{"title":"Beirut - Gulag Orkestar (2006) (V0)","uid":6358417,"size":68766660,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0028aa4ad8f8e1c118c6d85b3e00b35d2c1cd509&amp;dn=Beirut+-+Gulag+Orkestar+%282006%29+%28V0%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"kelsie","files":11,"time":1304234560,"description":"Tracklisting\n\n01. Gulag Orkestar\n02. Prenzlauerberg\n03. Brandenburg\n04. Postcards From Italy\n05. Mount Wroclai (Idle Days)\n06. Rhineland (Heartland)\n07. Scenic World\n08. Bratislava\n09. The Bunker\n10. The Canals Of Our City\n11. After The Curtain\n\nSpecial Edition (Lon Gisland EP)\n01. Elephant Gun\n02. My Family's Role In The World Revolution\n03. Scenic World\n04. The Long Island Sound\n05. Carousels\n\n\nDiscogs\n\nReview (taken from Allmusic):\n\n&quot;The best album to come out of Albuquerque since the Shins decamped for the Pacific Northwest, the debut album by Beirut (aka New Mexico-born 19-year-old singer/songwriter Zach Condon) bears an immediate resemblance both to Denver's DeVotchKa and the current passions of the Athens, GA, crowd formerly associated with the Elephant 6 stable. Like DeVotchKa, Condon is heavily influenced by Eastern European folk music and, to a lesser extent, the mariachi trumpets and Latin rhythms of the desert Southwest: the songs on Gulag Orkestar are lousy with mandolins and similarly plinky members of the string instrument family, accordions, horns, and hand percussion clearly played with dramatic in-studio arm flourishes. But like the Athens folks (some of whom appear here in a supporting role, most notably A Hawk and a Hacksaw's Jeremy Barnes), Condon isn't interested in mere approximations of traditional forms. Condon and friends use the folk instruments primarily as really cool-sounding textures, exotic backdrops for Condon's melodic indie folk tunes and impressionistic lyrics. The lyrics, it must be said, are the album's most obvious flaw, clearly the work of a young, romantically inclined teen who has never been to Europe but has seen a lot of foreign art films about, like, Gypsies 'n' stuff. Ignore the clunky lyrics -- easy enough to do since Condon is an unexpectedly appealing singer with a rich, mellifluous voice that, no kidding, recalls the great bel canto crooners of the pre-rock era (along with a little Nick Cave) -- and Gulag Orkestar is an infinitely more appealing album.&quot;","torrent":{"xt":"urn:btih:0028aa4ad8f8e1c118c6d85b3e00b35d2c1cd509","amp;dn":"Beirut+-+Gulag+Orkestar+%282006%29+%28V0%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0028aa4ad8f8e1c118c6d85b3e00b35d2c1cd509","infoHashBuffer":{"type":"Buffer","data":[0,40,170,74,216,248,225,193,24,198,216,91,62,0,179,93,44,28,213,9]},"announce":[],"urlList":[]}}