{"title":"[DvdRip-Xvid-Ita-Mp3]Le ali della libertÃƒÂ [survivalofmisa]","uid":5256278,"size":1802957178,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:00719335a0471185c46867b69af6e083a3217fe5&amp;dn=%5BDvdRip-Xvid-Ita-Mp3%5DLe+ali+della+libert%C3%83%C2%A0%5Bsurvivalofmisa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":0,"uploader":"misafor","files":1,"time":1262559556,"description":"\n\nDirigente bancario, Andy Dufresne, condannato - malgrado la sua innocenza - all'ergastolo nella prigione di Stato di Shawshank per l'assassinio della moglie e del suo amante, affronta il carcere con coraggio e calma: la speranza e la riflessione lo assistono sempre. Sottoposto subito al rito iniziatico delle violenze sessuali, Dufresne si lega presto di amicizia con il nero Red, ergastolano da trenta anni ed abilissimo nell'arte del sopravvivere in un ambiente piÃƒÂ¹ che duro dominato dal carcerato Heywood; si adopera per ricostruire ex novo la polverosa biblioteca gestita dall'anziano Brooks Hatlen (ottenendo infine dal Ministero della Giustizia dollari, libri e dischi) ma soprattutto si fa stimare sfruttando le proprie qualitÃƒÂ  professionali dal rigido direttore Warden Norton (un invasato della Bibbia) che fa di Andy il proprio consigliere per loschi affari. Andy ÃƒÂ¨ fertile di idee, anche se a volte movimenta la dura vita passando anche un mese in isolamento per qualche insolita iniziativa osteggiata dal sadico capo delle guardie, Hadley. Di fatto ÃƒÂ¨ diventato il complice del direttore (corrotto sugli appalti), facendogli affluire su un conto bancario intestato ad un nome di pura invenzione il denaro mal guadagnato. Il suicidio per impiccagione del vecchio Brooks, atterrito dalla libertÃƒÂ  dopo 50 anni di carcere, sconcerta Andy, che ha da 19 anni il proprio piano: quello di pazientare e sperare sempre, di aiutare i compagni (come nel caso del giovane ladruncolo Tommy Williams), sfruttando cultura e preparazione. Nel frattempo, Norton ha fatto uccidere il giovane Tommy, casualmente al corrente della innocenza di Dufresne (il che avrebbe implicato la revisione del processo e la liberazione di Andy, troppo prezioso per Norton). La vendetta per Andy non ha piÃƒÂ¹ sapore: ÃƒÂ¨ la libertÃƒÂ  ciÃƒÂ² che piÃƒÂ¹ gli preme. E cosÃƒÂ¬, dopo esser riuscito, durante un ventennio, con martelletto da minerali procuratogli da Red a scavare nella parete della cella (coperta da un poster di una diva del cinema) un cunicolo, riesce ad evadere e spacciandosi come il titolare del conto bancario creato per Norton (che, denunciato, intanto si ÃƒÂ¨ sparato al momento dell'arresto), Andy va a vivere tranquillo e ricco su di una spiaggetta messicana. E' lÃƒÂ  che, finalmente beneficiando di una riduzione di pena per buona condotta, lo raggiunge Red.\n","torrent":{"xt":"urn:btih:00719335a0471185c46867b69af6e083a3217fe5","amp;dn":"%5BDvdRip-Xvid-Ita-Mp3%5DLe+ali+della+libert%C3%83%C2%A0%5Bsurvivalofmisa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00719335a0471185c46867b69af6e083a3217fe5","infoHashBuffer":{"type":"Buffer","data":[0,113,147,53,160,71,17,133,196,104,103,182,154,246,224,131,163,33,127,229]},"announce":[],"urlList":[]}}