{"title":"Lonely Planet Bali &amp; Lombok, 14E [Epub &amp; Mobi] [StormRG]","uid":10101094,"size":19174443,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0089b2ece3f545de179da16f4d93b31d913830dd&amp;dn=Lonely+Planet+Bali+%26amp%3B+Lombok%2C+14E+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":0,"uploader":"krystine","files":-1,"time":1399402923,"description":"Lonely Planet Bali &amp; Lombok (Travel Guide)\nAuthor: Lonely Planet, Ryan Ver Berkmoes &amp; Adam Skolnick\nPublished: 2013\nPublisher: Lonely Planet\nISBN: 9781743216309\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\n\n#1 best-selling guide to Bali &amp; Lombok*\n\nLonely Planet Bali &amp; Lombok is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Get swept up in daily-occurring, fleeting temple processions with masked mythical creatures, find serenity at a lavish Balinese spa, and be dazzled by Legong lore-telling dancers; all with your trusted travel companion. Get to the heart of Bali &amp; Lombok and begin your journey now!\n\nInside Lonely Planet Bali &amp; Lombok Travel Guide:\n\nFull-colour images throughout\nHighlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\nInsider tips save you time and money and help you get around like a local, avoiding crowds and trouble spots\nEssential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\nHonest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\nCultural insights give you a richer and more rewarding travel experience - including customs, history, local life &amp; religion, the arts, architecture, and environment\nOver 47 colour local maps\nUseful features - including Travel with Children, What's New, and Month-by-Month (annual festival calendar)\nCoverage of Kuta &amp; Seminyak, South Bali &amp; the Islands, Ubud &amp; Around, East Bali, Central Mountains, North Bali, West Bali, Lombok, Gili Islands, and more\neBook Features: (Best viewed on tablet devices)\n\nZoom-in maps and images bring it all up close and in greater detail\nDownloadable PDF and offline maps let you stay offline to avoid roaming and data charges\nSeamlessly flip between pages\nEasily navigate and jump effortlessly between maps and reviews\nSpeedy search capabilities get you to what you need and want to see\nUse bookmarks to help you shoot back to key pages in a flash\nVisit the websites of our recommendations by touching embedded links\nAdding notes with the tap of a finger offers a way to personalise your guidebook experience\nInbuilt dictionary to translate unfamiliar languages and decode site-specific local terms\nThe Perfect Choice: Lonely Planet Bali &amp; Lombok, our most comprehensive guide to Bali &amp; Lombok, is perfect for those planning to both explore the top sights and take the road less travelled.\n\nLooking for just the highlights of Bali? Check out Lonely Planet's Pocket Bali, a handy-sized guide focused on the can't-miss sights for a quick trip.\nLooking for more coverage? Check out Lonely Planet's Indonesia guide for a comprehensive look at what the whole country has to offer.\nAuthors: Written and researched by Lonely Planet, Ryan Ver Berkmoes, and Adam Skolnick.\n\nAbout Lonely Planet: Started in 1973, Lonely Planet has become the world's leading travel guide publisher with guidebooks to every destination on the planet, as well as an award-winning website, a suite of mobile and digital travel products, and a dedicated traveller community. Lonely Planet's mission is to enable curious travellers to experience the world and to truly get to the heart of the places they find themselves in.\n\n*Bestselling guide to Bali &amp; Lombok Source: Nielsen Bookscan. Australia, UK and USA, April 2012 to March 2013.\n\n","torrent":{"xt":"urn:btih:0089b2ece3f545de179da16f4d93b31d913830dd","amp;dn":"Lonely+Planet+Bali+%26amp%3B+Lombok%2C+14E+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0089b2ece3f545de179da16f4d93b31d913830dd","infoHashBuffer":{"type":"Buffer","data":[0,137,178,236,227,245,69,222,23,157,161,111,77,147,179,29,145,56,48,221]},"announce":[],"urlList":[]}}