{"title":"The Cosmological Origins of Myth and Symbol","uid":15816243,"size":855816,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:010db06293a53deb3460dff7595273a5fd2157c8&amp;dn=The+Cosmological+Origins+of+Myth+and+Symbol&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"marty14","files":1,"time":1473687914,"description":"The Cosmological Origins of Myth and Symbol: From the Dogon and Ancient Egypt to India, Tibet and China - Laird Scranton [epub]\r\n\r\nGreat thinkers and researchers such as Carl Jung have acknowledged the many broad similarities that exist between the myths and symbols of ancient cultures. One largely unexplored explanation for these similarities lies in the possibility that these systems of myth all descended from one common cosmological plan. Outlining the most significant aspects of cosmology found among the Dogon, ancient Egyptians, and ancient Buddhists, including the striking physical and cosmological parallels between the Dogon granary and the Buddhist stupa, Laird Scranton identifies the signature attributes of a theoretic ancient parent cosmology--a planned instructional system that may well have spawned these great ancient creation traditions. \r\n\r\nExamining the esoteric nature of cosmology itself, Scranton shows how this parent cosmology encompassed both a plan for the civilized instruction of humanity as well as the conceptual origins of language. The recurring shapes in all ancient religions were key elements of this plan, designed to give physical manifestation to the sacred and provide the means to conceptualize and compare earthly dimensions with those of the heavens. As a practical application of the plan, Scranton explores the myths and language of an obscure Chinese priestly tribe known as the Na-Khi--the keepers of the world’s last surviving hieroglyphic language. Suggesting that cosmology may have engendered civilization and not the other way around, Scranton reveals how this plan of cosmology provides the missing link between our macroscopic universe and the microscopic world of atoms","torrent":{"xt":"urn:btih:010db06293a53deb3460dff7595273a5fd2157c8","amp;dn":"The+Cosmological+Origins+of+Myth+and+Symbol","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"010db06293a53deb3460dff7595273a5fd2157c8","infoHashBuffer":{"type":"Buffer","data":[1,13,176,98,147,165,61,235,52,96,223,247,89,82,115,165,253,33,87,200]},"announce":[],"urlList":[]}}