{"title":"Losing My Virginity - The Autobiography By Richard Branson (Pdf,","uid":9759780,"size":14435498,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0160756074ea28ea007abb3159b299fc2f149381&amp;dn=Losing+My+Virginity+-+The+Autobiography+By+Richard+Branson+%28Pdf%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":5,"uploader":"GoonerTPB","files":3,"time":1394795793,"description":"Paperback: 608 pages\nPublisher: Virgin Books (7 May 2009)\nLanguage: English\nISBN-10: 0753519550\nISBN-13: 978-0753519554\n\nThis is the bestselling autobiography of iconic entrepreneur Sir Richard Branson, featuring his take on his latest business ventures, personal achievements and intrepid adventures.\n\nYou'll discover how Sir Richard is committed to building a better world through responsible, holistic business practices and ventures such as the Virgin Health Bank, which is contributing to regenerative medicine, Virgin Fuels, which has pledged Â£200 million to renewable energy projects, and his company's charitable arm, Virgin Unite. You'll also learn about how Sir Richard and his company are reaching for the stars in a new era of commercial space travel with Virgin Galactic.\n\nWith insights into this very public figure's personal life as well as his business successes and the lessons he's learned along the way, this is an amazing memoir, motivational business guide and inspiring story that will capture your imagination.\n\nBiography\nRichard Branson was born in 1950 and educated at Stowe School. It was here that he began to set up Student Magazine when he was just 16. By 17 he'd also set up Student Advisory Centre, which was a charity to help young people. In 1970 he founded Virgin as a mail order record retailer, and not long after he opened a record shop in Oxford Street, London. During 1972 a recording studio was built in Oxfordshire, and the first Virgin artist, Mike Oldfield, recorded &quot;Tubular Bells&quot; which was released in 1973. This album went on to sell over 5 million copies. Since then many household names, including Belinda Carlisle, Genesis, Phil Collins, Janet Jackson and The Rolling Stones have helped to make Virgin Music one of the top six record companies in the world. The equity of Virgin Music Group - record labels, music publishing, and recording studios was sold to THORN EMI in 1992 in a US$1billion deal. The Virgin Group has now expanded into international music Megastores, air travel, mobile, financial, retail, music, internet, drinks, rail, hotels and leisure, with around 200 companies in over 30 countries. Richard is married with two children and spends most of his time at his home on Necker Island.","torrent":{"xt":"urn:btih:0160756074ea28ea007abb3159b299fc2f149381","amp;dn":"Losing+My+Virginity+-+The+Autobiography+By+Richard+Branson+%28Pdf%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0160756074ea28ea007abb3159b299fc2f149381","infoHashBuffer":{"type":"Buffer","data":[1,96,117,96,116,234,40,234,0,122,187,49,89,178,153,252,47,20,147,129]},"announce":[],"urlList":[]}}