{"title":"I Was Vermeer: The 20th Century's Greatest Forger","uid":15885289,"size":2246340,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:017a4246fa1c9ded4f3395e052c59046e89044bd&amp;dn=I+Was+Vermeer%3A+The+20th+Century%27s+Greatest+Forger&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":0,"uploader":"marty14","files":1,"time":1474644849,"description":"I Was Vermeer: The Rise and Fall of the Twentieth Century's Greatest Forger - Frank Wynne [epub]\r\n\r\nFrank Wynne's remarkable book tells the story of Han van Meegeren, a painter whose Vermeer forgeries made him a secret superstar of the art world. During van Meegeren's heyday as a forger of Vermeers, he earned 50 million dollars, the acclamation of the world's press, and the satisfaction of swindling the Nazis.\r\n\r\nHis canvases were so nearly authentic that they would almost certainly be prized among the catalogue of Vermeers if he had not confessed. And, no doubt, he never would have confessed at all if he hadn't been trapped in a catch-22: he had thrived so noticably during the war that when it ended, he was quickly arrested as a Nazi collaborator. His only defense was to admit that he himself had painted the remarkable &quot;Vermeers&quot; that had passed through his hands ― a confession the public refused to believe, until, in a huge media event, the courts staged the public painting of what would be van Meegeren's last &quot;Vermeer.&quot;\r\n\r\nI Was Vermeer is an utterly gripping real-life mystery, capturing both the life of the consummate art forger, phenomenally skilled and yet necessarily unrecognized, and the equally fascinating work of the experts who identify forgeries and track down their perpetrators. Wry, amoral, irreverent, and plotted like a thriller, it is the first major book in forty years on this astonishing episode in history","torrent":{"xt":"urn:btih:017a4246fa1c9ded4f3395e052c59046e89044bd","amp;dn":"I+Was+Vermeer%3A+The+20th+Century%27s+Greatest+Forger","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"017a4246fa1c9ded4f3395e052c59046e89044bd","infoHashBuffer":{"type":"Buffer","data":[1,122,66,70,250,28,157,237,79,51,149,224,82,197,144,70,232,144,68,189]},"announce":[],"urlList":[]}}