{"title":"GTA: Vice City - Repack","uid":10631383,"size":1166943931,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:025d78745420fbb8339ee1fbaba3229596b062dd&amp;dn=GTA%3A+Vice+City+-+Repack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":1,"uploader":"Ytklyx15","files":2,"time":1406325030,"description":"The game is set in 1986 in fictional Vice City, which is based heavily on the city of Miami Beach, Florida. The game's look, particularly the clothing and vehicles, reflect (and sometimes parody) its 1980s setting. Many themes are borrowed from the major films Scarface, Carlito's Way, Goodfellas and Blow, along with the hit 1980s television series Miami Vice. Vice City also parodies and pays tribute to much of 1980s culture in the cars, music, fashion, landmarks, and characters featured in the game.\n\nRicardo Diaz's opulent mansion and the climactic battle which takes place in it are very similar to their counterparts in Scarface.Another reference is the game's overall storyline, as it is highly similar to the film, as is the design of the final mission. There are also more subtle references, such as an apartment hidden within the game with blood on the bathroom walls and a chainsaw (in a nod to the film's &quot;chainsaw torture&quot; scene),[10] or the pair of detectives who come chasing Tommy in a car resembling the Ferrari Testarossa after a three-star wanted level is attained, who look like characters portrayed by Don Johnson and Philip Michael Thomas in Miami Vice.\n\n\nSYSTEM REQUIREMENTS:\nPIV 1.5GHz, 512 Mo RAM, 3D Card 64 Mo\n\n\nINSTRUCTIONS:\nOpen setup and install the game. Then just play.\nEnjoy.","torrent":{"xt":"urn:btih:025d78745420fbb8339ee1fbaba3229596b062dd","amp;dn":"GTA%3A+Vice+City+-+Repack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"025d78745420fbb8339ee1fbaba3229596b062dd","infoHashBuffer":{"type":"Buffer","data":[2,93,120,116,84,32,251,184,51,158,225,251,171,163,34,149,150,176,98,221]},"announce":[],"urlList":[]}}