{"title":"The Code of the Extraordinary Mind 10 Unconventional Laws to Red","uid":15448830,"size":3255133,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02bd05d2b7cf3b7fb2aaac9705d136ee9d067e26&amp;dn=The+Code+of+the+Extraordinary+Mind+10+Unconventional+Laws+to+Red&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":5,"uploader":"shtihl22","files":2,"time":1469924040,"description":"**********Description***********\r\n\r\n\r\nHardcover: 288 pages\r\nPublisher: Rodale Books (May 10, 2016)\r\nLanguage: English\r\nISBN-10: 1623367085\r\nISBN-13: 978-1623367084\r\n\r\nNew York Times Bestseller\r\n* USA Today Bestseller\r\n* Audible Top Ten Non-Fiction Audiobooks\r\n\r\nWhat if everything we think we know about how the world works―our ideas of love, education, spirituality, work, happiness, and love―are based on Brules (bullsh*t rules) that get passed from generation to generation and are long past their expiration date?\r\n\r\nThis book teaches you to think like some of the greatest non-conformist minds of our era, to question, challenge, hack, and create new rules for YOUR life so you can define success on your own terms.\r\n\r\nThe Code of the Extraordinary Mind, a New York Times bestseller, is a blueprint of laws to break us free from the shackles of an ordinary life. It makes a case that everything we know about the world is shaped by conditioning and habit. And thus, most people live their lives based on limiting rules and outdated beliefs about pretty much everything―love, work, money, parenting, sex, health, and more―which they inherit and pass on from generation to generation.\r\n\r\nBut what if you could remove these outdated ideas and start anew? What would your life look like if you could forget the rules of the past, and redefine what happiness, purpose, and success mean for you?\r\n\r\nNot Just a Book, but a Movement\r\nBlending computational thinking, integral theory, modern spirituality, evolutionary biology, and humor, personal growth entrepreneur Vishen Lakhiani provides a revolutionary 10-point framework for understanding and enhancing the human self. You will learn about bending reality. You will learn how to apply unique models like consciousness engineering to help you learn and grow at speeds like never before.You will learn to make a dent in the universe and discover your quest. This framework is based on Lakhianiâ™s personal experiences, the 5 million people heâ™s reached through Mindvalley, and 200 hours of interviews and questions posed to incredible minds, including Elon Musk, Richard Branson, Peter Diamandis, Ken Wilber, Dean Kamen, Arianna Huffington, Michael Beckwith, and other legendary leaders.\r\n\r\nIn a unique fusion of cutting-edge ideas, personal stories, irreverence, and a brilliant teaching style, Lakhiani reveals the 10 powerful laws that form a step-by-step process that you can apply to life to shed years of struggle and elevate yourself to exceptional new heights.\r\n\r\nThe 10 Laws to an Extraordinary Life\r\nThis book challenges conventional ideas of relationships, goal-setting, mindfulness, happiness, and meaning. In a unique fusion of cutting-edge ideas, personal stories, and humorous irreverence, and not to mention, humor and napkin diagrams, this framework combines computational thinking with personal growth to provide a powerful framework for re-coding yourself―and replacing old, limiting models that hold you back with new, empowering beliefs and behaviors that set you on the path toward an extraordinary life. A life of more happiness and achievement than you might have dared to dream possible.\r\n\r\nOnce you discover the code, you will question your limits and realize that there are none. Step into a new understanding of the world around you and your place in it, and find yourself operating at a new, extraordinary level in every way...happiness, purpose, fulfilment, and love.\r\n\r\nThis Book Is a Living, Breathing Manifesto That Goes Beyond a Traditional Publication\r\nFor those who want more, The Code of the Extraordinary Mind connects to a full on immersive experience including ways for you to dive into particular chapters to unlock additional videos or training and connect with each other and the author to learn via peer-to-peer learning networks","torrent":{"xt":"urn:btih:02bd05d2b7cf3b7fb2aaac9705d136ee9d067e26","amp;dn":"The+Code+of+the+Extraordinary+Mind+10+Unconventional+Laws+to+Red","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02bd05d2b7cf3b7fb2aaac9705d136ee9d067e26","infoHashBuffer":{"type":"Buffer","data":[2,189,5,210,183,207,59,127,178,170,172,151,5,209,54,238,157,6,126,38]},"announce":[],"urlList":[]}}