{"title":"Far.Cry.4.Update.v1.4-RELOADED","uid":11561035,"size":46129190,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:02d6fcd2ba25e80b0289300aa3e677c01d6a5356&amp;dn=Far.Cry.4.Update.v1.4-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"Taker009","files":-1,"time":1416881524,"description":"Far.Cry.4.Update.v1.4-RELOADED\n\nRelease info:  \n\n\n\n\nFar Cry 4 Update V1.4 (c) Ubisoft\n\n11/2014 :..... RELEASE.DATE .. PROTECTION .......: UbiDRM + Ubisoft\n1 :.......... DISC(S) .. GAME.TYPE ........: FPS, Adventure\n\n\n\nPatchnotes: See included whatsnew.txt\n\n\n\nGame information:  \n\nHidden in the towering Himalayas lies Kyrat, a country steeped in tradition\nand violence. You are Ajay Ghale. Traveling to Kyrat to fulfill your\nmother's dying wish, you find yourself caught up in a civil war to overthrow\nthe oppressive regime of dictator Pagan Min. Explore and navigate this\nvast open world, where danger and unpredictability lurk around every corner.\nHere, every decision counts, and every second is a story. Welcome to Kyrat.\n\nGame Features:  \n\n- EXPLORE AN OPEN WORLD FILLED WITH POSSIBILITIES\nDiscover the most diverse Far Cry world ever created. With terrain\nspanning from lush forests to the snowcapped Himalayas, the entire world\nis alive - and deadly.\n- From leopards, rhinos, black eagles, and vicious honey badgers, Kyrat\nis home to abundant wildlife. As you embark on your hunt for resources,\nknow that something may be hunting you...\n- Scout enemy territory from above in the all-new gyrocopter and then plummet\nback to earth in your wing suit. Climb aboard the back of a six-ton\nelephant and unleash its raw power on your enemies.\n- Choose the right weapon for the job, no matter how insane or unpredictable\nthat job might be. With a diverse arsenal, you'll be prepared for anything.\n- Not every journey should be taken alone. Far Cry 4 allows for a second\nplayer to drop in and drop out at any point, re-imagining the cooperative\nexperience in the true spirit of Far Cry for the next generation. You'll\nnow be able to discover and explore the living open world of Kyrat\ntogether.\n\nINSTALLATION information:  \n\n1. Unrar.\n2. BURN or mount the image.\n3. INSTALL the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game INSTALL directory.\n5. Play the game.\n6. Support the SOFTWARE developers. If you like this game, BUY IT!\n\n\nChangelog:  \n\nv1.4\n\n* Fixed the &quot;black screen&quot; issue PC players were experiencing when certain USB peripherals were plugged in.\n* Fixed the &quot;grey screen&quot; issue some PC players were may have encountered after the Outpost Master Mission","torrent":{"xt":"urn:btih:02d6fcd2ba25e80b0289300aa3e677c01d6a5356","amp;dn":"Far.Cry.4.Update.v1.4-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02d6fcd2ba25e80b0289300aa3e677c01d6a5356","infoHashBuffer":{"type":"Buffer","data":[2,214,252,210,186,37,232,11,2,137,48,10,163,230,119,192,29,106,83,86]},"announce":[],"urlList":[]}}