{"title":"Ramones - Discography 1976-2006 [FLAC]","uid":10566362,"size":13365753674,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:02d959ca03a9ce2311ef8cc702288b5718d2812d&amp;dn=Ramones+-+Discography+1976-2006+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":24,"uploader":"rudown78","files":1280,"time":1405524304,"description":"Ramones - Discography 1976-2006 [FLAC]\n\n\nThe Ramones are the first punk rock band. Other bands, such as the Stooges and the New York Dolls, came before them and set the stage and aesthetic for punk, and bands that immediately followed, such as the Sex Pistols, made the latent violence of the music more explicit, but The Ramones crystallized the musical ideals of the genre. By cutting rock &amp; roll down to its bare essentials -- four chords; a simple, catchy melody; and irresistibly inane lyrics -- and speeding up the tempo considerably, The Ramones created something that was rooted in early '60s, pre-Beatles rock &amp; roll and pop but sounded revolutionary. Since their breakthrough was theoretical as well as musical, they comfortably became the leaders of the emerging New York punk rock scene. While their peers such as Patti Smith, Television, Talking Heads, and Richard Hell all were more intellectual and self-consciously artistic than The Ramones, they nevertheless appealed to the same mentality because of the way they turned rock conventions inside out and celebrated kitschy pop culture with stylized stupidity. The band's first four albums set the blueprint for punk, especially American punk and hardcore, for the next two decades. And The Ramones themselves were major figures for the next two decades, playing essentially the same music without changing their style much at all. Although some punk diehards -- including several of their peers -- would have claimed the band's long career wound up undercutting the ideals the band originally stood for, The Ramones always celebrated not just the punk aesthetic, but the music itself.\n\nBased in the Forest Hills section of Queens, NY, The Ramones formed in 1974. Originally, the band was a trio consisting of Joey Ramone (vocals, drums; born Jeffrey Hyman, May 19, 1951), Johnny Ramone (guitar; born John Cummings, Oct. 8, 1951), and Dee Dee Ramone (bass; born Douglas Colvin, Sept. 18, 1951), with Tommy Ramone (born Tom Erdelyi, Jan. 29, 1952) acting as the group's manager. All of the group's members adopted the last name &quot;Ramone&quot; and dressed in torn blue jeans and leather jackets, in homage to '50s greaser rockers. The group played their first concert on March 30, 1974, at New York's Performance Studio. Two months after the show, Joey switched to vocals and Tommy became the band's drummer. By the end of the summer, The Ramones earned a residency at CBGB's. For the next year, they played regularly at the nightclub, earning a dedicated cult following and inspiring several other artists to form bands with similar ideals. All of The Ramones sets clocked in at about 20 minutes, featuring an unrelenting barrage of short, barely two-minute songs. By the end of 1975, The Ramones secured a recording contract with Sire; discounting Patti Smith, they were the first New York punk band to sign a contract.\n\nEarly in 1976, The Ramones recorded their debut album for just over 6,000 dollars. The resulting album, Ramones, was released in the spring, gained some critical attention, and managed to climb to 111 on the U.S. album charts. On July 4, the band made their debut appearance in Britain, where their records were becoming a big influence on a new generation of bands. Throughout 1976, The Ramones toured constantly, inaugurating nearly 20 years of relentless touring. By the end of the year, the group released their second album, Ramones Leave Home. While the album just scraped the U.S. charts, Leave Home became a genuine hit in England in the spring of 1977, peaking at number 48. By the summer of 1977, the Sex Pistols and The Ramones were seen as the two key bands in the punk rock revolution, but where the Pistols imploded, The Ramones kept on rolling. Following the U.K. Top 40 hit &quot;Sheena Is a Punk Rocker,&quot; The Ramones released their third album, Rocket to Russia, in the fall of 1977.\n\nTommy Ramone left the band in the spring of 1977, although he produced the group's subsequent album. He was replaced by former Voidoid Marc Bee, who immediately changed his name to Marky Ramone. With their new drummer in place, The Ramones recorded their fourth album, Road to Ruin, which was released in the fall. Road to Ruin marked the band's first significant attempt to change their sound; not only were there stronger bubblegum, girl group, surf, and '60s pop influences on the music, it was the first of their albums to run over a half hour. Although their sound was more accessible, it didn't gain the band a noticeably larger following. Neither did Rock N' Roll High School, the 1979 Roger Corman film in which The Ramones had a pivotal part. The soundtrack to Rock N' Roll High School and the U.K.-only live album It's Alive were the band's only releases of 1979. For most of the year, they were in the studio recording their fifth album with legendary '60s pop producer Phil Spector. The title song to the Corman movie was the first track released from the sessions, although the soundtrack album did feature a number of older Ramones songs remixed by Spector. End of the Century, the Spector-produced Ramones album, finally appeared in January of 1980 to mixed reviews. Despite the lukewarm reception to the album, the record's cover of the Ronettes' &quot;Baby I Love You&quot; became their only Top Ten British hit; in America, none of the singles made an impact, although the record became their biggest hit, peaking at number 44.\n\nThe Ramones continued their attempts at crossover success with their sixth album, Pleasant Dreams, which was released in 1981. Featuring a production by former Hollies and 10cc member Graham Gouldman, the record was a commercial disappointment in both America and England. The band was relatively quiet during 1982, spending most of their time touring. In the spring of 1983, the band returned with Subterranean Jungle, which was produced by Ritchie Cordell and Glen Koltkin, the heads of the American indie label Beserkley Records. Not only did Subterranean Jungle fail to gain the band the larger audience they desired, it continued the erosion of the band's diehard fan base, as well as their decline in the eyes of many rock critics. Following the album's release, Marky Ramone left the band; he was replaced by Richard Beau, a former member of the Velveteens, who changed his name to Richie Ramone.\n\nWith 1984's Too Tough to Die, The Ramones delivered a belated response to America's burgeoning hardcore punk scene that was largely produced by Tommy Erdelyi. The album helped restore their artistic reputation, as did the 1985 single, &quot;Bonzo Goes to Bitburg,&quot; an attack on President Ronald Reagan's 1985 visit to Germany. Instead of continuing with the sound of Too Tough to Die, The Ramones began pursuing a more streamlined, stylized, and conventional take on their songwriting formula with 1986's Animal Boy. This was a direction the group followed for the remaining ten years of their career. Following the release of 1987's Halfway to Sanity, Richie Ramone left the band and Marky Ramone re-joined the group. In 1988, the career retrospective Ramones Mania appeared. In 1989, The Ramones contributed the theme song to the Stephen King movie Pet Semetary, and the track was included on Brain Drain, which was released in the summer of that year. After its release, the group's bassist, Dee Dee Ramone, left the band to pursue a career as a rapper called Dee Dee King; after his debut rap recording failed miserably, he formed the band Chinese Dragons. Dee Dee was replaced by C.J. Ramone (born Christopher John Ward).\n\nIn the early '90s, The Ramones sobered up, with both Joey and Marky undergoing treatment for alcoholism. The band returned to recording in 1992, first releasing the live Loco Live and then Mondo Bizarro, their first studio album in three years. Mondo Bizarro turned out to be a commercial failure, as did their 1994 covers album, Acid Eaters.\n\nFollowing the release of Acid Eaters, the mainstream guitar rock audience in America finally embraced punk rock, in the form of young bands like Green Day and the Offspring. Sensing that the climate may have been right for the crossover success they had desired for so many years, The Ramones immediately followed Acid Eaters with Adios Amigos, claiming that unless the new album sold in substantial numbers, the band would call it quits after a final farewell tour. Adios Amigos only spent two weeks in the charts. Nevertheless, The Ramones embarked on a long farewell tour that ran throughout the rest of 1995. The band was set to split in the beginning of 1996 when they were offered a slot on the sixth Lollapalooza, and they toured with the festival that summer. Following the completion of the tour, The Ramones parted ways, 20 years after the release of their first album. Just a few years later, Joey Ramone passed away on April 15, 2001, at age 49, the victim of lymphoma. Little more than a year after Joey's death, Dee Dee Ramone was found dead in his home in Los Angeles on June 5, 2002. Johnny Ramone passed away two years later on September 15, 2004 after a long battle with cancer. The final original member, Tommy Ramone, died on July 11, 2014 after a battle with bile duct cancer.\n\n\nStudio Albums:\n\n1976 - Ramones [2001 Remaster]\n1977 - Leave Home [2001 Remaster]\n1977 - Rocket to Russia [2001 Remaster]\n1978 - Road to Ruin [2001 Remaster]\n1980 - End of the Century [2002 Remaster]\n1981 - Pleasant Dreams [2002 Remaster]\n1983 - Subterranean Jungle [2002 Remaster]\n1984 - Too Tough to Die [2002 Remaster]\n1986 - Animal Boy\n1987 - Halfway to Sanity\n1989 - Brain Drain\n1992 - Mondo Bizarro\n1993 - Acid Eaters\n1995 - Â¡Adios Amigos!\n\nLive Albums:\n\n1979 - It's Alive\n1991 - Loco Live\n1996 - Greatest Hits Live\n1997 - We're Outta Here!\n2001 - You Don't Come Close\n2004 - NYC 1978 (Live, January 7, 1978 at The Palladium, NYC)\n\nCompilations:\n\n1988 - Ramones Mania\n1990 - All the Stuff (and More), Vol. 1\n1990 - All the Stuff (and More), Vol. 2\n1999 - Anthology: Hey Ho, Let's Go!\n2002 - Best of the Chrysalis Years\n2002 - Loud, Fast Ramones: Their Toughest Hits\n2005 - Weird Tales of the Ramones [Box]\n2006 - Greatest Hits\n\n\nEach album contains artwork, rip logs and cue sheets. Enjoy!!!!!!!!!!!!!!!!\n","torrent":{"xt":"urn:btih:02d959ca03a9ce2311ef8cc702288b5718d2812d","amp;dn":"Ramones+-+Discography+1976-2006+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02d959ca03a9ce2311ef8cc702288b5718d2812d","infoHashBuffer":{"type":"Buffer","data":[2,217,89,202,3,169,206,35,17,239,140,199,2,40,139,87,24,210,129,45]},"announce":[],"urlList":[]}}