{"title":"udemy - Python and Network Automation: Build 5 Python Apps","uid":12160367,"size":1402742915,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:02ddaa666dbdc6ee33ff42c5d0fe242e4c941a00&amp;dn=udemy+-+Python+and+Network+Automation%3A+Build+5+Python+Apps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":8,"uploader":"NepsterJay","files":148,"time":1437893671,"description":"Do you want to become a Python Developer without having to spend a lot of money on books and boring theoretical courses?\n\nAre you a network professional who wants to start automating network tasks?\n\nOr maybe you're seeking a raise or even a career change?\n\nSave Time and Money by Writing Your Own Python Programs to Automate Daily Network Tasks. Bonus, You Might Even Get a Raise or a Better Job with These New Skills!\n\n&quot;I think a new language is learned more practicing, and this course has many practical examples with clear explanations.&quot; by Mihaela Dvornic\n\nPython programming course aimed not only at network professionals, but at anyone having little or no experience in coding and a great desire to start learning Python from scratch. This hands-on training takes you from &quot;Hello World!&quot; to complex network applications in less then 15 hours.\n\n------------------------------------------------------------------------------------------------------------\n\nDuring this course you will learn Python concepts which are relevant to your networking job and build some amazing tools:\n\nPython App#1: Subnet calculator.\nPython App#2: Configuring multiple devices concurrently via SSH and Telnet.\nPython App#3: DHCP client simulator for testing a DHCP server.\nPython App#4: Collecting information from routers and storing it in a MySQL database.\nPython App#5: OSPF network discovery via SNMP. Building the OSPF topology.\n------------------------------------------------------------------------------------------------------------\n\nSounds unbelievable given your current programming experience? Well, it's true! How?\n\nFirst, you will learn and practice every Python key concept, which is explained in one or more video lectures, followed by a short quiz. Each video is filled with relevant examples, in a learn-by-doing fashion and the quizzes will help you consolidate the main ideas behind each Python topic.\n\nAfter laying the foundation (and also exploring some advanced Python topics), you will dive right into the real-life networking scenarios and apply your knowledge to build 5 great network tools.\n\n&quot;There is no major prerequisite and the material is hand-on from the go. Besides new lectures are being uploaded in response to suggestions and discussions.&quot; by Zafar Iqbal\n\nEquipped with working files, network topologies and Python code samples (in .pdf and .py formats), you will be able to work alongside me on each lecture and each application. I will provide a virtual machine with all the Python modules already installed and also the full code for each application, so you can save time and start coding and testing on the spot.\n\nWe will use emulated routers in GNS3 to test our Python apps in a network environment, so you can see the actual results of running your code.\n\nI encourage you to learn Python, an amazingly beginner-friendly programming language and take your (networking) job to a higher level of automation.\n\n&quot;Geared towards beginners, this course teaches the fundamentals of programming and applying those concepts to networking.&quot; by Costin-Alin Neacsu","torrent":{"xt":"urn:btih:02ddaa666dbdc6ee33ff42c5d0fe242e4c941a00","amp;dn":"udemy+-+Python+and+Network+Automation%3A+Build+5+Python+Apps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02ddaa666dbdc6ee33ff42c5d0fe242e4c941a00","infoHashBuffer":{"type":"Buffer","data":[2,221,170,102,109,189,198,238,51,255,66,197,208,254,36,46,76,148,26,0]},"announce":[],"urlList":[]}}