{"title":"Queen - Greatest Hits - VOLUME 1 [320k MP3]","uid":7190667,"size":148218012,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:03025cf0ed7a2b3afa6a75288318187a1bb0407d&amp;dn=Queen+-+Greatest+Hits+-+VOLUME+1+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":1,"uploader":"smbdownload","files":-1,"time":1334609066,"description":"Greatest Hits is a compilation album by the British rock group Queen. When released in November 1981, the album consisted of Queen's best-selling singles since their first chart appearance in 1974 with &quot;Seven Seas of Rhye&quot;, up to their 1980 hit &quot;Flash&quot; (though in some countries &quot;Under Pressure&quot;, the band's 1981 chart-topper with David Bowie, was included). There was no universal track listing or cover art for the album, and each territory's tracks were dependent on what singles had been released there and which were successful.\n\nQueen's Greatest Hits was an instant success, peaking at number one on the UK Album Chart for four weeks. It has spent 476 weeks in the UK Charts, and is the best-selling album of all time in the UK. It is certified eight times platinum in the United States, and is Queen's most commercially successful album worldwide with over 25 million copies sold, making it one of the best-selling albums of all time.\n\nThere was no universal track listing or cover art for the Greatest Hits album, and each territory's tracks were dependent on what singles were released there and what tracks charted. In some cases, despite the band's popularity, not enough songs were issued as singles to fill a compilation album, and a few album tracks were used as filler. Some examples of these were &quot;Sweet Lady&quot; and &quot;Love of My Life&quot;, neither was released as a single in any country, but appear on some regions' 1981 Hits release. In the UK and the U.S., where solid numbers could be collected, the standard was raised again by only including top 20 hits.\n\nTrack Listing [2011 REMASTER] [320k MP3]\n\n&quot;Bohemian Rhapsody&quot; (from A Night at the Opera, 1975) Mercury \t5:56\n&quot;Another One Bites the Dust&quot; (from The Game, 1980) \tJohn Deacon \t3:36\n&quot;Killer Queen&quot; (from Sheer Heart Attack, 1974) \tMercury \t2:57\n&quot;Fat Bottomed Girls&quot; (single version, from Jazz, 1978) \tBrian May \t3:16\n&quot;Bicycle Race&quot; (from Jazz, 1978) \tMercury \t3:01\n&quot;You're My Best Friend&quot; (from A Night at the Opera, 1975) \tDeacon \t2:52\n&quot;Don't Stop Me Now&quot; (from Jazz, 1978) \tMercury \t3:29\n&quot;Save Me&quot; (from The Game, 1980) \tMay \t3:52\n&quot;Crazy Little Thing Called Love&quot; (from The Game, 1980) \tMercury \t2:42\n&quot;Somebody to Love&quot; (from A Day at the Races, 1976) \tMercury \t4:56\n&quot;Now I'm Here&quot; (from Sheer Heart Attack, 1974) \tMay \t4:10\n&quot;Good Old-Fashioned Lover Boy&quot;(A Day at the Races, 1976)Mercury \t2:54\n&quot;Play the Game&quot; (from The Game, 1980) \tMercury \t3:33\n&quot;Flash&quot; (single version, from Flash Gordon, 1980) \tMay \t2:48\n&quot;Seven Seas of Rhye&quot; (from Queen II, 1974) \tMercury \t2:47\n&quot;We Will Rock You&quot; (from News of the World, 1977) \tMay \t2:01\n&quot;We Are the Champions&quot; (from News of the World, 1977) \tMercury \t2:59\n\n","torrent":{"xt":"urn:btih:03025cf0ed7a2b3afa6a75288318187a1bb0407d","amp;dn":"Queen+-+Greatest+Hits+-+VOLUME+1+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03025cf0ed7a2b3afa6a75288318187a1bb0407d","infoHashBuffer":{"type":"Buffer","data":[3,2,92,240,237,122,43,58,250,106,117,40,131,24,24,122,27,176,64,125]},"announce":[],"urlList":[]}}