{"title":"Native Instruments - Alicia's Keys","uid":8851649,"size":7415455378,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:031d0dafcc972ca6f35b95ca43b67bb0b4aa51ae&amp;dn=Native+Instruments+-+Alicia%27s+Keys&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":3,"uploader":"NewSky006","files":-1,"time":1377542784,"description":"Torrent Info:\n==============\n\nThis is not my own torrent!\n\n\nTorrent Contents:\n==================\n\nPackaged in .rars:\nKontakt 5 Library\n\n\nInstallation:\n==============\n\nExtract &quot;ap-niakknih.rar&quot;, then add &quot;Alicias Keys Library&quot; as a new library to Kontakt 5 (preferably the cracked version).\n\n\nProduct Info:\n==============\n\nTogether with Danish sample specialist Thomas Skarbye (better known by his company name Scarbee) and impulse response expert Ernest Cholakis, Alicia Keys has created a virtual piano that meets her professional standards and embodies the soulful sound that has become her trademark as a superstar. This is the piano sound that has helped Miss Keys win multiple Grammys and reach the top of the charts. \n\nALICIA'S KEYS was sampled from her own playing, recorded in the artist's own studio under the supervision of her trusted engineer, Ann Mincieli.\n\nThe instrument samples come from Alicia Keys' very own YamahaÂ­â„¢ C3 Neo grand piano. This unique and highly-sought after instrument was built to celebrate Yamaha's 100th anniversary in 2002 and represents the very top of the Conservatory Collection line. The exquisite and unique sound of the C3 Neo were painstakingly captured by Thomas Skarbye, Kontakt script wizard Nils Liberg, and Grammy-award winning engineer Ann Mincieli - making this exclusive instrument available to everyone. Using vintage microphones and preamps and through detailed analysis of Alicia's playing, the team succeeded in capturing the warm, soulful and inspiring sound of the C3 Neo all the way down to the finest nuances.\n\nAlicia herself says:\n&quot;I feel confident that we came up with the best virtual piano you've ever heard and I am excited to introduce it to you! Ann, Thomas and Nils are a brilliant team!&quot;\n\nGreat effort was put into making ALICIA'S KEYS as authentic as possible. Designed with incredible precision, and incorporating subtle details such as mechanical release noises, a specially developed sympathetic resonance and release system, and even the sound of fingers hitting keys (optional), this unique instrument delivers plenty of lively realism. So much in fact, that Alicia Keys herself used it exclusively on her latest album The Element of Freedom.","torrent":{"xt":"urn:btih:031d0dafcc972ca6f35b95ca43b67bb0b4aa51ae","amp;dn":"Native+Instruments+-+Alicia%27s+Keys","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"031d0dafcc972ca6f35b95ca43b67bb0b4aa51ae","infoHashBuffer":{"type":"Buffer","data":[3,29,13,175,204,151,44,166,243,91,149,202,67,182,123,176,180,170,81,174]},"announce":[],"urlList":[]}}