{"title":"Shadow_Warrior-FLT","uid":8966124,"size":7283151607,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:03db477dc13f744a89ec28f2a732271b0c67ef64&amp;dn=Shadow_Warrior-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":9,"uploader":"Mr.Stifmeister","files":2,"time":1380225152,"description":"\n                                                               ANSi JED\n\n\n            In Their 26th Year Of Glory, FairLight Released #1121\n\n                     Shadow Warrior (c) Devolver Digital\n\n:   Supplied by: FAIRLIGHT            : : Release Date: 26.09.2013           :\n    Cracked by:  FAIRLIGHT                Game Type:    FPS\n    Packaged by: FAIRLIGHT                Image Format: ISO\n               -----\n    DISCS: 1 DVD                          Protection: Steam\n\n    System Requirements : (S)-1-phenylpropan-2-amine\n\n\n Game information:\n =================\n\n Shadow Warrior is a bold reimagining of the  classic  3D  Realms  shooter\n from independent developer Flying  Wild  Hog  (Hard  Reset)  starring  the\n legendary and quick-witted warrior Lo Wang. Combine  the  brute  force  of\n overwhelming  firepower  with  the  elegant  precision  of  a  katana   to\n annihilate the merciless armies of the shadow realm in an exhilarating and\n visually stunning transformation of the classic first-person shooter.\n\n Shadow Warrior tells the offbeat  tale  of  Zilla  Enterprises  corporate\n shogun Lo Wang as he is ordered to acquire a legendary blade of  limitless\n power by his deceitful employer. Betrayed  and  left  for  dead,  Lo  Wang\n learns of the blades  connection  to  ancient  gods  from  another  realm\n preparing to push our world to the brink of destruction. Now the reluctant\n hero must become legend through a masterful  combination  of  gun,  blade,\n magic and wit to uncover the truth behind the demonic invasion and  banish\n evil back into the darkness.\n\n\n Features:\n =========\n\n * Shadow Warrior Reborn - A bold new vision of Shadow Warrior\n   elegantly blends classic first-person shooter gameplay with\n   thrilling action, inventive combat, and a contemporary\n   retelling of the hilarious legend of Lo Wang.\n * Elegant Swordplay - Unsheathe your legendary katana to slice\n   enemies apart with precisely targeted swings or unleash fluid\n   combos and special attacks to cut down hordes of enemies\n   with one swift pass through the enraged hordes.\n * Upgradeable Arsenal - Utilize every gun in your formidable\n   armory - from stylish revolvers and quad barrel shotguns\n   to explosive-tipped crossbow bolts and laser-guided rocket\n   launchers. Each weapon offers several unique upgrades to\n   increase power, speed, and add devastating alternative\n   firing options.\n * Mystical Powers - Call upon mystical powers to protect yourself\n   and paralyze your enemies or use their own severed heads and\n   still-beating hearts to bring them to their knees.\n\n\n Installation Information:\n =========================\n\n * Burn or mount\n * Install\n * Play the game\n\n NOTE: As usual, block the game exe in your firewall.\n\n                                                             /TEAM FAiRLIGHT\n\n\n                    +-+  QUALITY, TRADITION  AND PRIDE +-+\n","torrent":{"xt":"urn:btih:03db477dc13f744a89ec28f2a732271b0c67ef64","amp;dn":"Shadow_Warrior-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03db477dc13f744a89ec28f2a732271b0c67ef64","infoHashBuffer":{"type":"Buffer","data":[3,219,71,125,193,63,116,74,137,236,40,242,167,50,39,27,12,103,239,100]},"announce":[],"urlList":[]}}