{"title":"Hey Arnold! - All of seasons 1, 2, 3, 4 &amp; 5","uid":3825643,"size":15841593943,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0459a4134752b1e04de56e07f3bc823d0b602c10&amp;dn=Hey+Arnold%21+-+All+of+seasons+1%2C+2%2C+3%2C+4+%26+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":17,"uploader":"timberlax","files":106,"time":1191218639,"description":"All 99 episodes of Nickelodeon&amp;#039;s &quot;Hey Arnold!&quot; are finally available!!!\n\nCheck out the Hey Arnold! episode guide at: http://en.wikipedia.org/wiki/List_of_Hey_Arnold%21_episodes\n\nAfter some hard work, I was able to pull together all the episodes from a website. I cannot reveal the site due to fear of having it shut down but thanks its survival, it is now possible to watch all the episodes of Hey Arnold! that we all so cherished and enjoyed a few years back (Note: 2 episodes are in Russian from Nickelodeon Russia since I couldn&amp;#039;t find the original versions). Some bonus materials: \n\n- Hey Arnold! the Movie (2002)\n- Hey Arnold! &quot;Nickslusive&quot; (1 min making-of feature)\n- Promo vid\n- Arnold&amp;#039;s Neighborhood: demo game for PC\n- Screenshot gallery\n- Fan Art gallery\n- 2006 Hey Arnold! 10th anniversary chat with creator Craig Bartlett (text; as &quot;LisaBartlett&quot;)\n\n****A note to Viacom: you force us, the fans, to do this. After taking down all your episodes from YouTube and STILL not releasing them on DVD, your actions are unjust. Nickelodeon rode on the high ratings from Hey Arnold! and then they just dump it. We want Hey Arnold! on DVD! We would gladly buy it. WE WANT CRAIG BARTLETT COMPLETE THE JUNGLE MOVIE AND MAKE THE SERIES COME FULL CIRCLE. But until that glorious day happens due to the bureaucratic corporate interests of Viacom who would rather produce worthless new garbage TV shows every 2 months on Nickelodeon and ruin any last reputation that it still has, we will share these episodes amongst ourselves for future generations.*****\n\n=================================\n\nWhy was the series cancelled? Here&amp;#039;s the scoop: \n\nIn the summer of 2000 there was an idea to make a Hey Arnold movie after the success of the Rugrats Movie in 1998. Originally, the plan was for the movie to be about Arnold saving his neighborhood from developers, when Albie Hecht, the president of Nickelodeon Movies, decided that the show had a better story for a movie if Arnold looked for his parents, and so that became the theatrical feature while &quot;Arnold Saves the Neighborhood&quot; was written and animated as the shows 100th episode, aired in three parts (98,99,100) ending the fifth season. It started production in early 2000 and was delivered on tape in March 2001. In the meantime, &quot;the movie&quot; - which is nicknamed &quot;The Jungle Movie&quot; as it takes place in a jungle -went going through a series of rewrites. Eventually, it was decided that while people were waiting for &quot;The Jungle Movie&quot;, &quot;Arnold Saves the Neighborhood&quot; would be released as a theatrical movie in 2002. The decision to blow it up to film was made in summer 2001. The title was changed to Hey Arnold! The Neighborhood and then Hey Arnold! The Movie to get people who weren&amp;#039;t familiar with the show to watch it. On June 28, 2002, Hey Arnold! The Movie made its debut in theatres. The movie had a less than stellar performance. It opened ranking#6 only earning $2,038,000 on its first night; for its first weekend, it stayed at #6 earning US$5,706,332. It&amp;#039;s total gross was only $13,684,949. Like the Doug movie, Hey Arnold! The Movie was made for the small-screen; the film cost $3 million to make, as it practically used the same methods of animation as the TV series itself with very few bells and whistles to enhance the film for theatres.The one thing that probably made the movie fail was that the desicion making was too late, it looked more like a Men in Black spin off with the gadgets and the kid secret agent stuff. The plot was confusing &amp; ridiculous,honestly they could have made it better and juiced it up a notch; but the biggest problem was that the film was released too late;what they should have done was release the film in 2001 rather than wasting time with all those rewrites and changes. Nick &amp; Paramount studios had spent $13 million just to promote the Hey Arnold movie ; that&amp;#039;s over 4 times the cost to make the movie itself. Hey Arnold! is only one of a few films in history where the cost to promote the film greatly eclipses the cost to make it. Which in this case, it should have been a direct-to-video release but was moved to the theatres in a failed attempt to have a Rugrats-like success.As it stands Hey Arnold! The Movie is the worst opened Nick film, the second-worst Nick-related film, and the lowest-ranked Nick related film.It also didn&amp;#039;t help when Nick delayed the release of the VHS/DVD to December 31, 2002, when it would of sold more greatly if released before or during the Christmas holidays.\n\nWith the overall failing of Hey Arnold! The Movie, the second movie seems a distant dream away. At first Nickelodeon liked the idea of The Jungle Movie, so they wanted Craig to sign a contract that would have him work exclusively for Nick for two years. This was a problem, because Craig had agreed to produce a pilot for his new animated series called Party Wagon; that wasn&amp;#039;t for Nick, but for its competitor, Cartoon Network. Nick was unbending about the exclusivity clause, saying, &quot;No exclusivity clause, no Hey Arnold!&quot;.Bartlett had plans to spinoff the Helga character and her family into her own series called The Patakis,the characters would have been older than when they were on Hey Arnold! Helga would have been 15 but Nickelodeon turned down the idea. In the end Craig refused to sign the contract and Hey Arnold was cancelled in 2001 The last cartoon to be produced was &quot;The Journal&quot; in May of 2001 Episode 19 of season 5, and the final episode to be aired in the United States was aired on June 8, 2004 in total over 100 episodes were made since the series began in 1996.Bartlett instead decided to keep his new series Party Wagon rolling for Cartoon Network, which made Nick hopping mad about him switching sides with their competitor. Unfortuntely for Craig, Cartoon Network has not picked up Party Wagon after the production of the pilot.\n\n=================================\n\nEver since Nickelodeon cancelled Hey Arnold! in 2002 due to a dispute with creator Craig Bartlett, the show&amp;#039;s possible release on DVD has been in limbo. As a result, the &quot;jungle movie&quot; when Arnold finally gets together with Helga and goes out to find out the fate of his parents is never produced. \n\nLike so many other great Nicktoons that never saw the light of day after cancellation such as Doug, Rugrats and Rocko&amp;#039;s Modern Life, Hey Arnold! is among the best of the best of veteran Nicktoons that has been locked away in Viacom&amp;#039;s vault indefinitely. Viacom, the parent of MTV Networks (who owns Nickelodeon) has been selfishly and inconsiderately uninterested in releasing these great cartoons on DVD.\n\nSeed the hell out of this. Let&amp;#039;s get this torrent to 1,000,000 downloads and make a point! Spread the word!!! Hey Arnold!...we will always love you!","torrent":{"xt":"urn:btih:0459a4134752b1e04de56e07f3bc823d0b602c10","amp;dn":"Hey+Arnold%21+-+All+of+seasons+1%2C+2%2C+3%2C+4+%26+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0459a4134752b1e04de56e07f3bc823d0b602c10","infoHashBuffer":{"type":"Buffer","data":[4,89,164,19,71,82,177,224,77,229,110,7,243,188,130,61,11,96,44,16]},"announce":[],"urlList":[]}}