{"title":"Wolfenstein : Enemy Territory","uid":3727676,"size":277057116,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:045f4c41652e4c6a4d44ed9610efbc46ac27b806&amp;dn=Wolfenstein+%3A+Enemy+Territory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"jay are two","files":7,"time":1183129561,"description":"Description: Wolfenstein: Enemy Territory, free multiplayer relative of Return to Castle Wolfenstein from Splash Damage\n\n\nSite: http://www.planetwolfenstein.com/enemyterritory/\n\nFAQ:\n( http://www.planetwolfenstein.com/features/articles/pw_faq_et.shtml )\n\nDo I need to own or have RtCW installed to play Enemy Territory?\n\nNo, you do not need to own or have Return to Castle Wolfenstein installed in order to play Wolfenstein: Enemy Territory. You will however be required to download the game and meet the following system requirements:\n\n    * Windows 98/ME/2000/XP OS (Windows NT 4.0 not recommended for clients)\n    * 100% Windows 98/ME/2000/XP compatible system (including all 32bit drivers)\n    * Intel Pentium III 600Mhz processor or equivalent\n    * 128 MB RAM\n    * 32 MB 100% fully OpenGL compliant 3-D video card\n    * Microsoft Direct X 8.1 or higher (not included)\n    * 271 MB total disk space for game files\n    * 500 MB free disk space for swap file\n    * 100% Microsoft Windows compatible keyboard\n    * 100% Microsoft Windows compatible mouse\n    * 100% Microsoft Windows compatible sound card\n    * For internet play, 100% Windows 98/ME/2000/XP compatible 56.6k modem or better internet connection. 56.6k modem play is not recommended for games with more than 8 players total; broadband players should be able to handle up to 32 depending on their connection with the server on which they&amp;#039;re playing.\n\nThe following video cards were fully tested with Wolfenstein: Enemy Territory:\n\n    * GeForce 4 Ti 4600\n    * GeForce 4 MX\n    * GeForce 3\n    * GeForce 2 Ultra\n    * GeForce 2 MX\n    * GeForce256\n    * Radeon 8500/64\n    * Radeon 7200/64\n    * Radeon 9700 Pro/128\n    * Xabre 400\n\n\nIs it true that Wolfenstein: Enemy Territory is a FREE game?\n\nYES! It&amp;#039;s true! Wolfenstein: Enemy Territory is a free game. Thank you Splash Damage, id Software and Activision!\n\n\nAre there official bots for Enemy Territory?\n\nSorry, there are NO bots for Wolfenstein: Enemy Territory.\n\n\nWhere can I find out about classes, weapons, objects and map strategies?\n\nBe sure to read the Player Guide that comes with Wolfenstein: Enemy Territory. You can access the Guide through your Start Menu or find it located in your Wolfenstein - Enemy Territory\\Docs directory.\n\n\nWhy do I get a &quot;Cannot load OpenGL subsystem error&quot; when starting the game?\n\nYour video drivers need to be updated. Download and install the latest driver from your video card manufacturer&amp;#039;s website. The most popular ones are nVidia and ATI. Please note that the drivers that came with Windows XP and Win2k do NOT support OpenGL. Replace them with the drivers you download.\n\nFor further assistance with this error read this PW Forum thread.\n\n\nHow can I boost my system performance for Enemy Territory?\n\nTaken from the Wolfenstein: Enemy Territory readme file:\n\nWolfenstein: Enemy Territory allows you to customize your settings so that you can improve the visuals or decrease them. Some of them have a greater impact on performance than others. Below are some settings that will improve your performance, but at the expense of the visuals:\n\n   1. Set the system options to &amp;#039;Fastest&amp;#039;\n   2. \\com_maxfps (set to a high number i.e 400)\n   3. \\cg_atmosphericeffects 0\n   4. \\cg_wolfparticles 0\n   5. \\r_fastsky 1\n   6. \\r_picmip 3\n   7. \\cg_drawgun 0\n\n\nI&amp;#039;m LAGGING in ET, how can I get rid of it?\n\nFrom Activision: Problems with choppy gameplay may be the result of not setting your connection speed when you create your profile. The connection defaults to ISDN, which is a rate of 5000. If your rate is set to something not appropriate for your connection, you&amp;#039;ll get lag. If you&amp;#039;re playing over a LAN or a DSL or cable modem, your rate should be set to 25000. To set your rate, pull down the console (~) and type &quot;/rate (number)&quot; without the quotes. You can also do this by choosing the &quot;Options&quot; button in the main menu, then choosing &quot;System&quot; and checking the connection speed (near the bottom of the screen). Be sure to press Apply.\n\n\nEnemy Territory crashes or freezes!\n\nFirst be sure that your system meets the minimum system requirements.. Make sure that you have the latest video and sound card drivers available for your hardware from the manufacturer&amp;#039;s websites. Close down any other programs you may have running prior to running the game.\n\nIf ET locks up shortly after joining a server you can try the following solution:\n\nBefore joining a server press the Tilde &quot; ~ &quot; key to bring the console down, then type in the following: /pb_system 1\n\n\nHow do I take a screenshot?\n\nFrom the Enemy Territory Main Menu go to &quot;Options&quot;, then &quot;Controls&quot;, in the &quot;Miscellaneous&quot; section you will see a place to bind a key to &quot;Take Screenshot&quot;. You&amp;#039;ll find the screenshot files in the Wolfenstein - Enemy Territory\\etmain\\screenshots\\ directory.\n\n\nWhy can&amp;#039;t I zoom in when using the sniper rifle?\n\nYou have to press the &quot;Switch to Alternate&quot; key first to get a zoomed view. To find out which key to press, go to the &quot;Controls&quot; menu where you can also choose to assign a different key if you want. After you press that button in the game, use the mouse wheel to zoom (or the keys listed in the Controls screen).\n\n\nMedic: How do I use &amp;#039;adrenaline&amp;#039;?\n\nAs a Medic, once you have gained enough Experience you will receive the special ability to give yourself &quot;Adrenaline&quot; shots. In order to use adrenaline you must bring up the syringe (5), then &quot;Switch to Alternate&quot; (bind Switch to Alternate key through the &quot;Controls&quot; menu), and then press your fire key to inject yourself with the adrenaline.\n\n\nThere aren&amp;#039;t any servers listed in the in-game browser!\n\nMake sure you have your &quot;Source&quot; set to &quot;Internet&quot; (upper left hand corner of the in-game browser).\n\n\nI&amp;#039;m connecting to a server and it says I have to install and enable PunkBuster to connect. However, I just installed it! What should I do?\n\nAs the message says. You have to install AND enable it. Enable your PunkBuster client by clicking on the Enable PunkBuster button on the in-game browser screen.\n\n\nI have another PunkBuster question/problem. What do I do?\n\nCheck the PunkBuster Frequently Asked Questions. Make sure you have the latest PunkBuster files. The easiest way to make sure you are up to date is to download PBWEB. Place the program in your &quot;pb&quot; folder and run it from that location. PBWEB will automatically update your PunkBuster files.\n\n\nHow do I play a demo or a &quot;replay&quot;?\n\nTo play a demo (or replays as they are called in ET) you must first record a demo. You may configure a key to record your replays in the &quot;Options - Controls&quot; menu. Once you have recorded your replay you can view it back by going to the &quot;Replays&quot; section off of the Enemy Territory Main Menu. Simply select a demo from the scrolling menu and click on the &quot;View&quot; option to watch your replay.\n\n\nMy modem connection is craptastic, and I keep getting &amp;#039;connection interrupted&amp;#039;. What should I do?\n\nUpgrade to broadband, next question. But seriously, you can get a playable connection using a modem is you do some basic stuff. It may not always work, but often it will. First, set your rate to 3500 to 4000 max. Do this by entering /rate 3500 in the console, or putting seta rate 3500 in your config file. Next, you may need to cap your fps. Some people cap it as low as 25, but that will get you booted from PB servers if the administrator is using the recommended PB cvar settings, so cap it to 43. Do that by typing /com_maxfps , or entering seta com_maxfps in your config. 43 has a double benefit. Not only may it help your connection, but it is also one of the magic numbers that allows you to jump higher due to the way the game engine handles physics, providing of course that your system can maintain 43 fps. Do that by typing /com_maxfps in the console.\n\nThe last thing to do is to tweak your modem, and you can find info about it here: The PHHortress and UpsetChaps Gaming Connection Guide.\n\n\n\nHow many players can I host on my cable/DSL connection?\n\nMost consumer cable/DSL connections are capped at 128kb/s upload. With that little bandwidth you can host for around 2 or 3 people, plus yourself locally.\n\n\nHow much bandwidth is required to host a real server, and what sv_maxrate setting should I use?\n\nNote: The following was taken directly from the PW RtCW FAQ, the same information may not apply to Enemy Territory, stay tuned for more information as things become more clear.\n\nRule of thumb is to take your upstream bandwidth and divide it by the number of clients you want to serve. That will give you the rough BW required for each client, in bits per second (b/s). Then, just set your sv_maxrate accordingly.\n\nThe sv_maxrate represents the bandwidth in bytes per second (B/s), so just divide the bandwidth required (b/s) by 10 to get B/s. Yes, a byte has 8 bits, but just use 10s easier to calculate and it accounts for the header and footer information used in the TCP/IP (and UDP) protocol.\n\nSo, if for example you have 500kb/s upstream bandwidth and want to host for 10 people, each client will use 50kb/s, or 50,000. 50,000 divided by 10 is 5000, so 5000 is your sv_maxrate.\n\nHere is a good explanation of server BW: Haqsau&amp;#039;s Lab. The information is a little dated, but it&amp;#039;s still a very good resource.\n\n\nHelp! My question isn&amp;#039;t answered in this FAQ!\n\nLook at the front page of PlanetWolfenstein for walk-throughs or other how-tos. Or, check Ifurita&amp;#039;s site Return to Castle Wolfenstein 4 Dummies. All hail Ifurita! Server information can be found at gameadmins.com, network information at practicallynetworked.com, and a whole bunch of Q3 engine information can be found at Upset Chaps. It&amp;#039;s written for Q3 and TA, but it pertains to RTCW also.\n\n\nHELP! I still don&amp;#039;t have an answer!\n\nGo ahead and post a question in the PlanetWolfenstein Forums. ( http://www.forumplanet.com/planetwolfenstein/ )Make sure you pick the right forum to do so (i.e. Technical Support, Single Player Help, Server Admin Help, Level Editing or Modifications). Only post in General Discussion if your question does not belong to any of the other forums, and do not post in multiple forums because answers will get spread out in different threads and makes it harder for everyone to try and help.","torrent":{"xt":"urn:btih:045f4c41652e4c6a4d44ed9610efbc46ac27b806","amp;dn":"Wolfenstein+%3A+Enemy+Territory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"045f4c41652e4c6a4d44ed9610efbc46ac27b806","infoHashBuffer":{"type":"Buffer","data":[4,95,76,65,101,46,76,106,77,68,237,150,16,239,188,70,172,39,184,6]},"announce":[],"urlList":[]}}