{"title":"Il.Capo.Dei.Capi.2007.iTALiAN.DVDRip.XviD-GBM[volpebianca]","uid":4564424,"size":4403650560,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:04b03cf6bc3bd117707133ddb1f201f4437555f7&amp;dn=Il.Capo.Dei.Capi.2007.iTALiAN.DVDRip.XviD-GBM%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":3,"uploader":"ivanone","files":6,"time":1228814198,"description":"::: SCHEDA FILM :::\n\nTitolo: Il Capo Dei Capi\nNazionalitÃƒÂ : Italia\nRegia: Enzo Monteleone, Alexis Sweet\nGenere: Biografico - Drammatico\nCast: Claudio GioÃƒÂ¨: TotÃƒÂ² Riina, Daniele Liotti: Biagio SchirÃƒÂ², Simona Cavallari: Teresa, Salvatore Lazzaro: Bernardo Provenzano Marco Leonardi: Calogero Bagarella, Gioia Spaziani: Ninetta Bagarella, Claudio Castrogiovanni: Luciano Liggio, Francesco Scianna: Leoluca Bagarella, Paolo Ricca: Luciano Maino, Alfredo Pea: Vito Ciancimino, Domenico Centamore: Giovanni Brusca, Alessandro Lucente: Antonio SchirÃƒÂ², Francesco Foti: Stefano Bontade\nData di uscita: 2007\nDurata: 90&amp;#039; A Puntata\n\n\n\n::: TRAMA FILM :::\n\nPrima Puntata\n15 gennaio 1993. Salvatore Riina, superboss di Cosa nostra, ÃƒÂ¨ stato appena catturato dopo 23 anni di latitanza e in carcere riceve la visita di un uomo, il suo amico d&amp;#039;infanzia Biagio SchirÃƒÂ² che lo spinge a ricordare: nel 1943 Salvatore ÃƒÂ¨ un ragazzo di 13 anni di Corleone. Mentre lavora nei campi col padre, trova una bomba. Il padre di Salvatore vorrebbe recuperare la polvere da sparo dell&amp;#039;ordigno per rivenderlo ai cacciatori e ricavare qualcosa per arrotondare i suoi magri guadagni come bracciante.\n\nSeconda Puntata\nIl clan corleonese al completo (TotÃƒÂ² Riina, Luciano Liggio, Bernardo Provenzano, Calogero Bagarella e Luciano Maino) si prepara per andare a Palermo per una &quot;parlata d&amp;#039;affari&quot; con Salvatore La Barbera e Vito Ciancimino. Intanto in paese, TotÃƒÂ² frequenta spesso Ninetta Bagarella (sorella minore di Calogero). Appena i viddani approdano a Palermo cominciano subito a farsi rispettare: prima uccidono un macellaio che non voleva pagare un carico di carne clandestina e successivamente ammazzano un ragioniere che aveva pagato il pizzo alla famiglia sbagliata. Una sera, mentre i Corleonesi sono in un night club (dove Maino conosce una ragazza, Maria Nigro, che poi lo indurrÃƒÂ  a pentirsi), Salvatore La Barbera viene rapito e ucciso da Michele Cavataio.\n\nTerza Puntata\nBiagio e Teresa ormai sposati hanno appena avuto un bambino (Antonio). Intanto a Palermo Riina e i suoi compagni vanno negli uffici di Michele Cavataio travestiti da militari della Guardia di Finanza. Il gruppo ÃƒÂ¨ composto da TotÃƒÂ² Riina, Calogero Bagarella, Bernardo Provenzano e altri due uomini (soldati di Tano Badalamenti, il boss di Cinisi). Lo scopo dei mafiosi ÃƒÂ¨ quello di uccidere Cavataio (che in precedenza aveva eliminato Salvatore La Barbera). Un soldato di Badalamenti, nervoso, ha troppa fretta di sparare e causa una strage: prima di arrivare da Cavataio vengono uccise altre 5 persone. Il gruppo arriva nell&amp;#039;ultima stanza, dove si trova Cavataio.\n\nQuarta Puntata\nTroviamo da una parte SchirÃƒÂ² e il commissario Boris Giuliano con i suoi uomini che vanno all&amp;#039;aeroporto di Punta Raisi di Palermo per arrestare dei chimici francesi, giunti in Sicilia per insegnare a Francesco Marino Mannoia (chimico della famiglia Bontade) a tagliare la droga, e dall&amp;#039;altra parte una riunione tra i piÃƒÂ¹ grandi boss mafiosi. Appena la polizia arriva all&amp;#039;aeroporto, il commissario Giuliano riceve una telefonata nella quale gli viene riferito che non ÃƒÂ¨ possibile arrestare i due francesi per mancanza di prove. Peppe (che aveva un fratello in fin di vita), soldato di Bontade, accompagna TotÃƒÂ² a casa. Egli riceve una grande somma di denaro per curare il fratello in America.\n\nQuintaPuntata\nLa quinta puntata inizia con Pio La Torre, segretario regionale comunista, che da una parte fa un dibattito a Corleone per impedire la costruzione di una base militare a Comiso e dall&amp;#039;altra parte con la Commissione riunita. Nella commissione vi ÃƒÂ¨ un certo Apuzzo, un carissimo amico di Tommaso Buscetta che finge di essere fedele a TotÃƒÂ² Riina. Il commissario Mangano, ormai pensionato, consiglia ai magistrati di Palermo (che volevano combattere la mafia a tutti i costi) SchirÃƒÂ² come jolly per trovare tutti i piÃƒÂ¹ grandi latitanti e torna a Corleone per dire a SchirÃƒÂ² di andare a Palermo per lavorare con Giovanni Falcone, Paolo Borsellino e Rocco Chinnici. Mentre TotÃƒÂ² gioca con suo figlio Giovanni, Ninetta ÃƒÂ¨ di nuovo incinta e si sta preoccupando per le idee del marito.\n\nSesta Puntata\nBiagio SchirÃƒÂ² ÃƒÂ¨ ferito gravemente a causa della sparatoria con Leoluca Bagarella e Vito Maranza. Viene portato all&amp;#039;ospedale e fortunatamente si salva. TotÃƒÂ² Riina ÃƒÂ¨ nervoso poichÃƒÂ© ÃƒÂ¨ stato condannato all&amp;#039;ergastolo. Ignazio Salvo rassicura TotÃƒÂ² dicendogli che la sentenza verrÃƒÂ  modificata in Cassazione. TotÃƒÂ² ordina a Luchino il pedinamento di Ignazio Salvo. Per il titolo di capo dell&amp;#039;ufficio istruzione di Palermo ci sono due candidati: Giovanni Falcone e Antonino Meli. La nomina di Falcone sembra scontata, ma il ruolo viene invece affidato a Meli. Riina ordina l&amp;#039;assassinio di Falcone a Pino Scarpuzzedda e a Luchino. Pino organizza un attentato alla casa al mare del giudice all&amp;#039;Addaura, presso Mondello, ma fallisce. Nei giorni seguenti Pino Scarpuzzedda compie due rapine nella zona di Aglieri, uno in una gioielleria e l&amp;#039;altro al Banco di Sicilia. U curtu lo fa eliminare. Falcone viene trasferito a Roma. Ninuzzo SchirÃƒÂ² decide di seguire le orme del padre diventando anche lui poliziotto. La revisione della sentenza del Maxiprocesso non avviene neanche in Cassazione e TotÃƒÂ² fa uccidere Salvo Lima.\n\n\n\nQualitÃƒÂ  Audio Video Ottima Da DVD ","torrent":{"xt":"urn:btih:04b03cf6bc3bd117707133ddb1f201f4437555f7","amp;dn":"Il.Capo.Dei.Capi.2007.iTALiAN.DVDRip.XviD-GBM%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04b03cf6bc3bd117707133ddb1f201f4437555f7","infoHashBuffer":{"type":"Buffer","data":[4,176,60,246,188,59,209,23,112,113,51,221,177,242,1,244,67,117,85,247]},"announce":[],"urlList":[]}}