{"title":"Stephen Hawking - The Universe in a Nutshell","uid":11676358,"size":100045986,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:04b0b48329eba3e1f56032aa2f89257190a89877&amp;dn=Stephen+Hawking+-+The+Universe+in+a+Nutshell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":3,"uploader":"Cybotage","files":6,"time":1422889831,"description":"One of the most influential thinkers of our time, Stephen Hawking is an intellectual icon, known not only for the adventurousness of his ideas, but for the clarity and wit with which he expresses them. In this new work, Hawking brings us to the cutting edge of theoretical physics, where truth is often stranger than fiction, to explain in layman's terms the principles that control our universe.\nLike many in the community of theoretical physics, Professor Hawking is seeking to uncover the grail of science - the elusive Theory of Everything that lies at the heart of the cosmos. In his accessable and often playful style, he guides us on his search to uncover the secrets of the universe - from supergravity to supersymmetry, from quantum theory to M-theory, from holography to duality. And he lets us behind the scenes of one of his most exciting intellectual adventures as he seeks &quot;to combine Einstein's General Theory of Relativity and Richard Feynman's idea of multiple histories into one complete unified theory that will describe everything that happens in the universe.&quot;\n\nWith characteristic exuberance, Professor Hawking invites us to be fellow travelers on this extraordinary voyage through spacetime. The Universe in a Nutshell is essential listening for all of us who want to understand the universe in which we live.\n\nRead by Simon Prebble\nFormat: MP3\nBitrate: 64 Kbps\nUnabridged","torrent":{"xt":"urn:btih:04b0b48329eba3e1f56032aa2f89257190a89877","amp;dn":"Stephen+Hawking+-+The+Universe+in+a+Nutshell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04b0b48329eba3e1f56032aa2f89257190a89877","infoHashBuffer":{"type":"Buffer","data":[4,176,180,131,41,235,163,225,245,96,50,170,47,137,37,113,144,168,152,119]},"announce":[],"urlList":[]}}