{"title":"Get On Up The James Brown Story (2014) {FLAC} vtwin88cube","uid":10674529,"size":493968348,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:04dec563b85d188551b0235483ef566c260c0d14&amp;dn=Get+On+Up+The+James+Brown+Story+%282014%29+%7BFLAC%7D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":2,"uploader":"vtwin88cube","files":-1,"time":1406923587,"description":"James Brown\nGet On Up The James Brown Story (2014)\n\n\n\n\n\nallmusic.com...\n\nJames Brown was arguably the most important African-American artist of his generation, a musician whose work helped define his time and place while creating a sound that was his and his alone. Brown's sharp, percussive style upended R&amp;B, gave birth to funk, and would provide the blueprint for hip-hop, while echoes of his innovative music could be heard in free jazz, new wave, electronic, and many other musical avenues. If anyone in popular music deserves a big-screen biopic, it's James Brown, and the soundtrack to Get On Up, a feature film based on Brown's life starring Chadwick Boseman as the Godfather of Soul, is a reminder that Brown was a pathbreaker in the studio and a supreme showman on the stage. Opening with the taut groove of 1970's &quot;Get Up (I Feel Like Being A) Sex Machine,&quot; this album is dominated by Brown's sinewy, hard funk from the late '60s and '70s, such as the ferocious &quot;Mother Popcorn,&quot; the tough but passionate &quot;Cold Sweat,&quot; and the ominous &quot;The Payback, Pt. 1,&quot; though there are reminders of earlier and more soulful hits like &quot;Please Please Please,&quot; &quot;Try Me,&quot; and &quot;Caldonia.&quot; Along with the familiar studio recordings of several of Brown's biggest hits, Get On Up also folds in a number of vintage live recordings (including a ferocious take of &quot;Night Train&quot; from 1963's justifiably legendary Live at the Apollo), and if the studio was where he hatched the ideas to take his music in new and exciting directions, the stage was where he most effectively put his theories into practice, and the triple-play of 1971 live takes of &quot;Get Up (I Feel Like Being A) Sex Machine,&quot; &quot;Super Bad,&quot; and &quot;Soul Power&quot; is devastating, especially considering they were performed in real time into open mikes while some of the players were doing dance steps. With the exception of a heavily overdubbed version of &quot;Try Me,&quot; most of these tracks appear in versions that are recognizable to fans, and while some of this material may have been tricked up for use onscreen, the bulk of the album sounds like pure James Brown, delivered in potent form. 1991's 20 All-Time Greatest Hits is still the best one-disc overview of Brown's most vital work, and Star Time remains that rare box set that's practically devoid of filler, but if a new generation of music fans is going to be introduced to the Hardest Working Man In Show Business by the movie Get On Up, at least the soundtrack album delivers a satisfying taste of what made him a legend.\n\nGenre................: Soundtrack/R&amp;B\nYear.................: 2014\nQuality..............: Free Lossless Audio Codec (FLAC)\nIncluded.............: Front Cover, Cue, Log, Audiochecker\n\n\n\n01.Get Up (I Feel Like Being A) Sex Machine\n02.The Payback. (Pt. 1)\n03.Out Of Sight\n04.I Got You (I Feel Good)\n05.Caldonia\n06.Please Please Please (Live)\n07.Night Train (Live)\n08.Papa's Got A Brand New Bag, (Pt. 1)\n09.It's A Man's Man's Man's World (Live)\n10.Cold Sweat, (Pt. 1)\n11.Mother Popcorn, (Pt. 1)\n12.I Got The Feelin' (Live)\n13.I Can't Stand Myself (When You Touch Me) (Live)\n14.Say It Loud-I'm Black And I'm Proud, (Pt. 1)\n15.Get Up (I Feel Like Being A) Sex Machine (Live)\n16.Super Bad (Live)\n17.Soul Power (Live)\n18.Try Me (Live)\n19.Please Please Please\n20.Get Up Offa That Thing\n\n\n\n\n\nSupport The Artists.\nBuy it if you like it!\n\nThanks for Seeding\nCheers...","torrent":{"xt":"urn:btih:04dec563b85d188551b0235483ef566c260c0d14","amp;dn":"Get+On+Up+The+James+Brown+Story+%282014%29+%7BFLAC%7D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04dec563b85d188551b0235483ef566c260c0d14","infoHashBuffer":{"type":"Buffer","data":[4,222,197,99,184,93,24,133,81,176,35,84,131,239,86,108,38,12,13,20]},"announce":[],"urlList":[]}}