{"title":"Raspberry.Pi.Server.Essentials","uid":11657651,"size":6887424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:056c361cd169b9768d7b888b1c0ed199a88ecee3&amp;dn=Raspberry.Pi.Server.Essentials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":0,"uploader":"wildturkey00","files":4,"time":1417942021,"description":"\nFormat: EPUB/\nGenre: Raspberry Pi/tutorial\nPublished: 2014\n\nAS USUAL IF YOU ARE HAVING TROUBLE OPENING UP MY EBOOK FILES USE CALIBRE, IT IS FREE, AND OPENS ANY FORMAT... IF YOU CANT OPEN IT WITH CALBIRE, IT WILL CONVERT THE EBOOK TO WHATEVER FORMAT YOU WANT (example: EPUBtoPDF, PDFtoMOBI....ect) ALSO, i DO NOT HAVE THE TIME TO OPEN/CHECK EVERY FILE THAT i DOWNLOAD, IF IT IS TAGGED AS SOMEONE ELSES PLEASE SEND ME A PM SO THAT I CAN DELETE IT....I DONT KNOW ABOUT YOU BUT I HAVE TO WORK TWO SHITTY JOBS AND DO SCHOOL/HOMEWORK AND DONT HAVE THE TIME TO DO SO. FINAL NOTE: IF THE TORRENT WILL NOT DOWNLOAD OR FULLY DOWNLOAD PLEASE SEND ME A PM SO THAT I CAN FIX THE PROBLEM. THANKS IN ADVANCE :)\n\nBook Description: Transform your Raspberry Pi into a server for hosting websites, games, or even your Bitcoin network\n\nOverview\nUnlock the various possibilities of using Raspberry Pi as a server\nConfigure a media center for your home or sharing with friends\nConnect to the Bitcoin network and manage your wallet\n\nIn Detail\n\nRaspberry Pi makes a good server that facilitates you with eminently achievable to the massively ambitious ideas. It is a capable computer that can perform tasks that involve spreadsheets, word processing, and games. It also plays high-definition video. If you are looking for a way to set up a low cost web server, primarily to be used as a testing environment or to store files, then Raspberry Pi is perfect for you.\n\nThis book demonstrates Raspberry Pi's ability to perform tasks that a mini computer would, in an efficient manner using a minimum number of power resources. You can connect your Raspberry Pi to the Internet at home to share files, host multi-player games, or even host a website.\n\nStarting with the pre-requisites and installation of Pi, you will learn how to setup Pi as a web server with MySQL. This book progresses with building Pi as a file server and knowing about using the various file transfer protocols. It also guides you to install Bitcoin/ Litecoin and set up Bitcoin wallet. You will learn how to stream a webcam to watch movies in HD or camera module.\n\nComplete your journey by learning how to use Pi as a game server by using basic console commands to get graphical content.\n\nWhat you will learn from this book\nUse Raspberry Pi as a low cost network storage device\nConfigure a webserver using PHP and work with databases\nHost multi-player games by using Pi as a game server to get graphical content\nShare files and use hardware RAID on the Pi\nMine Bitcoins and make your own digital currency\nTurn your Raspberry Pi into a media server to stream media to your network\nEnable extra features such as installing a wireless adapter, enabling the hardware watchdog, and updating and upgrading the distro\n\nApproach\n\nThis is an engaging, easy to follow guide for developing a wide range of server projects with Raspberry Pi\n\nWho this book is written for\n\nThis book is targeted towards all Raspberry Pi enthusiasts who are interested in exploring the potential of Pi as a server. Even if you have no prior experience with the Raspberry Pi, you can pick up this book and develop a wide range of projects","torrent":{"xt":"urn:btih:056c361cd169b9768d7b888b1c0ed199a88ecee3","amp;dn":"Raspberry.Pi.Server.Essentials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"056c361cd169b9768d7b888b1c0ed199a88ecee3","infoHashBuffer":{"type":"Buffer","data":[5,108,54,28,209,105,185,118,141,123,136,139,28,14,209,153,168,142,206,227]},"announce":[],"urlList":[]}}