{"title":"Iron and Wine - Discography (2002-2013) [FLAC]","uid":8845166,"size":2310557987,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:057e76ee63c3f0d7acfc93436081f5e0e0733934&amp;dn=Iron+and+Wine+-+Discography+%282002-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":7,"uploader":"politux","files":-1,"time":1377361027,"description":"\n  Iron and Wine - Discography (2002-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Singer/Songwriter, Indie Folk, Lo-Fi\n  Source: CD\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2002 The Creek Drank the Cradle\n  2003 Sea &amp; The Rhythm EP\n  2004 Our Endless Numbered Days\n  2005 In The Reins \n  2005 Woman King EP\n  2007 Boy With a Coin (Single)\n  2007 The Shepherd's Dog\n  2009 Around the Well\n  2011 Kiss Each Other Clean\n  2013 Ghost on Ghost\n\n  Singer/songwriter Samuel Beam, who rose to prominence with a blend of whispered vocals and softly homespun indie folk, chose the moniker Iron &amp; Wine after coming across a dietary supplement named &quot;Beef Iron &amp; Wine&quot; while working on a film. Raised in South Carolina, Beam received his bachelor's degree in art from Virginia Commonwealth University in Richmond and later his Master of Fine Arts degree from Florida State University Film School. Although Beam would later expand his sound to include electric instruments and rich, lush textures, he was firmly exploring the former style when several of his lo-fi recordings caught the ear of Jonathan Poneman, co-owner of Sub Pop Records. The songs had been recorded in Beam's bedroom without the aid of studio flourishes, but Poneman nevertheless requested that additional material be sent to the label for submission, and Beam responded by sending two CDs in the mail -- both of them full-length albums. Poneman considered releasing them both, but instead slimmed down the set to 12 songs and released it in September 2002 as The Creek Drank the Cradle. The similarly themed The Sea &amp; the Rhythm EP followed in 2003.\n\n  It was Beam's 2004 full-length, Our Endless Numbered Days, that signaled his arrival on the indie pop scene. Recorded in Chicago with producer Brian Deck, the album was resolutely hi-fi, but the addition of a full band only illuminated Beam's deft lyricism and intimate vocal delivery, resulting in one of the most critically acclaimed albums of the year. Late 2004 found the newly marketable Iron &amp; Wine popping up on television commercials and movie soundtracks (In Good Company, Garden State), culminating in a busy 2005 that saw Beam release two EPs, the lush Woman King and In the Reins, a collaboration with Arizona spaghetti Western aficionados Calexico. The politically charged Shepherd's Dog, Beam and company's most diverse -- and most listenable -- record to date, was released in 2007. A two-disc collection of B-sides, rarities, soundtrack inclusions, and discarded tracks from the Iron &amp; Wine archives called Around the Well arrived in early 2009. Kiss Each Other Clean, Iron &amp; Wine's first collection of new music in nearly three years and one that found Beam further expanding the group's sound, was released in January 2011 by their new label, Warner Bros. After a move to 4AD and Nonesuch, Iron &amp; Wine released the more relaxed and intimate Ghost on Ghost in early 2013. The Brian Deck-produced album featured jazz drummer Brian Blade and bassist Tony Garnier of Bob Dylan's band, among others.","torrent":{"xt":"urn:btih:057e76ee63c3f0d7acfc93436081f5e0e0733934","amp;dn":"Iron+and+Wine+-+Discography+%282002-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"057e76ee63c3f0d7acfc93436081f5e0e0733934","infoHashBuffer":{"type":"Buffer","data":[5,126,118,238,99,195,240,215,172,252,147,67,96,129,245,224,224,115,57,52]},"announce":[],"urlList":[]}}