{"title":"Wilco - Star Wars (2015) [24bit FLAC]","uid":12299080,"size":777884894,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:05e54d8998bd92f0d91fb8fc603e5d7d6de75918&amp;dn=Wilco+-+Star+Wars+%282015%29+%5B24bit+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":2,"uploader":"politux","files":12,"time":1440675252,"description":"\n  Wilco - Star Wars (2015) [24bit FLAC]\n\n  Genre: Rock  \n  Style: Alternative\n  Source: WEB\n  Codec: FLAC\n  Bit rate: ~ 3,000 kbps\n  Bit depth: 24  \n  Sample rate: 96 kHz\n\n  01 EKG\n  02 More...\n  03 Random Name Generator\n  04 The Joke Explained\n  05 You Satellite\n  06 Taste the Ceiling\n  07 Pickled Ginger\n  08 Where Do I Begin\n  09 Cold Slope\n  10 King of You\n  11 Magnetized\n\n  Wilco's 11th studio album, Star Wars, opens with &quot;EKG,&quot; a 1:16 burst of skronky guitars that sounds like a few capable grad students imitating early Sonic Youth after a few beers, and if it seems like a goofy way to kick off the record, that's a big part of the album's charm. Wilco released Star Wars as a free download on July 16, 2015 with no advance notice (a day later, the band announced that the physical release would hit stores on August 21), and the element of surprise fits the playful, casual nature of the album. Where Wilco (The Album) and The Whole Love were enthusiastic but artful and crafted with care, Star Wars feels like an album full of experiments and happy accidents, 11 songs where the group members gathered in their rehearsal spot, rolled tape, and let their muse do what it will. Which is not to say Star Wars comes off as sloppy or uncertain; Jeff Tweedy's songs are a bit more angular than usual, but the melodies are typically strong and engaging (and often sweeter than their delivery suggests at first glance), and they give the performances a solid backbone. \n\n  The relatively open spaces of these songs give Tweedy and lead guitarist Nels Cline more room to move than they've traditionally allowed themselves in the studio, and the ringing and buzzing patterns that provide the beds for &quot;You Satellite&quot; and &quot;Pickled Ginger&quot; (as well as the reverse tape loops on &quot;Where Do I Begin&quot;) are the work of a band happy to tinker with its traditional framework. (And drummer Glenn Kotche does a splendid job of holding the various elements in place while adding thoughtful shade and color of his own.) Wilco rock with easygoing but real enthusiasm on tunes like &quot;Random Name Generator&quot; and &quot;King of You&quot; (both of which feature fuzz guitar that would do T. Rex proud), and if there are introspective moments in &quot;Magnetized&quot; and &quot;Taste the Ceiling,&quot; compared to the contemplations of life and death on Sukierae (which Jeff Tweedy recorded with his son Spencer under the group name Tweedy), these songs find the group's leader on more comfortable ground, and the tone of Star Wars is that of some good friends tossing ideas against the wall and discovering that a surprising number of them stick. If the noisy sense of play was meant to be therapy for Jeff Tweedy and his bandmates, it seems to have worked; it has been quite some time since Wilco seemed to be enjoying themselves as much as they do here, and handing it out for free makes Star Wars feel a bit like a boombox rehearsal tape passed along to some friends, only with a great songwriter, a world-class band, and a seasoned recording engineer standing in for those beery college kids and a cheap cassette machine","torrent":{"xt":"urn:btih:05e54d8998bd92f0d91fb8fc603e5d7d6de75918","amp;dn":"Wilco+-+Star+Wars+%282015%29+%5B24bit+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05e54d8998bd92f0d91fb8fc603e5d7d6de75918","infoHashBuffer":{"type":"Buffer","data":[5,229,77,137,152,189,146,240,217,31,184,252,96,62,93,125,109,231,89,24]},"announce":[],"urlList":[]}}