{"title":"Visible Body 3D Anatomy Atlas v1.1.0 Final By bobiras2009","uid":7595562,"size":44359177,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:061221ca036be78abe499d0d158f1d6d44d0531d&amp;dn=Visible+Body+3D+Anatomy+Atlas+v1.1.0+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"bobiras2009","files":-1,"time":1346684743,"description":"                                    By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nRequirements: Android 2.2 and up\nOverview: Fully interactive, 3D human anatomy model with more than 2,500 structures.\n\nRanked #1 anatomy app by iMedicalApps!\n\n&quot;Rarely does an app come along and knocks my socks off, but Visible Body is one of those apps. . . . Ideal for students and teachers of anatomy, as well as for patient education.&quot; -- iMedicalApps\n\n&quot;The graphics are nothing short of breath-taking . . . All-in-all this is one of the best anatomy applications available for any platform, and is definitely recommended for those learning basic anatomy.&quot; -- Medgadget\n\nAward of Excellence, Association of Medical Illustrators, 2011\n\nVisible Body 3D Human Anatomy Atlas is a human anatomy learning and teaching app that allows users to explore the human body visually and interactively. This release features both female and male anatomical models, each comprised of over 2,500 structures.\n\nâ˜… Start by choosing a View from the hundreds of thumbnails organized regionally and by anatomical system.\nâ˜… Tap on the thumbnail to launch a 3D model that is pre-set to show the region or anatomical structures of immediate interest.\nâ˜… Further adjust the model by rotating, ing, zooming, fading and hiding to study the anatomy from any angle and with any combination of anatomical structures showing, faded, or hidden.\nâ˜… Tap on an anatomical structure to identify it by name and to display the anatomical hierarchy to which it belongs.\nâ˜… Read definitions for any of the anatomical structures that comprise the Visible Body.\nâ˜… Search for anatomical structures by name and identify them or add them to the model.\n\nDevice Requirements\nâ˜… 1 GHz processor or higher\nâ˜… 512 MB RAM or higher\nâ˜… 480 x 800 pixel display or larger\n\nAbout the Model\nVisible Body 3D Human Anatomy Atlas consists of highly detailed, anatomically accurate, 3D models of all human body systems. The models were developed by an extensively-trained team with decades of experience in medical illustration and biomedical visualization. All anatomical content has been reviewed for accuracy by our panel of experts, including physicians and anatomists. Years of modeling and enhancement make it the most sophisticated and complete 3D model of the human body available. \n\n\n                                    By bobiras2009\t","torrent":{"xt":"urn:btih:061221ca036be78abe499d0d158f1d6d44d0531d","amp;dn":"Visible+Body+3D+Anatomy+Atlas+v1.1.0+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"061221ca036be78abe499d0d158f1d6d44d0531d","infoHashBuffer":{"type":"Buffer","data":[6,18,33,202,3,107,231,138,190,73,157,13,21,143,29,109,68,208,83,29]},"announce":[],"urlList":[]}}