{"title":"Nero Burning ROM 12.5.5001","uid":8606862,"size":104819590,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:061b5b9b37298de4dbcc45e0f17d25483a14ea34&amp;dn=Nero+Burning+ROM+12.5.5001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"xxx-yyy-zzz","files":1,"time":1372034512,"description":"Nero Burning ROM 12\n\nNero Burning ROM is the gold-standard disc burning engine and it continues to get better. Rip audio CDs; convert audio; burn and copy reliable and secure CDs, DVDs and Blu-ray Discs; create disc images; or burn DVD-Video, BDMV, and AVCHD compilations. It's now Windows 8-ready. With the newest version of Nero Burning ROM, you can automatically span large files efficiently across multiple discs using Nero DiscSpan SmartFit. Even mix disc types to use your optical media economically. Create CDs, DVDs and Blu-ray Discs that automatically begin playing a defined executable file when you put them into your PC drive.\n\nNero Burning ROM is renowned for its advanced security and reliability features. With Nero SecurDisc technology, your burned data can withstand disc scratches and discs that deteriorate from age. Moreover SecurDisc technology enables you to create password protected data discs for utmost privacy and protection. Nero Burning ROM is also still one of the easiest tools to use to make your own audio compilations that can be played on any standard CD player. Rip audio CDs (with automatic Gracenote title detection) to your PC, reorder them and create your own discs to play on your home or car stereo. Convert your audio files to a great variety of high quality audio formats including MP3/MP3PRO, FLAC, AIFF, OGG, and more. Set variable bitrates for MP3/MP3 PRO to gain the highest quality output while using a minimal amount of storage space.\n\nWhat's new in this version: Rip audio CDs, convert audio, burn and copy CDs, DVDs, Blu-ray discs.\n\n\n!!! Please seed !!!","torrent":{"xt":"urn:btih:061b5b9b37298de4dbcc45e0f17d25483a14ea34","amp;dn":"Nero+Burning+ROM+12.5.5001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"061b5b9b37298de4dbcc45e0f17d25483a14ea34","infoHashBuffer":{"type":"Buffer","data":[6,27,91,155,55,41,141,228,219,204,69,224,241,125,37,72,58,20,234,52]},"announce":[],"urlList":[]}}