{"title":"Magnetic Messaging","uid":9564388,"size":10189010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0630b7df3471fbfba4084effde49ea5580c3c40c&amp;dn=Magnetic+Messaging&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":0,"uploader":"ryanisgoodlooking","files":4,"time":1391482158,"description":"This torrent contains four e-books:\n\nMagnetic Messaging\n99 Best Texts\nGet The Girl\nConversation Topics Training Lab\n\n\n\n\nMagnetic Messaging review:\n\n Magnetic Messaging a &quot;how to&quot; texting guide for single men has been named the best program on texting for the second year in a row by leading men's website PUABooks.net in a newly updated review. The course which has quickly become a best seller offers readers a step by step blueprint for the proper use of sms messages in order to successfully woo a female love interest.\n\n&quot;When we first received word that Bobby Rio and Rob Judge had released a texting course, we were eager to review it for our website visitors,&quot; reports PUABooks.net's Clint Johnson. &quot;We receive a lot of emails from our followers asking us about how to text women the right way and we are always trying to find the best resources available to recommend to them. Rio has built a strong reputation for delivering no-nonsense dating advice and he is one of the dating coaches we recommend most highly, so it was no surprise that Magnetic Messaging has been such a success.&quot;\n\nJohnson's newly updated review provides details on Rio's infamous &quot;Key-Lock Sequence,&quot; a series of three strategically designed text messages for sparking a woman's emotional response, getting her excited to meet up, and then setting up a date.","torrent":{"xt":"urn:btih:0630b7df3471fbfba4084effde49ea5580c3c40c","amp;dn":"Magnetic+Messaging","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0630b7df3471fbfba4084effde49ea5580c3c40c","infoHashBuffer":{"type":"Buffer","data":[6,48,183,223,52,113,251,251,164,8,78,255,222,73,234,85,128,195,196,12]},"announce":[],"urlList":[]}}