{"title":"Neil Young (1992) Harvest Moon (@256)","uid":3257438,"size":99854600,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:06c5679789779d75004f2c77cf4aa33aa71d129c&amp;dn=Neil+Young+%281992%29+Harvest+Moon+%28%40256%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"shinwa","files":10,"time":1100962774,"description":"Size: 95.2 MB\nBitrate: 256/Stereo\nFormat: MP3 \n\nThe year of the 20th anniversary of the release of his most popular album, Harvest, Neil Young released a new album that harked back to that recording, employing many of the same musicians, again dubbed the Stray Gators, as well as arranger Jack Nitzsche and background singers Linda Ronstadt and James Taylor. He also used a similar folk-country acoustic style and sang songs that often had a personal, confessional tone. But the similarities were more of form than of content because, while Harvest was the statement of a confused, if earnest, 26 year old, Harvest Moon embodied the ruminations of a somewhat regretful 46 year old. Indeed, the greatest comparison to be made between the two records was that Young tried to use the passage of time as a confirmation of continuity. In the first several songs, he seemed to be trying to reconcile with his wife and revive their love, though he was uncertain that was possible. In &amp;quot;One of These Days,&amp;quot; he regretted the loss of friendships over the years. &amp;quot;War of Man&amp;quot; and the long and ponderous &amp;quot;Natural Beauty&amp;quot; concerned environmental preservation, and even the rollicking banjo tune &amp;quot;Old King&amp;quot; was a lament for the death of a faithful dog. &amp;quot;I never tried to burn any bridges,&amp;quot; sang an artist whose contradictory instincts to move on and to return found him, by the time of his 27th solo album, trying to get back to the feel of his fourth. If the attempt was not completely successful, nevertheless it was well and honestly made, and Young wasn't alone in his desire. As Hollywood has long since learned, sequels have a built-in audience, and Harvest Moon became Young's best-selling album in 13 years.","torrent":{"xt":"urn:btih:06c5679789779d75004f2c77cf4aa33aa71d129c","amp;dn":"Neil+Young+%281992%29+Harvest+Moon+%28%40256%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06c5679789779d75004f2c77cf4aa33aa71d129c","infoHashBuffer":{"type":"Buffer","data":[6,197,103,151,137,119,157,117,0,79,44,119,207,74,163,58,167,29,18,156]},"announce":[],"urlList":[]}}