{"title":"Neck Deep - Wishful Thinking (2014) [FLAC]","uid":9505988,"size":265189340,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:06f6f1a3ed529042df1ac071cbfed7698deb7473&amp;dn=Neck+Deep+-+Wishful+Thinking+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":4,"uploader":"politux","files":-1,"time":1390318218,"description":"\n  Neck Deep - Wishful Thinking (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Pop Punk, Alternative, Indie\n  Source: Scene CD (forsaken)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Losing Teeth \n  02 Crushing Grief (No Remedy) \n  03 Staircase Wit \n  04 Damsel In Distress \n  05 Zoltar Speaks \n  06 Growing Pains \n  07 Say What You Want\n  08 Mileage \n  09 Sweet Nothings \n  10 What Did I Expect? \n  11 Blank Pages \n  12 Candour\n\n  Ever since the Beatles hit the United States in 1964, there's been a long, rich history of American bands trying to sound like they're from the UK, but few artists have tried harder to put that formula into reverse than Neck Deep. On their debut album, 2014's Wishful Thinking, this Welsh five-piece plays polished SoCal-style pop-punk complete with a sneering accent that splits the difference between Green Day and blink-182, and you'd have to dig deep to find a U.K. punk band that sounds less like they're from the U.K. than these guys. For the most part, Neck Deep's failure to betray their national heritage is the most remarkable thing about them; the band is certainly tight and powerful, with Lloyd Roberts and Matt West keeping their guitar parts locked in tight throughout, and drummer Dani Washington revealing some metal-level chops in his bass drum-heavy attack. But even on the low-key closer &quot;Candour,&quot; vocalist Ben Barlow sounds freakishly like some guy from the L.A. suburbs, whether he's complaining about girls (&quot;Crushing Grief,&quot; &quot;Damsel in Distress&quot;) or the state of the world (&quot;Zoltar Speaks,&quot; &quot;Blank Pages&quot;), and for all their technical skill, there's something terribly generic about this band, who don't seem to have a fresh or distinctive move in their entire repertoire as they bounce through their cookie-cutter tunes. If you have an bottomless appetite for Warped Tour-appropriate pop-punk buffed with enough digital sheen that you could use it as a mirror, you might want to take a chance on Neck Deep, whose skill is undeniable, but you've almost certainly heard something just like this before, and without having to go all the way to Wales.","torrent":{"xt":"urn:btih:06f6f1a3ed529042df1ac071cbfed7698deb7473","amp;dn":"Neck+Deep+-+Wishful+Thinking+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06f6f1a3ed529042df1ac071cbfed7698deb7473","infoHashBuffer":{"type":"Buffer","data":[6,246,241,163,237,82,144,66,223,26,192,113,203,254,215,105,141,235,116,115]},"announce":[],"urlList":[]}}