{"title":"(2013) Dr. Dog - B-Room (Deluxe Edition) [320 kBps] {100.XY}","uid":9023607,"size":137682809,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0832d232a74aa26ab9f7116dc3b4642ed11edcc8&amp;dn=%282013%29+Dr.+Dog+-+B-Room+%28Deluxe+Edition%29+%5B320+kBps%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":"100.XY","files":-1,"time":1381278817,"description":"(2013) Dr. Dog - B-Room (Deluxe Edition)\n\n\nReview:\n Sound: Indie rock group Dr. Dog have been manning the stage and performing since the late 1990's. Their unique sound, which borrows elements from such bands as The Beatles and The Beach Boys and a conclave of musical genres including neo-psychedelia and baroque pop, quickly caught the attention and earned the band their first record deal just a few years following their inception in 1999. Dr. Dog's debut studio album, 2002's &quot;Toothbrush,&quot; would catch the fancy of My Morning Jacket frontman Jim James, who would later invite Dr. Dog on several supporting tours. These tours brought both Dr. Dog and their catalog of music to a broader audience; soon the band would find themselves in an article for The New York Times, which would again provide additional exposure. Following several substantial &quot;big breaks,&quot; Dr. Dog would go on to sign onto a larger record label, which would in turn provide better album production quality as compared to earlier outings; embark on multiple cross country tours; make several late night television appearances; and perform at a number of large scale music festivals. During all of this time, Dr. Dog continued to create and release new music. The band last year issued their sixth studio album, &quot;Be The Void,&quot; which continued Dr. Dog's trend of gradually climbing the Billboard Top 200 charts (this album in particular landed at number 45 on the Top 200, and number 8 on the Top Alternative Albums chart). Dr. Dog were apparently anxious to return to the studio, as one year later they are returning to the music world, this time bearing their seventh studio album. &quot;B-Room&quot; shows the rock group continuing in the same traditional style previously shown on their earlier releases. The band gives a diverse performance throughout the entire album. It triumphantly begins with a slower-paced track, &quot;The Truth,&quot; which boasts harmonious group vocal harmonies and a Motown-inspired beat. Complimentary guitar riffs and bass beats make up the background, with the vocals themselves being the attention-grabber on the compositional side. The album immediately picks back up with the following song, &quot;Broken Heart,&quot; which pulsates with strong percussion work and almost rapped lyrics. // 7\n\nLyrics: The vocal section of Dr. Dog is continuously standout when it comes to their latest studio offering. It is worth noting that each of the members of Dr. Dog contribute vocally, which understandably makes for some exceptional harmonies and choruses. When you have a song which is set at a slower pace, with quiet guitar playing and percussion work simply taking a breather, having a surge of melody coming from your vocal section makes for a truly memorable listening experience, and this is exactly what we have on many of the new tracks showcased on &quot;B-Room.&quot; When it comes to lyrical delivery and singing style, the band members do occasionally mix things up and take on different approaches to different songs; for example, on &quot;The Truth,&quot; the band members sing in time to the preset pace, however during &quot;Broken Heart&quot; the vocal section is racing to keep ahead of the beat to get out a quick mouthful in time for the pre-chorus. // 7\n\nOverall Impression: All in all, Dr. Dog give an applaudable job on their sixth studio effort, &quot;B-Room.&quot; The vocal harmonies are undoubtedly one of this album's stronger sides, while at times the actual lyrical delivery holds the song back. From a musical aspect, the entire band could not be tighter, and any established fan will have no problem enjoying this new collection of songs.\n\n\nTrack List:\n1. The Truth\n2. Broken Heart\n3. Minding the Usher\n4. Distant Light\n5. Phenomenon\n6. Too Weak to Ramble\n7. Long Way Down\n8. Cuckoo\n9. Twilight\n10. Rock &amp; Roll\n11. Love\n12. Nellie\n13 - Mt. Slippery\n14 - Can't Remember\n15 - Humble Passenger\n\n\nSummary: \nCountry: USA\nGenre: Indie\nStyles:  \t\nIndie Neo-psychedelia, Psychedelic rock ,Baroque pop, Indie folk, Indie rock\n\n\nMedia Report:\nSource : CD\nFormat : MPEG Audio\nFormat version : Version 1\nFormat profile : Layer 3\nBit rate mode : Constant\nBit rate : 320 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nCompression mode : Lossy","torrent":{"xt":"urn:btih:0832d232a74aa26ab9f7116dc3b4642ed11edcc8","amp;dn":"%282013%29+Dr.+Dog+-+B-Room+%28Deluxe+Edition%29+%5B320+kBps%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0832d232a74aa26ab9f7116dc3b4642ed11edcc8","infoHashBuffer":{"type":"Buffer","data":[8,50,210,50,167,74,162,106,185,247,17,109,195,180,100,46,209,30,220,200]},"announce":[],"urlList":[]}}