{"title":"Belisarius: The Last Roman General","uid":15932236,"size":3088396,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:088c17338e6effa579322bea54356818b089b35c&amp;dn=Belisarius%3A+The+Last+Roman+General&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":1,"uploader":"marty14","files":1,"time":1475367429,"description":"Belisarius: The Last Roman General - Ian Hughes [epub]\r\n\r\nBelisarius (c. 505–565 AD) was the greatest general of the Eastern Roman Empire and is among history’s most notable military personalities. At the age of 29, he twice defeated the Persians and reconquered North Africa from the Vandals, before going on to regain the Italian peninsula from the Ostrogoths, including the Eternal City, Rome. Fighting in the name of Justinian I, Belisarius recaptured large portions of the original territory of the ancient Roman Empire. However, Byzantium was both unwilling and incapable of retaining much of Belisarius’s hard-won advances, and soon after his death, the empire once again retracted.\r\n\r\nIn Belisarius: The Last Roman General, historian Ian Hughes recounts the life of this great soldier. In addition, he explains the evolution of classical Roman armies and systems of warfare into those of the Byzantine Empire, as well as those of their chief enemies, the Persians, Goths, and Vandals. Based on ancient source and drawing on a wealth of modern research, Belisarius’s career is set in the context of the turbulent times in which he lived and his reputation is reassessed to give a balanced portrait of this neglected giant among ancient commanders","torrent":{"xt":"urn:btih:088c17338e6effa579322bea54356818b089b35c","amp;dn":"Belisarius%3A+The+Last+Roman+General","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"088c17338e6effa579322bea54356818b089b35c","infoHashBuffer":{"type":"Buffer","data":[8,140,23,51,142,110,255,165,121,50,43,234,84,53,104,24,176,137,179,92]},"announce":[],"urlList":[]}}