{"title":"Power at Ground Zero - Lynne Sagalyn","uid":15912767,"size":14529567,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a276e2222c3127f8d7c2374a7664250b8f7faed&amp;dn=Power+at+Ground+Zero+-+Lynne+Sagalyn&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"mr_mando","files":1,"time":1475131160,"description":"The destruction of the World Trade Center complex on 9/11 set in motion a chain of events that fundamentally transformed both the United States and the wider world. War has raged in the Middle East for a decade and a half, and Americans have become accustomed to surveillance, enhanced security, and periodic terrorist attacks. But the symbolic locus of the post-9/11 world has always been &quot;Ground Zero&quot;--the sixteen acres in Manhattan's financial district where the twin towers collapsed. While idealism dominated in the initial rebuilding phase, interest-group trench warfare soon ensued. Myriad battles involving all of the interests with a stake in that space-real estate interests, victims' families, politicians, the Port Authority of New York and New Jersey, the federal government, community groups, architectural firms, and a panoply of ambitious entrepreneurs grasping for pieces of the pie-raged for over a decade, and nearly fifteen years later there are still loose ends that need resolution.\r\n\r\n\r\nThe symbolism of the reconstruction extended far beyond New York and was freighted with the twin tasks of symbolizing American resilience and projecting American power. As a result, every aspect was contested. As Sagalyn points out, while modern city building is often dismissed as cold-hearted and detached from meaning, the opposite was true at Ground Zero. Virtually every action was infused with symbolic significance and needed to be debated. The emotional dimension of 9/11 made this large-scale rebuilding effort unique; it supercharged the complexity of the rebuilding process with both sanctity and a truly unique politics. Covering all of this and more, Power at Ground Zero is sure to stand as the most important book ever written on the aftermath of arguably the most significant isolated event in the post-Cold War era","torrent":{"xt":"urn:btih:0a276e2222c3127f8d7c2374a7664250b8f7faed","amp;dn":"Power+at+Ground+Zero+-+Lynne+Sagalyn","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a276e2222c3127f8d7c2374a7664250b8f7faed","infoHashBuffer":{"type":"Buffer","data":[10,39,110,34,34,195,18,127,141,124,35,116,167,102,66,80,184,247,250,237]},"announce":[],"urlList":[]}}