{"title":"Basic Concepts in Computational Physics [2014] [PDF]","uid":12450341,"size":10105676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a6066e5beb2f66696337c525d50abedd1677d70&amp;dn=Basic+Concepts+in+Computational+Physics+%5B2014%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":2,"uploader":"NoctDeath","files":2,"time":1442675465,"description":"Title: Basic Concepts in Computational Physics \nAuthor: Benjamin Stickler, Ewald Schachinger \nFormat: PDF \nHardcover: 377 pages \nPublisher: Springer; 2014 edition (December 11, 2013) \nLanguage: English \nISBN: 978-1461480297 \n\n\nWith the development of ever more powerful computers a new branch of physics and engineering evolved over the last few decades: Computer Simulation or Computational Physics. It serves two main purposes:\n\n- Solution of complex mathematical problems such as, differential equations, minimization/optimization, or high-dimensional sums/integrals.\n- Direct simulation of physical processes, as for instance, molecular dynamics or Monte-Carlo simulation of physical/chemical/technical processes.\n\nConsequently, the book is divided into two main parts: Deterministic methods and stochastic methods. Based on concrete problems, the first part discusses numerical differentiation and integration, and the treatment of ordinary differential equations. This is augmented by notes on the numerics of partial differential equations. The second part discusses the generation of random numbers, summarizes the basics of stochastics which is then followed by the introduction of various Monte-Carlo (MC) methods. Specific emphasis is on MARKOV chain MC algorithms. All this is again augmented by numerous applications from physics. The final two chapters on Data Analysis and Stochastic Optimization share the two main topics as a common denominator. The book offers a number of appendices to provide the reader with more detailed information on various topics discussed in the main part. Nevertheless, the reader should be familiar with the most important concepts of statistics and probability theory albeit two appendices have been dedicated to provide a rudimentary discussion","torrent":{"xt":"urn:btih:0a6066e5beb2f66696337c525d50abedd1677d70","amp;dn":"Basic+Concepts+in+Computational+Physics+%5B2014%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a6066e5beb2f66696337c525d50abedd1677d70","infoHashBuffer":{"type":"Buffer","data":[10,96,102,229,190,178,246,102,150,51,124,82,93,80,171,237,209,103,125,112]},"announce":[],"urlList":[]}}