{"title":"The Writer's Idea Thesaurus - Fred White.pdf","uid":11675971,"size":9502208,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a97855fd0bfad7ff3870df89f131892c554397b&amp;dn=The+Writer%27s+Idea+Thesaurus+-+Fred+White.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"ZamKhan","files":1,"time":1422877490,"description":"The Writer's Idea Thesaurus: An Interactive Guide for Developing Ideas for Novels and Short Stories - Fred White.pdf\n\n\nEndless ideas at your fingertips, and at the turn of a page...\n\nNeed an idea for a short story or novel? Look no further than The Writer's Idea Thesaurus. It's far more than a collection of simple writing prompts. You'll find a vast treasury of story ideas inside, organized by subject, theme, and situation categories, and listed alphabetically for easy reference.\n\nAuthor and award-winning writing instructor Fred White shows you how to build out and customize these ideas to create unique plots that reflect your personal storytelling sensibilities, making The Writer's Idea Thesaurus an invaluable tool for generating creative ideas and vanquishing writer's block--for good.\n\nInside you'll find:\n\n2,000 unique and dynamic story ideas perfect for novels and short stories of any genre or writing style\nTwenty major idea categories, such as The Invasion of X, The Transformation of X into Y, Escape from X, The Curse of X, and more\nMultiple situations that further refine the major categories, such as The Creation of Artificial Life, The Descent Into Madness, Love in the Workplace, The Journey to a Forgotten Realm, and more\nInvaluable advice on how to customize each idea.\nThe Writer's Idea Thesaurus is an interactive story generator that opens the door to thousands of new story arcs and plotlines","torrent":{"xt":"urn:btih:0a97855fd0bfad7ff3870df89f131892c554397b","amp;dn":"The+Writer%27s+Idea+Thesaurus+-+Fred+White.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a97855fd0bfad7ff3870df89f131892c554397b","infoHashBuffer":{"type":"Buffer","data":[10,151,133,95,208,191,173,127,243,135,13,248,159,19,24,146,197,84,57,123]},"announce":[],"urlList":[]}}