{"title":"Microsoft Windows 10 Pro+Enterp.Insider Preview10.010074-AppzDam","uid":11861005,"size":8907861720,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0aa5173c384e8379224d81e6163f6d4db3b2cfd4&amp;dn=Microsoft+Windows+10+Pro%2BEnterp.Insider+Preview10.010074-AppzDam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":6,"uploader":"AppzDam","files":16,"time":1430278568,"description":"A new version of the popular operating system from Microsoft called Windows 10, even though the previous major release was called Windows 8. Go directly to the Windows 10 reflects the company's desire to distance itself from the not very popular previous version.\n\nFeatures :\n\nThe uniform for all Windows devices. Windows 10 will be installed on a wide range of devices than previous versions of OC. Some of these devices include not only personal computers, laptops, tablets, and smart phones, televisions, various boards and industrial devices used for scripting Internet of Things. New OC will also be a single platform for application development and delivery of single channel applications via Shop.\n\nImproved user interface. The interface of the operating system, on the one hand, was accustomed, on the other hand, has gained several new features.\n&quot;Start&quot; menu. Opened by clicking on the logo in the lower left corner of the desktop. In the left column of the menu contains shortcuts to the most recent applications running in the right - universal application tiles. The menu also contains the buttons for power management and an updated search function to search not only in the local system, but also on the Internet.\n\nUniversal application windows. Now the classic applications for the desktop and the new Universal applications run in their own window on the desktop.\nEnhanced Snap. Work in multiple applications at once it became easier and more convenient. Now Snap feature allows you to open up to 4 applications simultaneously on the screen and tells Windows what other applications are running and how they can be placed. Windows 10 will help make better use of screen space unallocated for other applications.\n\nMany desktops. Users can create multiple desktops and place them on the application window. You can display all created tables on the screen and switch between them.\n\nMultitasking. On the taskbar button, a new Task View. By clicking on it, the screen will appear as thumbnails of all running Windows applications.\n\nSpecial attention to business users and data. When you create a Windows 10, special attention was paid to corporate users. The new OS will be compatible with all conventional control systems that use the organization. The operating system provides new opportunities for the separation of workers and the personal data on devices of all types, which will translate the concept of BYOD in organizations.\n\nNotes :\n\nObtaining the ISO image:\nPut ESD image to a folder decrypt\nRun as administrator decrypt.cmd\nSelect 1 - Create a full ISO standard install.wim.After 10 minutes in the same folder appears ISO image\nActivation:\nPro: NKJFK-GPHP7-G8C3J-P6JXR-HQRJR Enterprise: PBHCJ-Q2NYD-2PX34-T2TD6-233PK Start a command prompt (cmd) Administrator Insert: slmgr / Ipk XXXXX XXXXX-XXXXX-XXXXX-XXXXX- (instead of XXXXX - the key activation)","torrent":{"xt":"urn:btih:0aa5173c384e8379224d81e6163f6d4db3b2cfd4","amp;dn":"Microsoft+Windows+10+Pro%2BEnterp.Insider+Preview10.010074-AppzDam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aa5173c384e8379224d81e6163f6d4db3b2cfd4","infoHashBuffer":{"type":"Buffer","data":[10,165,23,60,56,78,131,121,34,77,129,230,22,63,109,77,179,178,207,212]},"announce":[],"urlList":[]}}