{"title":"Ayn Rand - Atlas Shrugged - iTunes AudioBook","uid":4843300,"size":1362652255,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0b057cbfa3ec55e1d842d489d7c966ea73d0fb42&amp;dn=Ayn+Rand+-+Atlas+Shrugged+-+iTunes+AudioBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":1,"uploader":"4lib3rty","files":-1,"time":1239581821,"description":"Ayn Rand - Atlas Shrugged - iTunes AudioBook\n\n\niTunes file, but will play on all players that playback MP4 files.\n\n\nThese files have artwork, chapters, and will remember where they were played last.\n\n\nThe maximum for an iTunes audio file is 12 hours, so there are 5 files here. YES, the book is THAT long! It is 53 and 1/4 hours...\n\n\nEnjoy... and leave comments please, it's nice to know others appreciate your efforts.\n\n\nClick on my username to check out other important works related to freedom and liberty.\n\n\n\n\nReview from Amazon:\nAn earlier reviewer struck an important vein when mentioning that academia and media have left this novel largely untouched, while it has continued to be read via word-of-mouth recommendations. Why? Rand is provocative; the novel engenders both deep respect and vitriolic opposition. Why?\nTo begin with, this is not an ordinarily structured novel; it is an overt statement of a philosophy. The plot, like many of those employed by Shakespeare, is not wholly original. (See an older book entitled &quot;Secret of the League&quot;). In any event, Rand uses the complex plot allegorically as a vehicle for describing her own unique philosophy and its consequences. Rand's philosophy, and it is clear enough upon reading, is a synthesis of Aristotelianism with more modern &quot;humanistic&quot; concerns, in the greatest and original sense of the term. Rand ties Aristotle's basic conceptions of logic to the workings of egoism and capitalism. She rejects Nietzschean irrationalism, Kantian ethics, and the kind of Pragmatism championed by Dewey. Her suggested replacement for these constructs is a body of thought which recognizes and responds to human needs and values, economic conditions, political necessities, and logical imperatives, even if incompletely at times. Oddly, her critics continue to tout her as little more than a &quot;pop-philosopher&quot;. On to her book.\n\nAtlas Shrugged is a fountainhead of skilled dialogue and monologue. Francisco's speech on &quot;money&quot; is insightful, and honest. Some prosaic passages, like Galt's enormous speech near the novel's end, could have used some editing. Nonetheless, such passages are meant to (and succeed in) conveying a rather thorough philosophy. Also adept at employing dialogue, Rand leaves cutting snippets and short verbal gems throughout the book. She distinguishes perceptively between 'what people commonly say' and 'what those words often covertly are intended to mean.' This making-bare is done through the frankness of her protagonists, some of which mere foils to reveal more probing insights. Those who would call her characters &quot;shallow&quot; may be correct if judging by contemporary literary standards which praise personal texture and ambiguity. Rand seems more interested in the kind of moral tale woven by the great Greek dramatists, in which characters are primarily vehicles of ideas.\n\nIt was once said that the purpose of philosophy is to start with something that everyone takes for granted, and to end with that which noone will believe. Rand uses Atlas Shrugged to achieve this kind of ideational journey. No shallow fanatic, her novel is a work is also a great psychological study of the motives of several common ideas, values, and ethical standards. She constructs in Atlas Shrugged a powerful critique of collectivism, that thought which says &quot;We are our brother's keepers.&quot;\n\nI suppose one reason for the novel's continued popularity is that most readers are far too intelligent to be comforted by other kinds of books whose authors want them to think they are profound because they are difficult to grasp. Zservedah once called &quot;clear prose the conceptual tool of conservativism.&quot; Readers are probably tired of being asked to find beauty in the Emperor's clothes, in works of art which are ugly, and in books which are pessimistic. Atlas Shrugged is unabashedly lucid and candid; it is refreshing to find such confident and clear writing in this age of self-doubt, relativism, and academic obscurity.\n\nYou will be a richer person for having read it.\n\nAre some of Rand's adherents sycophantic? Certainly. Yet if her philosophy were the kind of &quot;cheap trash&quot; critics claim it to be, why the vehemence of her opposition?\n\n","torrent":{"xt":"urn:btih:0b057cbfa3ec55e1d842d489d7c966ea73d0fb42","amp;dn":"Ayn+Rand+-+Atlas+Shrugged+-+iTunes+AudioBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b057cbfa3ec55e1d842d489d7c966ea73d0fb42","infoHashBuffer":{"type":"Buffer","data":[11,5,124,191,163,236,85,225,216,66,212,137,215,201,102,234,115,208,251,66]},"announce":[],"urlList":[]}}