{"title":"The.forest.public.alpha.v0.08.build.20141008.cracked.3dm","uid":11175530,"size":504754567,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0bb034b0f98d3950400a7e5f2aad8e0326f08d8a&amp;dn=The.forest.public.alpha.v0.08.build.20141008.cracked.3dm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":2,"uploader":"kacperux","files":4,"time":1412779670,"description":"the.forest.public.alpha.v0.08.build.20141008.cracked.3dm\n\nVersion 0.08 Changelog:\n \nFirst pass at infinite weapon upgrading! use collected items to upgrade your weapons. Use teeth, feathers and glass shards to improve weapon speed and damage. \nFirst pass at Cloth/fire upgrading system added - add cloth to your weapons and set them alight \nStealth gameplay! Lowered vision range on enemies and gave them a smaller cone of vision. \nBushes will now hide player from enemy vision when crouched! \nPlayer now less visible to enemies at night - unless lighter is out, making him more visible. \nCovered in Mud will now correctly conceal player making him harder to spot by enemies. \nLowered range that enemies can hear player when walking/running \nStealth kills added! If player attacks an enemy from behind with rock or axe type weapon and enemy is unaware of player it will be an instant kill \nEnemies will bash away bushes looking for player when hidden from them \nNew cave explorer model added to cave (hanging) \nNew cave explorer model added (crushed) \nBetter death theme (less grating) \nHigh detailed plane doors added \nBetter looking log held model \nImproved building memory usage \nImproved HUD memory usage \nHeads can now be cooked on fires to create skulls \nNew pick up item added: Skull \nNew craftable item : Club (skull plus stick) \nYou can now pick up and use enemy clubs \nPicking up items in quick succession will now display a number for how many were collected \nAll collected items now have message appear \nImproved previous weapon switching system to be more reliable \nNew buildable item: Chalet Style Treehouse \nNew buildable item: Meat drying rack \nNew buildable item: Bonfire \nNew buildable item: WalkWay \nNew buildable item: Small animal trap!! \nNew buildable item: Gazebo \nNew buildable item: Defensive spike barrier \nNew art for body stumps (decapitated head, leg, arms) \nCannibals eating dead bodies now takes longer \nChicory and coneflower plants are now collectable \nNew Craftable item: Energy mix (chicory plus coneflower) \nEating Coneflower will restore a small amount of health \nEating Chicory will restore a small amount of energy \nRaccoon group behaviours added \nNew raccoon animations added, walk, trot, improved idling, overall raccoon animation speed increased \nNew craftable item: Headbomb (head plus bomb) \nFixed door on medium cabin \nNew animal added: Deer! Deer will turn towards approaching player, eat grass, run away from player and more \nNew crafted axe model \nCrafted axe now requires rope to build (Rock,Stick, Rope) \nImproved motion blur quality,stability and memory usage \nFur! Raccoons and rabbits now have fur shading \nImproved look of lizard armour \nImproved bird reactions to player, should fly away when you approach \nIncreased fog ranges \nReduced clipping of player arm in body when looking down at self \nRemoved deeper cave dead positions. Waking up in cave will now always be reasonably close to surface \nNew detailed rope model added, along with new curled rope pick up prefab \nTweaked pacing of daytime enemies \nLess blue enemies in upper parts of caves \nNew lizard skin inventory model (replacing scaled lizard mesh) \nNew inventory item : Tree sap! can be collected from trees, can be used in weapon upgrading/crafting \nNew tooth model and texture \nImproved pickup system. Will now pick up closest item you are looking at \nIncreased chance of meds and torches in suitcases, lowered chance of tennis balls. \nImproved look of alpha selected items in inventory(feather, herbs) \nTorch now displays amount of charge left in inventory tooltip \nInventory herb models replaced with more realistic versions \nFixed issue where weapons would swing a second time if you clicked again during early part of swing \nRandomized size of animals \nCave lakes, collision,lighting and layout improvements \nAdded more randomness to plane crash possible locations \n\nFlashlight no longer auto equips on pick up, needs to be manually selected from inventory \nYou can no longer pick up rabbits, you need to catch them in trap first","torrent":{"xt":"urn:btih:0bb034b0f98d3950400a7e5f2aad8e0326f08d8a","amp;dn":"The.forest.public.alpha.v0.08.build.20141008.cracked.3dm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bb034b0f98d3950400a7e5f2aad8e0326f08d8a","infoHashBuffer":{"type":"Buffer","data":[11,176,52,176,249,141,57,80,64,10,126,95,42,173,142,3,38,240,141,138]},"announce":[],"urlList":[]}}