{"title":"Kerbal Space Program (2.2.0.4) (GOG)","uid":12744312,"size":495321359,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0c75d61e7491787395ad351d9e2fc0111a4f8ad6&amp;dn=Kerbal+Space+Program+%282.2.0.4%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":0,"uploader":"mercs215","files":2,"time":1447281941,"description":"Install instructions:\r\n- Run &quot;setup_kerbal_space_program_2.2.0.4.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nChange log:\r\nPatch 1.0.5 (10 November 2015)\r\nHighlights\r\nContextual Contracts &amp; Contract Changes\r\nThe contracts system has had a major overhaul with the goal of providing you with more varied and relevant contracts. Front and center in this overhaul are the contextual contracts, which adapt to your progress in the game. Contextual contracts will take your existing infrastructure consisting of bases, stations, satellites and rovers, and will challenge you to do things such as adding new modules, rotate crews, fly in a Kerbal with a specific skill, explore the surface around it, move the orbit and so on.\r\nThe goal of the integration of the contracts with your existing missions is to integrate them more in the natural gameplay. You will be asked to use what you have built already, alongside the existing contracts that mostly ask you to launch new items.\r\nMore changes can be found in the passive milestone rewards, which automatically reward you for any milestone you cross. These rewards are not only reflected in reputation gains, but also in funding and science bonuses. Higher rewards are still available to players who actively pursue a goal from a World's First contract they've accepted. New milestones are also available, targeting objectives such as space walks, crew transfer and atmospheric flights on alien worlds, and if you're not someone who spends a lot of time at mission control then a new strategy available from the - Administration Building is right up your alley: leadership initiative increases the passive milestone rewards at the expense of contractual rewards, providing a boost to more independent players. Finally, the game now tracks manned and unmanned progress separately.\r\nThermodynamic improvements\r\nUpdate 1.0.5 features many improvements to the thermodynamic systems. The thermodynamics ('thermo') system has been reworked to correct the various issues encountered in 1.0.4. In addition the thermodynamics at high timewarp feature more customizability, and support differential skin-internal temperatures and non-instant changes. We've also corrected some issues with the atmospheres of other celestial bodies, and better tuned re-entry and aerobraking across the board. When loading a long-unloaded vessel, unloaded thermal changes will be applied, too.\r\nThe concept of core heat was also introduced, which in combination with various fixes should stop unexpected overheating of parts. Probably the best analogy of how this interacts with the rest of the thermal system (internal and skin temperature) would be to compare it to your computer’s case temperature, the temperature inside of the case, and the temperature of your CPU. For example, the ISRU should be capable of smelting materials, yet not melt the rocket it’s attached to. In game, this means that the ISRU works best with a core temperature of about 2000K, even if the part only has an internal temperature of 200-300K. This system allows us to be very expressive with the core temperature and simulate things such as warm-up time &amp; overheating without it being directly coupled to the part temperature, which would become problematic as we enter analytics warp and temperatures equalize.\r\nNew buoyancy model\r\nThe water buoyancy has been completely reworked. Water is now less soupy and it's very possible to build seaplanes. In keeping with our commitment to make the game as moddable as possible all the physics values can be tweaked in config files. The density of oceans differs across celestials bodies, invoking new gameplay challenges. The impact speed not only depends on the speed of the craft when it hits the water, but also the angle at which it hits the water.\r\nNew rocket and spaceplane parts\r\nA wide range of new and overhauled parts were introduced. The toroidal aerospike rocket engine has had an overhaul, as did the basic- and ramjet engines, the radial air intake and many mk.1 spaceplane parts. Among the new parts we find a complete working kit for mk.0 jet engines, the &quot;Goliath&quot; turbofan engine that would be a great fit on a large airliner and the &quot;Vector&quot; rocket engine, which mimics the Space Shuttle's main engines. The mk. 3 Cargo Ramp is a brand new part as well. This'll allow you to drive a payload into the back of an aircraft, or perhaps you want to create a docking bay on a space station with it! These are just some of the updated parts, we're hoping to see many new creations that incorporate them. We've also added new stock craft in the game for you to play around with.\r\nBugfixes &amp; Tweaks\r\nKSP 1.0.5 has seen a big focus on bugfixes. Over 100 issues were fixed, including launch clamps following you to orbit, . And good news for anyone with a fine eye for detail: the black stripes on the NASA tanks now line up perfectly! There were of course plenty more bugs on the 'fixed list', and a more comprehensive list is available below","torrent":{"xt":"urn:btih:0c75d61e7491787395ad351d9e2fc0111a4f8ad6","amp;dn":"Kerbal+Space+Program+%282.2.0.4%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c75d61e7491787395ad351d9e2fc0111a4f8ad6","infoHashBuffer":{"type":"Buffer","data":[12,117,214,30,116,145,120,115,149,173,53,29,158,47,192,17,26,79,138,214]},"announce":[],"urlList":[]}}