{"title":"Microsoft Exchange Server 2013 PowerShell Cookbook - Jonas Ander","uid":8729914,"size":13499866,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0caa3f893307353a5578ea0e1014ae2515686dce&amp;dn=Microsoft+Exchange+Server+2013+PowerShell+Cookbook+-+Jonas+Ander&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"Ehhhhtozebec","files":-1,"time":1374575213,"description":"Overview\n\nMicrosoft Exchange Server 2013 is a complex messaging system. Windows PowerShell 3 can be used in conjunction with Exchange Server 2013 to automate and manage routine and complex tasks to save time, money, and eliminate errors.\n\nMicrosoft Exchange Server 2013 PowerShell Cookbook: Second Edition offers more than 120 recipes and solutions to everyday problems and tasks encountered in the management and administration of Exchange Server. If you want to write scripts that help you create mailboxes, monitor server resources, and generate detailed reports, then this Cookbook is for you.\n\nThis practical guide to Powershell and Exchange Server 2013 will help you automate and manage time-consuming and reoccurring tasks quickly and efficiently. Starting by going through key PowerShell concepts and the Exchange Management Shell, this book will get you automating tasks that used to take hours in no time.\n\nWith practical recipes on the management of recipients and mailboxes as well as distribution groups and address lists, this book will save you countless hours on repetitive tasks. Diving deeper, you will then manage your mailbox database, client access, and your transport servers with simple but effective scripts.\n\nThis book finishes with advanced recipes on Exchange Server problems such as server monitoring as well as maintaining high availability and security. If you want to control every aspect of Exchange Server 2013 and learn how to save time with PowerShell, then this cookbook is for you.\n\n\nProduct Details\n\nISBN-13: 9781849689427\nPublisher: Packt Publishing\nPublication date: 6/16/2013\nPages: 504\n\nAbout the Authors:\n\nJonas Andersson: Having started his career as a Microsoft Infrastructure Consultant, Jonas further moved his focus on to Microsoft Exchange, and he has since worked on designing, implementing, and developing messaging solutions for enterprise customers. Jonas's unique knowledge makes him a key figure in large and complex migration projects, where he works with design and implementation.\n\nMike Pfeiffer: Being a Microsoft Certified Master and a former Microsoft Exchange MVP, Mike has been in the IT field for 15 years, and he has been working on Exchange for the majority of that time. Mike is currently a Premier Field Engineer at Microsoft, where he helps customers deploy and maintain Microsoft Exchange and Lync Server solutions.","torrent":{"xt":"urn:btih:0caa3f893307353a5578ea0e1014ae2515686dce","amp;dn":"Microsoft+Exchange+Server+2013+PowerShell+Cookbook+-+Jonas+Ander","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0caa3f893307353a5578ea0e1014ae2515686dce","infoHashBuffer":{"type":"Buffer","data":[12,170,63,137,51,7,53,58,85,120,234,14,16,20,174,37,21,104,109,206]},"announce":[],"urlList":[]}}