{"title":"The Rolling Stones.Discografia.","uid":4041755,"size":1767375209,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0d0eca7e788831bc3b76febae569b9e084c0ce5a&amp;dn=The+Rolling+Stones.Discografia.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":4,"uploader":"cholo24","files":661,"time":1203710055,"description":"La historia musical de los Rolling Stones comienza en 1960, cuando Mick Jagger y Keith Richards, dos viejos compaÃƒÂ±eros de estudios, comienzan a compartir su pasiÃƒÂ³n por la mÃƒÂºsica y el rythm &amp; blues. Al aÃƒÂ±o siguiente crearon un grupo, &amp;#039;Little Boy Blue &amp; Blue Boys, junto a Jack Taylor.\n\nEn 1962 conocen a Brian Jones. Este se une al grupo de Richards, Jagger y compaÃƒÂ±ÃƒÂ­a y deciden renombrar el grupo. El nuevo nombre elegido: &amp;#039;The Rolling Stones&amp;#039;, estaba inspirado en un viejo tema de Muddy Waters, &amp;#039;Rolling Stones Blues&amp;#039;. Pronto se incorporÃƒÂ³ Charlie Watts, junto al pianista Ian Stewart.\n\nEse mismo aÃƒÂ±o Bill Wyman sustituye a Taylor y en 1963 lanzan su primer sencillo, &amp;#039;Come On&amp;#039;, una versiÃƒÂ³n de una canciÃƒÂ³n de Chuck Berry. Por aquÃƒÂ©l entonces sÃƒÂ³lo se dedicaban a realizar versiones de temas conocidos. Ese aÃƒÂ±o realizan su primera gira por Gran BretaÃƒÂ±a.\n\nEn 1964 publican el primer ÃƒÂ¡lbum, &amp;#039;The Rolling Stones&amp;#039;, el cual sÃƒÂ³lo disponÃƒÂ­a de una canciÃƒÂ³n creada ÃƒÂ­ntegramente por los Rolling Stones. El resto eran versiones de otros artistas. Pero no se limitaban a versionear. El fuerte ritmo que imprimen a los temas y la agresividad que adoptan en sus intrumentos les confiere un aire propiamente suyo. Realizan dos giras por Estados Unidos y aparecen en el show de Ed Sullivan.\n\nFuera del escenario los expertos de marketing querÃƒÂ­an darles a conocer como los chicos malos del pop/rock, en contraposiciÃƒÂ³n con los Beatles, que podrÃƒÂ­an ser considerados los chicos buenos.\n\nAsÃƒÂ­, eran constantes los escÃƒÂ¡ndalos en que se veÃƒÂ­an salpicados. Unas veces eran detenidos por orinar en pÃƒÂºblico, otras por posesiÃƒÂ³n de drogas y asÃƒÂ­ uno tras otro.\n\nEn enero de 1965 saliÃƒÂ³ su segundo disco, &amp;#039;Rolling Stones 2&amp;#039;, para el que tomaron influencias de la mÃƒÂºsica negra americana, principalmente de soul.\n\nPor aquel entonces comenzaron a plantearse que, si querÃƒÂ­an mantenerse en la cima en el mundo de la mÃƒÂºsica tendrÃƒÂ­an que aportar su granito de arena y demostrar su capacidad creativa. Por ello, su manager les encerrÃƒÂ³ varios dÃƒÂ­as en un hotel para que trabajaran en la elaboraciÃƒÂ³n de temas nuevos e inÃƒÂ©ditos. De allÃƒÂ­ salieron algunos de sus mayores ÃƒÂ©xitos. A pesar de ello, su nuevo ÃƒÂ¡lbum &amp;#039;Out Of Our Heads&amp;#039;, seguÃƒÂ­a manteniendo un buen nÃƒÂºmero de versiones, reservÃƒÂ¡ndose los nuevos temas para discos posteriores.\n\nEn 1966 lanzan al mercado &amp;#039;Aftermath&amp;#039;, compuesto completamente por temas suyos, abandonando las versiones de la mÃƒÂºsica soul americana y los sonidos negros, y siendo considerado como uno de sus mejores discos.\n\nEn 1967 sacaron &amp;#039;Between The Buttoms&amp;#039;, que se vio salpicado por el escÃƒÂ¡ndalo en torno a la detenciÃƒÂ³n de Jagger y Richards por posesiÃƒÂ³n de droga. Los temas del disco coincidÃƒÂ­an con el de la detenciÃƒÂ³n, al tratar en asunto de las drogas en varias de las canciones.\n\nCon el Lp &amp;#039;Their Satanic Magesties Request&amp;#039; se llevaron uno de sus grandes fracasos. Intentaron imitar el &amp;#039;Sgt. Peppers&amp;#039; de los Beatles, pero la crÃƒÂ­tica les acusÃƒÂ³ de seguir la estela del otro grupo britÃƒÂ¡nico.\n\nEn 1968 aparece un nuevo disco de los Rolling Stones, titulado &amp;#039;Beggars Banquet&amp;#039;, que supuso la vuelta a la esencia de los Rolling. Una portada provocativa que fue censurada por su propia compaÃƒÂ±ÃƒÂ­a y que al final apareciÃƒÂ³ totalmente en blanco fue el principio. La continuaciÃƒÂ³n, unos temas provocativos que hablaban de luchas, de sensualidad y un recordatorio de la mÃƒÂºsica negra.\n\nEn 1969 Brian Jones fue encontrado muerto en su casa, vÃƒÂ­ctima de las drogas. Al grupo se uniÃƒÂ³ Mick Taylor. Este hecho fue seguido por la publicaciÃƒÂ³n de un nuevo disco, &amp;#039;Let It Bleed&amp;#039;, una rÃƒÂ©plica irÃƒÂ³nica al &amp;#039;Let it Be&amp;#039; de los Beatles, en un momento en que el grupo de Liverpool rumiaba su disoluciÃƒÂ³n. Este disco les encarama definitivamente en la cima del rock mundial.\n\nEn 1971 editan &amp;#039;Brown Sugar&amp;#039;, el primero con su propio sello discogrÃƒÂ¡fico y &amp;#039;Sticky Fingers&amp;#039;, el primero en que utilizan un diseÃƒÂ±o de Andy Warhol de unos labios como sello del grupo. Este ÃƒÂºltimo disco estÃƒÂ¡ considerado como uno de los grandes de los Rolling por su calidad instrumental. Con el fin de ahorrarse impuestos los Stones deciden trasladar sus cuentas a Francia.\n\nEn 1972 publican un doble disco, &amp;#039;Exile On Main Street&amp;#039;, un disco de gran calidad y muy ambicioso. PretendÃƒÂ­a ser el portal de entrada para una gran gira por Estados Unidos y habÃƒÂ­a que cautivar al pÃƒÂºblico. Fue nÃƒÂºmero uno en Inglaterra y en USA.\n\nLa dÃƒÂ©cada de los setenta avanzaba y los Rolling Stones continuaban sacando discos, alternando calidades. AsÃƒÂ­, en 1973 publicaban &amp;#039;Goats Head Soup&amp;#039; y en 1974 &amp;#039;It&amp;#039;s Only Rock&amp;#039;n Roll&amp;#039;, para cuya promociÃƒÂ³n llenaron las calles de Londres de pintadas que decÃƒÂ­an &amp;#039;Es sÃƒÂ³lo rock and roll&amp;#039;. Fue el ÃƒÂºltimo disco de Mick Taylor en la banda, que fue sustituÃƒÂ­do por Ron Wood. Tambien editaron un ÃƒÂ¡lbum en directo, &amp;#039;Love You Live&amp;#039;.\n\nHasta 1978 no sacaron su siguiente disco de estudio, &amp;#039;Some Girls&amp;#039;, considerado por la crÃƒÂ­tica como uno de sus mejores discos.\n\nLa dÃƒÂ©cada de los ochenta comenzÃƒÂ³ con la firma de un supermillonario contrato de los Rolling Stones con la CBS, el mayor hasta ese momento. Por ÃƒÂ©l, los Stones recibirÃƒÂ­an varios millones de dÃƒÂ³lares por cada disco publicado. Fruto del acuerdo fueron discos como &amp;#039;Emotional Rescue&amp;#039;, seguido de &amp;#039;Tattoo You&amp;#039; en 1981, &amp;#039;Stiff Life&amp;#039; en 1982, &amp;#039;Undercover&amp;#039; en 1983 y &amp;#039;Dirty Work&amp;#039; en 1986.\n\nEl disco que elevÃƒÂ³ la calidad media de la dÃƒÂ©cada fue &amp;#039;Steel Wheels&amp;#039;, de 1989, en el que basaron una nueva macrogira mundial y un nuevo ÃƒÂ¡lbum en vivo basado en dicha gira, &amp;#039;Flashpoint&amp;#039;.\n\nEn 1990 realizan una gira por JapÃƒÂ³n y Europa, en la que fueron seguidos por mÃƒÂ¡s de dos millones de espectadores y generando unos ingresos cercanos a los doscientos millones de dÃƒÂ³lares.\n\nEn 1994 publican un nuevo disco, &amp;#039;Voodoo Lounge&amp;#039; y un aÃƒÂ±o despuÃƒÂ©s sacan a la luz &amp;#039;Rock And Roll Circus&amp;#039;, grabado en 1968 y que nunca habÃƒÂ­a sido publicado.\n\nEn 1995 editan &amp;#039;Stripped&amp;#039; y en 1997 &amp;#039;Bridges To Babylon&amp;#039;. Por fin, en 2005, aparece un nuevo ÃƒÂ¡lbum de los Rolling Stones, titulado &amp;#039;A bigger bang&amp;#039;. Se trata de una ambiciosa y muy diversa colecciÃƒÂ³n de canciones de rock y blues con mucha fuerza y contundencia. Con una relaciÃƒÂ³n de 16 temas, es el ÃƒÂ¡lbum con temas nuevos mÃƒÂ¡s largo de la banda desde el &amp;#039;Exile on Main Street&amp;#039; de 1972. El tÃƒÂ­tulo refleja su fascinaciÃƒÂ³n por la teorÃƒÂ­a cientÃƒÂ­fica sobre el origen del Universo.\n","torrent":{"xt":"urn:btih:0d0eca7e788831bc3b76febae569b9e084c0ce5a","amp;dn":"The+Rolling+Stones.Discografia.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d0eca7e788831bc3b76febae569b9e084c0ce5a","infoHashBuffer":{"type":"Buffer","data":[13,14,202,126,120,136,49,188,59,118,254,186,229,105,185,224,132,192,206,90]},"announce":[],"urlList":[]}}