{"title":"Chinua Achebe - Novels, Poetry &amp; Non-Fiction (10 books)","uid":9169920,"size":21377287,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d4cb30edc71f0b8ee322eecd61c3e6e18461683&amp;dn=Chinua+Achebe+-+Novels%2C+Poetry+%26amp%3B+Non-Fiction+%2810+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"workerbee","files":-1,"time":1384050249,"description":"\nCHINUA ACHEBE (1930 - 2013) was a Nigerian novelist, poet, professor, and critic.  He was best known for his first novel THINGS FALL APART (1958), which gained worldwide attention and remains the most widely read book in modern African literature.  \n\nAchebe wrote his novels in English and defended the use of English, a &quot;language of colonisers&quot;, in African literature.  They focus on the traditions of Igbo society, the effect of Christian influences, and the clash of Western and traditional African values during and after the colonial era.  His style relies heavily on the Igbo oral tradition, and combines straightforward narration with representations of folk stories, proverbs, and oratory.\n\nWhen the region of Biafra broke away from Nigeria in 1967, Achebe became a supporter of Biafran independence and acted as ambassador for the people of the new nation.  In October 2012, the publication of THERE WAS A COUNTRY: A PERSONAL HISTORY OF BIAFRA immediately caused a stir and re-opened the discussion about the Nigerian Civil War.  It would prove to be Achebe's last publication during his lifetime.\n\nAchebe received numerous honours from around the world, including the Honorary Fellowship of the American Academy of Arts and Letters, as well as honorary doctorates from more than thirty colleges and universities. He is also the recipient of Nigeria's highest award for intellectual achievement, the Nigerian National Merit Award.  In 2007, he won the Man Booker International Prize for Fiction.\n\n\nAll the following books are in EPUB format:\n\n* ANTHILLS OF THE SAVANNAH (1987; Anchor Books, 2010).\n\n* ARROW OF GOD (1965; Penguin, 2010).\n\n* CHIKE AND THE RIVER (1966; Anchor Books, 2011).\n\n* COLLECTED POEMS (Anchor Books, 2004).\n\n* THE EDUCATION OF A BRITISH-PROTECTED CHILD (Knopf, 2009).\n\n* GIRLS AT WAR &amp; OTHER STORIES (Anchor Books, 1991).\n\n* HOPES AND IMPEDIMENTS: Selected Essays (Anchor Books, 1990).\n\n* NO LONGER AT EASE (1960; Anchor Books, 1994).\n\n* THERE WAS A COUNTRY: A Personal History of Biafra (Penguin, 2012).\n\n* THINGS FALL APART (1958; Anchor Books, 1994).\n","torrent":{"xt":"urn:btih:0d4cb30edc71f0b8ee322eecd61c3e6e18461683","amp;dn":"Chinua+Achebe+-+Novels%2C+Poetry+%26amp%3B+Non-Fiction+%2810+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d4cb30edc71f0b8ee322eecd61c3e6e18461683","infoHashBuffer":{"type":"Buffer","data":[13,76,179,14,220,113,240,184,238,50,46,236,214,28,62,110,24,70,22,131]},"announce":[],"urlList":[]}}