{"title":"Robert Greene and 50 Cent - The 50th Law","uid":5474911,"size":246863753,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0df65dc274ef4d14c3af797d193010c16262694b&amp;dn=Robert+Greene+and+50+Cent+-+The+50th+Law&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":2,"uploader":"7itanium","files":-1,"time":1270083291,"description":"Robert Greene has created a powerful book that will likely be misunderstood by most or discounted by many because of the co-author and his past, this will be a big mistake. In my opinion Robert Greene has taken a fearless step by choosing to cast 50 Cent\nas a modern day hip hop Napoleon, while I see the correlation, I'm not sure I'd go quite that far.\n\nThe 50th law is about two topics near and dear to my heart, fearlessness and hustle. In this case the term hustle is used to describe the street hustling tactics and the criminal endeavors of 50 Cent, what you can't overlook is that much of what 50 Cent did was in fact criminal and had no socially redeeming qualities. That said, he showed amazing insight for a child with little education other than that received from trial and error and other hustlers. He showed an intuitive grasp of core concepts of power, of strategy, and of outright manipulation. Robert discusses those tactics in great detail and in a very interesting way, the text is incredibly motivating. I constantly found myself wondering what I might do if I applied the same kind of hustle in an ethical, legal way to my existing business\nand kept coming back to the same conclusion, the business would grow and my competitors would be impacted.\n\nThe key ideas in the book are:\n\n1. Intense Realism - A very candid look at the value of seeing things as they are\n2. Self Reliance - A look at making everything your own and controlling yourself and your surroundings\n3. Opportunism - Finding the value in negative situations and making the best of ever situation while turning it to your advantage\n4. Keep moving - Move with the chaos, don't give others a chance to pin you down, change your appearance to fit the environment\n5. Aggression - Get over your fears of confronting people\n6. Authority - The person at the top sets the tone\n7. Connection - Think of the public first and their changing needs. Begin with their demand and create the appropriate supply.\n8. Mastery - Learn to master boredom, outlast your rivals, learn early to endure the hours of practice and drudgery to build a proper foundation to grow from\n9. Self Belief - Push beyond your limits. Your sense of who you are will determine your actions and what you get in life.\n10. The Sublime - Confront your mortality\n\nWhile this book does not contain the depth of history you've probably come to expect from Mr. Greene's writing, there is plenty of it here and it is well chosen to support the topic of each chapter.\n\nIf you were ever looking for the step by step how to apply all of Robert's other writing, this is it, all wrapped up in a very practical guide. Misunderstand or overlook this book at your own risk . . . better yet, get it now and learn it, you'll be glad you did. ","torrent":{"xt":"urn:btih:0df65dc274ef4d14c3af797d193010c16262694b","amp;dn":"Robert+Greene+and+50+Cent+-+The+50th+Law","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0df65dc274ef4d14c3af797d193010c16262694b","infoHashBuffer":{"type":"Buffer","data":[13,246,93,194,116,239,77,20,195,175,121,125,25,48,16,193,98,98,105,75]},"announce":[],"urlList":[]}}