{"title":"FSX PMDG MD11","uid":4868657,"size":162808270,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0e1143f96b677c3388b343c00da9c9af4a5f5330&amp;dn=FSX+PMDG+MD11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":2,"uploader":"cr3ator","files":-1,"time":1240672698,"description":"PMDG continues our lineage of fine airliner simulations with another popular heavy airliner,\nthe PMDG MD-11! Born out of airline requirements for a &quot;modern new DC-10&quot; the MD-11 is a superb example of aircraft engineering from the era when modern computer processing power was beginning to bring truly new ideas, safety and capability to the cockpit of transport airplanes. Highly automated and employing innovative new approaches to the pilot/airplane interface, the MD-11 took the McDonnell Douglas widebody line into the future with fully automated flight modes, aircraft system status pages, failure consequence displays and clearly thought out pilot controls. One of the most advanced airplanes ever produced by Douglas, the MD-11 has been largely missing from desktop simulation... Until Now!\n\nExterior Model\n\n    * 3DS Max MD-11 Model - Both engine variants included, accurately modeled to the smallest details and completed with high resolution textures.\n    * BONUS MD-11F Model - Having emerged as one of the most popular large freighters, an additional model representing the cargo version is also included complete with animated main deck cargo door (both the fore and aft main deck cargo door variants are modeled).\n    * Airplane Animations - All of the animated parts on the exterior model bring the MD-11 to life. Realistic gear, flap, spoiler and slat movement, opening passenger and cargo doors, wings that flex in response to aerodynamic and stress loads, and of course an Air Driven Generator (ADG) all animated using the most current 3D design industry standard techniques.\n\n Virtual Cockpit\n\n    * Dynamic Virtual Cockpit - Designed and animated using the same proprietary techniques developed for PMDG's award-winning 747-400 product line, Virtual Cockpit users will truly enjoy the sensation of &quot;being there&quot; when flying this simulator from the fully animated 3D virtual cockpit.\n    * Wing Views - Enjoy your flight from different locations in and around the aircraft, including multiple views of the wings.  \n\n Cockpit Features\n\n    * Complete Avionics - Sharp vector graphic cockpit displays bring the PMDG MD-11 vividly to life.\n    * Cockpit Systems - Aircraft Systems modeled to the degree of accuracy you've come to expect only from PMDG. Whether using the 2D or Virtual Cockpit, all cockpit switches, buttons knobs and controls work as they do on the MD-11. Developed with comprehensive support of PMDG's MD-11 Technical Advisors, to ensure everything is simulated correctly including fuel, hydraulics, pneumatics/air conditioning/cabin pressurization and all other secondary systems. When applicable automatic and manual modes are simulated, including system redundancy, interdependency and failure consequences.\n    * Internal Lighting - Modeled using a proprietary technique developed by PMDG specifically for the MD-11, you will be amazed at the range of lighting and customization options available including:\n          o Flood lighting and panel back-lighting independently controlled for different sections of the cockpit with variable intensity that can be increased and dimmed to 256 levels of intensity in a true 'rheostat' style\n          o Effect of flood and label lighting varies for different times of the day\n          o Dome lighting can be applied on top of flood lighting \n    * Widescreen Support - 2D Panel supports both standard and widescreen monitors with unique artwork for each.\n\n Additional Features\n\n    * Fully Immersive Sound - To increase the level of immersion, PMDG has included the unique sound of nearly every aspect of the MD-11 airplane. Hundreds of individuals switches, knobs, and controls were recorded expressly for the purpose of providing audio-tactile feedback as never before presented in a PMDG simulation. The sound package (included with the product) covers every sound you would expect to hear in the MD-11 cockpit, from the first click of the battery switch to the roar of the engines in flight.\n    * Interactive Load Manager - Adjust the weight of the fuel, passenger and cargo load for each flight.\n    * Add-on Liveries - As is always the case at PMDG, numerous free add-on liveries are available for most real-world MD-11 and MD-11F operators.\n\n \nAdditional MD-11 Details\n\n    *\n      LSAS (Longitudinal Stability Augmentation System)\n    *\n      RCWS (Roll control Wheel Steering)\n    *\n      Interactive FMS with three MCDUs - All major functionality operating to match its real world counterpart\n    *\n      Cockpit layout/windows management -\n          o Correct pilot perspective when using main 2D panel view.\n          o Innovative methods to allow customizable display of essential flight controls (FCP/ECP) into main view when flying from the 2D panel view.\n          o One-click configuration of panel windows for specific tasks e.g. 4th DU (SD display) + SDCP (System Display Cotrol Panel) + related overhead panel part, Engine Starters + Fuel switches + Overhead Ignition panel etc.\n    *\n      Failures Simulation - Unique MD-11 alerting system with over 400 crew alerting messages. The MD-11 takes crew alerting a step further however, by displaying dynamic lists of &quot;consequences&quot; related to system failures in order to help the crew maintain airplane and situational awareness during abnormal operations. The crew alerting and consequences system is fully modeled within the PMDG MD-11.\n    *\n      Airline Options - Dozens of airline options featured for customized airplane operations.\n    *\n      System Depth - MD-11 systems are very advanced and complex. However, all main systems (hyd, air, fuel, electrics) have automatic controllers that reconfigure the systems for the appropriate phase of flight and handle failures and abnormal situations just as is done on the actual airplane. When operated in auto mode, the airplane manages itself programmatically with minimal pilot interface (e.g. no need to ever turn on/off fuel pumps, engine bleeds and packs etc. the controllers will do this for you). Just as on the real aircraft, the crew can switch systems to manual mode for specific control of any of the highly detailed systems.\n","torrent":{"xt":"urn:btih:0e1143f96b677c3388b343c00da9c9af4a5f5330","amp;dn":"FSX+PMDG+MD11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e1143f96b677c3388b343c00da9c9af4a5f5330","infoHashBuffer":{"type":"Buffer","data":[14,17,67,249,107,103,124,51,136,179,67,192,13,169,201,175,74,95,83,48]},"announce":[],"urlList":[]}}