{"title":"[ScoreLand] Angela White, Christy Marks (Big Boob Paradise / 204","uid":8495470,"size":276902911,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0e39a389842f40fa499925b8a56656c53816ad99&amp;dn=%5BScoreLand%5D+Angela+White%2C+Christy+Marks+%28Big+Boob+Paradise+%2F+204&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":3,"uploader":"chkm8te","files":2,"time":1369131561,"description":"[ScoreLand] Angela White, Christy Marks (Big Boob Paradise / 20420 / 05.17.2013)\n\nShot on-location in the Caribbean. This is Big Boob Paradise. Two of the most-popular SCORE super-models get down and dirty in a tropical paradise. Here is what happens when two cover girls bump T&amp;A. Clash of the titans!\n\nAustralia's hottest and most-popular model since 2003 when she first contacted us, Angela White meets award-winning American Christy Marks in Eleuthera, The Bahamas. Rampaging sex drives collide on the pristine, white beach and turn the sand even hotter than the sun can bake it. Both girls are SCORE originals, meaning they started their adventures in modeling with us.\n\nWho is the most-aggressive of the two? Both girls are aggressive. Both are passive. This one-and-only pairing has been called epic. They were separated by half the world, yet they became BBFs (Busty Breast Friends). This sex rave was a highlight of living in paradise for a week. They are the ultimate girls-next-door.\n\nIt seemed as if Angela and Christy dared one another to escalate the heat, staring into each other's eyes intensely under nature's blue canopy and wearing nothing but the wind. Their tongues were in overdrive, their bodies writhing in sexual delirium and orgasmic pleasure.\n\nYou'll see how fascinated they were by each other's super-bodies as they explore their nipples, wet cunts, asses and every other erogenous zone a chick has.\n\n&quot;Angela White, hands down,&quot; said bikini-buster Christy when she was asked who was her favorite girl to do girl-girl with. &quot;She was really into it. Personality-wise, she was the best, too!&quot;\n\nThe biggest tourist attraction in Sydney, Australia, Angela was equally excited about her beach blanket bang partner.\n\n&quot;Christy Marks' boobs are just out of this world!&quot; Angela said. &quot;I think they are the biggest I've ever seen, especially on a girl who is as slender as Christy. That makes her even more phenomenal than most others.&quot;\n\nMade with the same love for big tits and pretty girls that made On Location Key Largo and On Location Costa Del Sol big hits, Big Boob Paradise is on DVD at your friendly neighborhood adult store or direct from eBoobStore.com. Lorna Morgan, Terry Nova and Gianna Rossi co-star.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=gl7dpxzoyojuamaza7h1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=gl7dpxzoyojuamaza7h1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=rogtfa06ui530iygo3a6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=rogtfa06ui530iygo3a6.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:0e39a389842f40fa499925b8a56656c53816ad99","amp;dn":"%5BScoreLand%5D+Angela+White%2C+Christy+Marks+%28Big+Boob+Paradise+%2F+204","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e39a389842f40fa499925b8a56656c53816ad99","infoHashBuffer":{"type":"Buffer","data":[14,57,163,137,132,47,64,250,73,153,37,184,165,102,86,197,56,22,173,153]},"announce":[],"urlList":[]}}