{"title":"Learn To Swim - Total Immersion - Four Strokes Made Easy","uid":8814475,"size":609501184,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0e42c7885e9192e48d39f267e07b1c044cd0dc8f&amp;dn=Learn+To+Swim+-+Total+Immersion+-+Four+Strokes+Made+Easy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"acer47x","files":1,"time":1376545846,"description":"Learn to swim. Four styles / Learn To Swim - Total Immersion - Four Strokes Made Easy\n\nYear : 1999 \nSport : Swimming \nmembers : Terry Laughlin \nDuration : 82 min \nComment : Professional (One) Comment \nlanguage : English \nQuality : DVDRip \nFormat : AVI \nVideo codec : DivX \nAudio codec : MP3 \nVideo : NTSC, 720x480, 29.97 fps, 778 Kbps, DivX 5 \nAudio : 48 kHz, MPEG Layer 3, 2 ch, 192 Kbps CBR \n\n\nDescription : This DVDRip contains two original video combined into one movie. This is a basic video will help you catch the key movements and rhythms that bind the two styles of the longitudinal axis (swimming freestyle (crawl) and swimming on his back ), and those that combine two styles of short-axis ( breaststroke and butterfly ). This unique approach - the study of the foundations of two punches at once. We guarantee that this will be one of the most valuable tools to improve swimming technique that you may have. BUTTERFLY AND BRASS: After training thousands of swimmers, we realized that the key positions and movements that produce the maximum flow and ease in butterfly and breaststroke are so closely related that they can and should be studied together because they enhance and reinforce each other. \n\n\nCONTENTS \n\nLesson One: Common Balance and Rotation Drills Learn to create the essential &quot;Wave&quot; movement of breaststroke and butterfly by rhythmically rocking your body, not by Kicking, preparing you to Swim efficiently and effortlessly, with your Whole body, rather than your arms and legs. Head-Lead Body Dolphin. Learn to undulate your entire body in a supple, relaxed &quot;wave&quot; motion and to use your head to convert a vertical wave into forward momentum. Then Add Breathing, Without interrupting your core-body rhythm. Hand-Lead Body Dolphin. Learn to use your hands to &quot;lengthen your vessel&quot; and reduce drag. Pulse To The Corners. Link to learn the &quot;catch&quot; for both fly and Breast to core body power. \n\n\nLesson Two: Stroke-Integration Drills for Butterfly Build an efficient, fluent Butterfly stroke from the Foundation developed in Lesson One. Stoneskipper. Learn to Maintain A seamless core-body &quot;Wave&quot; rhythm as you armstroke Add the butterfly, the butterfly then breath. Dolphin Body Butterfly. A Relaxed learn, sweeping butterfly Recovery to complement your seamless undulating core-body rhythm. EZ Fly. Put the Whole stroke Progressively together so you avoid practicing &quot;butterstruggle.&quot; \n\n\nLesson Three: Stroke-Integration Drills for Breaststroke Build an efficient, fluent Breaststroke from the Foundation developed in Lesson One. Pulling Heads-Up. Learn to Keep your compact and pull your head Steady, and return to your hands Quickly to full extension. Breaststroke Two-Pulse. Learn to Connect A compact, efficient armstroke skills with your body dolphin and to use your core body as your rhythm and power source. Two Up, One Down. Link an efficient Breast kick to the Previously learned skills and to your Channel Forward Momentum. One Up, One Down. Swim breaststroke with emphasis on Extra Long, Super-Glides in streamlined the Most slippery Position. Underwater Kick. Improve your efficiency kick by Avoiding Water resistance. Two Down, One Up. Learn to slip A Long sleek bodyline Smallest Possible through the hole in the Water Dolphin Breast. Learn to heighten your use of the dolphin body in each stroke cycle and Better make use of core-body power. \n\n\nLesson Four: Short-Axis Combinations Combine Breast and fly drills and strokes to Reinforce the Natural Link Between Them. Improve your sense of how to use &quot;body-Wave&quot; for power and Propulsion. Body-Dolphin Combo. Heighten your focus on the common Short-Axis Motions of Pulsing Forward and Breathing within the stroke. Combo SA Swimming. Alternates cycles of whole-stroke fly and breast. The fly cycles help improve the undulation in your breaststroke; the breast cycles help make your butterfly longer and more effortless. \n\n\n\nFREESTYLE AND backstroke As with Breaststroke and Butterfly, the key body positions and movements that produce the maximum flow and ease in freestyle and backstroke, so closely linked that they can and should be studied together because they enhance and reinforce each other. ","torrent":{"xt":"urn:btih:0e42c7885e9192e48d39f267e07b1c044cd0dc8f","amp;dn":"Learn+To+Swim+-+Total+Immersion+-+Four+Strokes+Made+Easy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e42c7885e9192e48d39f267e07b1c044cd0dc8f","infoHashBuffer":{"type":"Buffer","data":[14,66,199,136,94,145,146,228,141,57,242,103,224,123,28,4,76,208,220,143]},"announce":[],"urlList":[]}}