{"title":"WordPress Web Design For Dummies, 2E 2013 [PDF]","uid":9304602,"size":36866424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e9efffd231672c1909300e9d71c719079658064&amp;dn=WordPress+Web+Design+For+Dummies%2C+2E+2013+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":2,"uploader":"F1restorm","files":-1,"time":1386296968,"description":"Wordpress Web Design for Dummies- Second Edition\nAuthor: Lisa Sabin-Wilson \nPublished: September 3, 2013\nPublisher: Wiley\nISBN: 9781118546611\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nThere's a cheat sheet and articles available online (link in book), no registration was needed when I checked it. Tested on the above readers with no problems. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n___________________________________________________________________________________\n\nUpdated, full-color guide to creating dynamic websites with WordPress 3.6\n\nIn this updated new edition, bestselling For Dummies author and WordPress expert Lisa Sabin-Wilson makes it easy for anyone with a basic knowledge of the WordPress software to create a custom site using complementary technologies such as CSS, HTML, PHP, and MySQL. You'll not only get up to speed on essential tools and technologies and further advance your own design skills, this book also gives you pages of great case studies, so you can see just how other companies and individuals are creating compelling, customized, and cost-effective websites with WordPress.\n\nShows you how to incorporate WordPress templates, graphic design principles, HTML, CSS, and PHP to build one-of-a-kind websites\nExplains how to create an effective navigation system, choose the right color palette and fonts, and select different layouts\nReveals how you can tweak existing website designs with available themes, both free and premium\nProvides numerous case studies to illustrate techniques and processes, and the effects you can achieve\nDiscusses how you can translate your design skills into paid work\nWant to create cost-effective and fantastic websites with WordPress? This do-it-yourself book will get you there.\n","torrent":{"xt":"urn:btih:0e9efffd231672c1909300e9d71c719079658064","amp;dn":"WordPress+Web+Design+For+Dummies%2C+2E+2013+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e9efffd231672c1909300e9d71c719079658064","infoHashBuffer":{"type":"Buffer","data":[14,158,255,253,35,22,114,193,144,147,0,233,215,28,113,144,121,101,128,100]},"announce":[],"urlList":[]}}