{"title":"BMW DIS/SSS AND MANY MORE","uid":8789448,"size":8546648322,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0f5948fbe6772689f17556ae0c0d294de9851547&amp;dn=BMW+DIS%2FSSS+AND+MANY+MORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":2,"uploader":"vaska85","files":1,"time":1375904222,"description":"BMW DIS V57 SSS V32 TIS V8 DIAGNOSTIC DEALER SOFTWARE\n\n\nBMW / MINI dealer level access diagnostic software \n\nThis software package contains everything you need and more to get this running. If there is anything else you require then please contact me. \n\nBMW DIS (Diagnostic Information System) V57 -The diagnostic tool used by all BMW dealerships\n\nBMW SSS (Software Service Station) V32 -The platform used by all BMW dealerships for programming, individualization and encoding of BMW vehicles\n\nBMW TIS (Technical Information System) V8 -Full BMW service and repair manuals used by BMW dealerships including full technical specifications and torque settings\n\nWhat cable / Interface do I require?\n\nYou require an EDIABAS type interface.\n\nYou do not need a yellow multiplexer. Just an EDIABAS interface combined with my software. This software is specifically designed and compiled to work with the EDIABAS interface.\n\nWhat software is included?\nEVERITHING - AND LATEST!\n\nSo what can this software actually do?\n\nRead, identify and erase fault codes from all modules \nCode / Program modules\nProgram memory (seat / mirror positions to specific keys etc)\nEncode new modules\nTest specific parts\nStream live data\nWith this software you can do everything that you would normally be forced to pay a BMW dealership to do for you.\nWhich models are covered by this software? ALL before year 2007 (incl E70)\n\n\nThis software will run on any laptop with a minimum 35Gb Hard drive space\nLaptop running Windows 98, ME, XP, Vista or Windows 7\nLaptops without a serial port will require a USB to serial adapter\n\n\nPackage comes complete with a step by step installation procedural document.\n\n\nThese programs have been professionally engineered so they will run on any laptop running Windows 98, ME, XP, Vista &amp; 7\n\n\n\nPlease not these are educational DVD's are not for commercial use ","torrent":{"xt":"urn:btih:0f5948fbe6772689f17556ae0c0d294de9851547","amp;dn":"BMW+DIS%2FSSS+AND+MANY+MORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f5948fbe6772689f17556ae0c0d294de9851547","infoHashBuffer":{"type":"Buffer","data":[15,89,72,251,230,119,38,137,241,117,86,174,12,13,41,77,233,133,21,71]},"announce":[],"urlList":[]}}