{"title":"Noam Chomsky - Audiobooks Collection","uid":12754039,"size":5369220028,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0f755ac9defb8e1bc64d8d08a6e40e89e8f4d8da&amp;dn=Noam+Chomsky+-+Audiobooks+Collection&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":12,"uploader":"Cybotage","files":534,"time":1447422984,"description":"Format: MP3\r\nBitrate: Variable\r\nUnabridged\r\n\r\nAbout Noam Chomsky:\r\n\r\nNoam Chomsky was born to Dr. William (Zev) Chomsky and Elsie Simonofsky in Philadelphia on December 7, 1928. His father emigrated to the United States from Russia. William was an eminent scholar, author of the study Hebrew, the Eternal Language (1957), as well as numerous other works on the history and teaching of Hebrew. Noam entered the University of Pennsylvania in 1945. There he came in contact with Zelig Harris, a prominent linguist and the founder of the first linguistics department in the United States (at the University of Pennsylvania). In 1947 Chomsky decided to major in linguistics, and in 1949 he began his graduate studies in that field. His BA honor’s thesis Morphophonemics of Modern Hebrew (1949, revised as an MA thesis in 1951) contains several ideas that foreshadow Chomsky’s later work in generative grammar. In 1949 he married the linguist Carol Schatz. During the years 1951 to 1955 Chomsky was a Junior Fellow of the Harvard University Society of Fellows, where he completed his PhD dissertation entitled Transformational Analysis (1955; published as part of The Logical Structure of Linguistic Theory in 1975).\r\n\r\nChomsky received a faculty position at MIT in 1955 and he has been teaching there ever since. In 1961 he was appointed full professor in the Department of Modern Languages and Linguistics; the graduate program in linguistics began the same year. In 1966 he was appointed Ferrari Ward Professor of Linguistics. In 1976, the linguistics and philosophy programs at MIT were merged and the Department of Linguistics and Philosophy was created; this has been Chomsky’s home department ever since.\r\n\r\nAlongside his career as a linguist, Chomsky has been active in left-wing politics. In 1965 he organized a citizen’s committee to publicize tax refusal in protest to the war in Vietnam; four years later he published his first book on politics American Power and the New Mandarins. By the 1980’s he had become both the most distinguished figure of American linguistics and one of the most influential left-wing critics of American foreign policy. He has been extremely prolific as a writer: his web-site in 2003 listed 33 book publications in linguistics (broadly construed), and although the individuation of his political books is complicated, their number definitely exceeds 40. According to a 1992 tabulation of sources from the previous 12 years in the Arts and Humanities Citation Index, Chomsky was the most frequently-cited person alive, and one of the eight most frequently-cited authors of all time.\r\n\r\nList of Items:\r\n\r\n\r\nAn American Addiction\r\nCase Studies In Hypocrisy\r\nEverlasting War\r\nFor A Free Humanity, For Anarchy\r\nHopes And Prospects\r\nImperial Ambitions\r\nClass War - The Attack On Working People\r\nFailed States\r\nFree Market Fantasies, Capitalism In The Real World\r\nGovernment In The Future\r\nHegemony or Survival\r\nMedia Control, The Spectacular Achievements of Propaganda\r\nNecessary Illusions: Thought Control in Democratic Societies\r\nOn Language ('Reflections on Language' and 'Language and Responsibility')\r\nProblems of Knowledge and Freedom (Bertrand Russell Lectures)\r\nPropaganda And Control of The Public Mind\r\nWhat We Say Goes\r\nCapital Rules\r\nProspects For Democracy\r\nThe Clinton Vision: Old Wine, New Bottles\r\nThe Emerging Framework Of World Power\r\nThe Essential Chomsky\r\nThe Imperial Presidency Sovereignty\r\nThe New War on Terrorism: Facts and Fiction\r\nUnderstanding Power\r\nVarious Interviews and Talks - Unorganized collection of various audio recordings","torrent":{"xt":"urn:btih:0f755ac9defb8e1bc64d8d08a6e40e89e8f4d8da","amp;dn":"Noam+Chomsky+-+Audiobooks+Collection","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f755ac9defb8e1bc64d8d08a6e40e89e8f4d8da","infoHashBuffer":{"type":"Buffer","data":[15,117,90,201,222,251,142,27,198,77,141,8,166,228,14,137,232,244,216,218]},"announce":[],"urlList":[]}}