{"title":"Hunted.[2015].Complete.Channel.4.Reality.Documentary.360p.MPup","uid":14515806,"size":1417956290,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:100b097b26cf1bc538e628fa911f6e75467fbf69&amp;dn=Hunted.%5B2015%5D.Complete.Channel.4.Reality.Documentary.360p.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":5,"uploader":"makinapufterpup","files":6,"time":1462327284,"description":"Hunted.[2015].Complete.Channel.4.Reality.Documentary.360p.LDTV.ABC.AU.WEBRIP.[MPup]\r\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\r\n\r\nFormat: MPEG-4\r\nSize: 640x360\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 44.1 KHz\r\n\r\nIn this groundbreaking factual-thriller for British television, 14 British citizens are given fugitive status and go on the run. For up to 28 days they must evade capture from some of the world's best investigators.\r\n\r\n\t---------------------------------------------\r\n\r\nHunted.[2015].s01e01.360p.LDTV.WEBRIP.[MPup]\r\n\r\n[b]1 of 6[/b]\r\n \r\nThe hunters pursue Dr Ricky Allen and Emily and Lauren in London as they evade capture.\r\n\r\n\t---------------------------------------------\r\n\r\nHunted.[2015].s01e02.360p.LDTV.WEBRIP.[MPup]\r\n\r\n[b]2 of 6[/b]\r\n \r\nHarinder and Davinder Singh, Sikh brothers from Leicester, worry that Asian men with beards and backpacks are a terrorist stereotype, so they travel the UK within their community of extended family and friends. However, the pain of separation from their loved ones soon begins to bite. Meanwhile, doctor Ricky Allen continues to evade the hunters in Scotland, but profiler Julie Clegg is just one step behind.\r\n\r\n\t---------------------------------------------\r\n\r\nHunted.[2015].s01e03.360p.LDTV.WEBRIP.[MPup]\r\n\r\n[b]3 of 6[/b]\r\n \r\nRicky Allen has escaped capture for 15 days now and the hunters are getting frustrated at their lack of progress, so a media campaign is launched to flush him out of hiding. Now spooked, he flees south on a train as the hunters close in. Meanwhile, old school friends Emily Dredge and Lauren English are 12 days into their escape but fractures are beginning to appear in their relationship - leaving them both vulnerable.\r\n\r\n\t---------------------------------------------\r\n\r\nHunted.[2015].s01e04.360p.LDTV.WEBRIP.[MPup]\r\n\r\n[b]4 of 6[/b]\r\n \r\nFriends Stephen Hardiker and Martin Cole use canal towpaths to travel almost 100 miles on foot and bicycle to a caravan in Wales. Along the way, IT manager Martin comes up with an ingenious way to stay in touch with their loved ones - but will the cyber team crack their code? Meanwhile, 25-year-old Adam Young from Wales learnt survival skills from his father and is keen to put everything he knows into practice. However, when they pick up his lead, he spends an anxious night hiding out in the Dales.\r\n\r\n\t---------------------------------------------\r\n\r\nHunted.[2015].s01e05.360p.LDTV.WEBRIP.[MPup]\r\n\r\n[b]5 of 6[/b]\r\n \r\nNewlyweds Adam and Emma Channell want one last adventure before they start a family. They plan to go off grid in some of Britain's most remote rural areas, such as the Yorkshire Dales and deepest Wales, but paranoia soon kicks in. Freddie Young, a 21-year-old teaching assistant from Essex, is also on the run - although he is accompanied by his mother-in-law Jacqui Omer, who insists on coming along as she is convinced he can't cope on his own. Meanwhile, Emily Dredge is finding the pain of being apart from her baby unbearable and considers nipping home to see him. Will this be her final mistake?\r\n\r\n\t---------------------------------------------\r\n\r\nHunted.[2015].s01e06.360p.LDTV.WEBRIP.[MPup]\r\n\r\n[b]6 of 6[/b]\r\n \r\nWith just seven days to go, the remaining fugitives must reach a pre-arranged extraction point to evade capture once and for all. But with the clock ticking, the hunters are ramping up their efforts to find them. Stephen and Martin have avoided detection by travelling along canal towpaths - only to appear on the radar after using a cashpoint. School friends Emily and Lauren are still evading capture, despite going their separate ways, although Emily unwittingly trusts some strangers with valuable information. Is this the end of the road for the fugitives or have the breakthroughs come too late?","torrent":{"xt":"urn:btih:100b097b26cf1bc538e628fa911f6e75467fbf69","amp;dn":"Hunted.%5B2015%5D.Complete.Channel.4.Reality.Documentary.360p.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"100b097b26cf1bc538e628fa911f6e75467fbf69","infoHashBuffer":{"type":"Buffer","data":[16,11,9,123,38,207,27,197,56,230,40,250,145,31,110,117,70,127,191,105]},"announce":[],"urlList":[]}}