{"title":"Portishead - Discography 1994-2008 [FLAC]","uid":8224586,"size":6226372797,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:102ee2bf2528c4fe6b4ea7d70d633d6ad95d13ef&amp;dn=Portishead+-+Discography+1994-2008+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":18,"uploader":"rudown78","files":113,"time":1362565129,"description":"Portishead - Discography 1994-2008 [FLAC]\n\n\nPortishead may not have invented trip-hop, but they were among the first to popularize it, particularly in America. Taking their cue from the slow, elastic beats that dominated Massive Attack's Blue Lines and adding elements of cool jazz, acid house, and soundtrack music, Portishead created an atmospheric, alluringly dark sound. The group wasn't as avant-garde as Tricky, nor as tied to dance traditions as Massive Attack; instead, it wrote evocative pseudo-cabaret pop songs that subverted their conventional structures with experimental productions and rhythms of trip-hop. As a result, Portishead appealed to a broad audience -- not just electronic dance and alternative rock fans, but thirtysomethings who found techno, trip-hop, and dance as exotic as worldbeat. Before Portishead released their debut album, Dummy, in 1994, trip-hop's broad appeal wasn't apparent, but the record became an unexpected success in Britain, topping most year-end critics polls and earning the prestigious Mercury Music Prize; in America, it also became an underground hit, selling over 150,000 copies before the group toured the U.S. Following the success of Dummy, legions of imitators appeared over the next two years, but Portishead remained quiet as they worked on their second album.\n\nNamed after the West Coast shipping town where Geoff Barrow grew up, Portishead formed in Bristol, England, in 1991. Prior to the group's formation, Barrow had worked as a tape operator at the Coach House studio, where he met Massive Attack. Through that group, he began working with Tricky, producing the rapper's track for a Sickle Cell charity album. Barrow also wrote songs for Neneh Cherry's Homebrew, though only &quot;Somedays&quot; appeared on the record. Around the time of Portishead's formation, he had begun to earn a reputation as a remix producer, working on tracks by Primal Scream, Paul Weller, Gabrielle, and Depeche Mode. Barrow met Beth Gibbons, who had been singing in pubs, in 1991 on a job scheme. Over the next few years, the pair began writing music, often with jazz guitarist Adrian Utley, who had previously played with both Big John Patton and the Jazz Messengers.\n\nBefore releasing a recording, Portishead completed the short film To Kill a Dead Man, an homage to '60s spy movies. Barrow and Gibbons acted in the noirish film and provided the soundtrack, which earned the attention of Go! Records. By the fall, Portishead had signed with Go! and their debut album, Dummy, was released shortly afterward. Dummy was recorded with engineer Dave MacDonald, who played drums and drum machines, and guitarist Utley, who rounded out Portishead's lineup.\nBoth Barrow and Gibbons were media-shy -- the vocalist refused to participate in any interviews -- which meant that the album received little attention outside of the weekly U.K. music press, which praised the album and its two singles, &quot;Numb&quot; and &quot;Sour Times,&quot; heavily. Soon, Go! and Portishead had developed a clever marketing strategy based on the group's atmospheric videos that began to attract attention. Melody Maker, Mixmag, and The Face named Dummy as 1994's album of the year, and early in 1995, &quot;Glory Box&quot; debuted at number 13 without any radio play. Around the same time, &quot;Sour Times&quot; entered regular rotation on MTV in America. Within a few weeks, Dummy and &quot;Sour Times&quot; were alternative rock hits in the U.S. Back in the U.K., the album had crossed over into the mainstream, becoming a fixture in the British Top 40. In July, the record won the Mercury Music Prize for Album of the Year, beating highly touted competition from Blur, Suede, Oasis, and Pulp.\n\nFollowing the Mercury Music Prize award, Barrow retreated to Coach House to begin work on Portishead's second album. The self-titled record finally appeared in September 1997. The live PNYC followed late the next year. The self-titled record finally appeared in September 1997. Portishead went on hiatus starting in 1999, and Barrow, Utley and Gibbons worked on their own projects. In 2001, Barrow formed Invada Records, an experimental label that included Koolism on its roster. Barrow and Utley also recorded a cover of the instrumental rock classic &quot;Apache&quot; as the Jimi Entley Sound that was released as a limited edition 7&quot; single in 2002. The pair also worked as producers, with Barrow working under the moniker Fuzzface on Stephanie McKay's McKay album in 2003, and Barrow and Utley co-produced the Coral's 2005 album The Invisible Invasion. Gibbons collaborated with Rustin' Man, a.k.a. former Talk Talk member Paul Webb on the 2003 album Out of Season (Gibbons had also appeared on a few tracks by Webb's previous project, ORang).\n\nPortishead reconvened in 2005, performing their first live dates in seven years, including an appearance at the Tsunami Benefit Concert in Bristol, and recording material for their next album. Their version of &quot;Un Jour Comme un Autre (Requiem for Anna)&quot; appeared on 2006's Serge Gainsbourg tribute Monsieur Gainsbourg Revisted, and in 2007 the band curated the Nightmare Before Christmas All Tomorrow's Parties festival. In 2008, a decade after their last album, Portishead returned with Third, the trio's most challenging, unpredictable work yet.\n\n\n1. Dummy (1994)\n2. Glory Times (1995)\n3. Portishead (1997)\n4. Roseland Live NYC (1998)\n5. Third (2008)\n\nExtra: Roseland Live NYC [DVD] (2001)\n\n\nAll of the album artwork is also included. Enjoy!!!\n\n","torrent":{"xt":"urn:btih:102ee2bf2528c4fe6b4ea7d70d633d6ad95d13ef","amp;dn":"Portishead+-+Discography+1994-2008+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"102ee2bf2528c4fe6b4ea7d70d633d6ad95d13ef","infoHashBuffer":{"type":"Buffer","data":[16,46,226,191,37,40,196,254,107,78,167,215,13,99,61,106,217,93,19,239]},"announce":[],"urlList":[]}}