{"title":"Parallels Desktop 9 for Mac v9.0.23046.917896","uid":9800255,"size":424320774,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:1090477797d02898cc7bd608d9f2fa185040e850&amp;dn=Parallels+Desktop+9+for+Mac+v9.0.23046.917896+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"pogackers","files":-1,"time":1395363248,"description":"Parallels Desktop 9 for Mac is simply the #1 choice of customers worldwide to seamlessly run. Windows applications on a Mac without rebooting. Powerful performance lets you run day to day Windows productivity applications with ease. . Run even the most graphic intensive Windows programs and the most powerful cross platform Windows development tools side by side without compromise. Use Internet Explorer, Windows Media Player, Access, OneNote and other applications not available on the Mac. If youre new to Mac, keep the familiar Windows experience on your Mac. If you love the Mac OS interface, make Windows invisible. Either way, run Windows and Mac applications side by side without compromising performance. Parallels Desktop 9 even brings Mac OS X features like Launchpad and Dictation to Windows apps and is compatible with OS X Mavericks(10.9), OS X Mountain Lion (10.8.4), OS X Lion (10.7.5), OS X Lion (10.6.4), and OS X Snow Leopard(10.6.8). In addition to Windows 8, other OSs can also run in Parallels Desktop 9 for Mac, including Windows 7, Windows Vista, Windows XP, Linux, and Google Chrome OS. Sync iCloud, SkyDrive, Dropbox, etc., without unnecessary duplication of files locally. Worried about connecting to your network. Parallels Desktop also provides two modes for flexibility with different networking environments. No wonder Parallels Desktop has been the #1 solution for more than 7 years.","torrent":{"xt":"urn:btih:1090477797d02898cc7bd608d9f2fa185040e850","amp;dn":"Parallels+Desktop+9+for+Mac+v9.0.23046.917896+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1090477797d02898cc7bd608d9f2fa185040e850","infoHashBuffer":{"type":"Buffer","data":[16,144,71,119,151,208,40,152,204,123,214,8,217,242,250,24,80,64,232,80]},"announce":[],"urlList":[]}}