{"title":"Amnesia - The Dark Descent (UB) Mac","uid":5925936,"size":1141174687,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:109560827e2bd191d2213a0770aab23c2f4a9a6d&amp;dn=Amnesia+-+The+Dark+Descent+%28UB%29+Mac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":1,"uploader":"KawMoc","files":-1,"time":1288604583,"description":"Amnesia - The Dark Descent (UB) | Mac Os X | Games | 1.1 GB\n\n--------------------------------\n\nThe last remaining memories fade away into darkness. Your mind is a mess and only a feeling of being hunted remains. You must escape.\nAwake...\nAmnesia: The Dark Descent, a first person survival horror. A game about immersion, discovery and living through a nightmare. An experience that will chill you to the core.\n\nYou stumble through the narrow corridors as the distant cry is heard.\nIt is getting closer.\nExplore...\nAmnesia: The Dark Descent puts you in the shoes of Daniel as he wakes up in a desolate castle, barely remembering anything about his past. Exploring the eerie pathways, you must also take part of Daniel's troubled memories. The horror does not only come from the outside, but from the inside as well. A disturbing odyssey into the dark corners of the human mind awaits.\n\nA sound of dragging feet? Or is your mind playing tricks on you?\n\nExperience...\nBy using a fully physically simulated world, cutting edge 3D graphics and a dynamic sound system, the game pulls no punches when trying to immerse you. Once the game starts, you will be in control from the beginning to the end. There are no cut-scenes or time-jumps, whatever happens will happen to you first hand.\n\nSomething emerges out of the darkness. It's approaching. Fast.\n\nSurvive...\nAmnesia: The Dark Descent throws you headfirst into a dangerous world where danger can lurk behind every corner. Your only means of defense are hiding, running or using your wits.\n\nDo you have what it takes to survive?\n\n--------------------------------\n\nRecommended System Requirements\nMac OS X 10.5 or newer\nProcessor: 2.0Ghz (Universal Binary)\nMemory: 2048MB\nDisc Space: 2Go","torrent":{"xt":"urn:btih:109560827e2bd191d2213a0770aab23c2f4a9a6d","amp;dn":"Amnesia+-+The+Dark+Descent+%28UB%29+Mac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"109560827e2bd191d2213a0770aab23c2f4a9a6d","infoHashBuffer":{"type":"Buffer","data":[16,149,96,130,126,43,209,145,210,33,58,7,112,170,178,60,47,74,154,109]},"announce":[],"urlList":[]}}