{"title":"Need for Speed No Limits v1.5.3 Retail / Mod APK + OBB Data","uid":15878558,"size":3750518723,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:10a99a8941bbc403f2d29f9766ed748a6cc445f7&amp;dn=Need+for+Speed+No+Limits+v1.5.3+Retail+%2F+Mod+APK+%2B+OBB+Data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":36,"uploader":"SadeemPC","files":16,"time":1474562617,"description":"Need for Speed: No Limits v1.5.3\r\n\r\nOverview: Race for dominance in the first white-knuckle edition of Need for Speed made just for mobile – from the developer that brought you Real Racing 3\r\n\r\nBuild your dream ride with an unbelievable range of cars and customizations. Launch yourself between chaos and control as you hit the loud pedal and roll into underground car culture. Win races, up your rep, then kick into more races, more customizations, and more cars. Make your choices and never look back. Tonight we ride!\r\nThis app offers in app purchases. You may disable in app purchases using your device settings.\r\n\r\nCUSTOMIZE EXTREME RIDES\r\nPick up the real-world cars youâ™ve always wanted, from the Subaru BRZ to the BMW M4, McLaren 650s, Porsche 911, and more. Then trick them out with the hottest customization system on mobile, from spots like the Mod Shop and the Black Market, giving you over 2.5 million custom combos to play with. Your rides are waiting – take them to the stages or streets to go head-to-head versus the competition and prove yourself.\r\n\r\nDRIVE FAST – AND FEARLESS \r\nSteer onto the streets of Blackridge, driving reckless and juiced as sparks fly. Accelerate over jumps and around debris, into traffic, against walls, and through high-speed Nitro Zones. Flip on the nitrous and thrust yourself into another level of adrenaline-fueled driving and drifting. Around every corner is a fresh race as you clash with local crews and local cops. Itâ™s a world full of wannabe drivers – can you stay in front and earn respect?\r\n\r\nRACE TO WIN\r\nNever back down as you race anyone crazy enough to take you on, leave them gapped, and increase your rep. Dig, drift, drag, and roll your ride to wins with police on your tail, hitting each inch of the map hard by the time you reach the big end. Burn rubber in over 1,000 challenging races – and thatâ™s just the starting line. Be notorious, own the streets, and score the worldâ™s best cars. Because one ride is never enough!\r\n\r\nWhat's New ?\r\nJDM tuner cars join the roster of iconic Need For Speed No Limits vehicles.\r\n• Bring your driving and tuning skills to win the 2002 Nissan Silvia Spec R and the 2001 Mitsubishi Lancer Evolution Vi in two new Fastlane Events\r\n• Earn blueprints for the LaFerrari when you use each of your Fastlane cars to take on two all-new Blackridge Spirit Events\r\nFor Rep Level 60 Players and above, use your fastest car to take on other players with the exclusive Blackridge Rivals Pre-season event.\r\n\r\nHacks:\r\nUnlimited Nitro\r\nNo Damage Cars\r\n\r\nHomepage \nhttps://play.google.com/store/apps/details?id=com.ea.game.nfs14_row\r\n\r\nRequirements: 4.0.3+","torrent":{"xt":"urn:btih:10a99a8941bbc403f2d29f9766ed748a6cc445f7","amp;dn":"Need+for+Speed+No+Limits+v1.5.3+Retail+%2F+Mod+APK+%2B+OBB+Data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10a99a8941bbc403f2d29f9766ed748a6cc445f7","infoHashBuffer":{"type":"Buffer","data":[16,169,154,137,65,187,196,3,242,210,159,151,102,237,116,138,108,196,69,247]},"announce":[],"urlList":[]}}