{"title":"Hadrians Wall-The North-West Frontier of Rome (History).pdf","uid":15930473,"size":42898974,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10ae9088beb3ef0bb4598231ce20cf5e009e3354&amp;dn=Hadrians+Wall-The+North-West+Frontier+of+Rome+%28History%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":3,"uploader":"STBGD","files":1,"time":1475356880,"description":"Hadrian's Wall: The North-West Frontier of Rome\r\nBarnes &amp; Noble Books | 1995 | ISBN: 1566197570 | English | 280 pages | PDF | 41 MB\r\n\r\nHadrian's Wall is the most important surviving memorial to the military power of Rome. In the brilliance of its original concept, in the monumental character of its construction, it is altogether superior to the defended frontiers of Germany, of the Drobruja, and of North Africa. France might profitably have studied it in the planning of the ill-fated Maginot Line. David Divine's historical outline of the wall is concise, clear, and readable. But it is also a history of the Roman occupation of Britain through four centuries of its existence. Examining the wall as a military critic, he attacks tradition vigorously. It is his premise that the wall was a military triumph but a political disaster. The failure to pacify the Caledones produced a military situation that compelled the establishment of a strongly defended frontier. The maintenance of that frontier, with its garrison, upset the economic balance of the province. The very excellence of the wall itself ensured prolonged periods of idleness in its garrison. Mr. Divine's book is an impressive study of a province militarily uncertain, politically unstable, and economically unviable. It is a provocative assault on traditional beliefs, and it provides not only detailed and invaluable information on the wall itself but new insight into the Roman achievement","torrent":{"xt":"urn:btih:10ae9088beb3ef0bb4598231ce20cf5e009e3354","amp;dn":"Hadrians+Wall-The+North-West+Frontier+of+Rome+%28History%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10ae9088beb3ef0bb4598231ce20cf5e009e3354","infoHashBuffer":{"type":"Buffer","data":[16,174,144,136,190,179,239,11,180,89,130,49,206,32,207,94,0,158,51,84]},"announce":[],"urlList":[]}}