{"title":"The Loom of God: Tapestries of Mathematics and Mysticism","uid":16044804,"size":9588918,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10f9790e4c72103d452e73d37f32d0cb0a7bb136&amp;dn=The+Loom+of+God%3A+Tapestries+of+Mathematics+and+Mysticism&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":3,"uploader":"marty14","files":1,"time":1476552885,"description":"The Loom of God: Tapestries of Mathematics and Mysticism - Clifford A. Pickover [epub]\r\n\r\nFrom the mysterious cult of Pythagoras, to the awesome mechanics of Stonehenge, to the fearsome &quot;gargoyles&quot; and glorious fractals created on the computer screens of today, Pickover evokes the power of numbers and their connection with the search for the ultimate meaning of the universe. We learn that individuals through the ages have conjured numbers to predict the end of the world, to raise the dead, to find love, and to sway the outcome of wars.\r\n\r\nEven today, Pickover shows, serious mathematicians sometimes resort to mystical or religious reasoning when trying to convey the power of mathematics. Together we uncover mathematics in the most exquisite forms of nature - from the delicate shape of a spider web, to the curling spiral of a shell. We discover fractals in the branching patterns of blood vessels, plants, and mountain roots. And we grasp the power of a few simple concepts - including the gravitational constant and the speed of light - that control the destiny of the universe. Prepare yourself for a strange and often amusing journey.\r\n\r\nLet The Loom of God unlock the doors of your imagination through thought-provoking mysteries, puzzles, and problems on topics ranging from ancient Greek astronomy to Armageddon. A playground for computer hobbyists, an inspiring tome for science fiction aficionados, and an adventurous education for the curious in theology, astronomy, mathematics, and history, this book delivers a world of paradox and mystery. The Loom of God promises a creative, enticing, and unforgettable excursion along the vast tapestry, woven through history, of mathematics and the divine","torrent":{"xt":"urn:btih:10f9790e4c72103d452e73d37f32d0cb0a7bb136","amp;dn":"The+Loom+of+God%3A+Tapestries+of+Mathematics+and+Mysticism","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10f9790e4c72103d452e73d37f32d0cb0a7bb136","infoHashBuffer":{"type":"Buffer","data":[16,249,121,14,76,114,16,61,69,46,115,211,127,50,208,203,10,123,177,54]},"announce":[],"urlList":[]}}