{"title":"Bobby Brown Greatest Hits 320cbr (Big Papi) R&amp;B","uid":9481515,"size":153030556,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1213a7e1b95424060a4ac8ff8984d51dfb74f20f&amp;dn=Bobby+Brown+Greatest+Hits+320cbr+%28Big+Papi%29+R%26amp%3BB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":14,"uploader":"Big-Papi","files":-1,"time":1389807945,"description":"Source: 2000 CD\n\nHe's a prick but a talented prick - Big Papi\n\n\n\nBy D. Mok\n\nMost of Bobby Brown's catalogue is now in the bargain bin, so I would suggest getting the Don't Be Cruel and Bobby albums.\n\nWhile not a first-rate singer, Brown's talent came in his complete abandon when in the role of lead singer, or dancer, or rapper. With an LL Cool J-like confidence Brown uses his distinctive but limited voice to carry some of the best R&amp;B tunes of his time: &quot;Don't Be Cruel&quot;, &quot;Roni&quot;, &quot;My Prerogative&quot; and his best song, &quot;Every Little Step&quot;, with its brilliant groove and intoxicating keyboard sound. I can also think back to his music videos, which showcased his ferocious, streetsmart dance and choreography, and &quot;Every Little Step&quot; ranks with Michael Jackson's &quot;Smooth Criminal&quot; and Janet Jackson's &quot;Miss You Much&quot; as dance-video classics.\n\nThough Teddy Riley got the credit for New Jack Swing, L.A. Reid and Babyface were not to be discredited for Don't Be Cruel: Listening to their terrific songwriting and arrangements from this album made me forget Babyface's more recent, formulaic efforts. Even their work on the Bobby album had its merits, such as the twistily sexy yet sardonic melody on the verse of &quot;Humpin' Around&quot;.\n\nBut though this collection rounds up many of Brown's most popular titles, it commits the sin of collecting the singles mixes rather than the far superior album versions. &quot;On Our Own&quot; in its longer version on the Ghostbusters II soundtrack was much better, &quot;Don't Be Cruel&quot; is missing the haunting vocal chants (which were called &quot;Cruel Prelude&quot; on the original album and also woven into the last parts of the album track), and the wonderful second verse of &quot;Every Little Step&quot; is omitted in this single version.\n\nNow, don't get me wrong, the tunes still sound terrific. But I definitely wouldn't call these definitive, or even representative, versions of Brown's songs.","torrent":{"xt":"urn:btih:1213a7e1b95424060a4ac8ff8984d51dfb74f20f","amp;dn":"Bobby+Brown+Greatest+Hits+320cbr+%28Big+Papi%29+R%26amp%3BB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1213a7e1b95424060a4ac8ff8984d51dfb74f20f","infoHashBuffer":{"type":"Buffer","data":[18,19,167,225,185,84,36,6,10,74,200,255,137,132,213,29,251,116,242,15]},"announce":[],"urlList":[]}}