{"title":"Allegorithmic Substance Designer 5.0.3","uid":11806521,"size":232098852,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:12fe327ddc4e6442e4d5d4f3fb02e0255fae1fc5&amp;dn=Allegorithmic+Substance+Designer+5.0.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":2,"uploader":"jxoesneon","files":2,"time":1428614394,"description":"Substance Designer 5 is a node based texturing tool. Tired of messy layers ? Fit everything you need in a few compact and handy nodes. Let Substance connect all the channels for you and focus on what really matters: your art.\n\nNon-linear workflow\n\nMake any change you want at any time, as it automatically applies to all the outputs of your substance. Create and edit complete texture sets in a much faster way than with traditional tools!\n\nNon Destructive\n\nRevert all the actions you are making without losing any of your work. No more &quot;I can't come back to that point&quot;!\n\n\n\n\n\nPlease Note:\n\nSaying thanks is always good manners.\n\nIf you need help installing leave a post.\n\nOther members are welcome to leave posts to help others.\n\nI do requests so just PM me, but be patient.\n\nIf no help is forthcoming then PM me.\n\nAll torrents are now mirrored on Demonoid and Kickass\n\nTorrents not registered on main search: If you download regularly from me and wish to keep up to date with my uploads then adding a RSS feed to your browser will be the fastest way... Add from here: http://www.demonoid.ph/rss/users/cadmanowl.xml or here:... Copy and paste link if the redirect on this url does not work. Alternatively copy and paste this link and bookmark for a full list: http://www.demonoid.ph/files/?uid=7677992&amp;seeded=2 or here:\n\nUploaded Torrents: All programs are checked for viruses. Some virus scanners using a HEURISTIC SCAN will report FALSE/POSITIVES on some of the fixes, most scanners will declare keygens and patchers as trojans this is due to how those files work, always scan the files yourself. If you are unsure do not use, if you are unsure but wish to try use a sandbox to test or install into a virtual machine first. All files are checked on my system by the latest versions of Comodo Firewall, NOD32 AV, and McAfee Stinger. An online scanner is available here... http://www.virustotal.com/\n\nSeed Requests: All seed requests will be met where possible after 10 days of no seeder activity by other downloaders, after all i cannot re-seed everything with so many torrents. So members who download the torrents please try to seed inactive torrents that you have downloaded, remember it may be you next time who are waiting for seeds.\n\nMissing Torrents: Please PM me if any torrent that has been deleted through reporting it as infected, and i will see what I can do to resolve the problem.\n\nCompression and Image programs to use with the files I upload are here: http://www.demonoid.ph/files/details/2997171/7677992/\nUpdate 1 here: http://www.demonoid.ph/files/details/3031816/46067952/ and here:\n\nnfo files sometimes contain information I use Notepad++ which can be downloaded here: http://notepad-plus-plus.org/download/\n\nFor more information visit the homepage: https://www.allegorithmic.com/products/substance-designer","torrent":{"xt":"urn:btih:12fe327ddc4e6442e4d5d4f3fb02e0255fae1fc5","amp;dn":"Allegorithmic+Substance+Designer+5.0.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12fe327ddc4e6442e4d5d4f3fb02e0255fae1fc5","infoHashBuffer":{"type":"Buffer","data":[18,254,50,125,220,78,100,66,228,213,212,243,251,2,224,37,95,174,31,197]},"announce":[],"urlList":[]}}