{"title":"Messages from the Sea: Letters and Notes from a Lost Era Found","uid":15876982,"size":1646992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:137628997ad78884307483633408ee87312eddb5&amp;dn=Messages+from+the+Sea%3A+Letters+and+Notes+from+a+Lost+Era+Found&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":5,"uploader":"Dr.Soc","files":2,"time":1474529460,"description":"Messages from the Sea: Letters and Notes from a Lost Era Found in Bottles and on Beaches Around the World by Paul Brown\r\nPaperback: 200 pages\r\nPublisher: Superelastic (August 31, 2016)\r\nLanguage: English\r\nISBN-10: 0995541213\r\nISBN-13: 978-0995541214\r\nFormat: azw3, ePub\r\n\r\nMessages from the Sea is a collection of letters and notes found washed ashore on beaches and bobbing in water, in corked bottles and wax-sealed boxes, carved onto wreckage and in the bellies of sharks. They tell of foundering ships, missing ocean liners and shipwrecked sailors, and contain moving farewells, romantic declarations and intriguing confessions. Some solve the mysteries of lost vessels and crews, while others create new mysteries yet to be solved. Dating from a lost era of seafaring, they demonstrate the brave, lonely and fragile nature of life on the ocean waves. \r\n\r\nIncluded among these 100 messages are: a clue to the fate of the missing White Star liner Naronic; a murder confession found in a bottle off the White Cliffs of Dover; an update from John Franklin's lost Arctic expedition; a poem about a newborn baby found inside an 11ft shark; an unlikely apology from fleeing fraudster Violet Charlesworth; evidence for the unnecessary loss of the steamship London with 220 souls; the truth behind the mysterious grave robbery of the Earl of Crawford; and a message from the deck of the sinking Titanic","torrent":{"xt":"urn:btih:137628997ad78884307483633408ee87312eddb5","amp;dn":"Messages+from+the+Sea%3A+Letters+and+Notes+from+a+Lost+Era+Found","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"137628997ad78884307483633408ee87312eddb5","infoHashBuffer":{"type":"Buffer","data":[19,118,40,153,122,215,136,132,48,116,131,99,52,8,238,135,49,46,221,181]},"announce":[],"urlList":[]}}