{"title":"Forensics For Dummies - Douglas P. Lyle","uid":11897559,"size":5209997,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13c59ba459afc8c0102649cad16e8c687952ff35&amp;dn=Forensics+For+Dummies+-+Douglas+P.+Lyle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1431207936,"description":"A plain-English primer on crime scene investigation that's a must for fans of CSI or Patricia Cornwell\n\nSince the O. J. Simpson case, popular interest in forensic science has exploded: CBS's CSI has 16 to 26 million viewers every week, and Patricia Cornwell's novels featuring a medical examiner sleuth routinely top bestseller lists, to cite just a few examples. Now, everyone can get the lowdown on the science behind crime scene investigations. Using lots of fascinating case studies, forensics expert Dr. D. P. Lyle clues people in on everything from determining cause and time of death to fingerprints, fibers, blood, ballistics, forensic computing, and forensic psychology. With its clear, entertaining explanations of forensic procedures and techniques, this book will be an indispensable reference for mystery fans and true crime aficionados everywhere-and even includes advice for people interested in forensic science careers.\n\nD. P. Lyle, MD (Laguna Hills, CA), is a practicing cardiologist who is also a forensics expert and mystery writer. He runs a Web site that answers writers' questions about forensics, dplylemd.com, and is the author of Murder and Mayhem: A Doctor Answers Medical and Forensic Questions for Writers, as well as several mystery novels. John Pless, MD, is Professor Emeritus of Pathology at Indiana University School of Medicine and former President of the National Association of Medical Examiners","torrent":{"xt":"urn:btih:13c59ba459afc8c0102649cad16e8c687952ff35","amp;dn":"Forensics+For+Dummies+-+Douglas+P.+Lyle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13c59ba459afc8c0102649cad16e8c687952ff35","infoHashBuffer":{"type":"Buffer","data":[19,197,155,164,89,175,200,192,16,38,73,202,209,110,140,104,121,82,255,53]},"announce":[],"urlList":[]}}