{"title":"Lonely Planet China, 14 edition (Travel Guide)","uid":12032668,"size":144639446,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14087621f7f8a4286075b276799bb48271d35313&amp;dn=Lonely+Planet+China%2C+14+edition+%28Travel+Guide%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":0,"uploader":"MyeBookShelf","files":2,"time":1434640906,"description":"Lonely Planet China, 14 edition (Travel Guide) &lt;a href=&quot;\nhttp://s24.postimg.org/uojhlxss1/Lonely_Planet_China_14_edition_Travel_Guide.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s24.postimg.org/uojhlxss1/Lonely_Planet_China_14_edition_Travel_Guide.jpg&lt;/a&gt;\nEnglish | 2015 | ISBN: 1743214014 | 1056 Pages | EPUB | 137 MB\n\nLonely Planet: The world's leading travel guide publisher\nLonely Planet China is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Get lost in the dynastic grandeur of Beijing's Forbidden City, hike along the Great Wall, or take in Shanghai's neon lights from the Bund; all with your trusted travel companion. Get to the heart of China and begin your journey now!\nInside Lonely Planet China Travel Guide:\nColour maps and images throughout\nHighlights and itineraries help you tailor your trip to your personal needs and interests\nInsider tips to save time and money and get around like a local, avoiding crowds and trouble spots\nEssential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\nHonest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\nCultural insights give you a richer, more rewarding travel experience - including customs, history, art, religion, cinema, calligraphy, architecture, martial arts, landscapes, cuisine, and more\nFree, convenient pull-out Beijing map (included in print version)\nOver 190 maps\nCovers Beijing, Tianjin, Shandong, Shanghai, Fujian, Jiangsu, Liaoning, Zhejiang, Jilin, Shanxi, Anhui, Jiangxi, Hunan, Hong Kong, Macau, Guangdong, Hainan, Sichuan, Xinjiang, Inner Mongolia, Tibet and more\nThe Perfect Choice: Lonely Planet China, our most comprehensive guide to China, is perfect for both exploring top sights and taking roads less travelled.\nLooking for a guide focused on Beijing, Shanghai or Hong Kong? Check out Lonely Planet's Beijing guide, Shanghai guide or Hong Kong guide for a comprehensive look at all these cities have to offer; Discover China, a photo-rich guide to the country's most popular attractions; or Pocket Hong Kong, Pocket Beijing or Pocket Shanghai, handy-sized guides focused on the can't-miss sights for quick trips.\nAuthors: Written and researched by Lonely Planet, Chung Wah Chow, Megan Eaves, David Eimer, Tienlon Ho, Robert Kelly, Shawn Low, Emily Matchar, Bradley Mayhew, Daniel McCrohan, Dai Min and Phillip Tang.\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:14087621f7f8a4286075b276799bb48271d35313","amp;dn":"Lonely+Planet+China%2C+14+edition+%28Travel+Guide%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14087621f7f8a4286075b276799bb48271d35313","infoHashBuffer":{"type":"Buffer","data":[20,8,118,33,247,248,164,40,96,117,178,118,121,155,180,130,113,211,83,19]},"announce":[],"urlList":[]}}