{"title":"Udemy - Conquer Your Depression With The Power of Yoga ABEE","uid":11973113,"size":9810662367,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:15223539d7ac94d3add221fe352044cc0c6e9299&amp;dn=Udemy+-+Conquer+Your+Depression+With+The+Power+of+Yoga+ABEE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":8,"uploader":"The_Abee","files":45,"time":1432911366,"description":"Udemy - Conquer Your Depression With The Power of Yoga and Meditation ABEE\n &lt;a href=&quot;\nhttps://blog.udemy.com/wp-content/uploads/2014/03/bigstock-Young-Woman-doing-Yoga-Exercis-61750937-620x504.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://blog.udemy.com/wp-content/uploads/2014/03/bigstock-Young-Woman-doing-Yoga-Exercis-61750937-620x504.jpg&lt;/a&gt;\n\nReduce Your Depression With The Power of Yoga and Meditation\n\nLearn how to free yourself from anxiety and depression using the power of yoga and meditation.\n\nLectures: 45\nVideo: 11 Hours\nSkill level: all level\nLanguages: English\n\nInstructed by Teagan Fea \nHealth and Fitness / Yoga\n\nCourse description\n\n&quot;As a therapist for twenty years, I have reviewed many publications, classes, books etc. to help clients. This class is the most thorough combination of helpful strategies I have ever seen! Absolutely wonderful and a very positive way to help with emotional issues as well as depression.\n\nDon't let the yoga aspect keep you from taking this class. Although a valuable component, it doesn't have to be used to still make this class one of the most powerful emotional programs I have ever seen.&quot; Dr. Joyce Stone\n\nWelcome to Your Future, A Life Without of Depression.\n\nYou are standing on the precipice of change, a major breakthrough in your life. You just need to let go of what is preventing you from feeling good enough, loveable enough, skilled enough or attractive enough.\n\nI know with all of my heart that you can be free of these feelings. You can be happy and you can fall in love with yourself and you can be loved fully by another.\n\nYou just need the right keys and the right guide to help you to let go.\n\n\nHow This Course Is Structured:\n\n- This is a 7-module program that focuses on 7 key topics proven to heal depression.\n- Each of the topics includes a meditation and a yoga practice.\n- Each key includes valuable information and practices from either Yoga Therapy, Cognitive Behavioral Therapy, Somatic Psychotherapy, Spiritual Integration Therapy and experts in Diet and Nutrition.\n- Whilst studying and deepening your understanding about your depression, you will progress through a series of structured yoga and meditation practices to help you to rewire your brain.\n\nWhat Are the Requirements To Guarantee Your Success?\n\n- Have a genuine desire to want to wake up feeling good about who you are.\n- Be committed to working with a daily practice of Yoga and Meditation.\n- Be open to the idea that you can overcome depression and that feeling peaceful and joyous is possible.\n\nWhat Will I Get Out of This Program?\n\n- 34 Recorded Lectures, PDF transcripts, 6-audio recorded meditations, 3-video recorded yoga classes. (10.5 hours of content valued at $1,080.00)\n- Learn how to reduce your symptoms of depression and increase your feelings of well being.\n- Learn why your mind is making you feel depressed and how to change it to feel positive, relaxed and at peace.\n- Understand why your brain has become biologically wired to support your depression and how you can rewire it to support positive thoughts and feelings.\n- Learn what your common thinking errors are and how to change them.\n- Learn powerful tools and practices that generate positive thinking and feeling pathways in the brain.\n- Learn 3 therapeutic breathing techniques that will calm and relax your mind, body and emotions after only 5 minutes of practice.\n- Listen to a guided relaxation that teaches you how to release tension and stress in the body naturally without the use of drugs.\n- Learn easy techniques that harmonize your feelings and change your perspective about yourself. Finally, love who you are!\n- Work with a powerful tool that changes your negative feelings/emotions to positive feelings/emotions.\n- Say goodbye to the 'inner critic', the critical voice in your head.\n- Implement a diet and exercise plan to help you to release endorphins, the 'feel good' hormones\n- Take away gentle daily yoga and meditation practices designed by a Yoga Therapist (with 15 years experience) to heal your experience of depression.\n- Focus on moving forward as opposed to thinking about the past.\n- Receive guidance on how to connect with your inner peaceful essence.\n- Learn how to release your depression naturally without medication.\n- Work with techniques that focus on you developing love for yourself.\n- Have the support of a twice qualified yoga teacher and counselor with over 15 years experience specializing in mental health\n\n\nSee a tiny collection of my torrents. And, find your favorite books there.  ;)\n_____________________________________\n                                                                                                                                                                                            &lt;a href=&quot;\nhttp://thepiratebay.mn/user/The_Abee/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.mn/user/The_Abee/&lt;/a&gt;","torrent":{"xt":"urn:btih:15223539d7ac94d3add221fe352044cc0c6e9299","amp;dn":"Udemy+-+Conquer+Your+Depression+With+The+Power+of+Yoga+ABEE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15223539d7ac94d3add221fe352044cc0c6e9299","infoHashBuffer":{"type":"Buffer","data":[21,34,53,57,215,172,148,211,173,210,33,254,53,32,68,204,12,110,146,153]},"announce":[],"urlList":[]}}