{"title":"Anthony Ryan - The Waking Fire (The Draconis Memoria #1)","uid":15250388,"size":680125952,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1523c109ce2ddb5c92982752f079daa3024a4244&amp;dn=Anthony+Ryan+-+The+Waking+Fire+%28The+Draconis+Memoria+%231%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":0,"uploader":"Cybotage","files":51,"time":1468042447,"description":"Throughout the vast lands controlled by the Ironship Trading Syndicate, nothing is more prized than the blood of drakes. Harvested from captive or hunted Reds, Greens, Blues, and Blacks, it can be distilled into elixirs that bestow fearsome powers on the rare men and women known as the Blood-blessed.\r\n\r\nBut not many know the truth: that the lines of drakes are weakening. If they fail, war with the neighboring Corvantine Empire will follow swiftly. The Syndicate's last hope resides in whispers of the existence of another breed of drake, far more powerful than the rest, and the few who have been chosen by fate to seek it.\r\n\r\nClaydon Torcreek is a petty thief and an unregistered Blood-blessed who finds himself pressed into service by the Protectorate and sent to wild, uncharted lands in search of a creature he believes is little more than legend. Lizanne Lethridge is a formidable spy and assassin facing gravest danger on an espionage mission deep into the heart of enemy territory. And Corrick Hilemore is the second lieutenant of an Ironship cruiser whose pursuit of ruthless brigands leads him to a far greater threat at the edge of the world.\r\n\r\nAs lives and empires clash and intertwine, as the unknown and the known collide, all three must fight to turn the tide of a coming war - or drown in its wake.\r\n\r\nRead by Steven Brand\r\nFormat: MP3","torrent":{"xt":"urn:btih:1523c109ce2ddb5c92982752f079daa3024a4244","amp;dn":"Anthony+Ryan+-+The+Waking+Fire+%28The+Draconis+Memoria+%231%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1523c109ce2ddb5c92982752f079daa3024a4244","infoHashBuffer":{"type":"Buffer","data":[21,35,193,9,206,45,219,92,146,152,39,82,240,121,218,163,2,74,66,68]},"announce":[],"urlList":[]}}