{"title":"Comic Life 2.2.7 Windows (crack) [ChingLiu]","uid":9017823,"size":88336451,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:156e05a542233934c765b64187d3ee18ed17e92d&amp;dn=Comic+Life+2.2.7+Windows+%28crack%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"Ching_Liu","files":-1,"time":1381224710,"description":"FEATURES\n\nMaking comics is fun for everyone, and Comic Life's feature-set makes it super-simple. The easy-to-use interface integrates seamlessly with your photo collection or webcam. \nDrop in some photos, add some bendy lettering, captions and speech balloons and you are well on your way to impressing your friends and family!\n\n- So easy, you and your toddler can do it!\n- Full template support\n- Advanced balloon and text control\n- Predefined and freeform shapes\n- Image Filtering for your photos\n- Built-in Photos and Explorer image browser\n- Library of pre-made layouts, styles and fonts\n- Camera capture\n- Bendable comic lettering text\n- Export your comic out as an image, PDF,CBZ, or ePub\n\nThe restyled user interface not only makes creating comics even easier it also provides access to more advanced tools as well. For example, the new gradient designer lets you create complex linear and radial gradients for the perfect lettering effect. The new format bar gives quick access to all the common style options including font and color pickers.\n\nFull template support - Including panels, titles and captions along with complementary styles for a professional look. You can create your own templates with all your favorite font and style choices. Image filtering\n\nImage filtering - Enhance the look of your photos and lift the look of your comic project with the many included filters like hand-drawn, painted and night vision.\n\nSmart shapes - let you add common shapes to your comic and the free form shape drawing lets you create any shape or line you can imagine. Closed shapes can be converted to panels.\n\nAdvanced balloon controls - let you precisely curve balloon tails to fit around your content. Text layout has been rebuilt to precisely flow your text within balloons and captions even when they are clipped against a panel for the perfect comic-style effect. Built-in Finder image browser\n\nBuilt-in Photo image browser - and Built-in Explorer image browser makes it super easy to find your images without needing to leave Comic Life to track down the images you want. Great for children and beginners of all ages.\n\nNew Features\n\n* Introduces full template support.- Meaning you get a great head start on your projects!\n* Spell checker support.- Make sure those tricky words are spelled correctly with the intergrated spell checker!\n* PDF exports- Now you can easily export to the popular PDF format!\n* Advanced balloon control.- Raises your comics to the next level\n* Advanced text flow - for precision layout\n* Predefined and freeform shapes - for more creative expression\n* Enhanced user interface that preserves ease of use - while providing quick access to more advanced features\n* More comic fonts and panel layouts are included - for more customization and fun\n* Improved page numbering system - for easy placement and defining starting number\n\nSystem Requirements\n\n- Windows XP (SP3), Windows 7 (SP1) or Windows 8 (latest patches)\n- 1.5GHz processor; 2.0 GHz recommended\n- 1GB RAM; 2GB RAM recommended\n- 200 MB of available disk space\n- Minimum 1024x768 display; 1280x1024 recommended\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://plasq.com/products/comiclife2/win&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://plasq.com/products/comiclife2/win&lt;/a&gt;","torrent":{"xt":"urn:btih:156e05a542233934c765b64187d3ee18ed17e92d","amp;dn":"Comic+Life+2.2.7+Windows+%28crack%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"156e05a542233934c765b64187d3ee18ed17e92d","infoHashBuffer":{"type":"Buffer","data":[21,110,5,165,66,35,57,52,199,101,182,65,135,211,238,24,237,23,233,45]},"announce":[],"urlList":[]}}