{"title":"Caro Emerald - Deleted Scenes From The Cutting Room Floor [SKWLK","uid":5317320,"size":132704493,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:15b455fdbc3189841d7d8189dba24d24ab497d38&amp;dn=Caro+Emerald+-+Deleted+Scenes+From+The+Cutting+Room+Floor+%5BSKWLK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":3,"uploader":"SKWLKR","files":16,"time":1264760873,"description":"In 2007 werd Caro gebeld door producers David Schreurs en Jan van Wieringen. Zij hadden met Vince Degiorgio (o.a. N Sync, Atomic Kitten) een liedje geschreven voor een Japanse act, of Caro de demo in kon zingen. Hoewel het iedereen gelijk opviel hoe goed het liedje bij Caro's stem paste belandde &quot;Back It Up&quot; op de plank bij een aantal muziek uitgevers.\n\nEen jaar later kreeg Caro de kans om het liedje live te zingen op AT5. Het sloeg direct aan: kijkers bleven maar bellen en mailen, wie die zangeres met dat leuke liedje was. Caro maakte een videoclipje met een vriendin , die AT5 uit kon zenden. De clip belandde ook opmet hetzelfde effect: alleen maar positieve reacties. Radiostations in allerlei landen zetten het liedje spontaan op de playlist, en een US productiemaatschappij vroeg of ze het liedje mochten gebruiken in de film &quot;Dare&quot;.\n\nMaar met slechts ÃƒÂ©ÃƒÂ©n liedje op het repertoire leek het Caro en haar team beter om eerst een album te maken. GeÃƒÂ¯nspireerd door films en muziek uit de jaren '40-'50 gingen zij aan de slag met nieuwe ideeÃƒÂ«n. In november 2008 vertrok ÃƒÂ©ÃƒÂ©n van de producers naar Toronto om weer te schrijven met Vince, en kwam terug met 7 nieuwe liedjes en een duidelijke richting voor het album. Begin 2009 kwam Vince naar Amsterdam om het album af te maken. Het resultaat: een ongelofelijk sfeervol en toegankelijke plaat vol ballroom jazz, filmische tango's, groovende jazz en aanstekelijke mambo's, die klinken alsof ze in 1951 zijn opgenomen in Hollywood's befaamde scoring studio's.\n\n\nTracklist\n\n1. That Man\n2. Just One Dance\n3. Riviera Life\n4. Back It Up\n5. The Other Woman\n6. Absolutely Me\n7. You Don't Love Me\n8. Dr. Wanna Do\n9. Stuck\n10. I Know That He's Mine\n11. A Night Like This\n12. The Lipstick On His Collar","torrent":{"xt":"urn:btih:15b455fdbc3189841d7d8189dba24d24ab497d38","amp;dn":"Caro+Emerald+-+Deleted+Scenes+From+The+Cutting+Room+Floor+%5BSKWLK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15b455fdbc3189841d7d8189dba24d24ab497d38","infoHashBuffer":{"type":"Buffer","data":[21,180,85,253,188,49,137,132,29,125,129,137,219,162,77,36,171,73,125,56]},"announce":[],"urlList":[]}}