{"title":"Harold Melvin &amp; The Blue Notes - The Ultimate Blue Notes","uid":5397859,"size":184808253,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:15c7a21842cf3ada8623475a5b7cf8f3ed2d95cd&amp;dn=Harold+Melvin+%26+The+Blue+Notes+-+The+Ultimate+Blue+Notes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":3,"uploader":"neon","files":-1,"time":1267301089,"description":"Harold Melvin was one of the driving forces behind Philadelphia soul, leading his group the Blue Notes to the top of the charts during their stint on Kenny Gamble and Leon Huff's Philadelphia International label. Despite Melvin's billing out front, the Blue Notes' focal point was lead singer and onetime drummer Teddy Pendergrass, whose surging baritone graced the Blue Notes' recordings during their glory years of 1972-1975 and gave them a truly distinctive sound. Their output ranged from sweeping, extended proto-disco dance tracks to silky, smoldering ballads, all wrapped up in Gamble and Huff's lushly orchestrated production. When Pendergrass left for a solo career, Melvin &amp; the Blue Notes' commercial fortunes largely reverted to the pre-Pendergrass days (of which there were quite a few), although they did continue to record for a time. They never really disbanded, and by the time Melvin passed away in 1997, he'd been leading the Blue Notes for over four decades.\n\nMelvin was born June 25, 1939, in Philadelphia. A self-taught pianist, he began singing doo wop as a teenager with a group called the Charlemagnes, and put together the very first edition of the Blue Notes in 1954. The original lineup was a quintet featuring Melvin as the lead singer (for a time), songwriter, arranger, and choreographer; ironically, he would mostly relinquish those duties by the time the group achieved its greatest success. The Blue Notes cut their first single, &quot;If You Love Me,&quot; for Josie in 1956, and scored R&amp;B chart hits in 1960 with &quot;My Hero&quot; and again in 1965 with &quot;Get Out (And Let Me Cry).&quot; Numerous personnel shifts kept the group in flux despite steady recording activity, and Melvin kept assembling new versions of the Blue Notes. During the late '60s, the group toured often with the Cadillacs, whose young drummer Teddy Pendergrass would prove to be Melvin's greatest discovery.\n\n\n1. Wake Up Everybody - Harold Melvin &amp; The Blue Notes 7:32\n2. The Love I Lost - Harold Melvin &amp; The Blue Notes 6:23\n3. Bad Luck - Harold Melvin &amp; The Blue Notes 6:23\n4. If You Don't Know Me By Now - Harold Melvin &amp; The Blue Notes 3:25\n5. Yesterday I Had The Blues - Harold Melvin &amp; The Blue Notes 7:32\n6. Don't Leave Me This Way - Harold Melvin &amp; The Blue Notes 6:03\n7. Keep On Lovin' You - Harold Melvin &amp; The Blue Notes 3:40\n8. You Know How To Make Me Feel So Good (featuring Sharon Paige) - 5:16\n9. Hope That We Can Be Together Soon (featuring Sharon Paige) - 3:38\n10. I Miss You (Part I) - 3:14\n11. I'm Weak For You - 3:23\n12. Be For Real - 7:28\n13. Where Are All My Friends - 3:20\n14. Satisfaction Guaranteed (Or Take Your Love Back) - 3:26\n15. Tell The World How I Feel About 'Cha Baby - 5:55","torrent":{"xt":"urn:btih:15c7a21842cf3ada8623475a5b7cf8f3ed2d95cd","amp;dn":"Harold+Melvin+%26+The+Blue+Notes+-+The+Ultimate+Blue+Notes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15c7a21842cf3ada8623475a5b7cf8f3ed2d95cd","infoHashBuffer":{"type":"Buffer","data":[21,199,162,24,66,207,58,218,134,35,71,90,91,124,248,243,237,45,149,205]},"announce":[],"urlList":[]}}