{"title":"The Beatles - Let It Be (1970) WMA320","uid":6243795,"size":91889638,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:162829f5b81a728ca64be293dbd4645b5a55ba46&amp;dn=The+Beatles+-+Let+It+Be+%281970%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":5,"uploader":"MARCELODRGZ","files":-1,"time":1300168202,"description":"For those who don't know the story, the tension and frustration experienced by The Beatles during the &quot;White Album&quot; sessions reached new heights during the GET BACK sessions. In an attempt to bring spirit to the band, Paul was pushing to have The Beatles play live again. Perhaps his thinking was that playing together (as they used to do) would reunite them (as they used to be). Instead, there was much talk of breaking up. It was decided that the group should at least rehearse together while being filmed, but George Harrison actually walked out and quit the group for a few days. Apparently what John said regarding The Beatles at this time was indeed a group reality: &quot;It had become a job.&quot; \n\nExcluding the filming that took place at Twickenham Studios (brought to a close by tension within the band and George's walkout), the GET BACK sessions began on January 22, 1969, and ended just nine days later, all of it taking place at the band's Apple headquarters rather than Abbey Road studios. Although The Beatles behaved a little better when keyboardist Billy Preston was brought in, the sessions did not go well, being mostly jamming--meandering from song to song. As George Martin appropriately pointed out, &quot;they were rudderless at this time.&quot; Martin was not on hand for much of this, and even when he was present, it is unclear how involved he was. Engineer Glyn Johns was asked to compile the album--not George Martin. Though Johns complied, the ill-fated GET BACK was never given the group's stamp of approval and was left unreleased for over a year. \n\nIn January 1970--after the release of the glorious ABBEY ROAD but prior to Phil Spector's involvement--Glyn Johns was given another shot at compiling the album, but this turned out to be another futile attempt to make presentable the sessions that Paul has called &quot;the break-up of The Beatles on film.&quot; \n\nEarly in 1969, Allen Klein became involved with The Beatles; it was agreed (excepting Paul) that he should run the group's finances and business affairs. Klein, who profited from any additional Beatles releases, was the most likely impetus behind the release of LET IT BE and the involvement of Phil Spector, with whom Klein had worked previously. Klein was notorious for bringing in his own people; George Harrison himself recalled that it was in fact Allen Klein who suggested to John and George that they should have Spector listen to the tapes. John and George, being Spector fans, certainly approved of the idea. So unbeknown to Paul or George Martin, Phil Spector was brought in to have a go at it. Martin recalled that it was all very sneaky and done behind people's backs at a time when &quot;Allen Klein was running John.&quot; \n\nSpector produced the LET IT BE album in seven days, beginning on March 23, 1970, and ending April 2. His version involved many edits and an abundance of remixing. The orchestrated overdubs on &quot;Across The Universe,&quot; &quot;The Long And Winding Road,&quot; and &quot;I Me Mine&quot; were done in one session--the arrangements were by Richard Hewson, not Spector. Two songs on LET IT BE did not come from the GET BACK sessions. John's vocal on &quot;Across The Universe,&quot; along with some of the rhythm instruments, came from the original takes recorded in February 1968; and &quot;I Me Mine&quot; was recorded in January 1970, a full year after the project. \n\nOverall, I don't think that the GET BACK sessions were particularly great, nor do I think that they should be trivialized. Although the performances are perhaps not quite representative of what The Beatles were capable of, the songs themselves are strong enough to overcome these less-than-ideal renditions. Spector essentially took the music from the rehearsal-like sessions, dressed it up, and powdered its nose. I never did believe that the orchestra and choir added to &quot;The Long And Winding Road&quot; turned Paul's song into something phony. This great song holds up under Spector's treatment, and I'm glad that Paul finally admitted it wasn't so bad: &quot;I don't think it made it the worst record ever.&quot; \n\nI enjoy Spector's LET IT BE and think it worthy of a five-star rating, probably because I'm such a Beatles fanatic. My gripes, however, are that (1) the recordings of &quot;Get Back&quot; and &quot;Don't Let Me Down&quot; released as the single should have made the album (instead, Spector's mix is solid but inferior on &quot;Get Back,&quot; and he sidestepped &quot;Don't Let Me Down&quot;); and (2) the mix of &quot;Let It Be&quot; that became the single is superior to the one on the album, and I also prefer George's guitar solo on the single. \n\nLET IT BE... NAKED, the latest attempt at presenting the material, does not address the inherent problems with the GET BACK sessions--the reasons that caused them to be rejected in the first place. Instead, this cleaned-up version again exposes a band that was focusing more on problems than on music. Why is LET IT BE thought by many to be the group's weakest effort, and ABBEY ROAD (recorded a few months later) thought by many to be one of the greatest rock albums ever made? I think it is clear that in the case of the latter, (1) the band members put aside their differences to focus on the music; and (2) George Martin was allowed to fully work his magic. \n\nWithout getting into further details and writing pages here, suffice it to say that I will always wish that George Martin had been given a serious shot at producing this album from the beginning. Maybe then we would have had another Beatles masterpiece. \n\nby MurrayTheCat\n\nTRACKLIST:\n\n01 - Two Of Us.wma                                     \n02 - Dig A Pony.wma                                    \n03 - Across The Universe.wma                           \n04 - I Me Mine.wma                                     \n05 - Dig It.wma                                        \n06 - Let It Be.wma                                     \n07 - Maggie Mae.wma                                    \n08 - I've Got A Feeling.wma                            \n09 - One After 909.wma                                 \n10 - The Long And Winding Road.wma                     \n11 - For You Blue.wma                                  \n12 - Get Back.wma      \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFollow Me On Facebook Pages: MarcelodrgzTPB","torrent":{"xt":"urn:btih:162829f5b81a728ca64be293dbd4645b5a55ba46","amp;dn":"The+Beatles+-+Let+It+Be+%281970%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"162829f5b81a728ca64be293dbd4645b5a55ba46","infoHashBuffer":{"type":"Buffer","data":[22,40,41,245,184,26,114,140,166,75,226,147,219,212,100,91,90,85,186,70]},"announce":[],"urlList":[]}}