{"title":"Gay - Sean Cody Group 5 - Scenes 648 to 764","uid":4883559,"size":11750821897,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:178ccc708288209ae36f2b49bd9029506e923fb4&amp;dn=Gay+-+Sean+Cody+Group+5+-+Scenes+648+to+764&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":12,"uploader":"kidlv","files":50,"time":1241483213,"description":"All 50 non solo/oral movies from sc 648 (Berke Gets Fucked) to sc 764 (Jason and Trey - &quot;Behind the Scenes&quot;).\n\nFormat: in .mov format in highest resolution available from the Sean Cody website.\n\nFile Format: Scene # - Name of Person (Orientation position) and Second person (orientation position)\n\nExample: Sean Cody 648 - Berke (&quot;Straight&quot; Bottom) Gets Fucked (Fuller &quot;Straight&quot; Top)\n\nNote: A &quot;Straight&quot; in quotes indicates someone claiming to be straight in their solo movie but has had sex with other men on Sean Cody NUMEROUS times.  If there is no quotes, then he may have only had sex one or a few limited times.  If someone bottoms even once, they are immediately considered to be in quotations.\n\nNote: In the instance of a scene with 3 or more persons, then initials are added to indicate who the person Tops or Bottoms.  Example: Sean Cody 710 - Curtis (&quot;Straight&quot; Versatile), Trey (&quot;Straight&quot; Versatile) and Rylan (Gay Versatile).  In this example, however, all three topped the other two and were bottomed by the other two, thus the term Versatile with no initials.\n\nInfo: For movie information change the movie number at the end of the following link to your desired movie.\nhttp://www.seancody.com/page.php?frame=movie&amp;movie=648\n\nIncludes:\nList is TOO long to include a full file list.  Again 50 movies total, but only includes movies with anal sex, toy play, or &quot;Behind the Scenes&quot;.  Does not include masturbation only or oral only movies.\n\nThis group has movies containing Berke, Fuller, Dakota, Branson, Kipper, Joe, Rylan, Forrest, Cooper, Joey, Barry, Ken, Justin, Billy, Curtis, Todd, Ross, Jake, Gene, Trey, Eric, Ken, Greg, Mitch, Rick, Harley, Shane, Evan, Dave, Jim, Paul, Jesse, Chris, Kurt, Topher, Dan, Randy, and Jason.\n\nOther: I am still working on groups 1-3; still converting files from write protected AVI.  Groups 1-3 will include all PREVIOUS Sean Cody sex videos.  Again, just like in Groups 4 and 5, will not include solos or orals, and again each group will contain 50 videos.  After this installment, there are currently 12 more videos available.  Maybe I'll release Group 6 at 25 videos, instead of waiting for 50...\n\nOther: Group 5 has one exception to my previously stated rules. I included one masturbation only movie, sc 728, as it is actually two twins who masturbate together.  They, unfortunately, do not have sex with each other, but still kept the movie on the list just in case you do have an over active imagination and wanted to imagine them fucking each other (I know I do!!).  Also I have noted a few other exceptions...after making the torrent, I noticed I miss labeled a few &quot;Straight&quot; guys as Straight (No way you are straight if you take it up the ass!!)","torrent":{"xt":"urn:btih:178ccc708288209ae36f2b49bd9029506e923fb4","amp;dn":"Gay+-+Sean+Cody+Group+5+-+Scenes+648+to+764","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"178ccc708288209ae36f2b49bd9029506e923fb4","infoHashBuffer":{"type":"Buffer","data":[23,140,204,112,130,136,32,154,227,111,43,73,189,144,41,80,110,146,63,180]},"announce":[],"urlList":[]}}