{"title":"The Death of Caesar: History's Most Famous Assassination","uid":15816470,"size":20656267,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:17aa43ab74abf85b43315e0c6997c31d0c3e6c93&amp;dn=The+Death+of+Caesar%3A+History%27s+Most+Famous+Assassination&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"marty14","files":1,"time":1473691030,"description":"The Death of Caesar: The Story of History's Most Famous Assassination - Barry Strauss [epub]\r\n\r\nThanks to William Shakespeare, the death of Julius Caesar is the most famous assassination in history. But what actually happened on March 15, 44 BC is even more gripping than Shakespeare’s play. In this thrilling new book, Barry Strauss tells the real story.\r\n\r\nShakespeare shows Caesar’s assassination to be an amateur and idealistic affair. The real killing, however, was a carefully planned paramilitary operation, a generals’ plot, put together by Caesar’s disaffected officers and designed with precision. There were even gladiators on hand to protect the assassins from vengeance by Caesar’s friends. Brutus and Cassius were indeed key players, as Shakespeare has it, but they had the help of a third man—Decimus. He was the mole in Caesar’s entourage, one of Caesar’s leading generals, and a lifelong friend. It was he, not Brutus, who truly betrayed Caesar.\r\n\r\nCaesar’s assassins saw him as a military dictator who wanted to be king. He threatened a permanent change in the Roman way of life and in the power of senators. The assassins rallied support among the common people, but they underestimated Caesar’s soldiers, who flooded Rome. The assassins were vanquished; their beloved Republic became the Roman Empire. \r\n\r\nAn original, fresh perspective on an event that seems well known, Barry Strauss’s book sheds new light on this fascinating, pivotal moment in world history","torrent":{"xt":"urn:btih:17aa43ab74abf85b43315e0c6997c31d0c3e6c93","amp;dn":"The+Death+of+Caesar%3A+History%27s+Most+Famous+Assassination","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17aa43ab74abf85b43315e0c6997c31d0c3e6c93","infoHashBuffer":{"type":"Buffer","data":[23,170,67,171,116,171,248,91,67,49,94,12,105,151,195,29,12,62,108,147]},"announce":[],"urlList":[]}}