{"title":"Orson Scott Card - The Swarm (The Second Formic War #1)","uid":15472541,"size":519055546,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:17f830d99714815914ba35a013fd0111e236b93c&amp;dn=Orson+Scott+Card+-+The+Swarm+%28The+Second+Formic+War+%231%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":0,"uploader":"Laverna","files":2,"time":1470153677,"description":"Orson Scott Card and Aaron Johnston return to their Ender's Game prequel series with this first volume of an all-new trilogy about the Second Formic War in The Swarm.\r\n\r\nThe first invasion of Earth was beaten back by a coalition of corporate and international military forces and the Chinese army. China has been devastated by the Formic's initial efforts to eradicate Earth life forms and prepare the ground for their own settlement. The Scouring of China struck fear into the other nations of the planet; that fear blossomed into drastic action when scientists determined that the single ship that wreaked such damage was merely a scout ship. There is a mothership out beyond the solar system's Kuiper Belt, and it's heading into the system, unstoppable by any weapons that Earth can muster.\r\n\r\nEarth has been reorganized for defense. There is now a Hegemon, a planetary official responsible for keeping all the formerly warring nations in line. There's a Polemarch, responsible for organizing all the military forces of the planet into the new International Fleet. But there is an enemy within, an enemy as old as human warfare: ambition and politics. Greed and self-interest. Will Bingwen, Mazer Rackam, Victor Delgado, and Lem Juke be able to divert those very human enemies in time to create a weapon that can effectively defend humanity in the inexorable Second Formic War?\r\n\r\n\r\n\r\n\r\nRead by Stefan Rudnicki, Vikas Adam, Stephen Hoye, Arthur Morey, Paul Boehmer\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:17f830d99714815914ba35a013fd0111e236b93c","amp;dn":"Orson+Scott+Card+-+The+Swarm+%28The+Second+Formic+War+%231%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17f830d99714815914ba35a013fd0111e236b93c","infoHashBuffer":{"type":"Buffer","data":[23,248,48,217,151,20,129,89,20,186,53,160,19,253,1,17,226,54,185,60]},"announce":[],"urlList":[]}}