{"title":"Steve Jobs - Walter Isaacson 20-CD Set HQ Audio Book","uid":11731388,"size":2463820197,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:191ae7f78a596ee20c44737e585ce2093f7d088f&amp;dn=Steve+Jobs+-+Walter+Isaacson+20-CD+Set+HQ+Audio+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":3,"uploader":"Big-Papi","files":158,"time":1425406455,"description":"This 20 CD set took some time to rip and although most tracks have perfect CRCs there is a track or two without perfect CRCs but spot check shows they play fine. If you are uncertain if a particular track is CRC perfect then look at its MP3 tags to check the AccurateRip data.\n\nAll CD's were ripped using MP3 V0 which is nearly indistinguishable from FLAC (FLAC is perfect lossless reproduction of the sources, such as CD's and vinyl LP's). MP3 V0 provides the highest quality for MP3 rips while also providing the smallest file sizes possible, a fraction of the size of MP3 320kbps but better higher dynamic range.\n\nNow for the book. I have never worshiped Steve Jobs. Corporate leaders are typically giant douche bags. They have to be arrogant and bullies just to keep others in check. But great leaders are gifted with certain character traits and skills. Steve Jobs was certainly charismatic and could lead product teams to new areas of design and function thus achieving things never before tried. Perhaps much of this was done on the backs of others, but without Steve these things may never have surfaced, or at least taken longer to surface.\n\nHowever, this books should not just be viewed as a biography of Steve Jobs. It should be viewed as the history of personal computers and other technology that is commonplace for us today. It provides lessons for business people; lessons for relationships at work whether you are an executive, manager, or team member.\n\nThe book is skillfully read. All you have to do is set aside some time to listen and your world will change if just a little.\n\nBig Papi hopes you enjoy this.\n\n- Big Papi","torrent":{"xt":"urn:btih:191ae7f78a596ee20c44737e585ce2093f7d088f","amp;dn":"Steve+Jobs+-+Walter+Isaacson+20-CD+Set+HQ+Audio+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"191ae7f78a596ee20c44737e585ce2093f7d088f","infoHashBuffer":{"type":"Buffer","data":[25,26,231,247,138,89,110,226,12,68,115,126,88,92,226,9,63,125,8,143]},"announce":[],"urlList":[]}}