{"title":"[FSX] Aerosoft Airbus X [Full installer with crack and serial]","uid":6142884,"size":238144138,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:19aab67a1a36ac319ffe33c1c91607e65b0c48a8&amp;dn=%5BFSX%5D+Aerosoft+Airbus+X+%5BFull+installer+with+crack+and+serial%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":"NvidiaPhysX","files":-1,"time":1296520669,"description":"hello everyone,\n\nThis torrent contains airbus x v1.11(full installer) with cracked ascrypt_pro.dll.\n\nAlso,SERIAL number and subscribed email is supplied with the torrent.\n\nThis is the first aerosoft airbus x on TPB with working FMC and is a fully functional model.\n\n\n\nThe Aerosoft Airbus X is a high definition rendering of this venerable aircraft for FSX. Created with help from many Airbus pilots and Air Berlin it is what Aerosoft believes an airliner in FSX should be.\nDirectly aimed at the user who likes to fly and not to spend too much time on configuration and pre-flight checks but who does not want to compromise on the modelling and features, this aircraft will appeal to a large group of flight simmers.The fully functional Virtual Cockpit puts the user in a fully immersive environment where detailed animations (all with sound effects) and a high level of detailed modelling show the level of details that separate FSX from FS2004.\n\n\n\nAll the displays are detailed and easy to read, even at lower resolutions and show how most A320/A321?s are now leaving the factory. While leaving out the most complex (and least used) functions of the computer systems, the actual operation of the aircraft is highly accurate and as easy and logical as Airbus designs its aircraft. The displays will automatically show you the information you most need at any given moment.\n\nThe Fly-By-Wire flight model is totally reliable and extremely close to the actual aircraft. Where older aircraft use conventional throttles, the Airbus has a realistic FADEC system that means you almost never have to touch the throttle after you started your take-off run.\n\nThe external model is highly detailed and very smooth. All cabin and freight doors can be operated and show the interior of the aircraft. Animation of the flight control surfaces is accurate both in timing and movements.\n\nPlease note that the files of this product will be personalized when they are installed. This personalization allows us to find out who paid for this product, should any of these files ends up in  places where they should not be. This personalization has NO impact on  performance and does NOT include any Digital Right Management. It will  NOT prevent you from installing the product as many times as you wish,  nor will it prevent you from installing on all of the machines you own.\n\nFeatures:\n\nManuals/Documentation: Normal Checklist, PF/PNF Procedure guide, Systems Manual, Normal Procedures Manual. Over 120 pages (available in formats for smart phones and iPad), available in English, French, Spanish, German, Dutch and Russian.\nComing: soon =&gt; Virtual Airlines: There will be a reduced price option for VA pilots of VA?s that have a contract with Aerosoft (contact &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;3d4e484d4d524f497d5c584f524e525b49135e5250&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; for that).\nExtensive animations: sunshades, standby compass, APU door, pullout tables, observer seat, windows, windshield wipers (individual on both sides, two speed), passenger and cargo doors, landing lights, wind milling engines (depending on wind direction and strength), Ground Power Unit (will power the aircraft), traffic cones,  chocks (will act as parking brakes), Custom coded Spoiler/speed brake animation. All animations come with sound effects. Of course all the standard things like gears and flight control surfaces are animated.\nLoad/Save aircraft state module: easy to use module that saves all aircraft settings, includes presets for cold &amp; dark, taxi, takeoff, cruise.\nCompatibility: comes prepared for AES, uses default FSX standards wherever possible to stay compatible with other add-ons and hardware. Note:  throttle is read from DirectX, bypasses FSX completely, to avoid FSX related problems.\nModels / Engines / Liveries:  A320 with IAE and CFM engine,  A321 with IAE and CFM engine, (systems based on IAE standards).  Iberia, Niki, BA, US Airways, Air Berlin, Air France, Alitalia and Lufthansa included, dozens of other paints available shortly after release.\nSounds: High definition (FSX standard) sound set, with additionally over 100 sounds for VC.\nInstallation: Easy installer and no complex DRM schemes or Online installers.\nLighting:  Advanced non standard lighting system (landing lights, taxi way turn off lights, nose wheel taxi light, nose wheel take-off light) that actually light up the scenery around the aircraft.\nFrame rates: Frame rates are comparable to default FSX airbus (that has 1/5th the polygons and almost no detailed systems).\nPaint kit: Available on release, highly advanced.\nExtensibility: Very open in design (all systems in XML etc) and Aerosoft invites people to change and extend this product.\nAirbus X Connect: Stand alone application\nLoad manager: Makes it easy to load passengers, cargo and fuel\nTakeOff datasheet: Calculates Vspeed and FLEX settings\nFlight Following: Use any device with a browser (like Smartphone, iPod etc)  so you can go on with your life as the Airbus cruises.\nSystems:\nAir conditioning: full automatic and manual modes, including 3 separate zones, zone controller, pack controller, pack flow controller, hot air pressure regulator, engine bleed controller, APU bleed controller. Full feedback on ECAM COND and BLEED pages.\nPressurization: full automatic using 6 control modes with cabin pressure controllers, outflow valve actuator, control panel and safety valves. All indications on PRESS and DOORS ECAM.\nAvionics Ventilation: full automated mode using the Avionics Equipment Ventilation Controller (AEVC) with valve indication on ECAM.\nLanding Gear/Brakes: Full manual control, auto brakes, anti-skid, brake fans. Full indications on the main panel, ECAM WHEEL page, ACCU pressure gauge.\nStandby instruments: compass (drops from overhead panel), horizon, DDRMI and clock/timer.\nSeatbelt/ No Smoking: full automated and semi automated modes, including 10.000 feet auto switch.\nECAM: all pages (ENG, BLEED, PRESS, ELEC, HYD, FUEL, APU, COND, DOOR, WHEEL, F/CTL) included with all, status, recall and clear functions. T.O. CONFIG simulation fully supported and all pages will automatically show when needed.\nMaster Caution/ Master Warning: fully operational, including audio and reset.\nCommunication: Two VOR (with tuning by entering the name), Transponder and two ADF radios implemented in MCDU.  Two VHF and Audio Control panel. Fully compatible with Go Flight, Saitek, VR Insight etc without any additional software.\nFlight controls: two ELAC, two FAC and three SEC computers, with mechanical flight control backup, operating under normal law protection (load factor limitation, pitch attitude protection, high AoA protection, high speed protection).  Full FBW system. Speed brakes and spoiler with ground spoiler control system. All flight controls fully linked to hydraulic systems. Fully featured ECAM F/CTL page.  Slats and Flaps systems fully featured and fully compatible with all additional hardware.\nTCAS: Fully implemented with 4 threat levels (default, proximate TA, RA) in navigation display, including sounds.\nNavigation: Uses updatable Navigraph navigation database.\nMCDU features:\nMain menu:\nAircraft status\nPanel state Load/save module with preset:\nCold &amp; Dark\nReady to taxi\nReady for take off\nCruise\nUser setups\nDoors and equipment:\nOpening doors and cargo holds\nCones and wheel chocks\nExternal power cart  (visible &amp; invisible for AES)\nINIT A and B:\nDEP/ARR airport entry\nManaged cruise altitude \nZFW and Block fuel entry\nPERF pages:\nTake Off\nV-speed entry (manual or auto calculated)\nTransition altitude\nTake off flaps position\nFlex temperature\nClimb\nCruise\nDescend\nApproach:\nDecision height\nMinimum descend altitude\nProgress page\nFuel prediction page\nData page with GPS\nIRS position monitor\nNearest airport list\nFlightplan page\nDirect-to page\nRadio navigation page\nVOR, ILS , ADF radio tuning and course setting\nFlight planning: Flight plans can either be loaded via the standard FSX flight planner or entered manually. Flight plans made by 3rd party tools (FSBuild, FS Commander etc) can be imported as long as they can be exported to standard FSX flight plans.\nFlight control unit (autopilot) features:\nSelected modes:\nAuto throttle speed\nHeading\nAltitude\nVertical speed\nManaged modes:\nAuto throttle speed set according to altitude\nLNAV Managed lateral mode, follows MCDU flight plan\nVNAV Managed vertical mode: note that VNAV is simplified to be easier to use.\nSets both speed and climb behavior according to aircraft altitude\nStarts descend automatically when reaching TOD\nNavigation display features:\nILS, VOR, NAV, ARC and PLAN modes\nRange settings: 10-320nm\nFlight plan with waypoints\nTCAS information\nADF/VOR info\nGPS Intersections, NDB?s, VOR?s and Airports can be selected for display\nPrimary Flight Display features:\nArtificial horizon\nAirspeed and altitude\nAutoflight settings\nILS info\nV-speeds\nFlaps, slats and gear retraction/extension speeds\nVMO (max speed)\nAlpha floor and alpha max speed tape\nGreen Dot, Vmax, Vls, Vapp, and many more speed tape indicators\nSystem requirements:\nMicrosoft Flight Simulator X (SP2, Acceleration or Gold Edition)\nWindows XP / Vista (32Bit or 64Bit) / Windows 7 with the latest Service Packs\nMicrosoft Visual C++ 2005 + SP1 Redistributable Package\nMicrosoft Visual C++ 2008 + SP1 Redistributable Package\nIntel Core 2 Duo CPU (2x 2666Mhz) or equivalent (Core 2 Quad CPU recommended)\n2 GB RAM\nDX9 Graphic Card with at least 256 MB (512 MB highly recommended)\nMouse with mouse wheel\nJoystick with throttle\nDownload-Size: 240 MB\nInstallations-Size: 500 MB\n\nManuals and smartphone checklists can be downloaded from the aerosoft site.\n\n\nwatch the first PMDG 737 ngx external screenshots:\n\n\nuploaded by me!!!\n\n \n","torrent":{"xt":"urn:btih:19aab67a1a36ac319ffe33c1c91607e65b0c48a8","amp;dn":"%5BFSX%5D+Aerosoft+Airbus+X+%5BFull+installer+with+crack+and+serial%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19aab67a1a36ac319ffe33c1c91607e65b0c48a8","infoHashBuffer":{"type":"Buffer","data":[25,170,182,122,26,54,172,49,159,254,51,193,201,22,7,230,91,12,72,168]},"announce":[],"urlList":[]}}