{"title":"Sherpa.2015.HDTV.x264-RBB","uid":14424944,"size":591881956,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:19cf4207d73a02002b2804da13290bcd6dd40fbc&amp;dn=Sherpa.2015.HDTV.x264-RBB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":2,"uploader":".BONE.","files":1,"time":1461557829,"description":"http://www.imdb.com/title/tt3746250/\r\n\r\nA fight on Everest? It seemed incredible. But in 2013 news channels around the world reported an ugly brawl at 21,000ft as European climbers fled a mob of angry Sherpas. In 1953, New Zealander Edmund Hillary and Sherpa Tenzing Norgay had reached the summit in a spirit of co-operation and brave optimism. Now climbers and Sherpas were trading insults - even blows. What had happened to the happy, smiling Sherpas and their dedication in getting foreigners to the top of the mountain they hold so sacred? Determined to explore what was going on, the filmmakers set out to make a film of the 2014 Everest climbing season, from the Sherpas' point of view. Instead, they captured a tragedy that would change Everest forever. At 6.45am on 18th April, 2014, a 14,000 ton block of ice crashed down onto the climbing route through the Khumbu Icefall, killing 16 Sherpas. It was the worst tragedy in the history of Everest. The disaster provoked a drastic reappraisal about the role of the Sherpas in the Everest industry. SHERPA, tells the story of how, in the face of fierce opposition, the Sherpas united in grief and anger to reclaim the mountain they call Chomolungma","torrent":{"xt":"urn:btih:19cf4207d73a02002b2804da13290bcd6dd40fbc","amp;dn":"Sherpa.2015.HDTV.x264-RBB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19cf4207d73a02002b2804da13290bcd6dd40fbc","infoHashBuffer":{"type":"Buffer","data":[25,207,66,7,215,58,2,0,43,40,4,218,19,41,11,205,109,212,15,188]},"announce":[],"urlList":[]}}