{"title":"Natalie Merchant (2014) [FLAC]","uid":10103623,"size":274672738,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1a1249f3ccffc569429f7daa4c1ab59d6d997b25&amp;dn=Natalie+Merchant+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":"politux","files":-1,"time":1399431063,"description":"\n  Natalie Merchant (2014) [FLAC]\n\n  Genre: Pop/Rock, Folk\n  Styles: Singer/Songwriter, Alternative\n  Source: WEB\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Ladybird \n  02 Maggie Said\n  03 Texas \n  04 Go Down, Moses \n  05 Seven Deadly Sins \n  06 Giving Up Everything \n  07 Black Sheep \n  08 It's A-Coming \n  09 Lulu (Introduction) \n  10 Lulu \n  11 The End\n\n  Bio\n\n  After rising to fame at the helm of the popular folk-rock band 10,000 Maniacs, Natalie Merchant enjoyed even greater success as a solo artist during the mid-'90s. Her literate, socially conscious songs established her among the preeminent women in pop music, while her solo debut -- 1995's Tigerlily -- helped pave the way for a number of female performers in a pre-Lilith Fair market. She continued releasing albums well into the 2000s, often examining specific genres or subjects, although Tigerlily remained her biggest-selling record.\n\n  Review\n\n  Natalie Merchant is marketed as the successor to 2001's Motherland, suggesting it's Merchant's first album since, but that isn't strictly true. She independently released a collection of folk covers called The House Carpenter's Daughter in 2003 and, most notably, the ambitious double-disc neo-children's album Leave Your Sleep in 2010 -- distinctive work both but she hasn't dedicated herself fully to original material in 13 years, so Natalie Merchant is indeed noteworthy. Feeling neither pent-up nor fussy, the eponymous album is handsome, deliberate, and familiar; she's not picking up where she left off, she's merely resuming her career, not acting like any time or fashion has passed in her absence. Which isn't to say Merchant operates as if it's still her '90s heyday. She obliquely references Hurricane Katrina with &quot;Go Down Music,&quot; but the strongest evidence that Merchant knows perfectly well it's 2014 is how she embraces her middle age. Even at the start of her career, Merchant aspired to sound wise and old and now that she's reached 50, she's exceedingly comfortable in her skin, never rushing her tempos, luxuriating in lush orchestral arrangements that are rarely Baroque and often find a nice contrast with softer, folkier moments, choosing to be melodic while studiously avoiding direct hooks. Natalie Merchant is not a progression so much as a deepening and, as such, it offers a quiet comfort for anyone who has ever loved her music.\n","torrent":{"xt":"urn:btih:1a1249f3ccffc569429f7daa4c1ab59d6d997b25","amp;dn":"Natalie+Merchant+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a1249f3ccffc569429f7daa4c1ab59d6d997b25","infoHashBuffer":{"type":"Buffer","data":[26,18,73,243,204,255,197,105,66,159,125,170,76,26,181,157,109,153,123,37]},"announce":[],"urlList":[]}}