{"title":"Psychology for Health Professionals, 2E Barkway [PDF][StormRG]","uid":11746694,"size":3608230,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a67b8aedc8ee29e34e5fa4c35ffdd612701b88f&amp;dn=Psychology+for+Health+Professionals%2C+2E+Barkway+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":1,"uploader":"0xmovva","files":2,"time":1426062114,"description":"\nTITLE/EDITION Psychology for Health Professionals, 2e\nBy: Patricia Barkway \nPaperback: 376 pages\nPublisher: Churchill Livingstone; 2 edition (September 2, 2013)\nLanguage: English\nISBN-10: 0729541568\nISBN-13: 978-0729541565\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nA fully updated edition of an important psychology text for nursing and health science students.\n\nThis fully updated second edition of Psychology for Health Professionals is written specifically for health science and nursing students in Australia and New Zealand.\n\nAuthored by the highly regarded Patricia Barkway, with a diverse range of expert contributors, this Elsevier text interprets psychology for nurses, as well as for students of paramedicine, occupational therapy, physiotherapy, public health, pharmacy, psychology, social work and midwifery.\n\nPsychology for Health Professionals 2e examines essential psychological theories, placing them within a social context. Acknowledging increasing awareness that behaviour is influenced as much by external factors as biological and psychological ones, the book's first half outlines psychological, lifespan and social theories, then applies them to contemporary health issues in later chapters.\n\nA key focus of this leading psychology textbook is examining individual personality and psychological theory within the social context of people's lives. New content includes current, evidence-based research, references and clinical examples relevant to interdisciplinary, contemporary healthcare practice. Issues of cultural safety and awareness have been strengthened throughout; there is a new section on chronic illness and a focus on recovery.\n\nThis introductory psychology text does not assume its readers will have prior 'psychology' knowledge, yet it can easily be used well beyond first-year university.\n\nCritical thinking questions\nClassroom activities\nResearch focus boxes providing examples of current research and evidence-based practice\nInterdisciplinary case studies throughout\nFurther resources and web links to provide further reading and research and up-to-date information, data and statistics","torrent":{"xt":"urn:btih:1a67b8aedc8ee29e34e5fa4c35ffdd612701b88f","amp;dn":"Psychology+for+Health+Professionals%2C+2E+Barkway+%5BPDF%5D%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a67b8aedc8ee29e34e5fa4c35ffdd612701b88f","infoHashBuffer":{"type":"Buffer","data":[26,103,184,174,220,142,226,158,52,229,250,76,53,255,221,97,39,1,184,143]},"announce":[],"urlList":[]}}