{"title":"Lords of the Sith: Star Wars Audiobook","uid":14558147,"size":315466124,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1af49c395920b00c9924e18c609673937f099fff&amp;dn=Lords+of+the+Sith%3A+Star+Wars+Audiobook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":2,"uploader":null,"files":2,"time":1462708722,"description":"It's not the best quality out there (Still perfectly enjoyable), but the other one on this site has a 10 minute audio overlap of some youtube video at around the 8 hour mark.\r\nHere's that one: https://thepiratebay.se/torrent/11900965/Lords_of_the_Sith\r\nThe one I linked is of better quality than this, but if you don't want to deal with not hearing a portion of the book, you can download this one instead.\r\n\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\n\r\nWritten by: Paul S. Kemp\r\nNarrated by: Jonathan Davis\r\nLength: 10 hrs and 56 mins \r\nSeries: Star Wars, Book 5\r\nUnabridged Audiobook\r\nRelease Date:04-28-15\r\nPublisher: Random House Audio \r\n\r\n\r\n\r\nPublisher's Summary:\r\nA long time ago in a galaxy far, far away....\r\n\r\nWhen the Emperor and his notorious apprentice Darth Vader find themselves stranded in the middle of insurgent action on an inhospitable planet, they must rely on each other, the Force, and their own ruthlessness to prevail.\r\n\r\n&quot;It appears things are as you suspected, Lord Vader. We are indeed hunted.&quot;\r\n\r\nAnakin Skywalker, Jedi Knight, is just a memory. Darth Vader, newly anointed Sith Lord, is ascendant. The Emperor's chosen apprentice has swiftly proven his loyalty to the dark side. Still, the history of the Sith Order is one of duplicity, betrayal, and acolytes violently usurping their Masters - and the truest measure of Vader's allegiance has yet to be taken. Until now.\r\n\r\nOn Ryloth, a planet crucial to the growing Empire as a source of slave labor and the narcotic known as &quot;spice&quot;, an aggressive resistance movement has arisen, led by Cham Syndulla, an idealistic freedom fighter, and Isval, a vengeful former slave. But Emperor Palpatine means to control the embattled world and its precious resources - by political power or firepower - and he will be neither intimidated nor denied. Accompanied by his merciless disciple, Darth Vader, he sets out on a rare personal mission to ensure his will is done.\r\n\r\nFor Syndulla and Isval, it's the opportunity to strike at the very heart of the ruthless dictatorship sweeping the galaxy. And for the Emperor and Darth Vader, Ryloth becomes more than just a matter of putting down an insurrection: When an ambush sends them crashing to the planet's surface, where inhospitable terrain and an army of resistance fighters await them, they will find their relationship tested as never before. With only their lightsabers, the dark side of the Force, and each other to depend on, the two Sith must decide if the brutal bond they share will make them victorious allies or lethal adversaries","torrent":{"xt":"urn:btih:1af49c395920b00c9924e18c609673937f099fff","amp;dn":"Lords+of+the+Sith%3A+Star+Wars+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1af49c395920b00c9924e18c609673937f099fff","infoHashBuffer":{"type":"Buffer","data":[26,244,156,57,89,32,176,12,153,36,225,140,96,150,115,147,127,9,159,255]},"announce":[],"urlList":[]}}