{"title":"Errol Morris - The Thin Blue Line (1988)","uid":3661896,"size":734677599,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1ba013d960df76312a5e717decf33d0a35f1d758&amp;dn=Errol+Morris+-+The+Thin+Blue+Line+%281988%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"brunosc","files":3,"time":1176335207,"description":"Plot Summary (from IMDB): Errol Morris&amp;#039;s unique documentary dramatically re-enacts the crime scene and investigation of a police officer&amp;#039;s murder in Dallas. Briefly, a drifter (Randall Adams) ran out of gas in Texas and was picked up by a 16-year-old runaway (David Harris). Later that night, they drank some beer, smoked some marijuana, and went to the movies. Then, their stories diverge. Adams claims that he left for his motel, where he was staying with his brother, and went to sleep. Harris, however, says that they were stopped by police late that night and Adams suddenly shot the officer approaching their car. The film shows the audience the evidence gathered by the police, who were under extreme pressure to clear the case. It strongly makes a point that the circumstantial evidence was very flimsy. In fact, it becomes apparent that Harris was a much more likely suspect and was in the middle of a &amp;#039;crime spree,&amp;#039; eventually ending up on Death Row himself for the later commission of other crimes. Morris implies that the D.A.&amp;#039;s and judge&amp;#039;s desire for the death penalty in this case (which Harris would have been ineligible for, due to his youth), made Adams a scapegoat on which to pin this heinous crime.\n\nRuntime: 103 min\nCountry: USA\nLanguage: English\nColor: Color\nAspect Ratio: 1.37 : 1\nSound Mix: Dolby\n\n***********************************FREAKYFLICKS************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\nwww.freakyflicks.tk\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;","torrent":{"xt":"urn:btih:1ba013d960df76312a5e717decf33d0a35f1d758","amp;dn":"Errol+Morris+-+The+Thin+Blue+Line+%281988%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ba013d960df76312a5e717decf33d0a35f1d758","infoHashBuffer":{"type":"Buffer","data":[27,160,19,217,96,223,118,49,42,94,113,125,236,243,61,10,53,241,215,88]},"announce":[],"urlList":[]}}