{"title":"The Red Baron : A History in Pictures (2016) [WWRG]","uid":15978667,"size":8729348,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1bb2ac6c3e16b00da4240d82d6758a34126a9a14&amp;dn=The+Red+Baron+%3A+A+History+in+Pictures+%282016%29+%5BWWRG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":6,"uploader":"Lion.King","files":3,"time":1475871816,"description":"\nKeen First World War aviation enthusiasts will be familiar with Norman Franksâ™ previous books covering the life of Rittmeister Manfred Freiherr von Richthofen, so why this new one? Well Manfred, the iconic Red Baron, has constantly remained at the forefront of First World War studies and, in commemorating the one hundred years that have elapsed since the beginning of hostilities, it seems like a good time to introduce a new arrangement of photographs covering the entire span of von Richthofenâ™s war (most of which will have been seen, but spread over a whole variety of books and magazines about First World War flying), consolidated in one book.\r\n\r\nIn the time that has elapsed since the release of Franksâ™ earlier titles on a similar theme, a constant trickle of new information has filtered down to him. Although none of it specifically challenges the conclusions drawn in earlier publications, in consolidating them here heâ™s been able to preserve some significant notes of interest.\r\n\r\nFollowing a number of visits to Belgium and Northern France in recent years, Franks has managed to acquire additional images, illustrating the places in which the Red Baron lived and fought between 1916 and 1918. This collection represents the entire span of von Richthofen's recorded history in pictures, some new and lesser-known, some iconic and widely circulated; all housed here under one roof, for the very first time","torrent":{"xt":"urn:btih:1bb2ac6c3e16b00da4240d82d6758a34126a9a14","amp;dn":"The+Red+Baron+%3A+A+History+in+Pictures+%282016%29+%5BWWRG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bb2ac6c3e16b00da4240d82d6758a34126a9a14","infoHashBuffer":{"type":"Buffer","data":[27,178,172,108,62,22,176,13,164,36,13,130,214,117,138,52,18,106,154,20]},"announce":[],"urlList":[]}}