{"title":"Personality Types: Using the Enneagram for Self-Discovery ","uid":8573597,"size":3574878,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1bc2f59163669a1a4f54ad40941eae795e667054&amp;dn=Personality+Types%3A+Using+the+Enneagram+for+Self-Discovery+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1371225469,"description":"Personality Types: Using the Enneagram for Self-Discovery by Don Richard Riso, Russ Hudson\n1996 | ISBN: 0395798671 | English | 544 Pages | EPUB | 3.40 MB\n\n&quot; The Enneagram is an extraordinary framework for understanding more about ourselves. No matter from which point of view we approach it, we discover fresh conjunctions of new and old ideas.&quot; So writes Don Riso in this expanded edition of his classic interpretation of the Enneagram, the ancient psychological system used to understand the human personality. In addition to updating the descriptions of the nine personality types, Personality Types, Revised greatly expands the accompanying guidelines and, for the first time, uncovers the Core Dynamics, or Levels of Development, within each type. This skeletal system provides far more information about the inner tension and movements of the nine personalities than has previously been published. This increased specificity will allow therapists, social workers, personnel managers, students of the Enneagram, and general readers alike to use it with much greater precision as they unlock the secrets of self-understanding, and thus self-transformation. ","torrent":{"xt":"urn:btih:1bc2f59163669a1a4f54ad40941eae795e667054","amp;dn":"Personality+Types%3A+Using+the+Enneagram+for+Self-Discovery+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bc2f59163669a1a4f54ad40941eae795e667054","infoHashBuffer":{"type":"Buffer","data":[27,194,245,145,99,102,154,26,79,84,173,64,148,30,174,121,94,102,112,84]},"announce":[],"urlList":[]}}