{"title":"Midtown Madness Car Race Full","uid":7766382,"size":94024158,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1c49e5481c479befc443c38a604a1fe25ee0c730&amp;dn=Midtown+Madness+Car+Race+Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":2,"uploader":"SSJASON","files":6,"time":1351387450,"description":"== MIDTOWN MADNESS ==\nLanguage: Engligh\nTorrent File Size: 90MB\nPlatform: Windows PC\n\nMidtown Madness features four single-player modes: Blitz, Circuit, Checkpoint, and Cruise. In Blitz, the player must reach a destination within a time limit; in Circuit, the player races other vehicles; in Checkpoint, the game adds the complication of other traffic, such as police cars and pedestrians; and in Cruise, the player simply explores the city. Players have a choice of up to ten vehicles, although only five are available at the start. To unlock the other cars, players must achieve goals such as winning a certain number of races.Checkpoint mode allows players to set the frequency of traffic, police cars, and pedestrians.\n\nCar damage is slightly realistic. After the player crashes into traffic cars, police cruisers or opponent's cars, there is a visible damage on the car. After too many collisions, the car's tires start to appear wobbly and damaged. Once completely damaged out, the tires will fall off and the car will be unusable for a few seconds before respawning. However, in Checkpoint Races, damaging out results in Game Over. The same applies to the cops, once they are damaged out, they will not respawn. The only way to evade the police is to destroy them.\n\nThere are few types of racing:\nCruise (Free roam around the city)\nCheckpoint Races (A race over the city with marked checkpoints, you can pass them any way you like. 6 completed races unlock Ford Mustang Police Cruiser)\nCircuit Races (A closed track over the city roads with certain number of laps. 5 completed races unlock Ford Mustang Fastback)\nBlitz Races (Time race with only player as a driver. The player has to complete the race in the ordered time to pass it. 5 completed races unlock Freightliner Century)\n\nSYSTEM REQUIREMENTS:\nCPU:\tIntel Pentium IV (or higher)\nRAM:\t256 MB\nVGA:\t32MB DirectX 9.0c compatible video card\nDX:\tDirectX 9.0c\nOS:\tWindows 98,ME,2000,XP Professional\nHDD:\t900 MB of HD space\nSound:\tDirectX compatible Sound Card\nODD:\t8X CD-ROM","torrent":{"xt":"urn:btih:1c49e5481c479befc443c38a604a1fe25ee0c730","amp;dn":"Midtown+Madness+Car+Race+Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c49e5481c479befc443c38a604a1fe25ee0c730","infoHashBuffer":{"type":"Buffer","data":[28,73,229,72,28,71,155,239,196,67,195,138,96,74,31,226,94,224,199,48]},"announce":[],"urlList":[]}}