{"title":"Grand Theft Auto IV .5 GTA 4 .5 Fully Loaded","uid":8170223,"size":14730228503,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1cb3c67e9623d39879f372c4efd09971c62dc733&amp;dn=Grand+Theft+Auto+IV+.5+GTA+4+.5+Fully+Loaded&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":8,"uploader":"CDUBBlin","files":1,"time":1361412213,"description":"Massive overhaul to GTA-4.\nThis is the closest you will get to GTA 5 until its released. It was made with 5 simple goals.\n1-compatibility (system stability)\n2-Best Mods ever created and configured to work flawlessly simultaneously\n3-No missing Textures problem/issue!!\n4-All New Cars (high Poly/Detailed yet low resource costing) \n5-Does not require super computer to ruin. (Any dual core GPU and 1GB V Card will work fine. Recommended use = double the above for enhancing long distance detail)\n\nA little bit of what this contains.\n-Fully updated Game version. (1.0.7.0)\n-Texture Packs (Roads, buildings, Safe-houses,Guns,cloths, etc, etc)\n-New Cars. All Cars Replaced (From classics to 2013 Models)\n-Majestic Hotel Suit and over 20 others opened up around city for you to safe/RP in. all are marked on radar/map.\n-Most Textures in game converted to higher Detail\n-Speedometer meter (KPH/MPH first person or 3rd person driving)\n-First person Mod (shooting and Driving)\n-Massive mountain island with many roads bridges and new Area to drive and Explore. (Has many dirt/paved roads to drives and jumps bigger then you ever imagined. Beaches and New boating areas etc, etc, etc)\n-All game bugs from multiple mod conflicts have been 100 pct fixed.\n-Built in vehicle Handling Mod (Most realistic released)\n-Built in ENB (does not require super computer and easy changeable)\n-Built in Native Trainer (Has a car spawn-er and many many other options) F3\n-Built in car Tuner (Saves up to 50 cars full customization) F4\n-Built in LCPDFR compatible and ready (Police missions) Alt+p \n-Built in ASI Loader (So you can add other mods easy)\n-Built in Script Hook (used for loading mod stuff)\n-Built in gas Script(Gas Stations converted to real gas stations to refuel at. Gas gauge built in under speedometer. Refill with &quot;X&quot; while next to gas pump)\n-Built in new high Detailed mini map, large map and radar.\n-Built in car/taxi traffic Fix (Fixes issue of missing textures and same cars)\n-Compilation of 5 best &quot;LIFE Adding&quot; mods. Real Signs and businesses. More people with proper AI/schedules. Time square Redone to match real thing.\n-Many more things you will find that are not game/lore breaking.\n","torrent":{"xt":"urn:btih:1cb3c67e9623d39879f372c4efd09971c62dc733","amp;dn":"Grand+Theft+Auto+IV+.5+GTA+4+.5+Fully+Loaded","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cb3c67e9623d39879f372c4efd09971c62dc733","infoHashBuffer":{"type":"Buffer","data":[28,179,198,126,150,35,211,152,121,243,114,196,239,208,153,113,198,45,199,51]},"announce":[],"urlList":[]}}