{"title":"The Witcher: Enhanced Edition (GOG)","uid":11971545,"size":13816741470,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1d4bd426ab56a1edb65f13276cc7ad77c7e9b20e&amp;dn=The+Witcher%3A+Enhanced+Edition+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":18,"uploader":"mercs215","files":24,"time":1432840503,"description":"This was taken straight from GOG.com and includes all the DLC, patches and the game goodies. \nIf you do not want the game goodies, you can select to not download the &quot;Game Goodies&quot; folder in your BitTorrent client.\n\nInstall instructions: \n1. Run &quot;setup_the_witcher_enhanced_edition_2.0.0.12&quot; located in the &quot;Game Setup&quot; folder\n2. Play, no cracks needed as DRM free\nIf you like this game, please support the developers and BUY IT! Remember to seed so others can enjoy\n\nTHE WITCHER - ENHANCED EDITION (c) CD Projekt RED\nRelease Date: October 26, 2007\nProtection: None\nGame Type: Role-playing - Action - Fantasy\nStore page: http://www.gog.com/game/the_witcher\nGame Version: 2.0.0.12\nLanguage: English\n\nAbout This Game\nYour name is Geralt of Rivia and you are a witcher, that means you kill monsters for a living. You were given special training to be the best at what you do and your body has been enhanced with potent elixirs to help you do it.\nSuffering from amnesia you remember nothing of your past. Kaer Morhen, the last remaining keep of the witchers, was attacked by a mysterious organization, just as you were starting to lick your wounds there. The battle is won but the secret recipe for the mutagen, a substance required to create more of your kind, has been stolen. The surviving witchers set out to find and reclaim it and punish everyone involved. Memory loss or not, you are one of them.\nSet in a dark fantasy world with a unique medieval, yet somewhat modern, feel to it, The Witcher isn't just another fantasy RPG. With a deep story, complex characters, and tough choices that actually matter, this game will keep you glued to your monitor for days.\nArguably one of the best RPGs ever made, with a mature, non-linear story and a challenging combat system\nBeautiful graphics and an enchanting soundtrack create a very unique dark fantasy atmosphere\nThe Witcher's universe is created by Andrzej Sapkowski - bestselling fantasy author\n\nMinimum system requirements:\nWindows: Windows XP, Intel Pentium 4 2.4GHz or AMD Athlon 64 +2800\n1 GB RAM for Windows XP, 1.5 GB for Vista\nNVIDIA GeForce 6600 or ATI Radeon 9800 or better\n8.5 GB available hard drive space\nDirectX 9.0c compliant soundcard","torrent":{"xt":"urn:btih:1d4bd426ab56a1edb65f13276cc7ad77c7e9b20e","amp;dn":"The+Witcher%3A+Enhanced+Edition+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d4bd426ab56a1edb65f13276cc7ad77c7e9b20e","infoHashBuffer":{"type":"Buffer","data":[29,75,212,38,171,86,161,237,182,95,19,39,108,199,173,119,199,233,178,14]},"announce":[],"urlList":[]}}