{"title":"Great Houses of Europe (Architecture History Art Ebook).pdf","uid":10323916,"size":79379597,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d5fa2bd2bb123cd8382695dd39903850e3a206d&amp;dn=Great+Houses+of+Europe+%28Architecture+History+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"STBGD","files":-1,"time":1402339550,"description":"pdf / English / Putnam / 1961 / 318 Pages / 75 MB\n\nAmong Europe's greatest legacies to the arts are the private houses which richly stud its cities and countryside. In this book forty of the finest are shown in all their splendor. They range from a palace in Leningrad to the beautiful rose-pink Queluz near Lisbon, and in time from the end of the mediaeval period to the beginning of the nineteenth century. No house has been chosen which is radically altered, none which is ruinous, and none which is not fully representative of its country and its age. The forty color-plates show some of the most famous, as well as some of the less well-known, examples of the Renaissance, Tudor, Baroque, Rococo and classical periods, and equal emphasis has been given to the interior as to the outside of the houses. The rich art-collections which many of them contain, the gardens that surround them and the great figures and events with which these houses have been\nassociated, are all illustrated and described. A particular feature of the book is the inclusion, in almost every case, of early prints and paintings showing how the\nhouses appeared to contemporaries in different centuries. Sacheverell Sitwell, well known as a connoisseur of the arts, has written the Introduction which describes\nthe contribution that domestic architecture has made to the cultural life of Europe; and Edwin Smith, who has taken almost all the illustrations specially for this book, has related his photographs to the text that accompanies them. Each house is  described by an author familiar with the house itself and the cultural history of the country in which it lies, but the text is written for the non-specialist, whose appreciation of these houses will be heightened by a knowledge of their history,\nbuilders and owners. The magnificent illustrations speak for themselves.","torrent":{"xt":"urn:btih:1d5fa2bd2bb123cd8382695dd39903850e3a206d","amp;dn":"Great+Houses+of+Europe+%28Architecture+History+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d5fa2bd2bb123cd8382695dd39903850e3a206d","infoHashBuffer":{"type":"Buffer","data":[29,95,162,189,43,177,35,205,131,130,105,93,211,153,3,133,14,58,32,109]},"announce":[],"urlList":[]}}