{"title":"Henry David Thoreau - Walden &amp; Other Works (8 books)","uid":9540549,"size":33966929,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d802c05b635ff27e5a8f57c8c103f2598314b00&amp;dn=Henry+David+Thoreau+-+Walden+%26amp%3B+Other+Works+%288+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":2,"uploader":"workerbee","files":-1,"time":1391034214,"description":"\nHENRY DAVID THOREAU (1817-1862) was an American author, poet, philosopher, abolitionist, naturalist, tax resister, development critic, surveyor, historian, and leading transcendentalist.  He is best known for his book WALDEN, a reflection upon simple living in natural surroundings, and his essay RESISTANCE TO CIVIL GOVERNMENT (also known as &quot;Civil Disobedience&quot;), an argument for disobedience to an unjust state.\n\nAmong his lasting contributions were his writings on natural history and philosophy, where he anticipated the methods and findings of ecology and environmental history, two sources of modern-day environmentalism.  His literary style interweaves close natural observation, personal experience, pointed rhetoric, symbolic meanings, and historical lore, while displaying a poetic sensibility, philosophical austerity, and &quot;Yankee&quot; love of practical detail.\n\nIncluded here are multiple editions of WALDEN, two books of essays on natural history, and a large one-volume edition of Thoreau's journal.  Of special note are the two annotated editions of WALDEN and THE MAINE WOODS, correcting errors and omissions from previous editions and providing illuminating notes on the biographical, historical, and geographical contexts ofÂ Thoreau's life.\n\n\nThe following books are in PDF format unless otherwise noted:\n\n* FAITH IN A SEED: The Dispersion of Seeds &amp; Other Late Natural History Writings (Island Press, 1996).  Edited by Bradley P. Dean.\n\n* THE JOURNAL OF HENRY DAVID THOREAU,1837-1861 (New York Review Books, 2009).  Edited by Damion Searls with a Preface by John R. Stilgoe. -- EPUB\n\n* THE MAINE WOODS: A Fully Annotated Edition (Yale University Press, 2009).  Edited by Jeffrey S. Cramer.\n\n* WALDEN (Princeton University Press, 1971).  Edited by J. Lyndon Shanley with an Introduction by Joyce Carol Oates.\n\n* WALDEN: 150th Anniversary Edition (Princeton University Press, 2004).  Edited by J. Lyndon Shanley with an Introduction by John Updike.\n\n* WALDEN: A Fully Annotated Edition (Yale University Press, 2004).  Edited by Jeffrey S. Cramer.\n\n* WALDEN &amp; CIVIL DISOBEDIENCE (Barnes &amp; Noble, 2003).  With an Introduction and Notes by Jonathan Levin. -- EPUB\n\n* WILD APPLES &amp; OTHER NATURAL HISTORY ESSAYS (University of Georgia Press, 2002).  Edited by William Rossi.\n","torrent":{"xt":"urn:btih:1d802c05b635ff27e5a8f57c8c103f2598314b00","amp;dn":"Henry+David+Thoreau+-+Walden+%26amp%3B+Other+Works+%288+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d802c05b635ff27e5a8f57c8c103f2598314b00","infoHashBuffer":{"type":"Buffer","data":[29,128,44,5,182,53,255,39,229,168,245,124,140,16,63,37,152,49,75,0]},"announce":[],"urlList":[]}}