{"title":"Michael Savage - Abuse of Power - epub","uid":15891775,"size":361463,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1de3efa0ed76404eb272938f15aca7dc9b7baae4&amp;dn=Michael+Savage+-+Abuse+of+Power+-+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":3,"uploader":"roflcopter2110","files":1,"time":1474761646,"description":"http://boltimg.com/images/Y5Krf.jpg\r\n\r\nMichael Savage - Abuse of Power - epub\r\n\r\nFrom the New York Times bestselling author and nationally syndicated radio talk-show host comes a high-intensity debut thriller, the story of a smeared network journalist who uncovers a chilling terrorist plot\r\n\r\nJack Hatfield is a hardened former war correspondent who rose to national prominence for his insightful, provocative commentary. But after being smeared as a bigot and extremist by a radical leftist media-watchdog group, he ultimately loses his job and finds himself working in obscurity as a freelance news producer in San Francisco.\r\n\r\nOne afternoon Hatfield is on a ride-along with the SFPD bomb squad when a seemingly routine carjacking turns deadly, after police find several pounds of military-grade explosives in the jacked car. And when the FBI urges Hatfield to stay out of it, he knows he’s onto something big.\r\n\r\nThis event will open up a shadowy trail that leads Hatfield from San Francisco to Tel Aviv, London, Paris, and back again, as he works with a stunning Yemeni intelligence agent and a veteran Green Beret to expose a terrorist group known as the Hand of Allah---and a plot within the highest corridors of power that will dwarf 9/11.\r\n\r\nIn this lightning-paced first thriller, spanning the globe from Europe and Israel to the back alleys of San Francisco’s Chinatown, a reporter must make the choice between protecting his own life and investigating a terrorist cell whose goal is nothing less than total political control---no matter what the cost","torrent":{"xt":"urn:btih:1de3efa0ed76404eb272938f15aca7dc9b7baae4","amp;dn":"Michael+Savage+-+Abuse+of+Power+-+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1de3efa0ed76404eb272938f15aca7dc9b7baae4","infoHashBuffer":{"type":"Buffer","data":[29,227,239,160,237,118,64,78,178,114,147,143,21,172,167,220,155,123,170,228]},"announce":[],"urlList":[]}}