{"title":"Castles and Fortified Cities of Medieval Europe Pdf Gooner","uid":12046852,"size":56376309,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e63a6a7a5706aec9e1894c7d435e77b23de8408&amp;dn=Castles+and+Fortified+Cities+of+Medieval+Europe+Pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1434915818,"description":"Publisher: McFarland &amp; Company (May 1, 2002)\nLanguage: English\nISBN-10: 0786410922\nISBN-13: 978-0786410927\n\nDuring the Middle Ages, castles and other fortified buildings were a common feature of the European landscape. As central powers rose and fell, the insecurity of the time inspired a revival of fortification techniques first introduced in the Roman Empire. Despite limitations in construction techniques and manpower, medieval fortifications were continuously adapted to meet new political circumstances and weapons technology. Here is an illustrated guide to the architecture of medieval fortifications, from the first castles to the fortified cities of the fifteenth and sixteenth centuries. In hundreds of detailed and thoroughly researched pen-and-ink drawings, artist Jean-Denis G.G. Lepage introduces the reader to a heterogeneous group of buildings whose unique characteristics show the development and diversity of European medieval military architecture. Each drawing is accompanied by detailed text describing types of buildings (e.g., moat-and-bailey castles), built-in defenses (arrow splits, pepper-pot towers), and particular castles and cities (the Mont-Saint-Michel, the city of Jerusalem). Elements of medieval warfare and weaponry are also covered in drawings and text","torrent":{"xt":"urn:btih:1e63a6a7a5706aec9e1894c7d435e77b23de8408","amp;dn":"Castles+and+Fortified+Cities+of+Medieval+Europe+Pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e63a6a7a5706aec9e1894c7d435e77b23de8408","infoHashBuffer":{"type":"Buffer","data":[30,99,166,167,165,112,106,236,158,24,148,199,212,53,231,123,35,222,132,8]},"announce":[],"urlList":[]}}