{"title":"Imperial Crossroads: The Great Powers and the Persian Gulf","uid":15885293,"size":2215379,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e73c5495b1bbd700c9374668048573fad70f401&amp;dn=Imperial+Crossroads%3A+The+Great+Powers+and+the+Persian+Gulf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":1,"uploader":"marty14","files":1,"time":1474644962,"description":"Imperial Crossroads: The Great Powers and the Persian Gulf - Jeffrey R. Macris, Saul Kelly [epub]\r\n\r\nFor centuries the world’s Great Powers, along with their fleets, armies, and intelligence services, have been drawn to the Persian Gulf region. Lying at the junction of three great continents – Asia, Europe, and Africa – and sitting athwart the oceanic trade routes that link the cities of the world, the Gulf, like a magnet, has pulled superpowers into the shallow waters and adjacent lands of the 600 mile long appendage of the Indian Ocean. An observer at Hormuz at the mouth of the Gulf would alternately have watched pass in the 15th century the treasure ships of Chinese Admiral Zheng He, in the 16th century the caravels of Portuguese Admiral Afonso de Albuquerqe, in the 17th century the merchant ships of the Dutch East India Company, in the 18th to the 20th centuries the frigates and steamships of the British, and finally in the late 20th century to today, the cruisers and aircraft carriers of the U.S. Fifth Fleet. Perhaps in the future, Americans may be supplanted by the Indians, or perhaps the Chinese. \r\n\r\nIn the Great Powers’ comings and goings since the 1400s, several consistent broad interests emerged. For the majority of this time, for example, the superpowers entered the Gulf region not to colonize, as the Europeans did in other places, but rather to further trade, which in the 20th century increasingly included oil. They also sought a military presence in the Gulf to protect seaborne flanks to colonial possessions further east on the Indian sub-continent and beyond (India, in fact, has long cast a shadow over the Gulf, given its historic trade and cultural ties to the Gulf region, strong ties that continue today). In their geo-political jockeying, furthermore, the Great Powers sought to deprive their rivals access to the states bordering the Gulf region. In tending to these enduring interests inside the Strait of Hormuz, the Great Powers through history concentrated their trade, political, and military presence along the littorals. Not surprisingly, their navies have played a substantive role. \r\n\r\n\r\nImperial Crossroads: The Great Powers and the Persian Gulf is a collection of connected chapters, each of which investigates a different perspective in the broader subject of the Great Powers and their involvement with the states of the Persian Gulf. This volume concentrates on four western nations – Portugal, Holland, Britain, and the United States – and concludes with a look at the possible future involvement of two rising Asian powers – China and India","torrent":{"xt":"urn:btih:1e73c5495b1bbd700c9374668048573fad70f401","amp;dn":"Imperial+Crossroads%3A+The+Great+Powers+and+the+Persian+Gulf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e73c5495b1bbd700c9374668048573fad70f401","infoHashBuffer":{"type":"Buffer","data":[30,115,197,73,91,27,189,112,12,147,116,102,128,72,87,63,173,112,244,1]},"announce":[],"urlList":[]}}