{"title":"Public Disgrace - 19 yo Samy (HDTV) - public BDSM &amp; humiliation","uid":5106172,"size":940492272,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:1e84d1e5bc7d38539032b56826d6a43e21be4015&amp;dn=Public+Disgrace+-+19+yo+Samy+%28HDTV%29+-+public+BDSM+%26+humiliation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":6,"uploader":"pure_screens","files":5,"time":1254382880,"description":"PublicDisgrace - Samy\n\n\n\nscreens: &lt;a href=&quot;\nhttp://www.cmylink.com/PublicDisgraceSamy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cmylink.com/PublicDisgraceSamy&lt;/a&gt;\n\n\n\n\nReleased:  Aug 28, 2009\n\nSamy is a hot 19 year old who had never been tied up before this shoot. You get to see all the raw emotion of a first timer as she is taken to the streets, \nstripped, flogged, dominated and made to suck cock and get fucked. Throughout the shoot she alternates between a nervous smile, screams of pain and moans \nof pleasure. Everything we do to her is new,and in the end she is hungry for more.\n\n\n\nAbout the webiste:\n\n&quot; Public Disgrace is the best public sex and BDSM site on the web. Women are bound, stripped, and punished in public. PublicDisgrace.com features porn with public nudity, public spanking, and public fucking at a new level. This site has hot girls on busy streets displayed tied up, gagged, sucking cock, fucking in public, and ass fucked for everyone to see. Voyeurs, exhibitionists, and anyone else will love seeing European girls being stripped in public, flashing in public, flashing their breasts, bound, gagged, and ass fucked. Girls also get taken to bars and parties and made to suck stranger's cocks and give them handjobs while bound. The site features lots of European first timers who have never tried bondage before as well as kink veterans like Bobbi Starr and Lorelei Lee. Crowds of people fondle bound naked girls. Hot sluts wear nipple clamps, tight ball gags, and have their shaved pussies exposed. Amateur beauties get vibrated to orgasm while everyone watches. See girls walk around the streets with cum drenched faces. This is no ordinary public sex site, girls are not only exposed to strangers they are fucked in bondage, bound and ass fucked, and tied in inescapable bondage, so once they are exposed they can do nothing to cover themselves up.\n\nNo one has dared to do this public bondage before. Our amazing director takes hot girls into public and humiliates them. They give public blowjob after blowjob and have sex with strangers. The girls are made a public disgrace, public female humiliation at its best. You'll see tons of high quality pictures, videos, downloads, and streaming media. Publicdisgrace.com is in high definition for your viewing pleasure.\n\nOther fantastic features on PublicDisgrace.com include nude girls bound, fucked, examined, and put into slave submission. The public humiliation of girls on Public Disgrace is kinky sex at a whole new level! &quot;\n\n\n1280 x 720 (HDTV)\nwmv\n01:09:07\n\nIncludes pictures set.\n\n\n\n3,700+ porn torrents: &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n(ALWAYS with honest screens &amp; detailed info)\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:1e84d1e5bc7d38539032b56826d6a43e21be4015","amp;dn":"Public+Disgrace+-+19+yo+Samy+%28HDTV%29+-+public+BDSM+%26+humiliation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e84d1e5bc7d38539032b56826d6a43e21be4015","infoHashBuffer":{"type":"Buffer","data":[30,132,209,229,188,125,56,83,144,50,181,104,38,214,164,62,33,190,64,21]},"announce":[],"urlList":[]}}