{"title":"GRAVITY'S RAINBOW - Thomas Pynchon {FerraBit}","uid":15891586,"size":1717635458,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1ebbef03b60d95dd0999af36e8900ae0fd49c168&amp;dn=GRAVITY%27S+RAINBOW+-+Thomas+Pynchon+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":7,"uploader":"FerraBit","files":36,"time":1474758722,"description":"GRAVITY'S RAINBOW by Thomas Pynchon (1973) {FerraBit}\n\nRead by . . : George Guidall\nPublisher . : Penguin Audio (2014)\nISBN-10 . . : B00OTU3F1S\nISBN-13 . . : 9780553551266\nFormat . . .: MP3. 30 tracks.\nSize: . . . : 1.7 GB (1712 MB)\nBitrate . . : 100 kbps (iTunes 12, Stereo, VBR, 44.1 kHz)\nSource . . .: 30 CDs (37.5 hrs)\nGenre . . . : Fiction Classics, Fiction Literary\nUnabridged .: Unabridged\n\n1 track per CD, nicely tagged and labeled, cover scan included. \n.PDF, .epub, .lit included (original formatting not preserved)\n\nThanks for sharing &amp; caring.\nCheers, FerraBit\nSeptember 2016\n\nLinks:\n \nhttp://thomaspynchon.com/\n \nhttp://www.booksontape.com/book/299800/g...s-rainbow/\n \nhttp://www.booksontape.com/hear-george-g...s-rainbow/\n \nhttp://www.nytimes.com/2014/11/23/books/...idall.html\n \nhttps://www.amazon.com/Gravitys-Rainbow/dp/B00OTU3F1S\n\n\nOriginally posted:\n \nhttps://thepiratebay.org/search/FerraBit/\n \nhttps://www.demonoid.ooo/files/?uid=4819534\n\n\nTaken the time to read this? Take some more, and leave a nice \nnote of encouragement for everyone to share and care.\nGot your FPL card?\n_____________________________________________________\n\nDescriptions:\n\nWinner of the 1973 National Book Award, Gravity's Rainbow is a postmodern epic, a work as exhaustively significant to the second half of the twentieth century as Joyce's Ulysses was to the first. Its sprawling, encyclopedic narrative and penetrating analysis of the impact of technology on society make it an intellectual tour de force.\n   ~  ~  ~  ~  ~\n[Review from 2014] &quot;Gravity's Rainbow,&quot; Thomas Pynchon's gargantuan parable of rocketry, sex and a whole bunch of other stuff, turned 41 this year — six years older than its author when it was first published. What happens when a novel whose scenes of coprophagia and pedophilia moved Pulitzer trustees to cancel the prize in 1974 (when Pynchon seemed poised to win) eases into middle-aged, canonical respectability? Well, for one thing, it gets an audiobook release. Since the mid-1980s, a George Guidall recording has been floating around, like some mythical lost rocket part — no one had heard it, but all Pynchon fans knew someone who knew someone who had — but in October a new version, authorized and rerecorded and burned onto 30 compact discs — hit the stands. How on earth, I wondered as I stripped the wrapper, is poor Mr. Guidall going to render the sudden outbreaks of crazed capitals, or librettos in which stoners with guitars pastiche Rossini, the instructions helpfully stating &quot;(bubububoo[oo] oo [sung to opening of Beethoven 5th, with full band])&quot;? He turns out to do it in a slow and deep-voiced manner, beneath whose calm avuncularity you can detect anxiety, even mania, bubbling but never quite erupting — although I could have sworn I heard him, in the silence at the end of CD 30, racing out the door to buy a year's supply of those Thayer's Slippery Elm Throat Lozenges the hero Slothrop sucks, or perhaps to check himself into the book's White Visitation mental hospital.\n\nThe main benefit of Guidall's superhuman effort may well be ergonomic. Unlike Grigori, the novel's reflex-conditioned octopus, a human reader has only two hands; removing the book as a physical object frees up one of these to palm through Steven Weisenburger's &quot;A ‘Gravity's Rainbow' Companion&quot; and the other to click around the many online glossaries to the text while listening. Such resources seem to me more than optional; only &quot;Finnegans Wake&quot; is more opaque, more reference-saturated than Pynchon's novel. And perhaps the benefits of audio end here. An old canard, reeled off incessantly by people who haven't read &quot;Finnegans Wake,&quot; or at least haven't understood it, holds that &quot;you need to hear it spoken aloud in order to appreciate it.&quot; This is nonsense: Joyce's novel, wrapped around in silence, is all about legibility — inscriptions, codices, scattered scraps of paper in need of reassembly, exegesis or decoding. So it is with &quot;Gravity's Rainbow&quot;: The book's logic is entirely scriptural. Every surface in it is a parchment to be interpreted: ice-cracks form &quot;graffiti... a legend to be deciphered&quot;; raindrops splash in asterisks, inviting us &quot;to look down at the bottom of the text of the day&quot;; lit cigarettes trail &quot;cursive writing&quot;; even feces on the walls of sewers presents &quot;patterns thick with meaning.&quot; Its people, lying in rows in a hospital ward described as a &quot;half-open file drawer of pain each bed a folder,&quot; are legible as well, &quot;poor human palimpsests&quot; that doctors transcribe and — more sinisterly — rewrite. Slothrop's ancestors, as Puritans, scanned the sky for messages, viewed all of nature as a ledger packed with data &quot;behind which always, nearer or farther, was the numinous certainty of God.&quot; In keeping with their sensibility, the narrative momentum thrusts both forward, toward inevitable (because predestined) final catastrophe and judgment and, simultaneously, backward, through histories encrypted into junkyards, light bulbs, even human hair, reverse-engineering cities into ruins, rooms to their &quot;plan views&quot; in order to lay bare the plans hatched in them, plans in whose web all current actors find themselves entangled. One character is tellingly urged, in a direct address by the narrator, to ponder a &quot;wind tunnel&quot; theory of history, through which tensor analysis might reveal &quot;nodes, critical points,&quot; turbulence-spots decisive in the shaping of all subsequent airflow, only now become apparent — then told, &quot;Here's a thought: Find a non-­dimensional coefficient for yourself.&quot;\n\nThis restless contrafluvial parsing, this excavation of each layer in the substrata of the present, leads to a work that, were it written today, would be assigned the label &quot;theory fiction.&quot; Pynchon's scanning and assimilation of a host of cultural histories and scientific archives, of the work of Pavlov, Max Weber, Robert Graves and others, is assiduous, even scholarly — if we imagine the most brilliant scholar dosed up to his eyeballs as he expounds urban theory, economics, folk mythology and differential calculus, all at the same time. Double integration in aeronautical guidance, the poetry of Emily Dickinson, weather reports gleaned from 1944 editions of The London Times — it all gets wound through Pynchon's typewriter, held in formation by a rhetorical patterning lifted principally from Melville (like those of &quot;Moby-Dick,&quot; the most striking sequences in &quot;Gravity's Rainbow&quot; typically begin with a statement of plain fact, then unpack this into a lyrical succession of images, which in turn set up a large conceit, before the chapter, often switching to the apostrophic/interrogative, climaxes in a burst of monumental allegory). It's entirely fitting that the character we first meet, into whose dream we find ourselves inveigled, is one Pirate Prentice — a clear stand-in for the author: as pirate, brazenly commandeering and stripping other vessels; as prentice, learning (although not so slowly) on the job. Prentice is the recipient of the novel's first, rocket-bomb-borne cryptic message; he it is whom his age tasks with &quot;getting inside the fantasies of others: being able, actually, to take over the burden of managing them&quot;; who saves his drunken buddy from crashing to his death from a balcony, but is unable to prevent the larger Fall, the screaming from the sky.\n\n&quot;Incoming mail,&quot; thinks Prentice as he watches the missive-carrying V2 arc its way toward him in the dawn. But the V2, lit by the sun from below, also appears as a star, dragging a rainbow contrail. In this novel about clarity and obfuscation, about the Enlightenment's most dazzling and dark consequences, light and its color spectrum play a central role. Light (like those feces in the sewer) is always patterned — trellised, meshed by lattices and trusswork; it, too, promises and withholds meaning, covering landscapes &quot;in misty ambivalence&quot; and turning people into &quot;dark fish hiding past angles of refraction.&quot; The rainbow, as a laying-out of chromatic intervals and syntax, would be nature's way of parsing herself. But man, or rather the Man, has realized he can do this too: Enter IG Farben (&quot;Colors&quot;), developer and patent-holder of synthetic dyes and fabrics, not to mention Zyklon B; mother ship of BASF, Bayer and half the other big chemical industry names; funder over time of a range of political campaigns including but not limited to the Nazi Party's; the &quot;corporate octopus&quot; (is this a first citation for the term?) for which Grigori is no more than a small stand-in, whose factual history Pynchon meticulously studies and then fictively embellishes, according it the role of the most critical of all point-sets in the tunnel. The logic and M.O. of IG Farben and its outliers is invasive transformation, artificial synthesis, control. Which also, of course, is the logic and M.O. of novel-writing. Pynchon fully appreciates the link: &quot;How alphabetic is the nature of molecules,&quot; he writes. &quot;These are our letters, our words: They too can be modulated, broken, recoupled, redefined, copolymerized one to the other in worldwide chains that will surface now and then over long molecular silences, like the seen parts of a tapestry.&quot;\n\nPolitically, the universe of &quot;Gravity's Rainbow&quot; separates into two sides, opposed yet uncomfortably co­dependent: on the right, the &quot;System&quot;; on the left, the &quot;Counterforce&quot; (for which read &quot;counterculture&quot;). Prentice, trained by the institutions of the first, ends up putting his talents in the service of the second, for whom Slothrop, eventually disintegrating with his harmonica into the wind, becomes an Orphic martyr. The System, when it craves enlightenment, has its ledgers all to hand, whereas the Counterforce has to fall back on &quot;dreams, psychic flashes, omens, cryptographies, drug-­epistemologies, all dancing on a ground of terror, contradiction, absurdity&quot; (a perfect description of this novel). But they're both after the same thing: the epiphanic &quot;holy Center&quot; or &quot;Absolute Zero&quot; whose &quot;pure light&quot; is so total it blinds. In this respect, an even more aptly named figure than Pirate Prentice is the statistician Milton Gloaming, whom we see squinting at a graph during a séance, &quot;trying to develop a vocabulary of curves&quot;: The sightless visionary poet (Milton) meets the day's (or age's) twilight. Slothrop, escaping down a literal tunnel in the Nordhausen rocket complex and struck by the &quot;amazing perfect whiteness&quot; of his pursuers' phosphorescent flare, also &quot;feels a terrible familiarity here, a center he has been skirting; ... never has he been as close as now to the true momentum of his time.&quot; That momentum comes to a head in the novel's final passages, when the rocket, morphed into an atom bomb, falls on Los Angeles's Orpheus Theater — at which point Pynchon lets ­&quot;Moby-Dick&quot; speak more or less directly as he describes an annihilating whiteness that is &quot;an abolition of pigment, of melanin, of spectrum.&quot; But there's another, more subtle Melville borrowing here too: from &quot;The Tartarus of Maids,&quot; whose descriptions of an automated paper mill, the &quot;metallic necessity,&quot; &quot;unbudging fatality&quot; and &quot;autocratic cunning of the machine,&quot; seem to have colored Pynchon's depiction of the rocket factory. Halfway through &quot;Gravity's Rainbow,&quot; Pynchon, when referring to the rocket, replaces the label &quot;V2&quot; with its technical synonym &quot;A4.&quot; Uncharacteristically, he doesn't tease out any associations from the latter term — yet, as anyone who's ever written knows, it also names the standard size of paper. As we contemplate the &quot;dim page&quot; of the Orpheus Theater's final screen, we might recall that Slothrop's ancestors were paper millers too: They knew that apocalypse was also a question of the Book.\n\nSo: 41 years on, is this book dated? In parts, yes. It's hard not to roll or glaze over one's eyes when treated to characters' detailed Tarot profiles. (&quot;You kids still reading that hippie stuff?&quot; an old-timer once said to a friend of mine who was holding &quot;Gravity's Rainbow&quot; in a bar.) At a material level, Pynchon's obsession with that epochal chromo-synthetic fabric, film-celluloid, might seem a little 20th century — yet, as the novel's maverick auteur Gerhardt von Göll suggests, cinema itself is but a staging post within a larger project of becoming-media: &quot;Someday, when the film is fast enough, the equipment pocket-size... then... then...&quot; The words are prophetic; you're probably reading them on a hand-held right now. Also prophetic, given Edward Snowden's recent revelations, is the warning that &quot;the Grid is wide open, all messages can be overheard.&quot; A significant portion of the world's population now lives under drones whose ­rocket-bombs, in a twist that even Pynchon's &quot;pornographies of flight&quot; didn't envisage, film as they kill. On its first page, &quot;Gravity's Rainbow&quot; seems to make a sly reference to Mann's Naphta, who claims in &quot;The Magic Mountain&quot; that terror is &quot;what our age demands.&quot; Yet perhaps the enduring power of Pynchon's version of terror is that it is ultimately an ontological, rather than contingent, condition — which is why his novel leans, even more heavily than on Melville, on Rilke, whose &quot;Duino Elegies&quot; cast godhead as something we endure because it disdains, for the moment, to annihilate us. Every angel is terrifying.\n\nThen there's the hoary old Great American Novel question: Might this be it? It seems to me the question is a red herring, since the Great American Novel (like democracy for Derrida) is something that is always and inherently to-come. But I would have no qualms about staking this book's claim to be the Great German Novel; not in the sense, obviously, of being the best novel written by a German, but rather as a work in which the historical trajectory of German literary culture — the progression through Idealism and Romanticism to Nazi-fringed ­techno-mysticism and beyond — attains both its apex and its most spectacular cloudburst. I kept thinking, as I listened to Guidall, of a line in Heidegger's &quot;Building, Dwelling, Thinking&quot; where he describes homelessness as the &quot;summons that calls mortals into their dwelling.&quot; Virtually every one of Pynchon's characters is homeless or displaced, wandering the earth's great bombed-out Zone in search of some abode: a homeland, house or simply bed to spend the night in (if you like, a coefficient). Even the novel's insects crave this: We see cockroaches trying to establish temporary dwellings in the &quot;mysterious sheaf of vectors&quot; of a straw bed even as their nibbling causes their small &quot;tenement-world&quot; to crumble. The scene is reprised later beneath a &quot;lambent, all seeing&quot; electric bulb — but first time round it plays out in the Christ-child's crib in Bethlehem, under that other annunciating star. The prevalence of cockroaches points, of course, to the writer (also Germanophone) to whom Pynchon perhaps owes most of all: Kafka. The prisoners of &quot;In the Penal Colony&quot; are strapped into a giant killing-machine that writes in code on their own skin; as they die, angelic children stationed by their side, they're meant to get a final burst of revelation — but the only subject whom we actually watch undergo the ritual is granted no such grace on his demise. The same holds true in &quot;Gravity's Rainbow.&quot; As one &quot;melanocyte&quot; (or pigment-producing skin cell) tells another in one of the novel's most surreal scenes, to which Guidall's soothing, reasoning and yet not hysteria-precluding tone seems uncannily suited: &quot;There is no such message, no such home — only the millions of last moments . . . no more. Our history is an aggregate of last moments.&quot;\n   ~  ~  ~  ~  ~\nWhat's it like to bring a classic to life? George Guidall, the expert narrator of more than 1,200 audiobooks told us about his experience recording GRAVITY'S RAINBOW. Rediscover the power of Pynchon's postmodern epic in this new audiobook recording, recently reviewed by the New York Times.\n\nWinner of the 1973 National Book Award, GRAVITY'S RAINBOW is a complex and intellectual thriller following one U.S. Army lieutenant's Faustian quest for a secret missile. This critically acclaimed bestseller covers a huge range of topics, which according to George, presented quite a challenge in the studio.\n\nNever before widely available on audiobook, this new recording provides listeners with the perfect opportunity to dive into Pynchon's classic. George says audiobooks provide an &quot;emotional immediacy&quot; that make challenging classics like GRAVITY'S RAINBOW more accessible to listeners.","torrent":{"xt":"urn:btih:1ebbef03b60d95dd0999af36e8900ae0fd49c168","amp;dn":"GRAVITY%27S+RAINBOW+-+Thomas+Pynchon+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ebbef03b60d95dd0999af36e8900ae0fd49c168","infoHashBuffer":{"type":"Buffer","data":[30,187,239,3,182,13,149,221,9,153,175,54,232,144,10,224,253,73,193,104]},"announce":[],"urlList":[]}}