{"title":"Infinite Skills Learning Microsoft Excel 2013","uid":8710789,"size":1278517099,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1ec35cd2a2a03394b4a57f22b7e29239b29a2245&amp;dn=Infinite+Skills+Learning+Microsoft+Excel+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":6,"uploader":"EliteBeast","files":-1,"time":1374232592,"description":"Duration 7.75 hours mp4\n\nn this Microsoft Excel 2013 training course, veteran trainer Guy Vaccaro takes you through the basics of the worlds most popular spreadsheet software. Excel can be a complex and confusing program to use, but Guy breaks it down into bite-sized pieces and teaches it in plain English. No prior experience in Excel or spreadsheets is required to get the most out of this Excel beginners video training.\n\nYou will start with the absolute basics, creating and saving a new workbook. Guy proceeds step by step through the process of entering data in cells, doing basic math, formatting your worksheets, setting up pages for printing and applying basic mathematical formulas. Once you are comfortable with the basics, you will move on to more advance formatting with themes, using Excel provided templates, adding graphics and charts, and using Excel as a database. You finish off with advanced formulas, and applying conditional formatting to your worksheet.\n\nBy the time you have completed this video training course for Microsoft Excel 2013, you will be comfortable with day to day operations that you would perform in this software program. You will be able to perform calculations, and create professional graphs and charts from your data. Working files are included to allow you to follow along using the same source material that the author uses throughout the lessons in this computer based training video.\n\n106 videos + project files","torrent":{"xt":"urn:btih:1ec35cd2a2a03394b4a57f22b7e29239b29a2245","amp;dn":"Infinite+Skills+Learning+Microsoft+Excel+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ec35cd2a2a03394b4a57f22b7e29239b29a2245","infoHashBuffer":{"type":"Buffer","data":[30,195,92,210,162,160,51,148,180,165,127,34,183,226,146,57,178,154,34,69]},"announce":[],"urlList":[]}}