{"title":"Haken - Restoration (2014) [EP]","uid":11272968,"size":96381339,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1f13b764df4d80811405a3500ae2420e40ce8390&amp;dn=Haken+-+Restoration+%282014%29+%5BEP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":"analogkid6103","files":4,"time":1414105067,"description":"\tHaken\n\n\n\nHaken was formed in 2007 by To-Mera guitarist and keyboardist Richard Henshall and his two school friends Ross Jennings (vocals) and Matthew Marshall (guitar).[1][2] The band completed their lineup with a keyboardist they met on an online forum, Peter Jones, and Jones' close friend and drummer Raymond Hearne, and To-Mera guitarist Thomas MacLean became the band's bassist. They recorded a demo in 2007 that contained two tracks, 'Snow' and 'Souls'. With the demo they began to play small live venues in London, with some good response. In 2008 they then recorded four more songs, 'Manifolds', 'Blind', 'Sleeping Thoughts Wake' and 'Black Seed', and released a full-length demo including all six existing tracks.\n\nLater in 2008, Marshall and Jones left the band to pursue other careers. Charlie Griffiths, the guitarist for the band Linear Sphere and Anchorhead became a full time member of the band. The keyboardist Diego Tejeida joined the band in late 2008 as well. As they began to tour more, even opening a few UK shows for King's X, Sensory Records recognized them and offered them a record deal. They began recording for their debut album, Aquarius, soon after, and it was released in March 2010.\n\nHaken released their second album, Visions, in October 2011. On 20 June 2013 Haken announced their new album, The Mountain, which was released on 2 September by InsideOut Music. The album was mixed and mastered by Jens Bogren.\n\nOn 25 September 2013, Haken announced that Tom MacLean would be leaving the band after completing the Prog Stage Festival in Israel in October 2013. After a series of auditions, he was replaced by Indiana-born musician Conner Green.\n\nOn 8 September 2014, Haken announced via their Facebook page their first EP, Restoration, set for a 27 October, 2014 release. The EP will contain three reworked tracks from their 2008 demo, Enter the 5th Dimension. Darkest Light, a reworked version of Blind, was released with a music video featuring footage from the recording process of Restoration on September 24. Shortly before, the band had already announced (also via Facebook) that they had started to write for their fourth album.\n\n\n\nBand Members\n\nRoss Jennings - vocals\nRichard Henshall - guitars and keyboards\nRaymond Hearne - drums, tuba, backing vocals\nCharles Griffiths - guitars\nDiego Tejeida - keyboards, backing vocals\nConner Green - bass guitar, backing vocals\n\n\n\nDiscography\n\nAquarius (2010)\nVisions (2011)\nThe Mountain (2013)\n\n\n\nRestoration (2014) [EP]\n\n\n\n01. Darkest Light\n02. Earthlings\n03. Crystallised\nGenre:\tProgressive\nSubgenre:\tProgressive Metal\nBitrate:\t320 k\nSize:\t91.92 MB\nShow/Hide Files: \t\n4 files","torrent":{"xt":"urn:btih:1f13b764df4d80811405a3500ae2420e40ce8390","amp;dn":"Haken+-+Restoration+%282014%29+%5BEP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f13b764df4d80811405a3500ae2420e40ce8390","infoHashBuffer":{"type":"Buffer","data":[31,19,183,100,223,77,128,129,20,5,163,80,10,226,66,14,64,206,131,144]},"announce":[],"urlList":[]}}