{"title":"Slate.Digital.FG-X.Mastering.VST.RTAS.v1.1.2-AiR","uid":8473281,"size":17672317,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1f9bebee2a4f54eca9aecb4be62caf3e2930b857&amp;dn=Slate.Digital.FG-X.Mastering.VST.RTAS.v1.1.2-AiR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":1,"uploader":"akun91","files":-1,"time":1368544098,"description":"-----------------------------------------------------------------------------------\n             Slate.Digital.FG-X.Mastering.Processor.VST.RTAS.v1.1.2-AiR\n                 --------------------------------------------------\n-----------------------------------------------------------------------------------\n-----------------------Uploaded on TPB by Akun / ABOD Studios----------------------\n               _______________________________________________________\n\n\nDescription :\n\n\n  The Concept                                                                 \n                                                                               \n   Imagine mastering your  mixes without causing  the lifeless, squashed,  and \n   over compressed sound that  has become so common  in modern music. We  have \n   all  been at  the mercy  of the  &quot;loudness wars&quot;  for over  ten years  now. \n   Masters have become louder and louder, at the expense of the music becoming \n   harsh  and lacking  punch and  dynamics. One  of the  main causes  of this  \n   epidemic is the use of the Peak Limiter to achieve increased levels in  the \n   mastering stage. Peak limiters attenuate transients and often reduce punch, \n   stereo  imaging, can  greatly alter  mix balances,  and cause  a fatiguing  \n   result to the ears.                                                         \n                                                                               \n   Some of the top  mastering engineers have found  ways to combat this  sonic \n   degradation by using techniques other  then Peak Limiting. One of  the more \n   popular techniques is the use of saturation in both the analog and  digital \n   domain. Another popular method is  clipping the front end of  expensive A/D \n   converters.                                                                 \n                                                                               \n   However, both of  these methods, while  usually more unobtrusive  then peak \n   limiting, have their downfalls. Static saturation curves are not  universal \n   in their ability to sound good on all transients. Clipping greatly  reduces \n   low  end  punch  and  is  very poor  at  retaining  sub  bass.  Both static \n   saturation  and clipping  have a  small window  of gain  maximizing before  \n   audible distortion. Enter Slate Digital.                                    \n                                                                               \n   FG-X Dynamics Rack                                                          \n                                                                               \n   Two years ago  Steven Slate and  expert algorithm engineer  Fabrice Gabriel \n   started working  out the  concept for  a digital  audio process  that could \n   increase the level of a mix without altering the punch and dynamic feel, or \n   make  the mix  sound squashed  and lifeless.  They started  by researching  \n   saturation curves and their effect on various types of transient  material. \n   After several months  of study and  hundreds of listening  tests, they made \n   some  fascinating  discoveries.  What  they found,  was  that  in  order to \n   transparently  add level  to a  mix, a  dynamic and  intelligent transient  \n   saturation system would have to be developed.                               \n                                                                               \n   New  Advanced  Algorithms were  created  to execute  the  extremely complex \n   communication  system that  would be  needed to  properly perform  the new  \n   dynamic operations. A new algorithm  was formed, and the process  was named \n   &quot;Intelligent Transient Preservation&quot;, or ITP.                               \n                                                                               \n   ITP - Intelligent Transient Preservation                                    \n                                                                               \n   The ITP  process uses  a complex  lookahead detection  algorithm to analyze \n   oncoming  transients  and  groups  of  transients.  It  then  optimizes   a \n   specialized  set  of saturation  curves  for that  specific  transient. For \n   example, if the ITP algorithm's lookahead identifies a kick drum transient, \n   it will optimize the algorithm  so that it preserves low  frequency energy. \n   For a  snare drum  transient, it  will optimize  the algorithm  to preserve \n   upper mid range punch.  The result is the  most transparent means of  level \n   maximization the industry has ever heard, with extreme transparency, and no \n   degrading artifacts common to peak limiters.                                \n                                                                               \n  \n\n                ____________________________________________________\n\n\nTested clean on a Windows 8 x64 virtual machine running with ESET Nod 32 5.2.9.1\nVirus database v.8272 (2013 04 26)\nTested crack and stability on Windows 7 x64 (on Presonus Studio One 2.5.1 32-bit)\nTime tested: + 10 hours\n\nIT WILL RUN ON BOTH Windows 64-bit and 32-bit (VST,RTAS - DAWS)\n\n\n                ____________________________________________________\n\n\n\nInstructions:\n\n\n\n     1) Unzip, Unrar and run Setup.exe \n                            \n                  2) Enjoy this fine Team AiR release !!! \n\n\n                ____________________________________________________\n\nSupport the software creators !\n\n________________\n\nPS: Help me to seed please, I have a 1 mbps bandwidth and this is the only release of Slate.Digital.FG-X.v1.1.2 on The Pirate Bay !\nPost feedback please as i'm a new uploader ! :)\n\n________________\n\nTHANKS TO TEAM AiR.\nABOD. MMXIII // FRANCE\t\t\t\t\t\t\t\t\t","torrent":{"xt":"urn:btih:1f9bebee2a4f54eca9aecb4be62caf3e2930b857","amp;dn":"Slate.Digital.FG-X.Mastering.VST.RTAS.v1.1.2-AiR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f9bebee2a4f54eca9aecb4be62caf3e2930b857","infoHashBuffer":{"type":"Buffer","data":[31,155,235,238,42,79,84,236,169,174,203,75,230,44,175,62,41,48,184,87]},"announce":[],"urlList":[]}}