{"title":"The Big Ideas That Changed the World (DK History Ebook).pdf","uid":11816959,"size":60241298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:205d53e98cb74c747e87f5ce8a42f9e0c00f799b&amp;dn=The+Big+Ideas+That+Changed+the+World+%28DK+History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"STBGD","files":1,"time":1429131005,"description":"Ideas That Changed the World\nEnglish | 2010 | ISBN: 0756665310, 1405356839 | 258 pages | PDF | 57.5 mb\n\nThe Big Ideas that Changed the World combines the quality and breadth of a modern design museum with the high standards of a DK reference title. Stunning photography and beautifully written stories work together to give the reader a unique experience. We don't just show you what's ground-breaking about a space suit, we explain its place in history and space exploration, and the other inventions it has influenced. Readers will be struck with wonder by each item and sense the excitement that so many discoveries inspire.\n\nEach subject is introduced through text and a close-up photograph. Captivating icons lead the reader further into the story behind the object and then on to a collections spread featuring similar inventions and developments that shaped the design before and afterward.\n\nSome of the incredible inventions and ideas featured are: microscope (Charles Darwin's), telescope (Isaac Newton's), antibiotics, elevators, eyeglasses, the bicycle, auto pilot, the blackboard (as used by Albert Einstein), tin cans, umbrellas, buttons, TV, satellites, submarines, Captain Cook's travel cooking implements, the wheel, cement, a volcanologist's heat-proof uniform, the first Roman coin, bar codes, the first video game, the Walkman, the first Apple computer, surf boards, film animation, and much, much more!","torrent":{"xt":"urn:btih:205d53e98cb74c747e87f5ce8a42f9e0c00f799b","amp;dn":"The+Big+Ideas+That+Changed+the+World+%28DK+History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"205d53e98cb74c747e87f5ce8a42f9e0c00f799b","infoHashBuffer":{"type":"Buffer","data":[32,93,83,233,140,183,76,116,126,135,245,206,138,66,249,224,192,15,121,155]},"announce":[],"urlList":[]}}