{"title":"The Complete Home Guide to Herbs, Natural Healing and Nutrition ","uid":9672307,"size":1529167,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:209f3cc00ce3c464642e3c534b8b42b2f536684c&amp;dn=The+Complete+Home+Guide+to+Herbs%2C+Natural+Healing+and+Nutrition+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":0,"uploader":"AtomTPB","files":1,"time":1393488372,"description":"Pages: 288 pages\nPublished: January 13, 2004\nLanguage: English\nISBN-10: 1580911455\nISBN-13: 978-1580911450\nFormat: PDF\n\nEchinacea and gingko biloba are well-known herbal remedies for common ailments such as colds and memory loss. But the vast majority of herbal aids are underused as treatments or preventatives for everything from insomnia to arthritis to heart disease. In THE COMPLETE HOME GUIDE TO HERBS, NATURAL HEALTH, AND NUTRITION, herbal practitioner Jill Rosemary Davies explains how to promote good health by understanding the body and how it is affected by a wide range of healing plants. She teaches you how to use herbs as potent tools for natural healing as well as how to combine them with nutrition and exercise for a healthy lifestyle. Additionally, you'll find:\n\nSections on cleansings, immunity, life stages, and body systems; a complete A to Z of diseases and treatments; and a section on first aid. Instructions for making your own herbal teas, decoctions, tinctures, ointments, oils, and more.\n\nAnd because the herbs used in this book are widely available in health food stores, drug stores, and grocery stores-some you'll even find growing in your own backyard-incorporating a greater range of beneficial herbs into your life will be all the more simple. Open the book to any page and you'll feel like you've stumbled upon Mother Nature's best-kept secrets.","torrent":{"xt":"urn:btih:209f3cc00ce3c464642e3c534b8b42b2f536684c","amp;dn":"The+Complete+Home+Guide+to+Herbs%2C+Natural+Healing+and+Nutrition+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"209f3cc00ce3c464642e3c534b8b42b2f536684c","infoHashBuffer":{"type":"Buffer","data":[32,159,60,192,12,227,196,100,100,46,60,83,75,139,66,178,245,54,104,76]},"announce":[],"urlList":[]}}