{"title":"Exxxtrasmall - Jasmine Summers (Small Girl Makes Big Moves) NEW","uid":15785755,"size":605232314,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:20fc6b6cce85fade18d2c93f45926aaad98cad7c&amp;dn=Exxxtrasmall+-+Jasmine+Summers+%28Small+Girl+Makes+Big+Moves%29+NEW+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":10,"uploader":"xxxlavalxxx","files":2,"time":1473320902,"description":"The oh so small Jasmine is looking to flex her dance skills and become a music video star! Too bad things got off to a bumpy start. She knocked on the door to enter the house where she would audition, but the director didnt see her. She was so tiny he had no idea she was there, Until she alerted him. That shit was kind of funny. Shes only four feet and ten inches tall, not the usual build for girls in his videos, but Richie is still willing to give her a shot. Turns out besides her dancing skills, Jasmine did not fit any of the requirements or qualifications to be in this video, plus Richie thought she would be overshadowed by the taller girls. This is when the minute Jasmine had to pull out the big guns. She pulled out her cocksucking and dick riding skills to persuade Richie she would fit right in. After having her tight little body bounce all over his hefty cock, Richie not only crowned her with a hot spritz of semen, but also a one time music video contract! That just goes to show, sometimes its not about how tall you stand, but more about how much dick you can squeeze into your tight little slit.\r\nTags: 18 Year, Black Hair, Blowjob, Cute, Deepthroat, Facial, Girl Next Door, Hardcore, Latina, Petite, POV, Spanish, Straight, Tattoos, Teen\r\n \nhttp://imgdone.com/viewer.php?file=31026531990663367078.jpg\r\n \nhttp://imgdone.com/viewer.php?file=26391842771131497193.jpg","torrent":{"xt":"urn:btih:20fc6b6cce85fade18d2c93f45926aaad98cad7c","amp;dn":"Exxxtrasmall+-+Jasmine+Summers+%28Small+Girl+Makes+Big+Moves%29+NEW+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20fc6b6cce85fade18d2c93f45926aaad98cad7c","infoHashBuffer":{"type":"Buffer","data":[32,252,107,108,206,133,250,222,24,210,201,63,69,146,106,170,217,140,173,124]},"announce":[],"urlList":[]}}