{"title":"Maus: A Survivor's Tale","uid":4373437,"size":93056121,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:213fcc8fb472340bee47733a85d5298d48645268&amp;dn=Maus%3A+A+Survivor%5C%27s+Tale&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":0,"uploader":"Koz152","files":-1,"time":1220288682,"description":" &lt;a href=&quot;http://en.wikipedia.org/wiki/Maus&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://en.wikipedia.org/wiki/Maus&lt;/a&gt;\n\nThe book alternates the stories told by Spiegelman&amp;#039;s father Vladek Spiegelman about life in Poland before and during the Second World War with the contemporary life of Art, Vladek and their loved ones in the Rego Park neighborhood of New York City. The book recounts the struggle of Vladek Spiegelman living with his family in Radomsko, CzÃ„â„¢stochowa, Sosnowiec and Bielsko in the late 1930s and his tragic odyssey during the war which ultimately led him to Auschwitz as prisoner 175113.\nThe book has a satirical feel about it since the characters are all presented as various types of anthropomorphic animals, according to nationality or race.\nThroughout the book, Art Spiegelman confronts his complex and often conflicted relationship with his father. For example, Vladek exhibits racial prejudice against blacks despite his own experiences of anti-Semitism. He is also presented as stingy and a person who makes life very difficult for those around him, including his first wife Anja (Art&amp;#039;s mother, who committed suicide) and his second wife Mala, both concentration camp survivors. The personality of the present day Vladek seems quite different from that of the man in the concentration camps, where he was resourceful and compassionate.\n","torrent":{"xt":"urn:btih:213fcc8fb472340bee47733a85d5298d48645268","amp;dn":"Maus%3A+A+Survivor%5C%27s+Tale","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"213fcc8fb472340bee47733a85d5298d48645268","infoHashBuffer":{"type":"Buffer","data":[33,63,204,143,180,114,52,11,238,71,115,58,133,213,41,141,72,100,82,104]},"announce":[],"urlList":[]}}