{"title":"Garth Marenghi's Darkplace - DVD rip - XviD - with extras","uid":4692361,"size":1938895954,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:223b974153730b8cdac7c35dfb324c2875d37e57&amp;dn=Garth+Marenghi%5C%27s+Darkplace+-+DVD+rip+-+XviD+-+with+extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":3,"uploader":"AgnostikRU","files":39,"time":1233436580,"description":"Title: Garth Marenghi's Darkplace\nCountry Of Origin: United Kingdom\nType: TV series\nGenre: Comedy, Horror, Sci-Fi\nProduction Year: 2004\nSeasons: 1\nEpisodes: 6\nDirector: Richard Ayoade\nStarring: Matthew Holness, Matt Berry, Alice Lowe, Richard Ayoade\nRunning Time: ~25 minutes/episode\nIMDb: http://www.imdb.com/title/tt0397150/\nIMDb rating: 9.2/10\n\nSource: DVD9, PAL\nTools: DVDFab 5, AutoGK 2.45\nCodec: XviD\nResolution: 640x480\nAudio: 128 kbps, VBR\nLanguage: English\nSubtitles: English, external\nExtras:\n- Darkplace Illuminatum (interview)\n- Misc. Horrificata Illuminata (more interview)\n- Pam's Home Movies (shot on set)\n- My Storyboards (a storyboard from ep. 1)\n- The One Scene I Cut (deleted scene from ep. 5)\n- Test Footage (alternative take from ep. 2 - Dean didn't like his hair :) )\n- Easter Egg\n\nGarth Marenghi's Darkplace is a comedy series, released in 2004, that lampoons 1980s television drama, particularly horror, sci-fi, and &quot;the rampant egotism of self-appointed 'mastermind' authors.&quot; The show presents Garth Marenghi's Darkplace as though it were a real, low-budget television series, produced in the 1980s, and now getting its first screening; this hoax is the basis of the show's fictional frame. Darkplace's fictional show-within-a-show includes deliberately poor production and special effects, sub-par acting, and storylines that are &quot;severely flawed and open-ended&quot;, this is interspersed with 'present-day interviews' with the 'cast'.\n\nThe series' fictional premise is that some time in the 1980s, best-selling horror author Garth Marenghi and his publisher/publicist, Dean Learner, made their own low-budget television series with a single intent: &quot;to change the evolutionary course of Man over a series of half-hour episodes.&quot; Set in Darkplace Hospital, &quot;over the very gates of Hell,&quot; in Romford, East London, Garth Marenghi's Darkplace shows the adventures of Dr. Rick Dagless, M.D., as he fights the forces of darkness while simultaneously coping with the pressures of day to day admin. Within this fictional context, Marenghi wrote 63 teleplays from which 50 shows were produced; however, Channel 4 was eventually forced to reject the show due to its &quot;radicality.&quot; Though, Marenghi also cites possible government suppression: &quot;MI8, which is actually three levels above MI6, pulled the plug. And they did it because I knew the truth.&quot;\n\nThe show's music soundtrack parodies the same subjects as the writing, and gained its composer Andrew Hewitt a B.A.F.T.A. Nomination as Best New Composer for Film and T.V.\n\n************************\n\nNotes:\n- I've included all extras that had any video, except the colour bars. The soundtrack is not included.\n- If you're using a good media player (such as GOMplayer), you don't have to unrar the subtitles, they will be extracted automatically.\n\nPLEASE NOTE: I cannot seed 24/7 and sometimes have connection issues, so please be patient. I will seed as fast as I can, as often as I can. Enjoy!","torrent":{"xt":"urn:btih:223b974153730b8cdac7c35dfb324c2875d37e57","amp;dn":"Garth+Marenghi%5C%27s+Darkplace+-+DVD+rip+-+XviD+-+with+extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"223b974153730b8cdac7c35dfb324c2875d37e57","infoHashBuffer":{"type":"Buffer","data":[34,59,151,65,83,115,11,140,218,199,195,93,251,50,76,40,117,211,126,87]},"announce":[],"urlList":[]}}