{"title":"Dictionary of Oil and Gas Production - Clifford Jones","uid":15885928,"size":4239464,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22a952ced35b32e532ad4d8e89f2f00032c2cb20&amp;dn=Dictionary+of+Oil+and+Gas+Production+-+Clifford+Jones&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":3,"uploader":"clouderone","files":1,"time":1474654540,"description":"Dictionary of Oil and Gas Production - Clifford Jones (Whittles, 2012).pdf\r\n\r\nThis dictionary provides a synthesis of information currently available but only in a diverse array of sources. Through judicious choice and careful scrutiny, the author has gathered together a very handy ready-reference in the same style as his companion volumes, Dictionary of Energy and Fuels and Dictionary of Fire Protection Engineering.\r\n\r\nAlthough the material covered is diverse, particular entries are focused and linked with each other so as to provide a good degree of comprehensiveness. For example, there is much information on well engineering including example calculations, and this is linked to wells at particular oil fields. There is also much on offshore production and again principles are linked, often by calculation, with particular offshore production platforms.\r\n\r\nThe North Sea features, but not exclusively, and the vast bulk of the information presented is relevant to all locations. Commercial products, including those for oil well maintenance, are featured and information on the web from suppliers is expanded by drawing on the physics and chemistry of how such products work","torrent":{"xt":"urn:btih:22a952ced35b32e532ad4d8e89f2f00032c2cb20","amp;dn":"Dictionary+of+Oil+and+Gas+Production+-+Clifford+Jones","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22a952ced35b32e532ad4d8e89f2f00032c2cb20","infoHashBuffer":{"type":"Buffer","data":[34,169,82,206,211,91,50,229,50,173,77,142,137,242,240,0,50,194,203,32]},"announce":[],"urlList":[]}}