{"title":"Modern Architecture in Latin America (Art Ebook).pdf","uid":15875019,"size":50782614,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22f9cd641d2b6411067d8f6763c0f63c267e1cf2&amp;dn=Modern+Architecture+in+Latin+America+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"STBGD","files":1,"time":1474492404,"description":"Modern Architecture in Latin America: Art, Technology, and Utopia\r\n2015 | 0292762976 | English | 424 pages | PDF | 48 MB\r\n\r\nModern Architecture in Latin America: Art, Technology, and Utopia is an introductory text on the issues, polemics, and works that represent the complex processes of political, economic, and cultural modernization in the twentieth century. The number and types of projects varied greatly from country to country, but, as a whole, the region produced a significant body of architecture that has never before been presented in a single volume in any language. Modern Architecture in Latin America is the first comprehensive history of this important production.\r\n\r\nDesigned as a survey and focused on key examples/paradigms arranged chronologically from 1903 to 2003, this volume covers a myriad of countries; historical, social, and political conditions; and projects/developments that range from small houses to urban plans to architectural movements. The book is structured so that it can be read in a variety of ways—as a historically developed narrative of modern architecture in Latin America, as a country-specific chronology, or as a treatment of traditions centered on issues of art, technology, or utopia. This structure allows readers to see the development of multiple and parallel branches/historical strands of architecture and, at times, their interconnections across countries. The authors provide a critical evaluation of the movements presented in relationship to their overall goals and architectural transformations","torrent":{"xt":"urn:btih:22f9cd641d2b6411067d8f6763c0f63c267e1cf2","amp;dn":"Modern+Architecture+in+Latin+America+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22f9cd641d2b6411067d8f6763c0f63c267e1cf2","infoHashBuffer":{"type":"Buffer","data":[34,249,205,100,29,43,100,17,6,125,143,103,99,192,246,60,38,126,28,242]},"announce":[],"urlList":[]}}