{"title":"NextUp TextAloud 3.0.93 + Serial Keys [SadeemPC].zip","uid":14543338,"size":23181100,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2353d4dfc112026410bccd66e4f8da0a5d540948&amp;dn=NextUp+TextAloud+3.0.93+%2B+Serial+Keys+%5BSadeemPC%5D.zip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":0,"uploader":"SadeemPC","files":1,"time":1462547405,"description":"NextUp TextAloud 3.0.93\r\n\r\nConvert any text into voice and MP3 for PC or download to MP3 player. TextAloud is the leading text to speech program, available with exciting premium voices (including several languages) from ATT, Cepstral and NeoSpeech for the best in computer speech for your PC. TextAloud uses voice synthesis to convert text into spoken audio. TextAloud reads text from email, web pages, reports and more, aloud on your PC. TextAloud can also save your daily reading to MP3 or Windows Media files ready for playback on your iPod, PocketPC, or even on your TV with Tivo's Home Media Option. \r\n\r\nWhat you can do with TextAloud:\r\n• Sit back and relax while your PC reads to you\r\n• Save text to MP3 for portable audio players\r\n• Proofread your own writing\r\n• Listen to that report while you're on the treadmill\r\n• Find help for someone with a reading disability\r\n• Create messages for your answering machine\r\n• Reduce eye strain from too much reading\r\n• Listen to information while you work on something else\r\n• Take some reading along for your daily walk or run\r\n• Turn your iPod into a tax write-off\r\n• Listen to an eBook during your commute\r\n• Study English as a Second Language\r\n• Help a senior citizen or someone with low vision\r\n• Add some spice to your PowerPoint presentations\r\n• Find a great new tool to study for exams\r\n• Listen to text read in other languages\r\n• Amuse your kids by letting your PC read stories to them\r\n• Create audio files for computer games\r\n• Prepare for a big speech by hearing your words read aloud\r\n\r\nFeatures at a glance:\r\n• Single-Article and Multi-Article Mode for listening to articles one at a time, or building a playlist to listen to later.\r\n• Load articles using the Clipboard, Document Import, Hot Keys and Drag and Drop.\r\n• Support for Word, PDF and HTML documents.\r\n• Support for multiple Text-To-Speech engines, including international voices.\r\n• Support for WAV, MP3 and WMA audio files.\r\n• Proofread tool for listening to documents as you proofread.\r\n• Plugin toolbar for Internet Explorer to listen to web pages.\r\n\r\nWhats New:\r\nUpdated spell check component and American English dictionary\r\nFixed problem with losing tray icon\r\nError handling improvements related to writing audio files","torrent":{"xt":"urn:btih:2353d4dfc112026410bccd66e4f8da0a5d540948","amp;dn":"NextUp+TextAloud+3.0.93+%2B+Serial+Keys+%5BSadeemPC%5D.zip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2353d4dfc112026410bccd66e4f8da0a5d540948","infoHashBuffer":{"type":"Buffer","data":[35,83,212,223,193,18,2,100,16,188,205,102,228,248,218,10,93,84,9,72]},"announce":[],"urlList":[]}}