{"title":"The Truth About Tesla: The Myth of the Lone Genius in the Histor","uid":15791975,"size":37541746,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23a8546fe15c8a0d4c1ffb91f0ed6cfbd0cf4530&amp;dn=The+Truth+About+Tesla%3A+The+Myth+of+the+Lone+Genius+in+the+Histor&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":1,"uploader":"marty14","files":1,"time":1473389428,"description":"\nChristopher Cooper, &quot;The Truth About Tesla: The Myth of the Lone Genius in the History of Innovation&quot;\r\nEnglish | ISBN: 1631060309 | 2015 | True PDF | 200 pages | 35.8 MB\r\n\r\nEverything you think you know about Nikola Tesla is wrong.\r\n\r\nNikola Tesla was one of the greatest electrical inventors who ever lived. For years, the engineering genius was relegated to relative obscurity, his contributions to humanity (we are told) obscured by a number of nineteenth-century inventors and industrialists who took credit for his work or stole his patents outright. In recent years, the historical record has been &quot;corrected&quot; and Tesla has been restored to his rightful place among historical luminaries like Thomas Edison, George Westinghouse, and Gugliemo Marconi.\r\n\r\nMost biographies repeat the familiar account of Tesla's life, including his invention of alternating current, his falling out with Edison, how he lost billions in patent royalties to Westinghouse, and his fight to prove that Marconi stole 13 of his patents to &quot;invent&quot; radio. But, what really happened?\r\n\r\nConsider this: Everything you think you know about Nikola Tesla is wrong. Newly uncovered information proves that the popular account of Tesla's life is itself very flawed. In The Truth About Tesla, Christopher Cooper sets out to prove that the conventional story not only oversimplifies history, it denies credit to some of the true inventors behind many of the groundbreaking technologies now attributed to Tesla and perpetuates a misunderstanding about the process of innovation itself.\r\n\r\nAre you positive that Alexander Graham Bell invented the telephone? Are you sure the Wright Brothers were the first in flight? Think again! With a provocative foreward by Tesla biographer Marc. J. Seifer, The Truth About Tesla is one of the first books to set the record straight, tracing the origin of some of the greatest electrical inventions to a coterie of colorful characters that conventional history has all but forgotten","torrent":{"xt":"urn:btih:23a8546fe15c8a0d4c1ffb91f0ed6cfbd0cf4530","amp;dn":"The+Truth+About+Tesla%3A+The+Myth+of+the+Lone+Genius+in+the+Histor","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23a8546fe15c8a0d4c1ffb91f0ed6cfbd0cf4530","infoHashBuffer":{"type":"Buffer","data":[35,168,84,111,225,92,138,13,76,31,251,145,240,237,108,251,208,207,69,48]},"announce":[],"urlList":[]}}