{"title":"Matilda The Musical (Original Cast Recording) OST","uid":6892711,"size":99063150,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:23b609939ba9bacdf94f71b14fdc8610e55995f2&amp;dn=Matilda+The+Musical+%28Original+Cast+Recording%29+OST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":0,"uploader":"ole.elias","files":17,"time":1324077288,"description":"The amazing music by Tim Minchin performed by the original London Cast of Matilda The Musical.\n\nThe best thing running in London, I can not recommend going to the show itself enough.\n\n\n\n\nSome information from matildathemusical.com :\n\nFollowing a sensational sell-out season at The Courtyard Theatre, the RSC's production of MATILDA THE MUSICAL has transfered to London's West End.\n\nRoald Dahl's much-loved story bursts into life on stage in this brand new musical version by Dennis Kelly and award-winning musician and comedian Tim Minchin. Children and adults alike will be thrilled and delighted by the story of the special little girl with an extraordinary imagination.\n\nThe production is directed by Matthew Warchus and designed by Rob Howell with choreography by Peter Darling, lighting by Hugh Vanstone, musical supervision and orchestration by Christopher Nightingale, sound by Simon Baker and special effects and illusions are by Paul Kieve. The entire creative team will reassemble to create the London production.\n\nBertie Carvel (Miss Trunchbull), Paul Kaye (Mr Wormwood), Josie Walker (Mrs Wormwood) and Lauren Ward (Miss Honey) will reprise their roles alongside original cast members Marc Antolin, Verity Bentham, Peter Howe, Michael Kent, Melanie La Barrie, Matthew Malthouse, Alastair Parker, Nick Searle and Emily Shaw. Further adult casting includes: Matthew Clark, Leanne Pinder, Rachel Moran, Lucy Thatcher, Tim Walton and Gary Watson.\n\nThe three teams of eight young performers who recreate the roles of Bruce, Lavender, Amanda, Nigel, Eric and the other pupils at Crunchem Hall Primary School are: Thomas Atkinson, Jake Bailey, James Beesley, Ruby Bridle, Oonagh Cox, Jemima Eaton, Alicia Gould, Zachary Harris, Callum Henderson, Fleur Houdijk, Jamie Kaye, William Keeler, Lily Laight, Katie Lee, Isobelle Molloy, Jemima Morgan, Toby Murray, Alfie Manser, Lucy May Pollard, Annabel Parsons, Ellie Simons, Louis Suc, Jaydon Vijn and Ted Wilson.\n\nThe role of Matilda is shared by: Eleanor Worthington Cox, Cleo Demetriou, Kerry Ingram and Sophia Kiely!\n\n\n\nEnjoy!\n\n\nx Elias","torrent":{"xt":"urn:btih:23b609939ba9bacdf94f71b14fdc8610e55995f2","amp;dn":"Matilda+The+Musical+%28Original+Cast+Recording%29+OST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23b609939ba9bacdf94f71b14fdc8610e55995f2","infoHashBuffer":{"type":"Buffer","data":[35,182,9,147,155,169,186,205,249,79,113,177,79,220,134,16,229,89,149,242]},"announce":[],"urlList":[]}}