{"title":"Velvet Revolver - Contraband (2004) [CD Rip] vtwin88cube","uid":6171305,"size":138704807,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2584b9b90a786351aae4bbd5cd2d876172755cc9&amp;dn=Velvet+Revolver+-+Contraband+%282004%29+%5BCD+Rip%5D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":3,"uploader":"vtwin88cube","files":-1,"time":1297593290,"description":"Velvet Revolver\nContraband (2004)\n\nVelvet Revolver began with a spring 2002 jam session that reunited ex-Guns N' Roses bandmates Slash (guitar), Duff McKagan (bass), and Matt Sorum (drums) on-stage. With the discovery that their chemistry was still going strong, the trio began pushing around some new music and auditioning singers for what became known as &quot;the Project.&quot; Early entries included ex-Buckcherry shouter Josh Todd and Neurotica's Kelly Shaefer; both became acquainted with the cutting room floor. By early 2003, the existence of &quot;the Project&quot; -- and its quest for a singer -- was common knowledge, so much so that VH1 sent cameras to document the search. Dave Kushner (Wasted Youth, Dave Navarro) also joined up as second guitarist. Troubled STP-er Scott Weiland came on board next. He and the band clicked immediately and recorded a hyper piece of glitter metal for the Hulk soundtrack called &quot;Set Me Free.&quot; By June, &quot;the Project&quot; had been renamed Velvet Revolver, and Weiland was officially made its lead singer, though possession charges stemming from a May bust were still outstanding. The band signed a deal with RCA and spent the rest of 2003 fitting in gigs and recording sessions around Weiland's court-ordered rehab. RCA next announced an April 2004 release for Contraband, Velvet Revolver's full-length debut; the date was then pushed to May, and finally to June. That spring, Weiland labored through court dates and recovery as Slash and Duff did advance press for Contraband, and fan anticipation for the album grew. VR also released the single &quot;Slither,&quot; a rabid, ambitious rocker guided by Slash's signature guitar sound. The single sidled steadily up the active rock charts, and when Contraband finally dropped, it was to general appreciation for its mix of STP and GNR signatures and its surprising turn toward hedonistic maturity. Velvet Revolver's sophomore effort, Libertad, followed in 2007. \n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nSource:\t\t\tRetail CD\nGenre:\t\t\tRock\nM3U Playlist:\t\tYes\n\n01.Sucker Train Blues\n02.Do It For The Kids\n03.Big Machine\n04.Illegal I Song\n05.Spectacle\n06.Fall To Pieces\n07.Headspace\n08.Superhuman\n09.Set Me Free\n10.You Got No Right\n11.Slither\n12.Dirty Little Thing\n13.Loving The Alien\n\n\nIt's another clean &amp; crisp CD rip. Enjoy!\n","torrent":{"xt":"urn:btih:2584b9b90a786351aae4bbd5cd2d876172755cc9","amp;dn":"Velvet+Revolver+-+Contraband+%282004%29+%5BCD+Rip%5D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2584b9b90a786351aae4bbd5cd2d876172755cc9","infoHashBuffer":{"type":"Buffer","data":[37,132,185,185,10,120,99,81,170,228,187,213,205,45,135,97,114,117,92,201]},"announce":[],"urlList":[]}}