{"title":"Carole King - Tapestry (1971) [Rock Pop][mp3 320][h33t][schon55]","uid":4991532,"size":124549872,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:25d4c8a8de6c8f4682dad5ea5742530851f377dc&amp;dn=Carole+King+-+Tapestry+%281971%29+%5BRock+Pop%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":2,"uploader":"schon55","files":22,"time":1247072036,"description":"Carole King - Tapestry \nAudio CD \nRelease Date  May 25, 1999 \nLabel: Sony \nBitrate: 320 kbps\n\nSo what if this album was released in 1971. . .  it is still Music At It's Best in everyone's ears.  The landmark album for singer/songwriter Carole King and one of the best recordings in music business ever.  I know a lot of artists that would love to have an album like that in their repertoire, this is kind of a greatest hits package in my humble opinion.  I am posting the remastered version of the original album with some bonus-unreleased tracks. \n\nAmazon. com essential recording\nCarole King was famous as a writer of girl-group hits in the '60s.  In 1971, she became more famous.  That's the year Tapestry became one of the biggest-selling LPs of all time.  It's easy to hear why--the music is loose, earthy, L. A.  session-pop.  King is casual, intimate, and tough; she covers all the emotional ground of the post-liberated woman with ease.  She brings adult nuance to &quot;Will You Still Love Me Tomorrow?&quot; and comes up with hits ( &quot;It's Too Late,&quot; &quot;I Feel the Earth Move&quot; ) whose white-soul realism and maturity put pop hits to shame.  ~ Steve Tignor\n\nThis was a beautiful album when I first heard it in 1971.  It is a beautiful CD when I listen to it today.  Tapestry marked Carole King's transition from remarkable &quot;Tin-Pan Alley' pop song-writer for the likes of Neil Sedaka, the Shirelles (who I think originally recorded Will You Love Me Tomorrow) and others to a singer/performer of the first rank.  The album exploded in 1971, no small feat when you consider that 1971 may have seen the culmination in the evolution of the album from a compilation of inidvidual hits into a set-piece that was best served whole.  The evolution began with Sgt.  Pepper and Pet Sounds and went on from there.  The growth of FM radio was fueled in part by the ability of those stations to play entire albums at a time.  Similarly, the fact that FM stations would play whole sides of album encouraged musicians to create albums that were more than just a series of unrelated songs.  But I digress .  .  . \nThere is a two-fold beauty gained from listening to Tapestry today.  The first is the nostalgic pleasure gained from listening again to beautiful words set perfectly to music.  This pleasure is probably limited to those of us, of a certain age, who cut their musical teeth on the music of the 60s and early 70s.  The second is the pleasure anyone, no matter their age, can get from listening to the combination of lyrics and music that is Tapestry.  \n\nIf the definition of a classic is a piece of work that survives and propsers over time, then Tapestry is a classic.  ~ Leonard Fleisig &quot;Len&quot; \n\nPersonnel:\nRuss Kunkel - drums\nDavid Campbell - viola\nCarole King - vocals, guitar, piano, keyboards\nJulia Tillman - background vocals\nCurtis Amy - soprano, tenor &amp; baritone saxophones, flute\nDanny Kootch - guitar, congas\nRalph Schuckett - electric piano\nCharles Larkey - electric &amp; acoustic basses\nJoel O'Brien\nTerry King - cello\nBarry Socher - violin\nPerry Steinberg - acoustic bass\n\nCarole King - Tapestry Tracks:\n01  I Feel The Earth Move \n02  So Far Away \n03  It's Too Late \n04  Home Again \n05  Beautiful \n06  Way Over Yonder \n07  You've Got A Friend \n08  Where You Lead \n09  Will You Love Me Tomorrow? \n10  Smackwater Jack \n11  Tapestry \n12  (You Make Me Feel Like) A Natural Woman \n13  Out In The Cold - (bonus track, previously unreleased) \n14  Smackwater Jack - (bonus track, previously unreleased, live)","torrent":{"xt":"urn:btih:25d4c8a8de6c8f4682dad5ea5742530851f377dc","amp;dn":"Carole+King+-+Tapestry+%281971%29+%5BRock+Pop%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25d4c8a8de6c8f4682dad5ea5742530851f377dc","infoHashBuffer":{"type":"Buffer","data":[37,212,200,168,222,108,143,70,130,218,213,234,87,66,83,8,81,243,119,220]},"announce":[],"urlList":[]}}