{"title":"The Hitler Legacy: The Nazi Cult in Diaspora","uid":16033557,"size":4130843,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25f7dfa9703675535ceea617a95e0e7c20180126&amp;dn=The+Hitler+Legacy%3A+The+Nazi+Cult+in+Diaspora&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":4,"uploader":"marty14","files":1,"time":1476454134,"description":"The Hitler Legacy: The Nazi Cult in Diaspora - Peter Levenda [epub]\r\n\r\nMore than thirty years after his first investigation of the Nazi underground Peter Levenda has returned again and again to his quest for the truth about the true character of the Nazi cult and the people and political movements it has influenced in the decades since the end of World War II.\r\n\r\nThe wide sweep of this investigation moves from a Ku Klux Klan headquarters in Reading, Pennsylvania to the New York City office of the Palestine Liberation Organization; from the apartment of a notorious neo-Nazi leader to an Islamic boarding school - headquarters of the man who ordered the Bali Bombings. When Levenda uncovered the existence of a Nazi underworld in Asia, the nexus of religion, politics, terrorism and occult beliefs was revealed to be the real domain of the threat to global security.\r\n\r\nMeticulously researched--from both archival material and declassified intelligence agency files, to personal interviews and investigations undertaken in Asia, Europe and Latin America - The Hitler Legacy is the story of how the mistakes of the 20th century have come home to roost in the 21st.\r\n\r\nThis book will challenge the conventional thinking about such subjects as the Muslim Brotherhood and Islamist terrorism and even about the alleged death of one of history's most infamous killers - Adolf Hitler","torrent":{"xt":"urn:btih:25f7dfa9703675535ceea617a95e0e7c20180126","amp;dn":"The+Hitler+Legacy%3A+The+Nazi+Cult+in+Diaspora","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25f7dfa9703675535ceea617a95e0e7c20180126","infoHashBuffer":{"type":"Buffer","data":[37,247,223,169,112,54,117,83,92,238,166,23,169,94,14,124,32,24,1,38]},"announce":[],"urlList":[]}}