{"title":"War and Peace (Penguin Classics) - Leo Tolstoy","uid":9288652,"size":1687470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26445ff0c8cdf6da60919b6a9eb959c3606f1f0f&amp;dn=War+and+Peace+%28Penguin+Classics%29+-+Leo+Tolstoy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":2,"uploader":"ZamKhan","files":-1,"time":1386056960,"description":"British scholar Briggs unveils his lucid new translation of Tolstoy's masterpiece-the first in almost 40 years-to a slightly anxious audience, from first-timers who, balking at the amount of time required by this massive yet startlingly intricate work, want to ensure they are reading the best translation available, to purists who worry that clunky modern prose will replace the cadences of earlier translations. But these concerns melt away after the first 100 pages of this volume. Briggs's descriptions are crisper and the dialogue is sharper, with fewer &quot;shall's,&quot; &quot;shan't's&quot; and &quot;I say!'s&quot; than the Garnett, Maude, or Edmonds translations, leaving readers free to enjoy the rich and complex plot, vivid characters and profound insights into war and the nature of power. There are some awkward spots: Briggs claims his earthy rendering of soldierly banter is more realistic than earlier, genteel translators', but it reads distractingly stagy: &quot;Give 'im a right thumpin', we did.&quot; It's also a shame to have lost Tolstoy's use of French, not only in the mouths of his characters, but also in the essays, as when he plays with Napoleon's famous &quot;sublime to the ridiculous&quot; quote. Briggs will face competition next year when Pevear and Volokhonsky release their new translation, but for now, this is the most readable translation on the market.","torrent":{"xt":"urn:btih:26445ff0c8cdf6da60919b6a9eb959c3606f1f0f","amp;dn":"War+and+Peace+%28Penguin+Classics%29+-+Leo+Tolstoy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26445ff0c8cdf6da60919b6a9eb959c3606f1f0f","infoHashBuffer":{"type":"Buffer","data":[38,68,95,240,200,205,246,218,96,145,155,106,158,185,89,195,96,111,31,15]},"announce":[],"urlList":[]}}