{"title":"A History of Britain volume 1: 3000 BC - 1603 AD","uid":15789117,"size":3419766,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26a8591e293c3c35b2f867021f80d3f34b7e31f3&amp;dn=A+History+of+Britain+volume+1%3A+3000+BC+-+1603+AD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"marty14","files":1,"time":1473368308,"description":"A History of Britain volume 1: At the Edge of the World, 3000 BC–AD 1603 - Simon Schama [epub]\r\n\r\nWhat do you get when you combine the resources and ethos of the BBC with the literary panache of one of the world's best narrative historians? The answer is Simon Schama's A History of Britain, the first volume of which accompanies the BBC-History Channel series of the same name. In a beautifully written and thoughtfully crafted book, studded with striking portraits, pictures, and maps, Schama, the bestselling author of books on European cultural history such as The Embarrassment of Riches and Citizens, as well as 1999's Rembrandt's Eyes, has managed to be both conventional and provocative.\r\n\r\nHe tells the official version of Britain's island story - from Roman Britain, through the Norman conquest, the struggles of the Henrys and Richards with their barons and clerics, Edward I and the subjugation of Wales, King Death (the plague), and on to the Henrician reformation, before closing with the remarkable reign of the virgin queen, Elizabeth I. But, while sticking to a script familiar to anyone who sat up and listened in history lessons at school, Schama brings it all alive, with memorable prose - Simon de Montfort's rebel parliament is described as inaugurating the &quot;union between patriotism and insubordination&quot;; with Henry VIII, Schama says, &quot;you could practically smell the testosterone.&quot; And with fine sensitivity, too, particularly on the symbolism of buildings, memorials, language, and ceremonies, and on the complex relations between England and her Celtic and Catholic neighbors. If history must have gloss, then let it be written and presented like this","torrent":{"xt":"urn:btih:26a8591e293c3c35b2f867021f80d3f34b7e31f3","amp;dn":"A+History+of+Britain+volume+1%3A+3000+BC+-+1603+AD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26a8591e293c3c35b2f867021f80d3f34b7e31f3","infoHashBuffer":{"type":"Buffer","data":[38,168,89,30,41,60,60,53,178,248,103,2,31,128,211,243,75,126,49,243]},"announce":[],"urlList":[]}}