{"title":"Hardtied--Stolen Breath  Violet Monroe  London River High","uid":16017737,"size":2356938560,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:26d00ea640ce75f8115151d7f059317eaf6abb05&amp;dn=Hardtied--Stolen+Breath++Violet+Monroe++London+River+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":26,"uploader":"merzedes","files":1,"time":1476313862,"description":"\nStolen Breath | Violet Monroe | London River\r\n\r\nOctober 12, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nViolet Monroe is a pretty promiscuous girl, she definitely gets around, but her whole life she's only ever been with boys. This didn't seem like a real issue to her until she found herself tied to a chair face to face with London River, a sexy dominatrix and one of the toughest handlers in all of BDSM. Now London is set on proving to Violet that girls have more fun just playing with each other than inviting boys along for the ride. Violet isn't so sure, but she's open to convincing.\r\n\r\nWhile Violet is tied up to the chair, London starts off by twisting and pulling at her nipples, getting little squeaks and shrieks out of her as she does. London cuts off the sexy little dress Violet wore for her and pinches and twists even harder. Then, with Violet's body exposed, London reaches her hand between Violet's legs and starts playing with her pussy. Violet loves that, but not as much as she loves when London pulls out the hitachi and starts vibrating her clit. She can feel the vibrations coursing through her whole body.\r\n\r\nLondon moves Violet so that she is bent over a large wooden box, her wrists and ankles tied in place with rope so that her legs are spread. She can't even move enough to squirm around when London puts the hitachi back on her pussy and turns it to high power. Then London decides to turn up the pressure even more. She takes out a black dildo and, after smacking Violet's ass with it a few times, starts fucking her with it while the vibrator is still on. Violet cries out in pleasure and tries to writhe but it's no use. She's stuck in place. \r\n \r\nScreens \nhttp://www.hardtied.com/hogtied/bondage/trailer.php?y=2016&amp;p=10_12vmonroe4&amp;u=Hardtied-Violet-Monroe-London-River-Stolen-Breath\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:26d00ea640ce75f8115151d7f059317eaf6abb05","amp;dn":"Hardtied--Stolen+Breath++Violet+Monroe++London+River+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26d00ea640ce75f8115151d7f059317eaf6abb05","infoHashBuffer":{"type":"Buffer","data":[38,208,14,166,64,206,117,248,17,81,81,215,240,89,49,126,175,106,187,5]},"announce":[],"urlList":[]}}