{"title":"[SoM]Ratatouille[DvdRip-Xvid-Ita-Mp3]","uid":4797198,"size":730142720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:26df5f83fdab2aeb1a74bfe6302cdd2c33e20903&amp;dn=%5BSoM%5DRatatouille%5BDvdRip-Xvid-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":1,"uploader":"mitimex","files":1,"time":1237921311,"description":"Il protagonista del film e' un topo di nome Remy che ha un sogno impossibile, quello di diventare un rinomato cuoco in un ristorante francese a cinque stelle. Assieme allo sguattero, Linguini, percorre il proprio percorso creativo per diventare il maggiore cuoco di Parigi.\nPer tutta la vita, Remy ha mostrato un olfatto dotatissimo e il sogno piÃƒÂ¹ inusuale possibile per un topo: cucinare in un ristorante rinomato. Senza preoccuparsi dell'evidente difficoltÃƒÂ  di emergere nella professione che ha maggiore paura dei topi al mondo, per non parlare degli inviti della sua famiglia ad accontentarsi del suo stile di vita (fatto di mucchi d'immondizia), le fantasie di Remy sono ricche di flambÃƒÂ© e sautÃƒÂ©. Ma quando le circostanze fanno arrivare Remy nel ristorante parigino reso famoso dal suo eroe culinario, Auguste Gusteau, il cui motto &quot;chiunque puÃƒÂ² cucinare&quot; ha ispirato Remy per tutta la vita, capisce improvvisamente che venire scoperto in una cucina puÃƒÂ² essere decisamente pericoloso se si hanno dei baffi e una coda.\nNel momento in cui i sogni di Remy sembrano sul punto di andare in fumo, trova quello di cui ha bisogno, un amico che crede in lui: l'addetto alle pulizie del ristorante, un ragazzo timido e isolato che sta per essere licenziato. Ora, non avendo nulla da perdere, Remy e Linguini formano la piÃƒÂ¹ improbabile delle coppie, con il goffo corpo di Linguini che canalizza la mente creativa di Remy, mettendo Parigi completamente sottosopra e si ritrovano entrambi a vivere un'incredibile avventura fatta di svolte comiche, sviluppi emotivi e il piÃƒÂ¹ improbabile dei successi, che i due non avrebbero mai potuto vivere senza l'aiuto reciproco. \n","torrent":{"xt":"urn:btih:26df5f83fdab2aeb1a74bfe6302cdd2c33e20903","amp;dn":"%5BSoM%5DRatatouille%5BDvdRip-Xvid-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26df5f83fdab2aeb1a74bfe6302cdd2c33e20903","infoHashBuffer":{"type":"Buffer","data":[38,223,95,131,253,171,42,235,26,116,191,230,48,44,221,44,51,226,9,3]},"announce":[],"urlList":[]}}