{"title":"Prison Architect Alpha 27","uid":11587787,"size":127316608,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2725d53ed33aeee62b31bdb488b535424aef70cb&amp;dn=Prison+Architect+Alpha+27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":0,"uploader":"Lamasu","files":-1,"time":1417192320,"description":"Prison Architect is the world's latest Prison Management Sim. Starting with an empty plot of land you must construct a holding cell with basic water and electricity to house your first batch of prisoners, to buy you enough time to create a proper cell block. You'll need to hire some guards, get some showers built and unless the kitchen is up and running with chefs working away you're going to end up with a riot on your hands. From there you take your prison in which-ever direction you like. A monsterous super-max or comfortable center for rehabilitation, the choice is up to you.\n\nAlpha 27 changelog (28.11.2014): &lt;a href=&quot;\nhttp://www.introversion.co.uk/prisonarchitect/builds.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.introversion.co.uk/prisonarchitect/builds.html&lt;/a&gt;\nChanges:\n= New food Supply &amp; Demand system\n-- All cell blocks are now assigned a specific canteen to eat in, permitting accurate demand calculation per canteen\n-- All kitchens are assigned specific canteens, such that every kitchen serves at least one canteen, and all canteens are served by at least one kitchen\n-- A new button in Deployment/Logistics can be used to manually override these assignments\n-- This new system permits accurate calculations of supply and demand in all canteens.\n-- Hover the mouse over the Canteen supply/demand icon, to see a breakdown of the calculated demand per hour.\n-- All prisoners will now eat at meal times, not just the very hungry ones.\n-- Some prisoners will leave wasted food behind if they are not that hungry.\n-- &quot;Ingredient Teleporting&quot; from alpha 26 has been removed\n-- Chefs will now cook whatever ingredients are available in their kitchen, rather than requiring specific ingredient types\n-- If cooked food is available in a canteen but there are no serving trays, a stack of serving trays will be instant-purchased\n= Reform program scheduler\n-- Advanced players can now click the &quot;Edit Schedule&quot; button to manually set the times and locations of all Reform Programs\n-- Programs set manually will be 'pinned' in place, and will not be moved by the auto-scheduler\n-- New programs can be created by clicking in the schedule\n-- Right click on programs to cancel them\n-- Existing reform programs screen now moves camera to current assigned room when mousing over\n-- Reverted back to old style colour scheme : Yellow = prisoner on way, Green = attending class\n= Phone Tap object\n-- Built in a security room and connected via wires to phone booths\n-- Manned by a Guard\n-- Allows you to listen in to prisoner phone calls, revealing their Reputation, and arranged contraband throw-ins.\n-- Cctv research renamed to Surveillance, and includes cctv equipment and phone monitoring\n= Names In The Game: Report offensive entry button\n-- All entries in the Names in the game list now have a &quot;Report&quot; button\n-- Click on this button if you feel the bio is offensive and should be removed from the game.\n-- The number of clicks on any entry is recorded in our database, and we will review all reported entries and remove them as appropriate.\n= Game balance\n-- Reputations rebalanced : Legendary, Volatile, Deadly are all less likely\n-- Contraband smuggling via deliveries has been halved\n-- Prisoners needs now start at zero\n= Other changes and fixes\n-- Deployment/Jobs screen now shows staff-only work rooms as grey instead of green.\n--- Assigning prisoners to work in those rooms will produce a flashing red warning message saying &quot;STAFF ONLY&quot;\n-- Render change : Different wall types no longer blend wierdly, eg fences, perimeter walls\n-- New Reputation :\n--- Skilled Fighter. Can sometimes disarm an opponent during a fight.\n--- Expert Fighter. Can sometimes take a weapon from his opponent during a fight.\n-- Fixed : Markers continuously popping up over Guards during fights\n-- Many language typos and fixes. Thanks to RGeezy911 for doing this work.\n-- Fixed : Blackscreen bug with certain Intel GMA cards\n= Bug fixes\n-- 0004332: [AI &amp; Behaviour] Issues with Chef AI (Chris) - resolved.\n-- 0004274: [Control &amp; User Interface] AA Program - 'Removes' spelling mistake. (RGeezy911) - resolved.\n-- 0002272: [Gameplay] Inconsistent naming - Cook or Chef (RGeezy911) - resolved.\n-- 0004139: [Control &amp; User Interface] Failure Condition: Bankrupt - Disastrous spelled wrong (RGeezy911) - resolved.\n-- 0002305: [Other] CEO phonecall (RGeezy911) - resolved.\n-- 0001647: [Other] Shears item name misspelled as &quot;Sheers&quot; (RGeezy911) - resolved.\n-- 0000783: [Other] spelling mistakes in Language File (RGeezy911) - resolved.\n-- 0000476: [Control &amp; User Interface] Maintenance is misspelled in Bureaucracy screen, elsewhere (RGeezy911) - resolved.\n-- 0000073: [Other] Missing apostrophe in CEO dialogue (RGeezy911) - resolved.\n-- 0002681: [Control &amp; User Interface] Typos: In descriptions of CCTV cameras and Holding Cell (RGeezy911) - resolved.\n-- 0005187: [Control &amp; User Interface] Possible misspelling in Grant description (RGeezy911) - resolved.\n-- 0006688: [Graphics] Black Screen with game running the the background (works fine in Alpha 25) (John) - resolved.\n-- 0005835: [AI &amp; Behaviour] Piles of dirty clothing not being dealt with (lim_ak) - resolved.\n-- 0006824: [Gameplay] rubble needs to be repaired (lim_ak) - resolved.\n-- 0006823: [Gameplay] Water pump continues to supply water after being dismantled (lim_ak) - resolved.\n-- 0003579: [AI &amp; Behaviour] Guard Dogs get stuck at the entrance of Kennels (John) - resolved.\n-- 0006033: [Graphics] Flashing power symbols after foundations are bulldozed with lights installed. (John) - resolved.\n-- 0004767: [Graphics] Single Electric Cable Invisible (lim_ak) - resolved.\n\nIf you like the game, support the developer, buy it! &lt;a href=&quot;\nhttp://www.introversion.co.uk/prisonarchitect/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.introversion.co.uk/prisonarchitect/&lt;/a&gt; &lt;a href=&quot;\nhttp://store.steampowered.com/app/233450/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/233450/&lt;/a&gt; &lt;a href=&quot;\nhttp://store.steampowered.com/search/?developer=Introversion%20Software&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/search/?developer=Introversion%20Software&lt;/a&gt;\nSupport the people whose products you like!","torrent":{"xt":"urn:btih:2725d53ed33aeee62b31bdb488b535424aef70cb","amp;dn":"Prison+Architect+Alpha+27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2725d53ed33aeee62b31bdb488b535424aef70cb","infoHashBuffer":{"type":"Buffer","data":[39,37,213,62,211,58,238,230,43,49,189,180,136,181,53,66,74,239,112,203]},"announce":[],"urlList":[]}}