{"title":"Jimi Hendrix - The Best Of Jim Hendrix (1997) 320 vtwin88cube","uid":6656866,"size":182105223,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:27bd6998a9cdf1dca37ad5388fe823db83d2f912&amp;dn=Jimi+Hendrix+-+The+Best+Of+Jim+Hendrix+%281997%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":36,"leechers":3,"uploader":"vtwin88cube","files":-1,"time":1315351442,"description":"Jimi Hendrix\nExperience Hendrix\nThe Best Of Jim Hendrix (1997)\n\n\n\n\n\nIn his brief four-year reign as a superstar, Jimi Hendrix expanded the vocabulary of the electric rock guitar more than anyone before or since. Hendrix was a master at coaxing all manner of unforeseen sonics from his instrument, often with innovative amplification experiments that produced astral-quality feedback and roaring distortion. His frequent hurricane blasts of noise and dazzling showmanship -- he could and would play behind his back and with his teeth and set his guitar on fire -- has sometimes obscured his considerable gifts as a songwriter, singer, and master of a gamut of blues, R&amp;B, and rock styles.\n\nWhen Hendrix became an international superstar in 1967, it seemed as if he'd dropped out of a Martian spaceship, but in fact he'd served his apprenticeship the long, mundane way in numerous R&amp;B acts on the chitlin circuit. During the early and mid-'60s, he worked with such R&amp;B/soul greats as Little Richard, the Isley Brothers, and King Curtis as a backup guitarist. Occasionally he recorded as a session man (the Isley Brothers' 1964 single &quot;Testify&quot; is the only one of these early tracks that offers even a glimpse of his future genius). But the stars didn't appreciate his show-stealing showmanship, and Hendrix was straight-jacketed by sideman roles that didn't allow him to develop as a soloist. The logical step was for Hendrix to go out on his own, which he did in New York in the mid-'60s, playing with various musicians in local clubs, and joining white blues-rock singer John Hammond, Jr.'s band for a while. \n\n\n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\n\nThis compilation just misses being the perfect single-CD Jimi Hendrix anthology, and it's a crying shame because it comes so close. Its main virtue is that, in contrast to Smash Hits -- the only compilation of Hendrix's work approved by the artist -- it extends its reach past 1968. The last of the tracks come from the abortive First Rays of the New Rising Sun album, left unfinished at the time of his death, and show off a more R&amp;B and soul-oriented sound than Hendrix was generally known for -- and are worth the price of the disc by themselves. In fact, some of these cuts recall Hendrix's history with the Isley Brothers, but done his way, with the range of sounds that he was generating in 1970. The disc concludes with the obligatory live version of &quot;The Star Spangled Banner&quot; from Woodstock, which is of massive historical and cultural importance. Where it falls short is by leaving out &quot;Can You See Me&quot; and &quot;Remember,&quot; which are on Smash Hits -- it's a pity because the presence of two of those cuts (which, in fairness, can be found on Are You Experienced?) would make this compilation perfect in most respects. \n\n\n\n\n\n\nAudio-Info:\n\n\n01. Purple Haze\n02. Fire\n03. The Wind Cries Mary\n04. Hey Joe\n05. All Along The Watchtower\n06. Stone Free\n07. Crosstown Traffic\n08. Manic Depression\n09. Little Wing\n10. If 6 Was 9\n11. Foxey Lady\n12. Bold As Love\n13. Castles Made Of Sand\n14. Red House\n15. Voodoo Child (Slight Return)\n16. Freedom\n17. Night Bird Flying\n18. Angel\n19. Dolly Dagger\n20. Star Spangled Banner\n\n\n\n\n\n\n\n\n\n             ****Support The Artists &amp; Buy It If You Like It.****\n\n\n                 ****Enjoy &amp; Please Don't Forget To Seed!****\n\n\n\n\n","torrent":{"xt":"urn:btih:27bd6998a9cdf1dca37ad5388fe823db83d2f912","amp;dn":"Jimi+Hendrix+-+The+Best+Of+Jim+Hendrix+%281997%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27bd6998a9cdf1dca37ad5388fe823db83d2f912","infoHashBuffer":{"type":"Buffer","data":[39,189,105,152,169,205,241,220,163,122,213,56,143,232,35,219,131,210,249,18]},"announce":[],"urlList":[]}}