{"title":"Call Of Duty 2 ( v 1.3 ) Crack Pack and Patch","uid":4534182,"size":41793282,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2803ef02fb518bf56672d8de42bf98905e941d78&amp;dn=Call+Of+Duty+2+%28+v+1.3+%29+Crack+Pack+and+Patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":4,"uploader":"SmokeyDogg","files":5,"time":1227674389,"description":"CALL OF DUTY 2 v 1.3\n\n- 1.3 patch\n- keygen (rld-cod2kg.exe)\n- single player No-CD file\n- MP ( Multi Player ) exe, for cracked server\n\n\n\n\n\nCOD2 1.3 Patch\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n     The Call of  Duty  2  1.3  patch  is  an  all-inclusive  installation,\n     containing all of the previous updates from the 1.2 patch and the 1.01\n     patch.\n\n     NOTES FOR MOD USERS:\n\n     - It is  recommended  that  any  user  modifications  that  have  been\n       installed to  the  Call  of  Duty  2  directory  be  removed  before\n       installing this patch. These  modifications  are  not  supported  by\n       Activision and may not be compatible with some of the  new  features\n       that are included.\n     - Call of Duty 2 does not support mods that have spaces in  the  mod's\n       folder name. Be sure that the folder that contains your mod does not\n       have spaces; otherwise users will not be able to download the files.\n       For example, a mod in a folder called &quot;My  Mod&quot;  would  be  invalid,\n       whereas &quot;MyMod&quot; or &quot;My_Mod&quot; would work.\n\n     MULTIPLAYER FIXES:\n\n     - Raised the gamestate from 16k to 128k\n     - Added loading bars to maps mp_harbor and mp_rhine\n     - Addressed the PB GUID issue where players were not being assigned PB\n       GUID's of exactly 32 characters.\n\n     mp_rhine map changes:\n\n     - Fixed player getting on top of broken wall and seeing through second\n       story of bombed out building. \n\n     mp_harbor map changes:\n\n     - Reduced overall fog density\n     - Fixed missing water texture\n     - Fixed player not being able to shoot through lower  portion  of  the\n       first gap in a railing found on east side of map.\n     - Fixed player not being  able  to  shoot  through  lower  portion  of\n       railing found on east edge of map.\n     - Fixed a partially floating crate and a couple holes in sandbags.\n\n\n\n\nCOD2 1.3 MP server fix\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nTo install:\n\n1.&gt; Make a backup of your existing CoD2MP_s.exe as you will need to put it back if a new patch for COD2 ever comes out.\n2.&gt; Copy the CoD2MP_s.exe file from within this RAR into your Call of Duty dir.\n3.&gt; Enjoy hosting games with no more failed keychecks! :)\n\nNotes\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nHow &amp; Why:\nNobody released a fix for COD2 MP (at least I couldn't find one that worked) so I made my own.\n\nThis one doesn't rely on the stupid 30 minute timeout, which was affected simply by hex'ing the exe to change the cod2master.activision.com string to something like green.co.uk.  I appreciate the effort guys, but the 30 minute timeout sucked :)\n\nAnyway, my version works by changing the string that is checked for acceptance by the auth server.  By default, the COD2 server checks to see if it receives &quot;accept&quot; from the auth server (cod2master.activision.com) when it does a key check each time a new client connects.  If it receives &quot;deny&quot; or doesn't receive a reply it keeps trying for ages (30 minutes plus) until it eventually times out and lets clients connect regardless.  I simply changed &quot;accept&quot; to &quot;deny&quot; so that each time a client tries to connect, it still lets them join even though the auth server rejected their key :)\n\nThe only problem I could foresee with this is that a *legitimate* key may get rejected, since the auth server would return &quot;accept&quot; which would end up actually rejecting the user.  In practice, however, I've found this doesn't occur since all the &quot;deny&quot; messages I received were for invalid_client not bad_key so it ends up just letting anybody connect since they all get &quot;deny&quot;.\n\nAnyway, forget *how* it works unless you're interested.  Suffice to say it works, and only the server needs to have the crack in place - clients don't need the exe, so you only need this if you are planning to run a server (whether it is at a LAN or online, it doesn't matter, it still works).\n\n\nNOTE: I haven't tested this with a dedicated server, but I don't see how that would be any different since it uses the same exe and the same keycheck code.\n\nNOTE #2: NO, this does not allow you to join uncracked online servers.  There is no way to do that since the server is the one that checks the cod2master auth for your key validity.  This is a *server* fix, so only get it if you plan on hosting games, it does nothing for clients.\n\nNOTE #3: Be aware that this sill connects to cod2master.activision.com so do NOT block it with your firewall.  If you do, you're back to the 30 minute wait while the auth code times out.  I don't know if I recommend running this on a 24/7 dedicated box since every single keycheck from your IP will show up as *failed* at the cod2master end... I don't know if they check that sort of thing but it might look suss.\n\nNOTE #4: Even though it will work fine, I only made this for LAN play with my friends as we don't have a permanent internet connections at our LANs.  As always, BUY the game like I did - publishers won't continue making good games if you keep ripping them off.\n\nCheers!\nZoo Antelope...\n\n\n\nCOD2 1.3 SP nocd\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nTo install:\n     1 . Unrar\n     2 . Install the update\n     3 . Copy the crack\n     4 . Play and enjoy, you might die tomorrow\n\n\n","torrent":{"xt":"urn:btih:2803ef02fb518bf56672d8de42bf98905e941d78","amp;dn":"Call+Of+Duty+2+%28+v+1.3+%29+Crack+Pack+and+Patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2803ef02fb518bf56672d8de42bf98905e941d78","infoHashBuffer":{"type":"Buffer","data":[40,3,239,2,251,81,139,245,102,114,216,222,66,191,152,144,94,148,29,120]},"announce":[],"urlList":[]}}