{"title":"Low - Ones and Sixes (2015) [FLAC]","uid":12287979,"size":373921076,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:28f451bceb9d62b3987b871a659ee3962f07e3d2&amp;dn=Low+-+Ones+and+Sixes+%282015%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":0,"uploader":"politux","files":15,"time":1440502691,"description":"\n  Low - Ones and Sixes (2015) [FLAC]\n\n  Genre: Rock\n  Style: Indie\n  Source: CD \n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Gentle\n  02 No Comprende\n  03 Spanish Translation\n  04 Congregation\n  05 No End\n  06 Into You\n  07 What Part of Me\n  08 The Innocents\n  09 Kid in the Corner\n  10 Lies\n  11 Landslide\n  12 DJ\n\n  Artist Bio by Jason Ankeny\n\n  Formed in Duluth, Minnesota, in 1993, Low were perhaps the slowest of the so-called &quot;slowcore&quot; bands -- delicate, austere, and hypnotic, the trio's music rarely rose above a whisper, divining its dramatic tension in the unsettling open spaces created by the absence of sound. Initially comprising the husband-and-wife team of guitarist/vocalist Alan Sparhawk and drummer/vocalist Mimi Parker along with bassist John Nichols, Low began as an experimental reaction to the predominance of grunge. Producer and Shimmy Disc Records founder Kramer soon invited the group to record at his Noise N.J. studios, and the resulting demos earned them a deal with the Virgin-distributed Vernon Yard label.\n\n  After reentering the studio with Kramer, Low emerged with their 1994 debut, I Could Live in Hope, a beautiful set spotlighting the trio's hauntingly minimal aesthetic -- even Parker's drum set consisted of only a snare and a hi-hat. Nichols exited the group prior to 1995's lovely Long Division, recorded with new bassist Zak Sally. A subsequent appearance on the Joy Division tribute A Means to an End was later expanded into the following year's Transmission EP, a five-track set also featuring a rendition of Supreme Dicks' &quot;Jack Smith.&quot; With new producer Steve Fisk behind the boards, Low returned later in 1996 with The Curtain Hits the Cast. The Songs for a Dead Pilot EP followed in 1997 and marked Low's debut with their new label, Kranky, for whom they also released the critically acclaimed Secret Name in 1999. The late '90s also saw them issue Owl (Low Remixes) and the Christmas mini-album, which featured a cover of &quot;Little Drummer Boy&quot; that became a minor hit when it was featured in The Gap's holiday season commercials in 2000.\n\n  The band's brilliant Things We Lost in the Fire arrived on Kranky in 2001, with the darker, more subdued Trust coming the following year. Two years later, the B-sides/rare tracks collection A Lifetime of Temporary Relief appeared on Low's own Chairkickers Music imprint. For their seventh full-length album, 2005's The Great Destroyer, Low moved to Sub Pop; the second leg of the group's tour in support of the album had to be canceled after Sparhawk announced he was in treatment for depression. By 2007 he was feeling well enough to return to work, and the group released its second LP for Sub Pop, the politically charged Drums and Guns; Sparhawk had also launched a side project, the Retribution Gospel Choir, whose debut album appeared in 2008.\n\n  Released in 2011, C'mon marked the debut of bassist Steve Garrington, while the band also stretched its boundaries by working with producer Matt Beckley, who had previously worked with mainstream pop acts such as Katy Perry and Avril Lavigne. In 2013, Low's 20th anniversary year, the group released The Invisible Way, which featured production from Wilco's Jeff Tweedy. Low returned with a new studio album, Ones and Sixes, in September 2015, which the band produced in collaboration with recording engineer BJ Burton; Glenn Kotche of Wilco was a guest on the sessions","torrent":{"xt":"urn:btih:28f451bceb9d62b3987b871a659ee3962f07e3d2","amp;dn":"Low+-+Ones+and+Sixes+%282015%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28f451bceb9d62b3987b871a659ee3962f07e3d2","infoHashBuffer":{"type":"Buffer","data":[40,244,81,188,235,157,98,179,152,123,135,26,101,158,227,150,47,7,227,210]},"announce":[],"urlList":[]}}