{"title":"[SEWING] The Bag Making Bible: The Complete Creative Guide to Se","uid":11233899,"size":18726464,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2911bdf7c25ddc05151eadf4e39583afb4392212&amp;dn=%5BSEWING%5D+The+Bag+Making+Bible%3A+The+Complete+Creative+Guide+to+Se&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"KnitLady","files":-1,"time":1413573399,"description":"&quot;The Bag Making Bible&quot; is the first book and resource of it's kind - a technique-led approach to sewing your own designer bags and purses. It explains in detail how to create and construct the component parts of the bag. From adding styles of bag pockets to inserting zips and closures, using interfacing and reinforcement tricks, and fitting linings and various styles of bag handles, and much, much more. It also introduces and demonstrates the myriad materials, hardware, and tools and techniques available to the modern crafter, including using the sewing machine. \n\nEach chapter is fully illustrated with helpful colour photography and ends with a unique, step-by-step project that builds the ultimate handbag wardrobe. A separate pull-out section of full-size patterns enables readers to get started right away - no photocopying or enlarging required! Each bag design stands out in its own right, each to be made and loved for years to come. \n\nFull instructions are included to make:\na funky laptop/messenger/office bag\n3 kinds of book bags\nan ultra-organised nappy/craft tote\na multi-pocketed travel bag\na rigid cocktail clutch\nan over-the body hobo bag, and more. \n\nWhether you are making your first bag, or you want to add professional looking pockets to an existing pattern, or even if you are looking for a tempting bag project to really sink your sewing teeth into, &quot;The Bag Making Bible&quot; will be your 'go to' resource for information and inspiration","torrent":{"xt":"urn:btih:2911bdf7c25ddc05151eadf4e39583afb4392212","amp;dn":"%5BSEWING%5D+The+Bag+Making+Bible%3A+The+Complete+Creative+Guide+to+Se","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2911bdf7c25ddc05151eadf4e39583afb4392212","infoHashBuffer":{"type":"Buffer","data":[41,17,189,247,194,93,220,5,21,30,173,244,227,149,131,175,180,57,34,18]},"announce":[],"urlList":[]}}