{"title":"Brave New World - 1998 - english","uid":4199567,"size":803343887,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2946edb8732d9d2d379acbc2ae8946bf260f3ef5&amp;dn=Brave+New+World+-+1998+-+english&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"inkorrupt","files":2,"time":1211419647,"description":"Brave New World\n\nDirected by \tLeslie Libman, Larry Williams\nProduced by \tMichael R. Joyce\nWritten by \tDan Mazur (teleplay),\nDavid Tausik (teleplay)\nStarring \tPeter Gallagher, Leonard Nimoy, Tim Guinee\nMusic by \tDaniel Licht\nRelease date(s) April 19, 1998 (USA)\nRunning time \t87 minutes\nLanguage \tEnglish\nCodec:          DIVX 5\n\nBrave New World is a 1998 made-for-TV movie loosely based on Aldous Huxley&amp;#039;s novel Brave New World. The film stars Peter Gallagher and Leonard Nimoy. It is an abridged version of the original story.\n\nPlot\n\nThe film takes Aldous Huxley&amp;#039;s dystopian novel of the same name and &quot;modernizes&quot; it, setting it in a large metropolitan area much like the cities of today, albeit a bit cleaner, brighter and crime and poverty free. The plot centers on Bernard Marx, a high-level &quot;Alpha&quot; executive at the Department of Hatcheries and Conditioning, and on his relationship with Lenina Crowne, a schoolteacher who is responsible for educating the children grown within the building ? a dual role, for as well as teaching them out of textbooks, she is also in charge of the sleep-teaching machines that condition the children at night. Marx and Lenina have been seeing each other almost exclusively for a number of months, a practice that is beginning to attract unwanted attention from some in the strictly polygamous society. On top of this, Marx is increasingly coming under scrutiny by his boss (the Director of Hatcheries and Conditioning) for his wild theories on human psychology and mind control.\n\nThe couple vacation at a Savage Reservation, which is dirty, poor and rustic in contrast to the pristine city that Marx and Lenina hail from. Their helicopter crashes, and the couple is rescued from the clutches of a gang of thugs by a young man named John Cooper, who turns out to be the son of a Savage woman and an unidentified Alpha man who once worked at the reservation. Marx invites the Savage and his mother Linda to visit &quot;civilization,&quot; so that he may study John&amp;#039;s mind and perhaps gain some insight into why the conditioning programs at the DHC seem to be failing.\n\nJohn is initially excited by the wonders of civilization, but soon finds it dull and boring without the availability of literature, philosophy, free thinking and especially Shakespeare (he has committed most of the plays to memory). The populace constantly hounds him, seeing him as a new celebrity ready made for popular consumption; his story spawns a feature film and even his own clothing trend. Marx gains the notice of World Controller Mustapha Mond and moves up the ladder, while Lenina finds herself having strong feelings for John and even stronger ones for Bernard. Meanwhile, the DHC, who turns out to be John&amp;#039;s natural father, erases his name from the Reservation database and programs a wayward Delta assembly line worker to kill Marx, knowing that if Marx identifies him as a parent, the consequences could be dire (the practice of conceiving children through sex is anathema in the Brave New World: all children are created in &quot;hatcheries&quot; through in vitro fertilization and &quot;decanted&quot; from artificial life support machines).\n\nLinda?s constant use of a hallucinogenic drug called soma finally proves fatal, causing John to snap and rampage through a drug distribution center. The plot on Marx&amp;#039;s life fails, and the DHC is exposed as the father of a Savage, leading to his dismissal and reengineering as a menial laborer. Mond, who also reads Shakespeare, promotes Marx to DHC and pardons John. Seeking to escape the constant pressure, John flees to the countryside, is cornered relentlessly by the press, and is run off of a cliff. In the end, it is revealed that Lenina is pregnant with Marx&amp;#039;s child.\n\nThe couple, Bernard Marx and Lenina Crowne, take the long tunnel to a coastal area, shown in the final scene of the film, and become a family there. This may be an extension of the book&amp;#039;s original premise that too-intelligent and too-individualistic people are relocated to islands, hence the scene&amp;#039;s beach location would make a bit more sense.\n\nSource: http://en.wikipedia.org/wiki/Brave_New_World_%28film%29","torrent":{"xt":"urn:btih:2946edb8732d9d2d379acbc2ae8946bf260f3ef5","amp;dn":"Brave+New+World+-+1998+-+english","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2946edb8732d9d2d379acbc2ae8946bf260f3ef5","infoHashBuffer":{"type":"Buffer","data":[41,70,237,184,115,45,157,45,55,154,203,194,174,137,70,191,38,15,62,245]},"announce":[],"urlList":[]}}