{"title":"Harold and Kumar Go To White Castle [Extreme Unrated] DVDRip Xvi","uid":4158091,"size":739860527,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:296177b1c89db6402655164d006f34bae5ef0b9c&amp;dn=Harold+and+Kumar+Go+To+White+Castle+%5BExtreme+Unrated%5D+DVDRip+Xvi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":0,"uploader":"circlensess","files":2,"time":1209242234,"description":"Plot Summary:\nHarold Lee (Cho) and Kumar Patel (Penn) are two stoners who end up getting the munchies. What they crave the most after seeing a TV advertisement..\n\nAlso Known As:\nHarold &amp; Kumar Get the Munchies (Europe: English title) (UK) \nHarold et Kumar chassent le burger (Canada: French title)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0366551/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0366551/&lt;/a&gt;\n\nIt&amp;#039;s all about the Journey..., 8 August 2004\n\nAuthor: jon.h.ochiai (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;a2c8cdc1cacbc3cbe2d1cdc1c3ce8cd0d08cc1cdcf&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;) from Los Angeles, CA \n\nWith the title &quot;Harold &amp; Kumar Go to White Castle&quot;, how can one not see this movie? Well, one could, and would be missing a very funny movie. H&amp;R is genius creative marketing, and the director Danny Leiner&amp;#039;s movie is actually funnier than it&amp;#039;s trailer. The movie demographic is probably from 15 to 25-- totally not mine. Written by Jon Hurwitz and Hayden Schlossberg, the story is more hit than miss, with inspired moments and a drugged out cool. Consequently, the humor can be gross out bathroom humor. However, &quot;Harold &amp; Kumar&quot; can be clever funny, and has moments of comic genius. In the beginning, Kumar(Kal Penn) is having a medical school interview, and the dean (a classically clueless Fred Ward) asks him why he isn&amp;#039;t already in school with his perfect MCAT scores. Kumar says, &quot;Just because you&amp;#039;re hung like moose, doesn&amp;#039;t mean you have to do porn.&quot; I was rolling. John Cho and Kal Penn as Harold and Kumar have a natural chemistry and are completely charming. Cho and Penn overcome much of the movie&amp;#039;s inconsistencies. \n\nHarold (Cho) is the straight Korean guy who works as an associate at an investment bank. Kumar is the free spirited Indian guy, who interviews with medical schools, but never accepts. That way his father keeps supporting him. It&amp;#039;s Friday, and one of the partners at Harold&amp;#039;s firm dumps a report on Harold, so that he can party with some babes-- unbeknown-st to Harold. The report is due on Saturday. Harold is not having a particularly stellar day.\n\nKumar wants to smoke pot with his bud, regardless of Harold&amp;#039;s deadline. Back at their apartment complex, we meet Maria (a gorgeous Paula Garces), the object of Harold&amp;#039;s affection. Harold is in love with her, but has yet to utter a complete sentence to her in their daily elevator rides. So Harold and Kumar smoke weed and watch TV. Then they get the munchies, and thus begins their quest for White Castle-- somewhere in New Jersey. \n\nGive props to Leiner, Hurwitz, and Schlossberg for ignoring political correctness and having fun with stereotypes. Even in this simplistic comedy, this frames the story as the Harold and Kumar evolve-- after the high subsides. The scenes where Harold is giving career advice at a college Asian club meeting or where Kumar is talking with his father and older brother who are both doctors at the hospital are funny, and have an air of authenticity. Also the story plays off the fact that our duo are perceived geeks and are targets of the Extreme Sports Punks. \n\n&quot;Harold and Kumar&quot; has some of the funniest scenes that sometimes blur lines of taste. Regardless, it&amp;#039;s funny. In their quest for White Castle burgers and... getting laid, they end up at the home of mechanic Freakshow (an unrecognizable Chris Meloni). The &quot;threesome&quot; encounter with Lianne (the stunning Malin Akerman), Freakshow&amp;#039;s wife, is hot and hilarious-- more than the trailer tease which is good. Perhaps, H&amp;K&amp;#039;s defining moment is when the high duo ride a cheetah through the woods. You have to see the movie for this. Neil Patrick Harris as himself is awesome. H&amp;K pick the Harris on the road on the way to White Castle. Amazingly, his character is integral to the plot-- really. Harris is having fun playing against his own casting stereotype, and doing it well. He is totally out there. \n\nYou can figure out how this all ends. &quot;Harold and Kumar&quot; is not a cinematic masterpiece, but it is a lot of fun. John Cho is a talented reactive actor, some of his expression are priceless. Kal Penn is a great smart guy rebel, and a good actor. The two together are a solid comic team. I would see, for example &quot;Harold and Kumar Go to Disneyland&quot;.","torrent":{"xt":"urn:btih:296177b1c89db6402655164d006f34bae5ef0b9c","amp;dn":"Harold+and+Kumar+Go+To+White+Castle+%5BExtreme+Unrated%5D+DVDRip+Xvi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"296177b1c89db6402655164d006f34bae5ef0b9c","infoHashBuffer":{"type":"Buffer","data":[41,97,119,177,200,157,182,64,38,85,22,77,0,111,52,186,229,239,11,156]},"announce":[],"urlList":[]}}