{"title":"Joomla 3 Beginner's Guide (2013)","uid":8867199,"size":58257129,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:298b5f967af2fe7bd2e65d1d75d63a3434f18668&amp;dn=Joomla+3+Beginner%27s+Guide+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"d347hBy73","files":-1,"time":1377907201,"description":"Joomla! 3: Beginners Guide\n\nBook Details:\n\nPages: 434 \nPublisher: Packt Publishing (March 2013)\nLanguage: English\nISBN-10: 1782164340\nISBN-13: 978-1782164340\nFormat: PDF, EPUB\n\nBook Description:\n\nJoomla! is one of the most popular open source Content Management Systems, actively developed and supported by a world-wide user community. Its a free, fun, and feature-rich tool for anyone who wants to create dynamic, interactive websites. Even beginners can deploy Joomla to build professional websites. Even though it can be challenging to get beyond the basics and build the site that meets your needs perfectly, this book will guide you through it all.\n\nCompletely updated for Joomla! 3, this practical guide helps you to create professional and good-looking websites with Joomla!, whether you want to build a personal blog site or a full-featured company or club website.\n\nThe Joomla! 3 Beginners Guide will help you to get started with Joomla! quickly. It is presented in an organized, easy-to-read manner. The book does not focus on what Joomla! can do it focuses on what you can do using Joomla!.\nYou learn how to get Joomla! up and running, how to organize content, add new menus, add new features, change the design and much more. Real-life examples and tutorials will spark your imagination and show you what kind of professional, feature-rich websites any web builder can achieve with Joomla!. The focus is on clear instructions and easy-to-understand tutorials, with minimal jargon.\n\nUsing the Joomla! 3 Beginners Guide you will quickly gain the knowledge needed to build your own site, perfectly tailored to your specific needs.\n\nWhat you will learn from this book:\n\nCreate a feature-rich site that is easy to expand, customize, and maintain without having to learn web languages such as HTML and Cascading Style Sheets (CSS)\nDesign attractive home pages that provide a quick overview of the sites contents and direct people to the content they could be interested in\nEngage your web visitors and turn them into active users by enabling them to register, add content, and leave comments\nDesign clear and easy navigation using menus, submenus, and text hyperlinks\nMake full use of templates to get your site looking just right, tweaking the CSS and customizing templates using your own logo, fonts, and colors\nExtend Joomla!s capabilities by finding and utilizing must-have extensions that perfectly meet your needs\nIncrease your sites visibility for search engines by applying highly effective Search Engine Optimization (SEO) techniques\nSecure your site from hackers and potential threats using easy-to-follow techniques\n\nApproach:\n\nWritten with a fast-paced but friendly and engaging approach, this Packt Beginners Guide is designed to be placed alongside the computer as your guide and mentor. Step-by-step tutorials are bolstered by explanations of the reasoning behind what you are doing. You will quickly pick up the necessary skills, tips, and tricks for building a successful Joomla! website.\n\nWho this book is for?:\n\nThis book is written for beginners to website design. By the end of the book you will have built a complete custom content managed website, and be ready to build any kind of website.\n","torrent":{"xt":"urn:btih:298b5f967af2fe7bd2e65d1d75d63a3434f18668","amp;dn":"Joomla+3+Beginner%27s+Guide+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"298b5f967af2fe7bd2e65d1d75d63a3434f18668","infoHashBuffer":{"type":"Buffer","data":[41,139,95,150,122,242,254,123,210,230,93,29,117,214,58,52,52,241,134,104]},"announce":[],"urlList":[]}}