{"title":"The Elements of Investing - Easy Lessons for Every Investor.pdf ","uid":11716869,"size":1105418,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:299f3ce4980ddbdd4879afa883dbe40b1a88a335&amp;dn=The+Elements+of+Investing+-+Easy+Lessons+for+Every+Investor.pdf+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1424618899,"description":"Publisher: Wiley; 1 edition (December 14, 2009)\nLanguage: English\nISBN-10: 0470528494\nISBN-13: 978-0470528495\n\nA timeless, easy-to-read guide on life-long investment principles that can help any investor succeed\n\nThe Elements of Investing has a single-minded goal: to teach the principles of investing in the same pared-to-bone manner that Professor William Strunk Jr. once taught composition to students at Harvard, using his classic little book, The Elements of Style. With great daring, Ellis and Malkiel imagined their own Little Red Schoolhouse course in investing for every investor around the world-and then penned this book.\n\nThe Elements of Investing hacks away at all the overtrading and over thinking so predominant in the hyperactive thought patterns of the average investor. Malkiel and Ellis offer investors a set of simple but powerful thoughts on how to challenge Mr. Market at his own game, and win by not losing. All the need-to-know rules and investment principles can be found here.\n\nContains sound investment advice and simple principles of investing from two of the most respected individuals in the investment world\nBurton G. Malkiel is the bestselling author of A Random Walk Down Wall Street and Charles D. Ellis is the bestselling author of Winning the Loser's Game\nShows how to deal with an investor's own worst enemies: fear and greed\nA disciplined approach to investing, complemented by conviction, is all you need to succeed. This timely guide will help you develop these skills and make the most of your time in today's market","torrent":{"xt":"urn:btih:299f3ce4980ddbdd4879afa883dbe40b1a88a335","amp;dn":"The+Elements+of+Investing+-+Easy+Lessons+for+Every+Investor.pdf+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"299f3ce4980ddbdd4879afa883dbe40b1a88a335","infoHashBuffer":{"type":"Buffer","data":[41,159,60,228,152,13,219,221,72,121,175,168,131,219,228,11,26,136,163,53]},"announce":[],"urlList":[]}}