{"title":"FINAL FANTASY IV: AFTER YEARS v1.0.3 Android","uid":9329161,"size":468965991,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:29e88d2070bc1c0318dbef39065bc28c8ee229f5&amp;dn=FINAL+FANTASY+IV%3A+AFTER+YEARS+v1.0.3+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":".BONE.","files":-1,"time":1386698326,"description":"With a full 3-D remake, FINAL FANTASY IV: THE AFTER YEARS can now be played as never before. Take part in the epic sequel that unfolds nearly two decades after the events of FINAL FANTASY IV. Classic characters make their return alongside several new heroes, such as Ceodore, son of Cecil and Rosa.\n\nTen Playable Tales\nBegin your journey with &quot;&quot;Ceodore's Tale.&quot;&quot; Complete it to unlock the tales of six additional characters, which can be played in any order, and then return to the core story with &quot;&quot;Kain's Tale,&quot;&quot; &quot;&quot;The Lunarian's Tale,&quot;&quot; and &quot;&quot;The Crystals.&quot;&quot; A total of ten tales in all, and all contained in FINAL FANTASY IV: THE AFTER YEARS.\n\nActive Time Battle\nTake control of exhilarating combat made possible by the non-stop action in Square Enix's iconic battle system.\n\nLunar Phases\nFeel the moon's presence in combat, as its waxing and waning influences the potency of attacks and abilities of all combatants. Lunar phases cycle naturally with the passage of in-game time, or when resting at an inn, tent, or cottage.\n\nBand Abilities\nCombine the strength of your party members to awesome effect with Band abilities that can be unlocked through in-game events or by leveling your characters' Affinity.\n\nMinimap\nKeep an eye on your current location and nearby surroundings, or tap for quick access to the world map.\n\nGoogle Play Game Support\nStep up to meet all-new challenges offered by dozens of achievements.\n\nSeventeen years have passed since the war's end, and the son born to King Cecil and Queen Rosa of Baron has grown into a young man. Prince Ceodore has enlisted in the airship fleet known as the Red Wings, eager to meet the expectations demanded of his blood and station. Yet once more another moon has appeared in the sky, and with it vast hordes of monsters intent on destruction. The brief peace enjoyed by the Blue Planet now stands threatened under the shadow of impending catastrophe.\n\nWhat's in this version : (Updated: Dec 4, 2013)\nVarious minor bug\nRequired Android O/S : 2.3+","torrent":{"xt":"urn:btih:29e88d2070bc1c0318dbef39065bc28c8ee229f5","amp;dn":"FINAL+FANTASY+IV%3A+AFTER+YEARS+v1.0.3+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29e88d2070bc1c0318dbef39065bc28c8ee229f5","infoHashBuffer":{"type":"Buffer","data":[41,232,141,32,112,188,28,3,24,219,239,57,6,91,194,140,142,226,41,245]},"announce":[],"urlList":[]}}