{"title":"Gene Wolfe - The Book of the New Sun (5 vols.)(retail epub/mobi)","uid":10465728,"size":3961006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a25e15053be5a7c8fd8b3f489bcffde3f823551&amp;dn=Gene+Wolfe+-+The+Book+of+the+New+Sun+%285+vols.%29%28retail+epub%2Fmobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"pharmakate","files":-1,"time":1404188302,"description":"THE BOOK OF THE NEW SUN\n\nThe Book of the New Sun is unanimously acclaimed as Gene Wolfe's most remarkable work, hailed as &quot;a masterpiece of science fantasy comparable in importance to the major works of Tolkien and Lewis&quot; by Publishers Weekly, and &quot;one of the most ambitious works of speculative fiction in the twentieth century&quot; by The Magazine of Fantasy and Science Fiction.\n\n----------\n\nThese books have been uploaded many times before on many sites, but only very recently are they available in retail-quality versions. I think these editions are the best one's you'll find. (My thanks to the original uploaders.)\n\nThis torrent includes the following books:\n\n1. Shadow and Claw, which consists of two books previously published separately: The Shadow of the Torturer and The Claw of Conciliator.\n\nThe Shadow of the Torturer is the tale of young Severian, an apprentice in the Guild of Torturers on the world called Urth, exiled for committing the ultimate sin of his profession -- showing mercy toward his victim.\n\nThe Claw of the Conciliator continues the saga of Severian, banished from his home, as he undertakes a mythic quest to discover the awesome power of an ancient relic, and learn the truth about his hidden destiny.\n\n2. Sword and Citadel, which consists of two books previously published separately: The Sword of the Lictor and The Citadel of the Autarch.\n\nThe Sword of the Lictor is the third volume in Wolfe's remarkable epic, chronicling the odyssey of the wandering pilgrim called Severian, driven by a powerful and unfathomable destiny, as he carries out a dark mission far from his home.\n\nThe Citadel of the Autarch brings The Book of the New Sun to its harrowing conclusion, as Severian clashes in a final reckoning with the dread Autarch, fulfilling an ancient prophecy that will forever alter the realm known as Urth.\n\n3. The Urth of the New Sun.\n\nThe long awaited sequel to Gene Wolfe's four-volume classic, The Book of the New Sun.  We return to the world of Severian, now the Autarch of Urth, as he leaves the planet on one of the huge spaceships of the alien Hierodules to travel across time and space to face his greatest test, to become the legendary New Sun or die. The strange, rich, original spaceship scenes give way to travels in time, wherein Severian revisits times and places which fill in parts of the background of the four-volume work, that will thrill and intrigue particularly all readers of the earlier books. But The Urth of the New Sun is an independent structure all of a piece, an integral masterpiece to shelve beside the classics, one itself.\n\n-----------\n\nNote: There are two series of books that take place in the same universe as The Book of the New Sun. They are The Book of the Long Sun (in four volumes) and The Book of the Short Sun (in three volumes). Only a few of the volumes appear to have been released officially as ebooks so far. They can be found in various formats, along with other books by Gene Wolfe, in various formats, here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7311763&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7311763&lt;/a&gt;\n\nGene Wolfe audiobooks are here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4063594&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4063594&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2a25e15053be5a7c8fd8b3f489bcffde3f823551","amp;dn":"Gene+Wolfe+-+The+Book+of+the+New+Sun+%285+vols.%29%28retail+epub%2Fmobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a25e15053be5a7c8fd8b3f489bcffde3f823551","infoHashBuffer":{"type":"Buffer","data":[42,37,225,80,83,190,90,124,143,216,179,244,137,188,255,222,63,130,53,81]},"announce":[],"urlList":[]}}