{"title":"NSCA - Essentials Of Strength Training And Conditioning 3rd Edit","uid":8682593,"size":22361788,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a6c04c3e27c5bf5673b0bcc74f5106273acc299&amp;dn=NSCA+-+Essentials+Of+Strength+Training+And+Conditioning+3rd+Edit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1373733861,"description":"National Strength and Conditioning Association - Thomas R. Baechle &amp; Roger W. Earle (editors)\nISBN-13: 9780736084659\ne-Book\n2008\n\nNow in its third edition, Essentials of Strength Training and Conditioning is the most comprehensive reference available for strength and conditioning professionals. In this text, 30 expert contributors explore the scientific principles, concepts, and theories of strength training and conditioning as well as their applications to athletic performance.\n\nEssentials of Strength Training and Conditioning is the most-preferred preparation text for the Certified Strength and Conditioning Specialist (CSCS) exam. The research-based approach, extensive exercise technique section, and unbeatable accuracy of Essentials of Strength Training and Conditioning make it the text readers have come to rely on for CSCS exam preparation.\n\nThe third edition presents the most current strength training and conditioning research and applications in a logical format designed for increased retention of key concepts. The text is organized into five sections. The first three sections provide a theoretical framework for application in section 4, the program design portion of the book. The final section offers practical strategies for administration and management of strength and conditioning facilities.\n\nSection 1 (chapters 1 through 10) presents key topics and current research in exercise physiology, biochemistry, anatomy, biomechanics, endocrinology, sport nutrition, and sport psychology and discusses applications for the design of safe and effective strength and conditioning programs.\n\nSection 2 (chapters 11 and 12) discusses testing and evaluation, including the principles of test selection and administration as well as the scoring and interpretation of results.\n\nSection 3 (chapters 13 and 14) provides techniques for warm-up, stretching, and resistance training exercises. For each exercise, accompanying photos and instructions guide readers in the correct execution and teaching of stretching and resistance training exercises. This section also includes a set of eight new dynamic stretching exercises.\n\nSection 4 examines the design of strength training and conditioning programs. The information is divided into three parts: anaerobic exercise prescription (chapters 15 through 17), aerobic endurance exercise prescription (chapter 18), and periodization and rehabilitation (chapters 19 and 20). Step-by-step guidelines for designing resistance, plyometric, speed, agility, and aerobic endurance training programs are shared. Section 4 also includes detailed descriptions of how principles of program design and periodization can be applied to athletes of various sports and experience levels. Within the text, special sidebars illustrate how program design variables can be applied to help athletes attain specific training goals.\n\nSection 5 (chapters 21 and 22) addresses organization and administration concerns of the strength training and conditioning facility manager, including facility design, scheduling, policies and procedures, maintenance, and risk management.","torrent":{"xt":"urn:btih:2a6c04c3e27c5bf5673b0bcc74f5106273acc299","amp;dn":"NSCA+-+Essentials+Of+Strength+Training+And+Conditioning+3rd+Edit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a6c04c3e27c5bf5673b0bcc74f5106273acc299","infoHashBuffer":{"type":"Buffer","data":[42,108,4,195,226,124,91,245,103,59,11,204,116,245,16,98,115,172,194,153]},"announce":[],"urlList":[]}}