{"title":"Sleep (Stoner rock)","uid":4673629,"size":351100938,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2aa1c87d4d34fd9a5882395d6a81c77a36f999c2&amp;dn=Sleep+%28Stoner+rock%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":2,"uploader":"bitspreader","files":-1,"time":1232819898,"description":"SLEEP\n=====\n\nSleep - 1991 - Volume one\nSleep - 1993 - Sleep's Holy Mountain\nSleep - 1995 - Jerusalem\nSleep - 2003 - Dopesmoker\n\n-=&lt; From Allmusic &gt;=-\nPerhaps the ultimate stoner rock band, Northern California trio\nSleep's career wafted in and out of focus from within their\nself-mandated cloud of marijuana smoke. In their short time\ntogether, the group issued some of the heaviest, most\nuncompromising doom metal albums ever recorded, leaving a legend\nfar exceeding the actual volume of their output.Formed in the\nlate 80's in San Jose, California by bassist/vocalist Al Cisneros,\nguitarists Matt Pike and Justin Marler and drummer Chris Haikus,\nSleep instantly drew comparisons to under-appreciated 80's doomsters\nlike the Obsessed, Pentagram and especially Saint Vitus.\n\nTheir sludgy 1991 debut was named Volume One in honor of their\nsonic godfathers Black Sabbath, but it wasn't until Marler's\ndeparture (reportedly to become a monk!) and the release of 1993's\nSleep's Holy Mountain that their own, unique doom metal vision truly\nbegan coming into focus. The album became a favorite of the heavy\nmetal press, and Sleep were heralded alongside other promising\nretro-rocking groups like Kyuss and Monster Magnet as leaders of\nthe newly emerging stoner rock / doom metal scene. Such was the\nbuzz surrounding the group, that following a short European tour\nsupporting first generation doomsters Trouble and English hopefuls\nCathedral, Sleep was reportedly offered an unprecedented six-figure\ndeal by London Records. But instead of grabbing their chance at\nmainstream stardom for all it was worth, Sleep vowed to delve even\ndeeper into their incredibly heavy and slothful sound instead.\n\nAfter almost two years of writing and re-writing material for\ntheir next album (to be named Dopesmoker, not surprisingly) amidst\nabundant weed consumption, the trio finally delivered their\nlong-awaited epic, now named Jerusalem, to London Records. But to\ntheir label's surprise, Jerusalem comprised a single, 60-minute\nmagnum opus to marijuana which the band refused to edit or split\nup into sections under any circumstances. A complete deadlock\nensued, tying up both parties in red tape for another two years.\n\nFinally, having smoked their entire cash advance through their bongs,\nSleep decided to break up rather than surrender the album. Guitarist\nMatt Pike went on to form a new, more energetic heavy metal band\ncalled High on Fire, while drummer Matt Haikus eventually re-united\nwith founding guitarist (and now ordained monk) Justin Marler in The\nSabians. In the meantime, an unauthorized version of Jerusalem was\nquietly released by Rise Above Records, but it wasn't until 2003 that\na supposedly authentic and fully endorsed version of Dopesmoker finally\nreached record store shelves, bringing the convoluted Sleep saga to a\nclose at last.","torrent":{"xt":"urn:btih:2aa1c87d4d34fd9a5882395d6a81c77a36f999c2","amp;dn":"Sleep+%28Stoner+rock%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aa1c87d4d34fd9a5882395d6a81c77a36f999c2","infoHashBuffer":{"type":"Buffer","data":[42,161,200,125,77,52,253,154,88,130,57,93,106,129,199,122,54,249,153,194]},"announce":[],"urlList":[]}}