{"title":"The IT Crowd [Season 1]","uid":4675170,"size":1097222272,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2b05faf1b71a85a0d2c4208d3dc531de2f446235&amp;dn=The+IT+Crowd+%5BSeason+1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"rastafoogi","files":7,"time":1232879540,"description":"Written by Irish director Graham Linehan and produced by Ash Atalla for Channel 4. Currently, one series of six episodes has been produced and a second series of six episodes[3] (originally eight[4]) has been commissioned by Channel 4, which started on Friday 24 August 2007.[5] Series one was recorded in front of a live audience at Teddington Studios, Series two was recorded in front of a live audience at Pinewood Studios. The first two episodes were broadcast by Channel 4 on Friday 3 February 2006.\n\nCAST:\nChris O'Dowd ... Roy (7 episodes, 2006-2007)\nRichard Ayoade ... Moss (7 episodes, 2006-2007)\nKatherine Parkinson ... Jen (7 episodes, 2006-2007)\nChristopher Morris ... Denholm (6 episodes, 2006)\n\n\n\n\nCast &amp; Screens:\n &lt;a href=&quot;\nhttp://www.previewpal.info/public/viewer.php?file=w29wlj7dezdci1a6a3of.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.previewpal.info/public/viewer.php?file=w29wlj7dezdci1a6a3of.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.previewpal.info/public/viewer.php?file=pk9nkvg7d4sk2jjfz9tj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.previewpal.info/public/viewer.php?file=pk9nkvg7d4sk2jjfz9tj.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.previewpal.info/public/viewer.php?file=iv9o4pth735voqbof7dd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.previewpal.info/public/viewer.php?file=iv9o4pth735voqbof7dd.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.previewpal.info/public/viewer.php?file=3ch2rcvakbmx0k09ctr1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.previewpal.info/public/viewer.php?file=3ch2rcvakbmx0k09ctr1.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.previewpal.info/public/viewer.php?file=156e3f3gjocdwkujn7be.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.previewpal.info/public/viewer.php?file=156e3f3gjocdwkujn7be.jpg&lt;/a&gt;\n\n\n\n\n\nEpisode 1 - Yesterday's Jam\n\nThe technically challenged boss, Denholm Reynholm, is fooled by Jen's techno-bluffing, and appoints Jen as the manager of the IT support office, where she demonstrates her complete lack of knowledge in technical matters. Roy and Moss want to get rid of her, as they resent having to report to a higher ranking employee, and also feel that she is undeserving of her pos it ion. They try to undermine her authority while Jen struggles to maintain her leadership role. Moss and Roy attempt to bring up her lack of experience w it h Denholm but discover Denholm's pathological devotion to teamwork and decide to work together after all. Jen's ability to get on with people proves to be an asset to the IT department, both defusing s it uations and attracting attractive people to hang out in the basement. Jen gets the idea to hold a party in the IT office, and everything goes well until Moss tells an embarrassing story about hiring prostitutes in Amsterdam, suddenly alienating them from the rest of the building again.\n\nEpisode 2 - Calamity Jen\n\nThe three protagonists are summoned to a company wide meeting with Denholm, in which he &quot;declares war&quot; on stress. Moss and Roy attend a seminar on stress while Jen buys a pair of shoes she falls in love with, but which are two sizes too small, causing plenty of stress in the basement. An unattended soldering iron causes a fire to break out, causing many problems. Aside from a sense of surrealism, this episode also contains a fake advertisement for &quot;0118 999 881 999 119 725 3&quot;, which states that the twenty-digit number is to replace the UK emergency phone number 999, the service itself having been upgraded with 'better looking drivers'.\n\nEpisode 3 - Fifty-Fifty\n\nRoy has a horrible date with a woman who thinks he is &quot;some sort of disgusting tramp&quot; because he spends an hour w it h chocolate on his forehead looking like poo. The story of his disastrous appearance makes the rounds of the office building (and beyond) and the notion of what attracts women to men becomes the main theme of the episode. Jen impresses the temp secur it y guard Daniel by correctly guessing some of his musical history questions. However, things go horribly wrong when Daniel uses Jen as his &quot;phone a friend&quot; when he is a contestant on the television game show Who Wants to Be a Millionaire?. Jen guesses incorrectly, costing him Ã‚Â£31,000. To make it up to him she buys him dinner at &quot;Messy Joes&quot; (pronounced by Moss as &quot;Mesijos&quot;, leading her to believe it is an elegant continental restaurant, but instead is a rowdy family casual dining establishment). Roy is convinced that all women are drawn only to bad guys, and never to gentlemen. Roy and Moss therefore invent a dangerous persona in an attempt to solic it people on an online dating s it e and to win a bet w it h Jen. Roy gets a response and is taken w it h the girl's photograph so much he wants to go through w it h the date. He takes the date to the same restaurant recommended by Moss to Jen. It goes poorly and Roy winds up w it h chocolate on his forehead again and his date leaving w it h Jen's increasingly ag it ated secur it y guard. This episode stars Graham Linehan as a Mexican singer and Chris Tarrant as himself.\n\nEpisode 4 - The Red Door\n\nWhile Roy becomes stuck under a desk w it h Moss attempting to rescue him, Jen investigates the strange red door in the basement, leading to her discovery of Richmond (Noel Fielding), a lonely goth. Jen discovers Richmond's fall from grace through a series of flashbacks and tries to help him, while Roy tries not to become a &quot;desk rabb it &quot; (a term Moss created for the s it uation, and one that has never been used before).\n\nEpisode 5 - The Haunting of Bill Crouse\n\nMoss tells an extraordinary lie to help Jen escape the attention of Bill Crouse - he tells him that she is dead. Everyone at the office gathers for a memorial for Jen, where Denholm inv it es his friend Elton John (or is it ?), and Bill starts telling everyone that he was the last person to sleep w it h Jen. Meanwhile, Roy is trying to escape the attention of a woman of his own. While trying to get acquainted w it h Julie on the fifth floor, he mistakes her for Judy, the horrible looking office cleaner, who becomes sm it ten w it h Roy.\n\nEpisode 6 - Aunt Irma Visits\n\nJen's menstrual cycle, nicknamed Aunt Irma, has unexpected consequences for the office, with her colleagues all directly suffering from the associated effects, even Richmond, who says &quot;I'm not my usual cheery self&quot;. Furthermore, Moss has sent an email to all he knows in the IT community, inciting &quot;Aunt Irma&quot; riots and disturbances throughout the world. For instance, in Tokyo (a dog was frightened) and Hamburg (a bus was shouted at). The website &quot;Ladyproblems.com&quot; is devoted to them, bearing an image of their faces superimposed on old ladies. The only cure is to have a big girly night in w it h scented candles, and watching the movie Steel Magnolias. However they then all go to the company's &quot;Thank-You&quot; party, get incredibly drunk and wake up screaming in bed w it h various people. Jen slept w it h Moss, Roy slept with the company psychologist, who he had previously refused to associate with because she looks exactly like his mother; and Denholm slept wit h Richmond.\n\n\n\nTechnical Specs:\n\n--- Container Information ---                          \nBase Type:             AVI(.AVI)                \n                                                   \n--- Video Information ---                              \nVideo Codec Name:      XviD 1.0.3              \nDuration:              23:38.840                \nframe Width (pixels):  640                  \nframe Height (pixels): 352                  \nPixel Aspect Ratio:    1.000                    \nDisplay Aspect Ratio:  1.818                    \nframes Per Second:     25.000          \nVideo Bitrate (kbps):  886                \n                                                   \n--- Audio Information ---                              \nAudio Codec:           0x0055 MPEG-1 Layer 3                  \nAudio Sample Rate(Hz): 48000            \nAudio Bitrate(kbps):   130                \nAudio Channel Count:   2      \n\n\n\n\nAll Torrents have been scanned by:\n\n1.ESET NOD32 AV\n2.Spybot Search &amp; Destroy v1.6\n\nPLEASE SCAN ALL DOWNLOADED FILES WITH UPDATED ANTIVIRUS SOFTWARE.\n","torrent":{"xt":"urn:btih:2b05faf1b71a85a0d2c4208d3dc531de2f446235","amp;dn":"The+IT+Crowd+%5BSeason+1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b05faf1b71a85a0d2c4208d3dc531de2f446235","infoHashBuffer":{"type":"Buffer","data":[43,5,250,241,183,26,133,160,210,196,32,141,61,197,49,222,47,68,98,53]},"announce":[],"urlList":[]}}