{"title":"Metal Gear Solid 5 - GroundZeros Portable Multi-8","uid":11672973,"size":3035999910,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2b98862a6446e5810b90c40962747455e5c268c3&amp;dn=Metal+Gear+Solid+5+-+GroundZeros+Portable+Multi-8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":5,"uploader":"globeplus","files":4,"time":1422739116,"description":"Hi great PC games fans and welcome to play the new Metal Gear Solid game ...\n\n\n\nCOMPLETE GAME WITH PORTABILITY, THE GAME EXECUTABLE CAN BE\nRUNNED AFTER FINISHED THE DOWNLOAD .\n\n\nGameplay\n\n\nPlayers control Snake through the game map and complete missions while avoiding being spotted by the enemy. The threat detection system is revamped, with the removal of the onscreen meter or gauge to indicate the player that they are in the 'alert/evasion/caution' state as in previous games, which have instead been replaced by visual representations. Snake's binoculars have also been revamped; instead of selecting the binoculars as an item, the binoculars are hot keyed to a button. The player is able to mark enemies and be aware of their locations in the iDroid's holographic display. There are directional cues to help players when an enemy sees them from a distance and gets closer to them. A new &quot;Reflex Mode&quot; is activated when an enemy finds Snake and the player only has a short window of time (in slow motion) to take out the enemy before he fully sounds the alarm (a hissing audio cue can be heard if the player is detected by searchlight). Lights can be shot out to further aid the player's stealth efforts.\n\nGround Zeroes features seven missions in total, locked at individual levels. After completing the main mission the player will unlock four subsequent missions (referred to as &quot;Side Ops&quot;) set at different points in the day, all set in Camp Omega. These missions involve specific tasks, such as eliminating certain targets or obtaining classified information. After achieving a certain objective in the main mission, the player may unlock two additional &quot;Extra Op&quot; missions.\n\nAs the game is introductory in nature, being a prologue, the core story mission can be completed in a very short time frame. However, the game has many additional challenges, missions and alternative methods of play.\n\n\n* ENJOY","torrent":{"xt":"urn:btih:2b98862a6446e5810b90c40962747455e5c268c3","amp;dn":"Metal+Gear+Solid+5+-+GroundZeros+Portable+Multi-8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b98862a6446e5810b90c40962747455e5c268c3","infoHashBuffer":{"type":"Buffer","data":[43,152,134,42,100,70,229,129,11,144,196,9,98,116,116,85,229,194,104,195]},"announce":[],"urlList":[]}}