{"title":"Getting the Picture - The Visual Culture of the News 2015 Gooner","uid":12424722,"size":5667385,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c1f58f2a8d23cf2c91675e96d317f3362138706&amp;dn=Getting+the+Picture+-+The+Visual+Culture+of+the+News+2015+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1442359154,"description":"Publisher: Bloomsbury Academic (February 26, 2015)\nLanguage: English\nISBN-10: 1472524225\nISBN-13: 978-1472524225\n\nPowerful and often controversial, news pictures promise to make the world at once immediate and knowable. Yet while many great writers and thinkers have evaluated photographs of atrocity and crisis, few have sought to set these images in a broader context by defining the rich and diverse history of news pictures in their many forms.\n\nFor the first time, this volume defines what counts as a news picture, how pictures are selected and distributed, where they are seen and how we critique and value them. Presenting the best new thinking on this fascinating topic, this book considers the news picture over time, from the dawn of the illustrated press in the nineteenth century, through photojournalism's heyday and the rise of broadcast news and newsreels in the twentieth century and into today's digital platforms. It examines the many kinds of images: sport, fashion, society, celebrity, war, catastrophe and exoticism; and many mediums, including photography, painting, wood engraving, film and video. Packed with the best research and full colour-illustrations throughout, this book will appeal to students and readers interested in how news and history are key sources of our rich visual culture","torrent":{"xt":"urn:btih:2c1f58f2a8d23cf2c91675e96d317f3362138706","amp;dn":"Getting+the+Picture+-+The+Visual+Culture+of+the+News+2015+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c1f58f2a8d23cf2c91675e96d317f3362138706","infoHashBuffer":{"type":"Buffer","data":[44,31,88,242,168,210,60,242,201,22,117,233,109,49,127,51,98,19,135,6]},"announce":[],"urlList":[]}}