{"title":"Cicero - Philosophical &amp; Political Works (16 books)","uid":10087741,"size":126522130,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c274543645e2083d430f4515dd0c47fe718b939&amp;dn=Cicero+-+Philosophical+%26amp%3B+Political+Works+%2816+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"workerbee","files":-1,"time":1399136239,"description":"\nMARCUS TULLIUS CICERO (106 BCE - 43 BCE) was a Roman philosopher, politician, lawyer, orator, political theorist, consul and constitutionalist.  He came from a wealthy municipal family of the Roman equestrian order, and is widely considered one of Rome's greatest orators and prose stylists.\n\nHis influence on the Latin language was so immense that the subsequent history of prose in not only Latin but European languages up to the 19th century was said to be either a reaction against or a return to his style.  According to Michael Grant, &quot;the influence of Cicero upon the history of European literature and ideas greatly exceeds that of any other prose writer in any language&quot;.  The peak of his authority and prestige came during the eighteenth-century Enlightenment, and his impact on leading Enlightenment thinkers such as John Locke, David Hume, and Montesquieu was substantial.  His works rank among the most influential in European culture, and today still constitute one of the most important bodies of primary material for the writing and revision of Roman history, especially the last days of the Roman Republic.\n\nIn addition to the works of Cicero, Anthony Everitt's recent (2002) biography is also included here.\n\n\nThe following books are in PDF format unless otherwise indicated:\n\n* AGAINST VERRES, 2.1.53-86: Latin text with Introduction, Study Questions, Commentary and English translation (OpenBook, 2011).  Edited by Ingo Gildenhard.\n\n* BACK FROM EXILE: Six Speeches Upon His Return (American Philological Association, 1991).  Translated with Introductions and Notes by D. R. Shackleton Bailey.\n\n* HOW TO RUN A COUNTRY: An Ancient Guide for Modern Leaders (Princeton University Press, 2013).  Selected, translated, and with an Introduction by Philip Freeman.\n\n* O TEMPORA! O MORES: Cicero's &quot;Catilinarian Orations&quot;: A Student Edition with Historical Essays (University of Oklahoma Press, 2005).  Edited by Susan O. Shapiro.\n\n* ON ACADEMIC SCEPTICISM (Hackett, 2006).  Translated with Introduction and Notes by Charles Brittain.\n\n* ON DIVINATION: De Divinatione, Book I (Clarendon Press, 2006).  Translated with Introduction and Historical Commentary by David Wardle.\n\n* ON DUTIES (Cambridge University Press, 1991).  Edited by M. T. Griffin and E. M. Atkins.\n\n* ON MORAL ENDS (Cambridge University Press, 2004).  Edited by Julia Annas; translated by Raphael Woolf.\n\n* ON THE COMMONWEALTH &amp; ON THE LAWS (Cambridge University Press, 1999).  Edited by James E. G. Zetzel.\n\n* POLITICAL SPEECHES (Oxford World's Classics, 2006).  Translated with Introduction and Notes by D. H. Berry. -- PDF + ePUB\n\n* PRO M. CAELIO ORATIO (Clarendon Press, 1960).  Third edition, edited with Introduction and Commentary by R. G. Austin.\n\n* THE REPUBLIC &amp; THE LAWS (Oxford World's Classics, 1998).  Translated by Niall Rudd, with Introduction and Notes by Jonathan Powell and Niall Rudd. -- ePUB\n\n* SELECTED LETTERS (Oxford World's Classics, 2008).  Translated with Introduction and Notes by P. G. Walsh.\n\n* SPEECH ON BEHALF OF PUBLIUS SESTIUS (Clarendon Press, 2006).  Translated with Introduction and Commentary by Robert A. Kaster.\n\n* TOPICA (Oxford University Press, 2003).  Edited with a Translation, Introduction, and Commentary by Tobias Reinhardt.\n\n\nBonus book ==&gt; Anthony Everitt - CICERO: THE LIFE AND TIMES OF ROME'S GREATEST POLITICIAN (Random House, 2002). -- ePUB\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                               &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n\n","torrent":{"xt":"urn:btih:2c274543645e2083d430f4515dd0c47fe718b939","amp;dn":"Cicero+-+Philosophical+%26amp%3B+Political+Works+%2816+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c274543645e2083d430f4515dd0c47fe718b939","infoHashBuffer":{"type":"Buffer","data":[44,39,69,67,100,94,32,131,212,48,244,81,93,208,196,127,231,24,185,57]},"announce":[],"urlList":[]}}