{"title":"Money Rules: Rule Your Money or Your Money Will Rule You","uid":9386431,"size":3326566,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c38ea78f492bae533107da2d5687c3b0af07c10&amp;dn=Money+Rules%3A+Rule+Your+Money+or+Your+Money+Will+Rule+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"MucGar","files":-1,"time":1387811158,"description":"Money Rules: Rule Your Money or Your Money Will Rule You\n\n\nEnglish | ISBN: 1443408956 | 2013 | 512 pages | EPUB | 3 MB\n\n\nGail likes to say that money isn't rocket science, it's discipline. But even she acknowledges that there are tricks to her trade and that making money decisions often feels more complicated than it should. So, where to start? With Gail's Money Rules, of course, her essential rules for making your money work for you. Covering every topic under the financial sun--from TFSAs to taxes, borrowing to breaking bad habits, relationships to RRSPs--Gail tells readers that many of the rules they have been following might actually be working against their best interests. Some of her advice is, as she says, common sense (Rule #17: Needs Must Come Before Wants), some of it is surprising (Rule #222: Don't Borrow to Contribute to an RRSP), and some is even counterintuitive coming from Gail (Rule #261: Take Pleasure from Your Money). All of the rules are delivered in digestible pieces that each give the reader a clear sense of what works and what doesn't. For money-phobes, this book will be a kick in the pants; for money-minders, it will ease the worry that there might be a financial tone they've left unturned; for everyone else, Gail's rules provide what it takes to build a strong financial foundation that will last a lifetime.","torrent":{"xt":"urn:btih:2c38ea78f492bae533107da2d5687c3b0af07c10","amp;dn":"Money+Rules%3A+Rule+Your+Money+or+Your+Money+Will+Rule+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c38ea78f492bae533107da2d5687c3b0af07c10","infoHashBuffer":{"type":"Buffer","data":[44,56,234,120,244,146,186,229,51,16,125,162,213,104,124,59,10,240,124,16]},"announce":[],"urlList":[]}}