{"title":"Sixaxis Controller v0.7.4","uid":9178946,"size":352155,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:2ca243987140e7e1d02ee61ccb447a7bf378b918&amp;dn=Sixaxis+Controller+v0.7.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":".BONE.","files":-1,"time":1384203040,"description":"Finally the wait is over... The ultimate gaming experience awaits! Now you can play games on your phone the way they were meant to be played! Sixaxis Controller allows you to use your Sixaxis and DualShock 3 controllers in many of your favourite games and applications.\n\nPlease read all instructions carefully.\nNot all devices are supported, therefore it is strongly recommended that you try the 'Sixaxis Compatibility Checker' (available for free in the Android Market) before purchasing this app.\nIMPORTANT\nROOT access is required!!!\nDue to the way pairing is done with the controllers, you need to manually pair your controller with the PC utility 'SixaxisPairTool' (available on the website) and a mini-USB cable. Android 3.1+ users can also pair directly on their devices via USB.\nIt is highly recommended that you use an ORIGINAL controller. Many after market controllers will not work with this app. If you get a 'Client connected: 1' message, but the lights on your controller continue to flash, it is almost certainly not an original Sony controller.\nBe sure to read the instructions in the help menu carefully.\nFeatures:\nUp to four Sixaxis and DualShock 3 controllers supported at once.\nSupport as a native gamepad in Android 3.1+ devices. Full support for analog sticks and analog triggers.\nKeyboard emulation. Map all buttons and sticks to almost any key available in Android.\nMouse emulation. Configure a button to activate the mouse pointer on devices that support mice (most tablets, and many phones should work).\nTouch emulation allows you to map buttons and analog sticks to the screen. Play all your favourite games with full analog support, even those without built-in controller support!\n\nThis product is not affiliated with, nor authorized, endorsed or licensed in any way by Sony Corporation, its affiliates or subsidiaries. All trademarks are property of their respective holders.\n\nWhat's in this version : (Updated : Nov 9, 2013)\nNow compatible with Android KitKat 4.4.\nFix for some new controllers wrongly being detected as fake.\nExperimental vibration feedback (enable under General Settings)\nFix for some fake controllers.\nAdded exponential curve adjustment to analog touch button.\nNew driver for devices with MTK chipsets.\nSupport for PlayStationÂ®Move Navigation Controller.\nAdded Brazilian Portuguese (if you're interested in translating the app to other languages, please get in touch).\nRequired Android O/S : 2.2+","torrent":{"xt":"urn:btih:2ca243987140e7e1d02ee61ccb447a7bf378b918","amp;dn":"Sixaxis+Controller+v0.7.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ca243987140e7e1d02ee61ccb447a7bf378b918","infoHashBuffer":{"type":"Buffer","data":[44,162,67,152,113,64,231,225,208,46,230,28,203,68,122,123,243,120,185,24]},"announce":[],"urlList":[]}}