{"title":"Guided Mindfulness Meditation Series 3 - Jon Kabat-Zinn","uid":4905568,"size":233422289,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2cfd90930a0d4d86174dba58b86671301e2cbc68&amp;dn=Guided+Mindfulness+Meditation+Series+3+-+Jon+Kabat-Zinn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":2,"uploader":"tmblr443","files":12,"time":1242869768,"description":"Series 3 is a set of brand new (2005) guided meditations on four CDs to accompany Dr. Kabat-Zinn's new book, Coming to Our Senses: Healing Ourselves and the World Through Mindfulness. It begins with the cultivation of mindfulness of breathing (the &quot;breathscape&quot;) and mindfulness of body sensations (the &quot;bodyscape&quot;) on the three bands of CD #1.\n\nCD #2 features the cultivation of mindfulness via the experience of hearing whatever is coming to the ears (the &quot;soundscape&quot;) and to the experiencing of thoughts and emotions unfolding from moment to moment (the &quot;mindscape&quot;). This CD also includes a lying down meditation in the yogic corpse pose, specifically designed to help us learn how to cultivate mindfulness while lying down, to actually learn how to fall awake to the full range of our present moment experience by &quot;dying&quot; to the past and the future, rather than, as so often happens when practicing meditation while lying down, inadvertently falling asleep.\n\nCD #3 features the practice of choiceless awareness (the &quot;nowscape&quot;), in which we let go of selecting specific objects of attention to feature in the field of awareness and to be mindful of, and instead, invite our awareness to be so spacious that it includes anything and everything that might arise in any present moment, just as a mirror does not choose what to reflect but reflects whatever comes before it. This CD also features instructions for mindful walking meditation, which can be practiced on your own once you have listened to the instructions.\n\nCD #4 features an extended loving kindness meditation, directed both inwardly and outwardly, in which we cultivate intimacy with the landscape of our own heart, the heartscape and open to its capacity for deep nurturance, empathy, and healing for ourselves and for others . It also includes a guided meditation on how to bring mindfulness effortlessly into every aspect of everyday life, into what you might call the lifescape. When all is said and done, perhaps this is the most profound and most important of all these practices, and will make the most difference in your life and the lives of those you love and care for.\n\nCDs\n\nThe CDs are packaged in a protective folder that includes a page of instructions on &quot;How to Use Your Mindfulness Meditation Practice CDs&quot; and a note of explanation about the program from Dr. Kabat-Zinn.\n\nCD 1\n(a) Breathscape (20 minutes); (b) Bodyscape (20 minutes); (c) Breathscape and Bodyscape, with more silence and less guidance (20 minutes).\n\nCD 2\n(a) Soundscape (27 minutes); (b) Mindscape (20 minutes); (c) Dying Before You Die ? Corpse pose meditation (30 minutes).\n\nCD 3\n(a) Choiceless awareness / Nowscape (30 minutes); (b) Walking Meditation Instructions (10 minutes).\n\nCD 4\n(a) Lovingkindness / Heartscape (47 minutes); (b) Mindfulness in Everyday Life / Lifescape (12 minutes).","torrent":{"xt":"urn:btih:2cfd90930a0d4d86174dba58b86671301e2cbc68","amp;dn":"Guided+Mindfulness+Meditation+Series+3+-+Jon+Kabat-Zinn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cfd90930a0d4d86174dba58b86671301e2cbc68","infoHashBuffer":{"type":"Buffer","data":[44,253,144,147,10,13,77,134,23,77,186,88,184,102,113,48,30,44,188,104]},"announce":[],"urlList":[]}}