{"title":"Shadowrun Dragonfall-RELOADED","uid":9674360,"size":1250378159,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2d294408d9cad53ee09c9890fa474e1896367bd4&amp;dn=Shadowrun+Dragonfall-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"HeroMaster","files":-1,"time":1393534273,"description":"nERv\n\nShadowrun: Dragonfall (c) Harebrained Schemes\n02/2014: RELEASE.DATE .. PROTECTION: Steam\n1: DISC(S) .. GAME.TYPE: Adventure, Indie\nRPG, Strategy\n\nMAN MEETS MAGIC &amp; MACHINE. In 2012, magic returned to our world, awakening\npowerful creatures of myth and legend. Among them was the Great Dragon\nFeuerschwinge, who emerged without warning from the mountains of Germany\nunleashing fire, death, and untold destruction across the countryside. It\ntook German forces nearly four months to finally shoot her down - and when\nthey finally did, the event became known as the Dragonfall\n\nIt's 42 years later - 2054 - and the world has changed. Unchecked advances in\ntechnology have blurred the line between man and machine. Elves and trolls\nwalk among us, ruthless corporations bleed the world dry, and Feuerschwinge's\nreign of terror is just a distant memory. Germany is splintered - a stable\nanarchy known as the Flux State controls the city of Berlin. It's a place\nwhere power is ephemeral, almost anything goes, and the right connections can\nbe the difference between success and starvation. For you and your team of\nbattle-scarred shadowrunners, there's no better place to earn a quick payday\n\nNow, a new threat is rising, one that could mean untold chaos and\ndevastation. One that soon has you and your team caught on the wrong side of\na deadly conspiracy. The only clue: whispers of the Dragonfall. Rumors that\nthe Great Dragon Feuerschwinge may still be alive, waiting for the right\nmoment to return\n\nShadowrun: Dragonfall Features\n* Experience a New Full-Length Campaign: Return to the Tech meets Magic\nfuture of Shadowrun in an all-new 12+ hour campaign. Operating out of an\noffbeat hub neighborhood, you'll choose which missions to accept and how\nyou'll approach them while navigating the dark underbelly of the Flux\n* An Exciting New Locale: Shadowrun: Dragonfall transports runners to the\nFree City of Berlin, a thrilling Shadowrun setting full of gorgeous new\nhi-res environments, a diverse new cast of characters, and a new soundtrack\nby Sam Powell, the composer of the original Sega Genesis Shadowrun game\n* Command Your Team: Lead a small team of shadowrunners, each with their own\noutlook and backstory. The members of your team are designed to play unique\nroles during missions, and each has a distinct set of skills, abilities\nstrengths, and weaknesses\n* New Weapons, Portraits, Enemies &amp; More: Try your hand at the long-range\nsniper rifle, explosive grenade launcher, or stun-inducing taser. Chrome\nyourself out in the latest cyberware, and take on deadly new enemies\nincluding new magical creatures like gargoyles and fire drakes. Dragonfall\nbrings a host of new items, characters, over 60 new portraits to choose from\nand many other improvements to the Shadowrun Returns experience\n* Save Anywhere: You can save your progress at any time during the game. The\nnew save-game functionality is available in new downloads of Shadowrun\nReturns and through a patch for all existing copies\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game. This release is standalone and does not require any\nother release of Shadowrun Returns\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT!\n(the DRM-free version)\n\n\nSystem Requirements:\n\n\nOS:Windows XP SP3/Vista/Windows 7 \nProcessor: x86-compatible 1.4GHz or faster processor \nMemory:2 GB RAM \nGraphics:DirectX compatible 3D graphics card with at least 256MB of \naddressable memory \nDirectX:9.0 \nHard Drive:2 GB HD space\n\n\nPoster:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/Pnjlwdm.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/Pnjlwdm.png&lt;/a&gt;\n\n\nScreenshots:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/LGQRBtC.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/LGQRBtC.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://i.imgur.com/BmFk0VI.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/BmFk0VI.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://i.imgur.com/aETIyr6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/aETIyr6.jpg&lt;/a&gt;\n\n\nSEED AND ENJOY!","torrent":{"xt":"urn:btih:2d294408d9cad53ee09c9890fa474e1896367bd4","amp;dn":"Shadowrun+Dragonfall-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d294408d9cad53ee09c9890fa474e1896367bd4","infoHashBuffer":{"type":"Buffer","data":[45,41,68,8,217,202,213,62,224,156,152,144,250,71,78,24,150,54,123,212]},"announce":[],"urlList":[]}}