{"title":"Neurons.To.Nirvana.Understanding.Psychedelic.Medicines.2013.1080","uid":9077479,"size":2020980532,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:2d3764b39cb74e39072fa0f9377651f60025f332&amp;dn=Neurons.To.Nirvana.Understanding.Psychedelic.Medicines.2013.1080&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":2,"uploader":"otnor","files":1,"time":1382316353,"description":"NEURONS TO NIRVANA: UNDERSTANDING PSYCHEDELIC MEDICINES is a richly-illustrated feature documentary about the resurgence of psychedelics as medicine. Through interviews with the world's foremost researchers, writers, psychologists and pioneers in psychedelic psychotherapy, the film explores five powerful psychedelic substances (LSD, Psilocybin, MDMA, Ayahuasca and Cannabis) and their previously established medicinal and psychotherapeutic potential.\n\nFor the first time in two generations, the use of these drugs is not being presented as harmful or as self-indulgent, but as a rational and valuable addition to therapeutic practice. Several well-respected researchers are conducting clinical trials to treat a range of afflictions: PTSD, addictions and the psychological stresses suffered by late-stage terminal cancer patients. The initial results of all these studies are remarkable. The story extends beyond these trials however. Clients of licensed therapists are using psychedelics not as escape routes or addictive crutches, but in a quest for transformation, mental health, creativity, intellectual and spiritual enhancement and insight.\n\nNEURONS TO NIRVANA explores the promise of these brave new advances in psychopharmacology and cultural understanding guiding the viewer in a thought-provoking journey, as told by those determined to hold open the doors of perception.\n\nThe film introduces a vibrant spectrum of characters who champion psychoactive drugs for medicinal use including Rick Doblin, Ph.D., President and Founder of the Mulitdisciplinary Association for Psychedelic Studies (MAPS); Amanda Feilding, Countess of Wemyss, whose Beckley Foundation to Further Consciousness has supported research in this field; National Geographic &quot;Explorer in Residence&quot; Wade Davis, Dr. Dennis McKenna, ethnopharmacologist and expert on DMT and ayahuasca; Dr. Gabor Mate, award-winning author and expert on addictions; Dr. Michael Mithoefer, who conducted ground-breaking PTSD trails with MDMA, and many others.","torrent":{"xt":"urn:btih:2d3764b39cb74e39072fa0f9377651f60025f332","amp;dn":"Neurons.To.Nirvana.Understanding.Psychedelic.Medicines.2013.1080","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d3764b39cb74e39072fa0f9377651f60025f332","infoHashBuffer":{"type":"Buffer","data":[45,55,100,179,156,183,78,57,7,47,160,249,55,118,81,246,0,37,243,50]},"announce":[],"urlList":[]}}