{"title":"Seven Skeletons - The Evolution of the World's Most Famous Human","uid":15604848,"size":23408294,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f0449a3224de1449589bd3866efbff0248f8c56&amp;dn=Seven+Skeletons+-+The+Evolution+of+the+World%27s+Most+Famous+Human&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":2,"uploader":"gnv65","files":5,"time":1471706936,"description":"Seven Skeletons - The Evolution of the World's Most Famous Human Fossils\r\nby Lydia Pyne\r\nViking | August 2016 | eISBN: 978-0-698-40942-2 | ePUB | 22.2 mb\r\n\r\nAn irresistible journey of discovery, science, history, and myth making, told through the lives and afterlives of seven famous human ancestors\r\n\r\nOver the last century, the search for human ancestors has spanned four continents and resulted in the discovery of hundreds of fossils. While most of these discoveries live quietly in museum collections, there are a few that have become world-renowned celebrity personas-ambassadors of science that speak to public audiences. In Seven Skeletons, historian of science Lydia Pyne explores how seven such famous fossils of our ancestors have the social cachet they enjoy today.\r\nDrawing from archives, museums, and interviews, Pyne builds a cultural history for each celebrity fossil-from its discovery to its afterlife in museum exhibits to its legacy in popular culture. These seven include the three-foot tall &quot;hobbit&quot; from Flores, the Neanderthal of La Chapelle, the Taung Child, the Piltdown Man hoax, Peking Man, Australopithecus sediba, and Lucy-each embraced and celebrated by generations, and vivid examples of how discoveries of how our ancestors have been received, remembered, and immortalized.\r\nWith wit and insight, Pyne brings to life each fossil, and how it is described, put on display, and shared among scientific communities and the broader public. This fascinating, endlessly entertaining book puts the impact of paleoanthropology into new context, a reminder of how our past as a species continues to affect, in astounding ways, our present culture and imagination\r\n\r\nAbout the Author\r\nLydia Pyne has degrees in history and anthropology and a PhD in history and philosophy of science from Arizona State University. She has participated in field and archival work in South Africa, Ethiopia, Uzbekistan, Iran, and the American Southwest. She has published articles and essays in The Atlantic, Nautilus, and Public Domain Review. She lives in Austin, Texas, where she is an avid rock climber and mountain biker.\r\nShe is a freelance writer, editor, and historian, and a Research Fellow in the Institute for Historical Studies at the University of Texas of Austin, USA. She is a Contributing Editor for The &quot;Appendix &quot;and a Reviewer and Essayist for &quot;NewPages &quot;and &quot;New York Journal of Books&quot;. She is the author, with Stephen J. Pyne, of &quot;The Last Lost World: Ice Ages, Human Origins, and the Invention of the Pleistocene&quot; (Penguin, 2013). \r\n\r\nCONTENTS\r\nTitle Page\t\r\nCopyright\t\r\nDedication\r\nINTRODUCTION. Famous Fossils, Hidden Histories\r\nONE. The Old Man of La Chapelle: The Patriarch of Paleo\r\nTWO. Piltdown: A Name Without a Fossil\r\nTHREE. The Taung Child: The Rise of a Folk Hero\r\nFOUR. Peking Man: A Curious Case of Paleo-Noir\r\nFIVE. The Ascension of an Icon: Lucy in the Sky\r\nSIX. The Precious: Flo’s Life as a Hobbit\r\nSEVEN. Sediba: TBD (To Be Determined)\r\nAFTERWORD. O Fortuna!: A Bit of Luck, a Bit of Skill\t\r\nAcknowledgments\t\t\r\nNotes\t\r\nBibliography\t\t\r\nIndex\r\n \nhttps://s4.postimg.io/szaaxlrjh/Seven_Skeletons_The_Evolution_of_the_World_s_M.jpg","torrent":{"xt":"urn:btih:2f0449a3224de1449589bd3866efbff0248f8c56","amp;dn":"Seven+Skeletons+-+The+Evolution+of+the+World%27s+Most+Famous+Human","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f0449a3224de1449589bd3866efbff0248f8c56","infoHashBuffer":{"type":"Buffer","data":[47,4,73,163,34,77,225,68,149,137,189,56,102,239,191,240,36,143,140,86]},"announce":[],"urlList":[]}}