{"title":"Xenonauts (Latest With 1.06 Patch) (GOG)","uid":10416775,"size":2658293135,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2fe6d66a1c42722748bacbd0a6607af785c55ee6&amp;dn=Xenonauts+%28Latest+With+1.06+Patch%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":1,"uploader":"Sarah116","files":9,"time":1403593279,"description":"Hey guys, here Xenonauts with 1.06 patch. Hope you enjoy  and please help seed.\n\n\n-----------------\n\n\nChangelog:1.06 Patch Notes\n\n\n- Final mission no longer ends prematurely in some circumstances. \n\n- Fully disabled a debug module that was trying to contact our servers (we \nthought we'd fixed this earlier but it seems not). This sometimes caused \ncrashes or slow loading times. \n\n- Line of sight now updates properly if the aliens open UFO doors during \nthe AI turn. \n\n- Fixed a bug where units could move through doors without opening them on \nnight missions. \n\n- Base turrets have had their firepower upgraded significantly. \n\n- Fixed one of the alien weapons having overly high Burst accuracy. \n\n- Fixed the autopsy for one of the later aliens giving an empty pop-up. \n\n- Final manual has been added to the game. \n\n\n----------------\n\n\nWhat's cool about it:\nGround Combat: Xenonauts delivers tense turn-based combat across realistic, varied and fully-destructible battlefields, against almost fifty different variants of enemy. Missions range from capturing crashed UFOs or alien bases to defending cities (or even Xenonaut facilities) against alien attack. You'll experience the chill of encountering a new alien for the first time and the joys of test-firing a new weapon for the first time. Deeply asymmetric combat keeps the battles interesting - after all, you're fighting intergalactic invaders with 1970's ballistic technology!\n\n\nPersistent Soldiers: Soldiers in Xenonauts are persistent from mission to mission, improving their stats and gaining ranks with combat experience - but their deaths are always only a single bad move away. You will grow to care about the brave men and women under your command as they slowly grow from green rookies into hardened veterans, but that only makes it more painful when their heroic tale is cruelly cut short by a burst of plasma fire...\n\n\nResearch Tree: Xenonauts has an extensive research tree with almost a hundred projects to unlock, each with its own unique description and painted artwork. It slowly reveals the intentions and origins of the invaders, while also unlocking new battlefield equipment, aircraft and vehicles for you to use as you harness alien technology and turn it against them.\n\n\nOverview:\n\nXenonauts is a strategy game in which you control a multi-national military organisation defending a Cold War-era Earth from alien invasion, using small squads of persistent soldiers to eliminate the extraterrestrials and recover their technology in turn-based ground combat. A detailed strategic layer allows you to co-ordinate the defence of the planet, using your interceptors to shoot down UFOs and researching captured artefacts to learn about your foes and unlock new combat equipment to use on your missions.\n\nXenonauts is a spiritual successor to the classic X-Com strategy games from the 1990s. We aim to improve the graphics, add new content and streamline the interface whilst still retaining all of the key mechanics of the original games. Devoted fans should love this game, but we're also keen to introduce the joys of old-school grand strategy to a whole new generation of players who might not otherwise experience it!\n\n &lt;a href=&quot;\nhttp://www.gog.com/game/xenonauts&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/xenonauts&lt;/a&gt;","torrent":{"xt":"urn:btih:2fe6d66a1c42722748bacbd0a6607af785c55ee6","amp;dn":"Xenonauts+%28Latest+With+1.06+Patch%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fe6d66a1c42722748bacbd0a6607af785c55ee6","infoHashBuffer":{"type":"Buffer","data":[47,230,214,106,28,66,114,39,72,186,203,208,166,96,122,247,133,197,94,230]},"announce":[],"urlList":[]}}