{"title":"Mindware: Tools for Smart Thinking - Richard Nisbett (epub,azw)","uid":12335668,"size":1554819,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fed43dc30a16905ea4ee65209bd0232c8e584d4&amp;dn=Mindware%3A+Tools+for+Smart+Thinking+-+Richard+Nisbett+%28epub%2Cazw%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":0,"uploader":null,"files":2,"time":1441234692,"description":"Scientific and philosophical concepts can change the way we solve problems by helping us to think more effectively about our behavior and our world. Surprisingly, despite their utility, many of these tools remain unknown to most of us.\n\nIn Mindware, the world-renowned psychologist Richard E. Nisbett presents these ideas in clear and accessible detail. Nisbett has made a distinguished career of studying and teaching such powerful problem-solving concepts as the law of large numbers, statistical regression, cost-benefit analysis, sunk costs and opportunity costs, and causation and correlation, probing the best methods for teaching others how to use them effectively in their daily lives. In this groundbreaking book, Nisbett shows us how to frame common problems in such a way that these scientific and statistical principles can be applied to them. The result is an enlightening and practical guide to the most essential tools of reasoning ever developed-tools that can easily be used to make better professional, business, and personal decisions.\n\n===============================\n\nEditorial Reviews\n\n\nNisbett . . . immerses his readers in a great depth of knowledge but with such clear teaching and precise examples that they will enjoy the exercise and the result . . . A joy to own and mark up, a great gift of enlightenment from an expert and exemplary teacher. The section on Logic and Dialectical Reasoning, comparing cultures East and West, rewards readers who can accept uncertainty as the cost of deeper insight. (E. James Lieberman Library Journal)\n\nThe bad news is that our intuitive ways of thinking about the world are wrong. The good news is that it isn't hard to set them right. Nobody knows more about these things than the eminent psychologist Richard E. Nisbett, who has dedicated his life to understanding the shortcomings of the human mind and to finding ways to fix them. This book should be required reading at every university. (Daniel Gilbert, author of Stumbling on Happiness)\n\nAnyone who wants to think better, make better decisions, and be happier should read this brilliant book by the world's most eminent living social psychologist. In other words, everyone should read this book, and the sooner the better! (Timothy D. Wilson, Author of Redirect: Changing the Stories We Live By)\n\nAll the wisdom of twentieth- and twenty-first-century psychological research has been distilled into one superb book--for your everlasting benefit! You will take a giant step on the path to better decisions in your life. (Carol Dweck, author of Mindset: The New Psychology of Success)\n\nMindware will make you a better thinker, investor, parent, consumer, and leader. There are surprises and delights on each page. Every country should scrap a year or two of math education and require all citizens to read this book instead. (Jonathan Haidt, author of The Righteous Mind: Why Good People Are Divided by Politics and Religion)","torrent":{"xt":"urn:btih:2fed43dc30a16905ea4ee65209bd0232c8e584d4","amp;dn":"Mindware%3A+Tools+for+Smart+Thinking+-+Richard+Nisbett+%28epub%2Cazw%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fed43dc30a16905ea4ee65209bd0232c8e584d4","infoHashBuffer":{"type":"Buffer","data":[47,237,67,220,48,161,105,5,234,78,230,82,9,189,2,50,200,229,132,212]},"announce":[],"urlList":[]}}