{"title":"The Story So Far - Under Soil and Dirt (2011) [FLAC]","uid":8064900,"size":239586436,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:30a546fb0446ab1be9a862dfba5248cf8d2deb69&amp;dn=The+Story+So+Far+-+Under+Soil+and+Dirt+%282011%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"dickspic","files":13,"time":1359153334,"description":"Pure Noise Records FLAC / Lossless / Log (100%) / Cue\n\n1. States And Minds\n2. Roam\n3. Quicksand\n4. Swords And Pens\n5. High Regard\n6. Daughters\n7. Mt. Diablo\n8. Four Years\n9. Rally Cap\n10. Placeholder\n11. Closure\n\n\nIt seems that most everyone (all the pop-punk fans on Sputnik, anyway) agrees that Under Soil and Dirt is at the very least notable, and at the best, the latest pop-punk milestone. Some of the reasons for this are fairly obvious: the perfectly carved choruses that manage to be simultaneously intimate and anthemic, the presence of both punchy, low-note riffs and deeply textured, twinkly melodies, and the fact that in any corner of the album it's hard to find a songwriting mishap. But in my recent experience with the album, I've explored deeper into what were only hints and hunches during my first few encounters with it. As a result, the album is now something more to me than just good songwriting, good musicianship, and a refreshing amount of instrumental variety. It's another shoulder to lean on.\n\nNow, I'm not saying I'm the only one with this kind of relationship with this album. I guess this is just me declaring my joining the club. And telling you why you should, too! Only four payments of $19.95 for an inane newsletter in your e-mailbox once a week plus a free lanyard. This album isn't like that. It welcomes you. It knows what you've been through, and it will make you feel like you're actually a member of something.\n\nLet me finally quit beating around the bush. Lyrics like &quot;I'd like to think that you're worth my time, but you embody everything that I hate&quot; at first seemed wordy and obnoxious. But once I found how that style blends with other parts of the album, it all went together and made sense. This album is precise. Yeah, it's got straight-up punk shit: caffeinated drumbeats and pulsing powerchords. And it's also genuinely intimate: the choruses quietly crack with loud conviction. But that's where the preciseness comes in. If you want to blend those two things together, you have to be precise.\n\n&quot;Put yourself in my place for just one day, \nwatch all the colors in your spectrum fade gray,\nmore aware than ever that I might never be calm again.&quot;\n\nThink about it, the general sentiment in those first two lines could be trimmed to five words. There's gotta be a reason they aren't, and there is: the fact that the protagonist's sadness, apathy, etc. is elaborated on gives us a clue as to why he'll never be &quot;calm&quot; again. Why &quot;calm&quot;? Well, your &quot;spectrum&quot; kind of implies, like, everything you see, right? So, &quot;watching all the colors in your spectrum fade gray&quot; would be kinda like watching your life go to shit, more or less. I don't know about you, but watching my life play out in that manner would first attack my calmness. We're calm more than we're happy. We're calm more than we're sad. Calmness is the true precious jewel.\n\nI could go on and on with examples of lyrics like this, lyrics that make sure you know exactly what they're talking about. But hey man, the music does it, too. 'Daughters' is basically half-instrumental, equipped with a harmony that does a great job of expressing the same ideas the first half of the song did (incidentally, the song-half with the line &quot;And to think that you're somebody's daughter - Away at college, not getting smarter&quot;). 'High Regard' also has instrumental breaks that perfectly beset the rest of the song, and 'Placeholder' lays its foundation as an acoustic-based 'ballad' of sorts. Every note is alive and pulsing, but never out of control.\n\nThe album does seem to run out of things to say a little early, but hey, at least there's nothing it says I wish it didn't say. There are also a few crunchy transitions, and a few riffs and melodies that aren't exactly strikingly good. But every song has enough good in it to be wonderful: meticulously scripted lyrics that dig deeper into you with each listen, infectious riffs, and impeccable choruses that single you out in a stadium. I'm just not getting sick of it. Are you? You didn't say you were. You said you weren't. The Story So Far's Under Soil and Dirt: pop-punk for the ages.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:30a546fb0446ab1be9a862dfba5248cf8d2deb69","amp;dn":"The+Story+So+Far+-+Under+Soil+and+Dirt+%282011%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30a546fb0446ab1be9a862dfba5248cf8d2deb69","infoHashBuffer":{"type":"Buffer","data":[48,165,70,251,4,70,171,27,233,168,98,223,186,82,72,207,141,45,235,105]},"announce":[],"urlList":[]}}