{"title":"Guitar Pro 6.1.5 MacOSX-EMBRACE","uid":9116218,"size":687168206,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:31b004460af2de4d3ba07d973ec79d14dddb63f6&amp;dn=Guitar+Pro+6.1.5+MacOSX-EMBRACE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":1,"uploader":"akun91","files":-1,"time":1383016958,"description":"-----------------------------------------------------------------------------------\n                       Guitar Pro 6.1.5 r11553 MacOSX-EMBRACE\n                 --------------------------------------------------\n-----------------------------------------------------------------------------------\n               _______________________________________________________\n\n\nDescription :\n\n\nGuitar Pro is first and foremost a software designed to edit tablatures for guitar, bass, and other fretted instruments from 4 to 8 strings. With Guitar Pro you'll be able to learn how to play, compose and improve your guitar skills. Its great ease of use and the success of its specific file format have made it a software used by guitarists worldwide. It now includes editing support for many other instruments like the piano or the drums, a realistic audio engine, and interactive tools to support every musician's practice.\n\nINTERFACE\nYou'll know how to handle the interface in a matter of minutes, easily navigating over its tabs and buttons. For optimal ease in reading, you'll be able to display your scores as you prefer -- full-screen, double-page, or parchment-like --, and also display a guitar fretboard to visualize the exact positioning of your fingers on it.\n\nEDITING\nExpress your talent by creating your own scores in a matter of minutes. You can edit the notes directly on the standard score or on the tablature. In either case, capture your notes quickly with the numerical pad, the mouse, or even a MIDI instrument.\n\nAUDIO\nGuitar Pro is also a powerful score player, which facilitates composing or learning a piece.\n\nTOOLS\nGuitar Pro is a true workshop for guitarists: chord and scale libraries, tuner, metronom, virtual fretboard and keyboard. All of those tools work with fretted instruments from 4 to 8 strings.\n\nSHARE\nExport the songs you have created or arranged in Guitar Pro, to listen to them on your iPhone or iPad and share them with your friends. You'll have access to thousands of scores in Guitar Pro format (*.gp3, *.gp4, *.gp5, and *.gpx files) shared online by our users. You can also import or export\n\n\n\nRequirements :\n\nMacOS X 10.4 or later\nAdministrator's rights for installation, Internet connection for activation*\nCore Duo 1.8GHz\n2 GB RAM\nDVD-ROM drive\n2 GB free hard disk space\nScreen resolution 1024 x 768\n\n\nWhat's new in Guitar Pro 6.1.5 r11553:\n\n- [added] The YouRockGuitar can be automatically configured with Guitar Pro 6 for you to edit your tabs beat by beat.\n- [added] It is now possible to create a harmonica track from the add-instrument window (menu &quot;Track&quot; &gt; &quot;Add&quot;).\n- [improved] The exporting of MusicXML files is greatly improved.\n- [fixed] MIDI playback is fixed, for an optimal playback of your files.\n- [fixed] Capturing notes on the virtual guitar fretboard is fixed (menu &quot;Display&quot; &gt; &quot;Fretboard / Keyboard / Drums&quot;).\n- [fixed] The .WAV export is now tempo-accurate.\n- [fixed] Some bugs and crashing issues have been fixed.\n\n                ____________________________________________________\n\nContains Soundbanks!\n                ____________________________________________________\n\nInstructions :\n\n1: - Install the software from gp6-full-mac-r11553.dmg\n\n2: - Enter anything for Username and Key Id, fill enough to see the &quot;Offline Activation&quot; button clickable.\n\n3: - Choose Offline Activation and copy the serial it gives you.\n\n4. - Open the keygen by double click.\n\n5. - Copy &amp; paste the code you got from offline activation into the keygen and hit return.\n\n6. - You should then be given the activation serial. Copy &amp; Paste and enjoy!\n\n(You should disable internet access to the app and also auto-updates)\n\n\n\nHow to get rid of the &quot;permission denied error&quot;, when running the keygen through the terminal:\n\n1. Open Terminal;\n\n2. Type and leave a space at the end: chmod u+x\n\n3. Drag n' Drop the keygen_osx, then hit the enter;\n\n4. Try the keygen again, it should work now.\n\nFor those who are getting &quot;permission denied&quot; Problem\nPut the keygen file on your desktop, and type in the terminal chmod_u+x_(drag 'n' drop your keygen file). You can see that your icon have changed from a standard file to a terminal file. Note that the &quot;_&quot; means that you have to enter the space-bar.\n\n                ____________________________________________________\n\nSupport the software creators ! \n\n________________\n\nSeed if you like !\n\n________________\n\nThanks to EMBRACE.\nAkun//MMXIII\t\t","torrent":{"xt":"urn:btih:31b004460af2de4d3ba07d973ec79d14dddb63f6","amp;dn":"Guitar+Pro+6.1.5+MacOSX-EMBRACE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31b004460af2de4d3ba07d973ec79d14dddb63f6","infoHashBuffer":{"type":"Buffer","data":[49,176,4,70,10,242,222,77,59,160,125,151,62,199,157,20,221,219,99,246]},"announce":[],"urlList":[]}}