{"title":"Hitler’s Home Front (2016) [WWRG]","uid":15978169,"size":6863989,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3229d7530ccb00cd1375ddd6f5fa4533809384ba&amp;dn=Hitler%26rsquo%3Bs+Home+Front+%282016%29+%5BWWRG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":4,"uploader":"Lion.King","files":3,"time":1475866552,"description":"\nTwelve years of rule by Hitler and the Nazi Party could have made Germany a third world country after the end of the war, and according to some highly placed Allied officials of the time; that would not have been such a bad idea. Whatever treatment the Allies had in mind for the Germans could not have been much worse than the conditions already in existence for them just before and just after the end of the war. The German economy and infrastructure was already a wreck and the inflation continued after the surrender with prices of essentials (if they could be bought) rising to double and triple that of 1943. Only the war industry continued to function reasonably well right up to the end. He has never voted for any political party and does not support one now, saying that the only honest politician he remembers is Adolf Hitler. “Hitler said, ‘Give me five years and you won’t recognize Germany’.\r\n\r\nThis book is a memoir of Wilhelm Gehlen and his childhood in Nazi Germany, as a Nazi Youth and the awful circumstances which he and his friends and family had to endure during and following the war. Including a handful of recipes and descriptions of the strange and sometimes disgusting food that nevertheless kept people alive, this book sheds light on the truly awful conditions and the common feeling and aim among members of the Hitler Youth – that it was their duty to do everything possible to save the Thousand Year Reich in 1945.[/b]","torrent":{"xt":"urn:btih:3229d7530ccb00cd1375ddd6f5fa4533809384ba","amp;dn":"Hitler%26rsquo%3Bs+Home+Front+%282016%29+%5BWWRG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3229d7530ccb00cd1375ddd6f5fa4533809384ba","infoHashBuffer":{"type":"Buffer","data":[50,41,215,83,12,203,0,205,19,117,221,214,245,250,69,51,128,147,132,186]},"announce":[],"urlList":[]}}