{"title":"Money and Power: How Goldman Sachs Came to Rule - Audiobook MP3","uid":11350241,"size":870817046,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:322c763bc42c2e72e09f073e7d50c709f1c5a3ba&amp;dn=Money+and+Power%3A+How+Goldman+Sachs+Came+to+Rule+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":6,"uploader":"Squiddy82","files":-1,"time":1414892597,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nMoney and Power: How Goldman Sachs Came to Rule the World\n\nWritten by: William D. Cohan\nNarrated by: Rob Shapiro\nLength: 30 hrs and 5 mins\nUnabridged Audiobook\nRelease Date:04-12-11\n\nFrom the best-selling, prize-winning author of The Last Tycoons and House of Cards, a revelatory history of Goldman Sachs, the most dominant, feared, and controversial investment bank in the world.\n\nFor much of its storied 142-year history, Goldman Sachs has projected an image of being better than its competitors - smarter, more collegial, more ethical, and far more profitable. The firm - buttressed by the most aggressive and sophisticated PR machine in the financial industry - often boasts of &quot;The Goldman Way&quot;, a business model predicated on hiring the most talented people, indoctrinating them in a corporate culture where partners stifle their egos for the greater good, and honoring the &quot;14 Principles&quot;, the first of which is &quot;Our clients' interests always come first.&quot;\n\nBut there is another way of viewing Goldman - a secretive money-making machine that has straddled the line between conflict-of-interest and legitimate deal-making for decades; a firm that has exerted undue influence over government since the early part of the 20th century; a company composed of &quot;cyborgs&quot; who are kept in line by an internal &quot;reputational risk department&quot; staffed by former CIA operatives and private investigators; a workplace rife with brutal power struggles; a Wall Street titan whose clever bet against the mortgage market in 2007 - a bet not revealed to its clients - may have made the financial ruin of the Great Recession worse.\n\nAs William D. Cohan shows in his riveting chronicle of Goldman's rise to the summit of world capitalism, the firm has shown a remarkable ability to weather financial crises; congressional, federal and SEC investigations; and numerous lawsuits, all with its reputation and its enormous profits intact. Cohan has constructed a vivid narrative that looks behind the veil of secrecy to reveal how Goldman has become so profitable and so powerful","torrent":{"xt":"urn:btih:322c763bc42c2e72e09f073e7d50c709f1c5a3ba","amp;dn":"Money+and+Power%3A+How+Goldman+Sachs+Came+to+Rule+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"322c763bc42c2e72e09f073e7d50c709f1c5a3ba","infoHashBuffer":{"type":"Buffer","data":[50,44,118,59,196,44,46,114,224,159,7,62,125,80,199,9,241,197,163,186]},"announce":[],"urlList":[]}}