{"title":"Beyond Schizophrenia (2016) (Pdf) Gooner","uid":15846882,"size":3158100,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32f96845986044bd6da8123d33fa177e195f159a&amp;dn=Beyond+Schizophrenia+%282016%29+%28Pdf%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1474111109,"description":"Beyond Schizophrenia - Living and Working with a Serious Mental Illness (2016) (Pdf) Gooner\r\n\r\nPublisher: Rowman &amp; Littlefield Publishers (1 Jun. 2016)\r\nLanguage: English\r\nISBN-10: 1442248335\r\nISBN-13: 978-1442248335\r\n\r\nThe experience of living and working with schizophrenia is often fraught with challenges and setbacks. This book is a comprehensive attempt to explain why, in spite of near-miraculous advances in medication and treatment, persons with mental illness fare worse than almost any other disadvantaged group in the labor market. As a researcher of economics and disability and the mother of a son with schizophrenia, the author speaks from both professional and personal experience. First, she looks at societal factors that affect employment outcomes for persons with schizophrenia (or other serious mental illness), including stigma and discrimination, investments in human capital, the quality of mental health services, and the support of family and friends. Then she examines workplace factors that affect employment outcomes, including employer mandates in the Americans with Disabilities Act, the decision to disclose a diagnosis of mental illness at work, the interaction between job demands and functional limitations, and job accommodations for persons with a serious mental illness. Giving weight to both perspectives, the final chapter outlines a set of policy recommendations designed to improve employment outcomes for this population","torrent":{"xt":"urn:btih:32f96845986044bd6da8123d33fa177e195f159a","amp;dn":"Beyond+Schizophrenia+%282016%29+%28Pdf%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32f96845986044bd6da8123d33fa177e195f159a","infoHashBuffer":{"type":"Buffer","data":[50,249,104,69,152,96,68,189,109,168,18,61,51,250,23,126,25,95,21,154]},"announce":[],"urlList":[]}}