{"title":"Real Estate Finance and Investments, 14th Edition","uid":10860951,"size":8809295,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:33e53b004d1713014c5f842d6103db0ea386cb8a&amp;dn=Real+Estate+Finance+and+Investments%2C+14th+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1408840201,"description":"ABOUT THIS BOOK\nThe Fourteenth Edition of Real Estate Finance and Investments prepares students to understand the risks and rewards associated with investing in and financing both residential and commercial real estate. Concepts and techniques included in the chapters and problem sets are used in many careers related to real estate. The material in this edition is also relevant to individuals who want to better understand real estate for their own personal investment and financing decisions.\n\nThe Fourteenth Edition is designed to help students learn how to evaluate the risk and return associated with the various ways of investing and lending. Upcoming students who are interested in this field can use this book as a guide to perform the right kind of analysis to make informed real estate finance and investment decisions.\n\n\nTABLE OF CONTENTS\nPart 1. Overview of Real Estate Finance and Investments\n\nChapter 1. Real Estate Investment: Basic Legal Concepts\n\nChapter 2. Real Estate Financing: Notes and Mortgages\n\nPart 2. Mortgage Loans\n\nChapter 3. Mortgage Loan Foundations: The Time Value of Money\n\nChapter 4. Fixed Interest Rate Mortgage Loans\n\nChapter 5. Adjustable and Floating Rate Mortgage Loans\n\nChapter 6. Mortgages: Additional Concepts, Analysis, and Applications\n\nPart 3. Residential Housing\n\nChapter 7. Single Family Housing: Pricing, Investment, and Tax Considerations\n\nChapter 8. Underwriting and Financing Residential Properties\n\nPart 4. Incoming-Producing Properties\n\nChapter 9. Income-Producing Properties: Leases, Rents, and the Market for Space\n\nChapter 10. Valuation of Income Properties: Appraisal and the Market for Capital\n\nChapter 11. Investment Analysis and Taxation of Income Properties\n\nChapter 12. Financial Leverage and Financing Alternatives\n\nChapter 13. Risk Analysis\n\nChapter 14. Disposition and Renovation of Income Properties\n\nChapter 15. Financing Corporate Real Estate\n\nPart 5. Financing Real Estate Development\n\nChapter 16. Financing Project Development\n\nChapter 17. Financing Land Development Projects\n\nPart 6. Alternative Real Estate Financing and Investment Vehicles\n\nChapter 18. Structuring Real Estate Investments: Organizational Forms and Joint Ventures\n\nChapter 19. The Secondary Mortgage Market: Pass-Through Securities\n\nChapter 20. The Secondary Mortgage Market: CMOs and Derivative Securities\n\nChapter 21. Real Estate Investment Trusts (REITs)\n\nChapter 22. Real Estate Investment Performance and Portfolio Considerations\n\nIndex\n\n\nABOUT THE AUTHORS\nWilliam B. Brueggeman, Ph.D.\nEdwin L. Cox School of Business\nSouthern Methodist University\nWilliam B. Brueggeman has been an academic and consultant to business and public policy makers for over 30 years in the areas of finance and investment. His primary areas of interest include: real estate finance and investment, performance measurement, valuation, real estate-backed securities, mortgage and equity capital markets, portfolio analysis as well as applied business and regional economics. He has published over 70 articles and reports in his areas of expertise since completing the Ph.D. degree at Ohio State University in 1970 and is also an author of Real Estate Finance and Investments, which is now in its 14th edition, spanning 50 years of publication. It is the most widely used college textbook in real estate finance (in use at over 200 colleges and universities). He has served as President of the American Real Estate and Urban Economics Association and was editor of its journal. He presently holds the Clara and Leo F. Corrigan Chair in Real Estate at SMU (since 1978) and his scholarly work is frequently cited in academic journals and in leading news media (New York Times, Washington Post, Wall Street Journal and Barron's). Industry affiliations include six years as Consulting Director of Real Estate Research, Goldman, Sachs &amp; Co., New York where he conducted research on real estate and REITs and provided support for significant property transactions, corporate real estate divestitures, and spin-offs. He is currently Consulting Director of Research with L&amp;B Realty Advisors in Dallas.\n\nJeffrey D. Fisher, Ph.D.\nKelley School of Business\nIndiana University\nJeffrey D. Fisher, Ph.D. is Director of the Center for Real Estate Studies and the Charles H. and Barbara F. Dunn Professor of Real Estate at the Indiana University Kelley School of Business. He is a research consultant with the National Council of Real Estate Investment Fiduciaries (NCREIF) and has served on the board of NCREIF. Dr. Fisher is currently on the board of the Pension Real Estate Association (PREA) and the board of the Real Estate Research Institute. He received PREA/Graaskamp Award for Research Excellence from the Pension Real Estate Association, the George Bloom Award from the American Real Estate and Urban Economics Association for &quot;Outstanding Contributions to the field of Real Estate&quot; and the Alpha Kappa Psi Alumni Award for Teaching Excellence in Finance at the IU School of Business. He is currently a Research Fellow, member of the faculty and serves on the board of directors of the Weimer School of Advanced Studies in Real Estate and Land Economics, Homer Hoyt Advanced Studies Institute. Dr. Fisher was a founding trustee of The Appraisal Foundation that was formed in 1987 by the major appraisal organizations as a self-regulatory organization and source of standards for the appraisal industry. He served as President of the American Real Estate and Urban Economics Association (AREUEA) in 1990. Fisher also served as the 1986-87 Chairman of the Real Estate Center Directors and Chairholders' Association. Professor Fisher has a doctorate in Real Estate from Ohio State University. He is a coauthor of Real Estate, 9th edition, published by John Wiley and Sons, coauthor of Real Estate Finance and Investments, 14th edition, published by McGraw-Hill/Irwin, and coauthor of Income Property Valuation, published by Dearborn Financial Services. His books have been translated into Japanese, Chinese and Korean.\n\nDr. Fisher has published numerous articles in journals such as The Journal of the American Real Estate and Urban Economics Association, Journal of Real Estate Finance and Economics, The Journal of Urban Economics, The Journal of Real Estate Research, Journal of Portfolio Management, National Tax Journal, Public Finance Quarterly, The Appraisal Journal, Real Estate Review, The Real Estate Appraiser and Analyst, Real Estate Issues and The Journal of Property Tax Management.","torrent":{"xt":"urn:btih:33e53b004d1713014c5f842d6103db0ea386cb8a","amp;dn":"Real+Estate+Finance+and+Investments%2C+14th+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33e53b004d1713014c5f842d6103db0ea386cb8a","infoHashBuffer":{"type":"Buffer","data":[51,229,59,0,77,23,19,1,76,95,132,45,97,3,219,14,163,134,203,138]},"announce":[],"urlList":[]}}