{"title":"Deus E O Diabo Na Terra Do Sol (Black God, White Devil) Glauber","uid":3436767,"size":1474789104,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3436d5d19792a63414e8abfce17bc25fde82b0c2&amp;dn=Deus+E+O+Diabo+Na+Terra+Do+Sol+%28Black+God%2C+White+Devil%29+Glauber&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":4,"uploader":"kegir","files":7,"time":1138404424,"description":"Deus E O Diabo Na Terra Do Sol (Black God, White Devil) Glauber Rocha, 1964\n\nLanguage(s):                    Brazilian Portuguese  \nSubtitle(s):                    VobSub: English, Spanish\n\nThis summer it is time for the World cup in soccer and I think it?s the greatest event in sport. And as usual Brazil is going be among the best. But soccer is not cinema so Brazil is not competing for a top position in that subject. Now and then a movie from Brazil appears in the common market. The latest popular example is Cidade de Deus (City of god). Deus E O Diabo Na Terra Do So is old but it is good.\n\nI pick some comments from the IMDB  to describe Deus E O Diabo Na Terra Do Sol.\n\nThis movie is considered by the critics as the most important Brazilian movie of all times. And they are right in this point. An impressive, outstanding portrait of Brazilian rich culture with a focus on some delicate subjects as religion, faith, violence and economic exploration. Rocha made here a fantastic synthesis of the main problems of Brazil, problems that still remained almost forty years after. Great performances by Del Rey and Mauricio do Valle.\n\nDeus e o Diabo na Terra do Sol isn't just a good Brazilian movie. This is an actual masterpiece, compared to the big ones in the history of cinema. It's not a boring and too regional film, but deals with universal aspects of human nature, such as blind devotion, love, hate, and all kinds of misery. Glauber Rocha, with only 22 years, made a mix of Eisenstein, Italian neo-realism and nouvelle-vague, under a background of cordel literature (our pulp fictions). The Mauricio do Valle character, Antonio das Mortes, is fundamentally a European western anti-hero, and certainly inspired Leone, Corbucci and others in the development of their scripts. The soundtrack, with Villa Lobbos and Rocha&amp;Ricardo songs, matches perfectly with the dry landscape of the Brazilian Northeast. In short, Deus e o Diabo na Terra do Sol must be known. If you have open mind and like great cinema, and not just the popcorn no-brain north-American blockbusters, try this one.\n\nAnyway, this is the first South American movie under the freakyflicks tag. Why is it so?\n\nwww.freakyflicks.tk\n\nSEED AS LEAST AS MUCH AS YOU HAVE DOWNLOADED...PLEASE!\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'\n\n... simply search for 'freakyflicks' \n*************************************** \n************** FREAKYFLICKS ************* \n***************************************\n","torrent":{"xt":"urn:btih:3436d5d19792a63414e8abfce17bc25fde82b0c2","amp;dn":"Deus+E+O+Diabo+Na+Terra+Do+Sol+%28Black+God%2C+White+Devil%29+Glauber","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3436d5d19792a63414e8abfce17bc25fde82b0c2","infoHashBuffer":{"type":"Buffer","data":[52,54,213,209,151,146,166,52,20,232,171,252,225,123,194,95,222,130,176,194]},"announce":[],"urlList":[]}}