{"title":"All the Pope's Men: The Inside Story of How the Vatican Thinks","uid":15789300,"size":805324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:359be09ed7495f2706191a1ef4204a061541bbc4&amp;dn=All+the+Pope%27s+Men%3A+The+Inside+Story+of+How+the+Vatican+Thinks&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"marty14","files":1,"time":1473369774,"description":"All the Pope's Men: The Inside Story of How the Vatican Really Thinks - John L. Allen Jr [epub]\r\n\r\nThe sexual abuse scandals that shook American and British Catholicism in 2002 brought to light a long-standing cultural gap between the English-speaking Catholic world and the Vatican. In Rome, the crisis was often seen as an attack on the Church mounted by money-hungry lawyers, a hostile press, and liberal activists who used it as a way to turn attention on such concerns as celibacy, women’s ordination, and lay empowerment. When the Vatican struck down the U.S. bishops’ draft for handling allegations of sexual abuse, many saw it as an attempt to curb an independent American Catholic church. Yet, as time passed, it became clear that the Vatican’s well-founded concerns about due process were shared by most liberal U.S. bishops and canon lawyers. \r\n\r\nALL THE POPE’S MEN is a lucid, in-depth guide to the sometimes puzzling, often incomprehensible inner workings of the Vatican. It reveals how decisions are made, how papal bureaucrats think, and how careers in the Roman Curia are shaped. It debunks the myths that have fed the distrust and suspicions many English-speaking Catholics harbor about the way the Vatican conducts its business, explains who really wields the power, and offers entertaining profiles of the personalities, historical and present-day, who have wielded that power for good and for bad. A thoughtful analysis of the recent sexual abuse crisis sheds light on how the Vatican perceives the Church in the United States. \r\n\r\nBalanced, lively, and filled with Vatican history and lore, ALL THE POPE’S MEN provides the general reader with an authoritative picture of the highly charged relationship between the Vatican and the richest, most influential national Catholic church in the world today","torrent":{"xt":"urn:btih:359be09ed7495f2706191a1ef4204a061541bbc4","amp;dn":"All+the+Pope%27s+Men%3A+The+Inside+Story+of+How+the+Vatican+Thinks","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"359be09ed7495f2706191a1ef4204a061541bbc4","infoHashBuffer":{"type":"Buffer","data":[53,155,224,158,215,73,95,39,6,25,26,30,244,32,74,6,21,65,187,196]},"announce":[],"urlList":[]}}