{"title":"Intensamente HD - Esp Latino","uid":13098381,"size":1197605157,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:35c70b4a585e75087371058438196cac39c15c43&amp;dn=Intensamente+HD+-+Esp+Latino&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":3,"uploader":"timon7","files":1,"time":1451173210,"description":"Con base en el Cuartel General, el centro de control dentro de la mente de Riley, una niña de 11 años de edad, cinco Emociones tienen mucho trabajo. Ellas están lideradas por la optimista Alegría cuya misión es asegurarse de que Riley permanezca feliz. Temor encabeza la seguridad, Furia asegura que todo sea justo y Desagrado impide que Riley se intoxique, tanto física como socialmente. Tristeza no está exactamente segura de cuál es su rol y, francamente, nadie lo sabe. Cuando la familia de Riley se muda a una nueva y atemorizante ciudad, las Emociones comienzan a trabajar a pleno, ansiosas por guiar a la niña a través de su difícil transición. Pero cuando Alegría y Tristeza son inadvertidamente borradas a los confines de la mente de Riley - llevándose con ellas algunos cuantos recuerdos- Temor, Furia y Desagrado quedan a cargo, muy a su pesar. Alegría y Tristeza deberán aventurarse a través de sitios poco conocidos, como Memoria a Largo Plazo, Imaginalandia, Pensamiento Abstracto y Producciones de Ensueño, en un desesperado esfuerzo por volver al Cuartel Central, y a Riley.\r\nDirector: Pete Docter, Ronaldo Del Carmen\r\nReparto: Amy Poehler, Mindy Kaling, Lewis Black, Bill Hader, Phyllis Smith, Kaitlyn Dias, Diane Lane, Kyle MacLachlan","torrent":{"xt":"urn:btih:35c70b4a585e75087371058438196cac39c15c43","amp;dn":"Intensamente+HD+-+Esp+Latino","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35c70b4a585e75087371058438196cac39c15c43","infoHashBuffer":{"type":"Buffer","data":[53,199,11,74,88,94,117,8,115,113,5,132,56,25,108,172,57,193,92,67]},"announce":[],"urlList":[]}}