{"title":"Higher Learning 1995 DvDrip[Eng]-greenbud1969","uid":4488359,"size":737191983,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:361f133932e31f83fe83de14fcf72092d80d153d&amp;dn=Higher+Learning+1995+DvDrip%5BEng%5D-greenbud1969&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":1,"uploader":"greenbud1969","files":-1,"time":1225867598,"description":"Higher Learning 1995 DvDrip[Eng]-greenbud1969\n\n\ninfo-           &lt;a href=&quot; http://www.imdb.com/title/tt0113305/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0113305/&lt;/a&gt;\n\n\nFILES........... 1\nAUDIO........... MP3 48000HZ 112 KBPS CBR (2 CHNLS)\nVIDEO........... 750 KBPS XVID 23 FPS\nRESOLUTION...... 576 x 320\nRUNTIME......... 2:07:54\nSOURCE.......... DVD\n\nDIRECTOR........ JOHN SINGLETON\n\n\nSTARRING........ OMAR EPPS,KRISTY SWANSON,MICHAEL RAPAPORT,JENNIFER CONNELLY,ICE CUBE,JASON WILES,TYRA BANKS,COLE HAUSER,LAURENCE FISHBURNE,BRADFORD ENGLISH,REGINA KING,BUSTA RHYMES,JAY R. FERGUSON,ANDREW BRYNIARSKI,TREVOR ST. JOHN .....\n\n\nPLOT:\n\n\nThis drama examines the personal, political, and racial dilemmas facing a group of college freshmen as they begin their first semester at Columbus University. Malik (Omar Epps) is an African-American student attending on a track scholarship; academics are not his strong suit, and he goes in thinking that his athletic abilities will earn him a free ride through college. Fudge (Ice Cube), a &quot;professional student&quot; who has been at Columbus for six years so far, becomes friendly with Malik and challenges his views about race and politics in America, while Professor Phipps (Laurence Fishburne), a black man who teaches political science, firmly tells Malik that he will not be graded on a different standard either because of his race or his ability to run quickly. With Deja (Tyra Banks), Malik finds a girlfriend, a tutor, and a training partner all rolled into one. Meanwhile, Kristen (Kristy Swanson), a somewhat naive young woman from California, meets a boy named Billy (Jay R. Ferguson) after both have had too much to drink at a beer blast; Kristen soon becomes a victim of date rape and becomes involved with a campus feminist group to deal with the painful experience. While working with the women's group, Kristen gets to know Taryn (Jennifer Connelly), a strong but understanding woman who is also a lesbian, and she finds herself becoming attracted to her. And Remy (Michael Rapaport) is a confused young man from the Midwest who feels lost in the multi-cultural atmosphere of Columbus. He is approached by Scott (Cole Hauser), a member of a group of racist skinheads, who believe that Remy is a perfect candidate to help carry out his group's violent goals. Keep an eye peeled for Gwyneth Paltrow, who has a bit part as a student; rap stars Busta Rhymes, D-Knowledge and Mista Grimm also appear in supporting roles, as well as a cameo by the rock band Eve's Plum.\n\n\nTAGLINE: Question The Knowledge. 49 Countries. 6 Races. 2 Sexes. 1 Campus.\n\n\nAll stand-alone divx players compatible\n\n\nENJOY &amp; PLEASE SEED FOR AS LONG AS U CAN !!!!! \n\n\nALSO IF YOU HAVE ANY REQUESTS DON'T HESITATE TO ASK. I MIGHT HAVE WHAT YOUR LOOKING FOR. YOU NEVER KNOW IT NEVER HURTS TO ASK.","torrent":{"xt":"urn:btih:361f133932e31f83fe83de14fcf72092d80d153d","amp;dn":"Higher+Learning+1995+DvDrip%5BEng%5D-greenbud1969","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"361f133932e31f83fe83de14fcf72092d80d153d","infoHashBuffer":{"type":"Buffer","data":[54,31,19,57,50,227,31,131,254,131,222,20,252,247,32,146,216,13,21,61]},"announce":[],"urlList":[]}}