{"title":"BUTCHER","uid":15964632,"size":144653367,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3654be1a1ed7a65c78cbcc56a90a50274a0efe41&amp;dn=BUTCHER&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":"dauphong","files":1,"time":1475714407,"description":"\nAbout This Game\r\nThe easiest mode is 'HARD'!\r\n\r\nBUTCHER is a fast-paced 2D shooter game and a blood-soaked love letter to the early 90s. As a cyborg programmed to eradicate the last remains of humanity, your sole purpose is to well... annihilate anything that moves.\r\n\r\nSo grab your weapon of choice (from chainsaw, through shotgun, to grenade launcher) and kill your way through underground hideouts, post-apocalyptic cities, jungles and more. And if you're feeling creative, there are plenty other ways of ending your enemies' misery - hooks, lava pits, saws... no death will ever be the same.\r\n\r\nIf kicking corpses into a lava pit and adorning walls with blood is your idea of a good time, BUTCHER is THE game for you.\r\nKey features:\r\n\r\n    Ultra-violent uncompromising carnage in the spirit of Doom and Quake (chainsaw included)\r\n    Skill-based gameplay mechanics\r\n    Release your inner artist, paint the walls with (permanent) blood (up to 4 million pixels available to be painted per level)\r\n    Use the environment (saws, hooks, lava pits, animals and other) to brutally dispose of your enemies\r\n    Choose from an array of weapons (featuring classics like chainsaw, railgun and the deadly grenade launcher)\r\n    Adorn more than 20 levels with the insides of your enemies\r\n    Soak in the dark atmosphere reinforced by a wicked, heavy soundtrack (while you kick corpses around)\r\n    Die painfully: melt in lava, become piranha food, get crushed by heavy doors... and more!","torrent":{"xt":"urn:btih:3654be1a1ed7a65c78cbcc56a90a50274a0efe41","amp;dn":"BUTCHER","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3654be1a1ed7a65c78cbcc56a90a50274a0efe41","infoHashBuffer":{"type":"Buffer","data":[54,84,190,26,30,215,166,92,120,203,204,86,169,10,80,39,74,14,254,65]},"announce":[],"urlList":[]}}