{"title":"100 Country Houses - New Rural Architecture","uid":10215880,"size":26633822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38285ceed70f41533734a2acc610df2b0eabab2a&amp;dn=100+Country+Houses+-+New+Rural+Architecture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":1,"uploader":"svdinesh","files":2,"time":1400964085,"description":"This richly illustrated volume showcases the best of contemporary rural residential architecture from the world's most innovative architects. The homes featured in &quot;100 Country Houses: New Rural Architecture&quot; range from traditional to experimental, exemplifying a recent shift from the conventional country vernacular towards ultra-modern, forward-thinking and eco-friendly designs. In many cases, less-restrictive planning regulations in remote areas allow architects to push boundaries and flex their creative muscle, resulting in architectural creations of astonishing scope and vision. The new rural architectural consciousness often draws heavily from, or seeks to complement, a house's surrounding landscape in terms of form, colour, texture and materials. Many architects devise or utilise progressive design techniques to immerse homeowners in their environment - whether pastoral, woodland, wetland, mountaintop or vineyard. Architects working on remote projects often find themselves dealing with extremely challenging building sites and environments: steep slopes, fierce winds, harsh sun and rocky ground. Unique advances in design, both structural and aesthetic, can occur when finding solutions for such challenges. Stunning full-colour interior and exterior photographs are complemented by detailed plans, elevations, and project descriptions providing rare insight into the extraordinary talent of these world-class architects.\n\n100 Country Houses - New Rural Architecture\nBook Language: English\nPages: 224\nFile Type: Pdf\nFile Size: 25.26 MB\n\n[IMG]http://i.imgur.com/CILPCSb.jpg[/IMG]\n &lt;a href=&quot;\nhttp://i.imgur.com/CILPCSb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/CILPCSb.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:38285ceed70f41533734a2acc610df2b0eabab2a","amp;dn":"100+Country+Houses+-+New+Rural+Architecture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38285ceed70f41533734a2acc610df2b0eabab2a","infoHashBuffer":{"type":"Buffer","data":[56,40,92,238,215,15,65,83,55,52,162,172,198,16,223,43,14,171,171,42]},"announce":[],"urlList":[]}}