{"title":"The Paleo Diet Revised by Loren Cordain ","uid":9169506,"size":1465038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3879099ee8fd298f82cab085f7f1dad635a36950&amp;dn=The+Paleo+Diet+Revised+by+Loren+Cordain+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":0,"uploader":"420weedman","files":1,"time":1384045430,"description":" Eat for better health and weight loss the Paleo way with this revised edition of the bestselling guide-over 100,000 copies sold to date!\nHealthy, delicious, and simple, the Paleo Diet is the diet we were designed to eat. If you want to lose weight-up to 75 pounds in six months-or if you want to attain optimal health, The Paleo Diet will work wonders. Dr. Loren Cordain demonstrates how, by eating your fill of satisfying and delicious lean meats and fish, fresh fruits, snacks, and non-starchy vegetables, you can lose weight and prevent and treat heart disease, cancer, osteoporosis, metabolic syndrome, and many other illnesses.\n\nBreakthrough nutrition program based on eating the foods we were genetically designed to eat-lean meats and fish and other foods that made up the diet of our Paleolithic ancestors\nThis revised edition features new weight-loss material and recipes plus the latest information drawn from breaking Paleolithic research\nSix weeks of Paleo meal plans to jumpstart a healthy and enjoyable new way of eating as well as dozens of recipes\nThis bestselling guide written by the world's leading expert on Paleolithic eating has been adopted as a bible of the CrossFit movement\nThe Paleo Diet is the only diet proven by nature to fight disease, provide maximum energy, and keep you naturally thin, strong, and active-while enjoying every satisfying and delicious bite.\n\nGenre: Non-Fiction, Healthcare, Diet &amp; Fitness, Educational\n","torrent":{"xt":"urn:btih:3879099ee8fd298f82cab085f7f1dad635a36950","amp;dn":"The+Paleo+Diet+Revised+by+Loren+Cordain+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3879099ee8fd298f82cab085f7f1dad635a36950","infoHashBuffer":{"type":"Buffer","data":[56,121,9,158,232,253,41,143,130,202,176,133,247,241,218,214,53,163,105,80]},"announce":[],"urlList":[]}}