{"title":"Starcraft 2 Wings Of Liberty FIXED ISO + Campaign and Skirmish c","uid":5785281,"size":7956092786,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:38e88cbbc995db44ed022bb052112388e85f4f14&amp;dn=Starcraft+2+Wings+Of+Liberty+FIXED+ISO+%2B+Campaign+and+Skirmish+c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":10,"uploader":"Godslayer187","files":29,"time":1282587112,"description":"   First off sorry bout the original upload of this torrent, The iso somehow got  fucked when we made it. This one we have just used the RELOADED ISO and included it with all cracks and maps. This has been tested on several machines and works perfectly on all of them. Sorry to anyone that lost time on the previous release of this torrent. Simply follow the provided instructions and you will be playing skirmish and campaign SC2 in no time.\n\n\n\n\nInstructions:\n\n1. download THIS torrent\n\n2. mount the rld-scii (.iso) in SC2 ISO folder. It probably wont autoplay so browse the image and start the installation (installer.exe)\n\nNote: Daemon tools works best for virtual drives to mount images\n\n3. during installation, a pop up window asking you to register will appear, press the &quot;skip&quot; button\n\n4. as soon as the install finishes, an update window will appear, so close it before it begins updating, asap\n\n5. now enter the &quot;cracks&quot; folder then campaign crack folder and copy everything in that folder.\n\n6. paste everything in your &quot;Starcraft II&quot; folder (you'll overwrite several folders), located wherever you specified during installation, so try to remember where you installed it\n\n7. now double click the update.bat (in the &quot;Starcraft II&quot; folder)\n\n8. now, paste all those files ONE MORE TIME, in the &quot;Starcraft II&quot; folder and overwrite everything\n\n9. now go to the cracks folder again and enter the &quot;Razor1911&quot; folder, double-click sc2_copy.exe an let it do its thing\n\n10. now go to the cracks folder one last time, there is a file called &quot;SC2ALLin1_setup1033.exe&quot;, you will need WinRAR or 7-Zip (free on google) to extract it. after extracted make a shortcut or copy it to your desktop.\n\n11. now you can open the Map pack 01 folder and copy all 10 maps and paste them in &quot;My Documents/Starcraft II/Maps&quot; and also paste it in the installation folder &quot;Starcraft II&quot; (the one where you used update.bat, remember?)\n\n12. Run the SCALLin1.exe you copied to your desktop, once open click the maps tab and choose add maps from folder and then browse for the SC2 directory in your documents, select the maps directory and hit the ok button. (this will add the maps to SC2ALLin1)\n\n13. Now in SC2ALLin1 you can Click the map you want and choose select, then modify your race, teams ect ect abd click LAUNCH\n\n14. You can now Play Skirmish and campaign!! ENJOY!","torrent":{"xt":"urn:btih:38e88cbbc995db44ed022bb052112388e85f4f14","amp;dn":"Starcraft+2+Wings+Of+Liberty+FIXED+ISO+%2B+Campaign+and+Skirmish+c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38e88cbbc995db44ed022bb052112388e85f4f14","infoHashBuffer":{"type":"Buffer","data":[56,232,140,187,201,149,219,68,237,2,43,176,82,17,35,136,232,95,79,20]},"announce":[],"urlList":[]}}