{"title":"The Opium War: Drugs, Dreams and the Making of China","uid":16044862,"size":4918808,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3901566dc1f497f3329c729566807a680cac5996&amp;dn=The+Opium+War%3A+Drugs%2C+Dreams+and+the+Making+of+China&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":4,"uploader":"marty14","files":1,"time":1476553037,"description":"The Opium War: Drugs, Dreams and the Making of China - Julia Lovell [epub]\r\n\r\nIn October 1839, a cabinet meeting in Windsor voted to fight Britain’s first Opium War with China.\r\n\r\nThe conflict turned out to be rich in tragicomedy: in bureaucratic fumblings, military missteps, political opportunism and collaboration. Yet over the past 170 years, this strange tale of misunderstanding, incompetence and compromise has become the founding myth of modern Chinese nationalism: the start of China’s heroic struggle against a Western conspiracy to destroy the country with opium and gunboat diplomacy.\r\n\r\nBeginning with the dramas of the war itself, Julia Lovell explores its causes and consequences and, through this larger narrative, interweaves the curious stories of opium’s promoters and attackers. The Opium War is both the story of China’s first conflict with the West and an analysis of the country’s contemporary self-image. It explores how China’s national myths mold its interactions with the outside world, how public memory is spun to serve the present; and how delusion and prejudice have bedeviled its relationship with the modern West","torrent":{"xt":"urn:btih:3901566dc1f497f3329c729566807a680cac5996","amp;dn":"The+Opium+War%3A+Drugs%2C+Dreams+and+the+Making+of+China","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3901566dc1f497f3329c729566807a680cac5996","infoHashBuffer":{"type":"Buffer","data":[57,1,86,109,193,244,151,243,50,156,114,149,102,128,122,104,12,172,89,150]},"announce":[],"urlList":[]}}