{"title":"The End Of Faith - Sam Harris  (Unabridged)","uid":6764361,"size":167070772,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:39031e646a6675772acecc5aa3cfe68e319fbd9a&amp;dn=The+End+Of+Faith+-+Sam+Harris++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"rosie1966","files":9,"time":1319316330,"description":"Sam Harris cranks out blunt, hard-hitting chapters to make his case for why faith itself is the most dangerous element of modern life. And if the devil's in the details, then you'll find Satan waiting at the back of the book in the very substantial notes section where Harris saves his more esoteric discussions to avoid sidetracking the urgency of his message.\nInterestingly, Harris is not just focused on debunking religious faith, though he makes his compelling arguments with verve and intellectual clarity. The End of Faith is also a bit of a philosophical Swiss Army knife. Once he has presented his arguments on why, in an age of Weapons of Mass Destruction, belief is now a hazard of great proportions, he focuses on proposing alternate approaches to the mysteries of life. Harris recognizes the truth of the human condition, that we fear death, and we often crave &quot;something more&quot; we cannot easily define, and which is not met by accumulating more material possessions. But by attempting to provide the cure for the ills it defines, the book bites off a bit more than it can comfortably chew in its modest page count (however the rich Bibliography provides more than enough background for an intrigued reader to follow up for months on any particular strand of the author' musings.)\n\nHarris' heart is not as much in the latter chapters, though, but in presenting his main premise. Simply stated, any belief system that speaks with assurance about the hereafter has the potential to place far less value on the here and now. And thus the corollary -- when death is simply a door translating us from one existence to another, it loses its sting and finality. Harris pointedly asks us to consider that those who do not fear death for themselves, and who also revere ancient scriptures instructing them to mete it out generously to others, may soon have these weapons in their own hands. If thoughts along the same line haunt you, this is your book.--This text refers to the Hardcover edition.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:39031e646a6675772acecc5aa3cfe68e319fbd9a","amp;dn":"The+End+Of+Faith+-+Sam+Harris++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39031e646a6675772acecc5aa3cfe68e319fbd9a","infoHashBuffer":{"type":"Buffer","data":[57,3,30,100,106,102,117,119,42,206,204,90,163,207,230,142,49,159,189,154]},"announce":[],"urlList":[]}}