{"title":"Based on a True Story: A Memoir [Audiobook] by Norm Macdonald","uid":15879864,"size":209032057,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3991da1f25faaf62eed964dff9ee5e98a9f74eec&amp;dn=Based+on+a+True+Story%3A+A+Memoir+%5BAudiobook%5D+by+Norm+Macdonald&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":3,"uploader":"Dr.Soc","files":1,"time":1474582805,"description":"Based on a True Story: A Memoir [Audiobook] by Norm Macdonald\r\nEnglish | September 20, 2016 | ASIN: B01L0GDSHY, ISBN: 1524703184 | M4B @ 64 kbps | 7 hrs 23 mins | 199 MB\r\nNarrator: Norm Macdonald\r\n\r\nWild, dangerous, and flat-out unbelievable, here is the incredible memoir of the actor, gambler, raconteur, and SNL veteran and one of the best stand-up comedians of all time.\r\n\r\nAs this book's title suggests, Norm Macdonald tells the story of his life - more or less - from his origins on a farm in the-back-of-beyond Canada and an epically disastrous appearance on Star Search to his account of auditioning for Lorne Michaels and his memorable run as the anchor of Weekend Update on Saturday Night Live - until he was fired because a corporate executive didn't think he was funny.\r\n\r\nBut Based on a True Story is much more than a memoir; it's the hilarious, inspired epic of Norm's life. In dispatches from a road trip to Las Vegas (part of a plan hatched to regain the fortune he'd lost to sports betting and other vices) with his sidekick and enabler, Adam Eget, Norm recounts the milestone moments, the regrets, the love affairs, the times fortune smiled on his life, and the times it refused to smile. As the clock ticks down, Norm's debt reaches record heights, and he must find a way to evade the hefty price that's been placed on his head by one of the most dangerous loan sharks in the country.\r\n\r\nAs a comedy legend should, Norm peppers these minutes with classic jokes and fondly mythologized Hollywood stories. This wildly adventurous, totally original, and absurdly funny saga turns the conventional comic's memoir on its head and gives the listener an exclusive pass into the mad, glorious mind of Norm Macdonald","torrent":{"xt":"urn:btih:3991da1f25faaf62eed964dff9ee5e98a9f74eec","amp;dn":"Based+on+a+True+Story%3A+A+Memoir+%5BAudiobook%5D+by+Norm+Macdonald","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3991da1f25faaf62eed964dff9ee5e98a9f74eec","infoHashBuffer":{"type":"Buffer","data":[57,145,218,31,37,250,175,98,238,217,100,223,249,238,94,152,169,247,78,236]},"announce":[],"urlList":[]}}