{"title":"The Sopranos S01-S06 720p BluRay nHD x264","uid":9092788,"size":92190690569,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:39dee952a594cfcfda740673707d134eb865a73e&amp;dn=The+Sopranos+S01-S06+720p+BluRay+nHD+x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":36,"uploader":"fillinthisspace","files":86,"time":1382635924,"description":"The Sopranos - all episodes, 720p.\n\nI didn't create this torrent. I found it on isohunt, but given that site has now closed and this torrent is still being seeded, I thought I'd upload it here to help keep it active.\n\nI've only downloaded season one from this torrent myself. I've downloaded season one episodes from several different torrents and of those, season one in this torrent is the best quality. I assume the original Bluray quality wasn't anything great to begin, but season one in this torrent at least seems to be the best encoding job. I added a comment to the page for this torrent explaining why. http://thepiratebay.se/torrent/6299268/\n\nI know nothing almost nothing about the quality for any of the other seasons. Seasons 2-5 seem to be re-encodes of the web-dl torrents. Based on the single episode I looked at (s02e02) there's a very slight loss of fine detail in these encodes compared to the originals but they're only two thirds the size. For seasons 2-5, I downloaded Konashine's web-dl torrents myself.\n\nLikewise season 6 appears to be a re-encode of the season 6 HDDVD torrent, but once again I downloaded season 6 from Konashine's HDDVD season 6 torrent myself.\n\nSo after my big disclaimer regarding not knowing what the quality of these encodes are like (aside from season one which are the best I've found so far), if anyone else downloads other episodes from this torrent, please leave a comment regarding their quality for others.","torrent":{"xt":"urn:btih:39dee952a594cfcfda740673707d134eb865a73e","amp;dn":"The+Sopranos+S01-S06+720p+BluRay+nHD+x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39dee952a594cfcfda740673707d134eb865a73e","infoHashBuffer":{"type":"Buffer","data":[57,222,233,82,165,148,207,207,218,116,6,115,112,125,19,78,184,101,167,62]},"announce":[],"urlList":[]}}