{"title":"Stan Lee -  How To Draw Comics The Marvel Way","uid":5519618,"size":35939556,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a01422609a50bd8bb0055f54daa62dc4915438f&amp;dn=Stan+Lee+-++How+To+Draw+Comics+The+Marvel+Way&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":1,"uploader":"neon","files":-1,"time":1272485540,"description":"How to Draw Comics the Marvel Way\n\nStan Lee, the Mighty Man from Marvel, and John Buscema, active and adventuresome artist behind the Silver Surfer, Conan the Barbarian, the Mighty Thor and Spider-Man, have collaborated on this comics compendium: an encyclopedia of information for creating your own superhero comic strips. Using artwork from Marvel comics as primary examples, Buscema graphically illustrates the hitherto mysterious methods of comic art. Stan Lee's pithy prose gives able assistance and advice to the apprentice artist. Bursting with Buscema's magnificent illustrations and Lee's laudable word-magic, How to Draw Comics the Marvel Way belongs in the library of every kid who has ever wanted to illustrate his or her own comic strip. \n\n Since very few of us draw with just our fingernails, let's start off with what you'll need. Then we've got to make sure we're all speaking the same language. This part's the easiest.\n\nHere we go! just about everything you'll need to get you started. One of the nice things about being a comicbook artist is the fact that your equipment is no big deal. Let's just give the various items a fast once-over...\n\nPencil... Some artists prefer a soft lead, some like the finer hard lead. It's up to you.\n\nPen... A simple drawing pen with a thin point, for inking and bordering.\n\nBrush... Also for inking. A sable hair #3 is your best bet.\n\nErasers... One art gum and one smooth kneaded eraser -- which is cleaner to use.\n\nIndia ink... Any good brand of black india ink is okay.\n\nWhite opaquing paint... Invaluable for covering errors in inking.\n\nA glass Jar... This holds the water for cleaning your brushes.\n\nPushpins... Handy for keeping your illustration paper from slipping off the drawing board.\n\nTriangle... A must for drawing right angles and working in perspective.\n\nT square... Invaluable for drawing borders and keeping lines parallel.\n\nRuler... For everyone who says &quot;1 can't draw a straight line without a ruler.&quot; Now you've no excuse!\n\nIllustration paper... We use 2-ply Bristol board, large enough to accommodate artwork 10&quot; x 15&quot;.\n\nDrawing board... This can be a drawing table or merely a flat board which you hold on your lap. Either way, you always need some such thing upon which to rest your sheet of illustration paper.\n\nRag... This plain ol' hunk of any kind of cloth is used to wipe your pen points, brushes, and whatever. The sloppier you are, the more you'll need it.","torrent":{"xt":"urn:btih:3a01422609a50bd8bb0055f54daa62dc4915438f","amp;dn":"Stan+Lee+-++How+To+Draw+Comics+The+Marvel+Way","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a01422609a50bd8bb0055f54daa62dc4915438f","infoHashBuffer":{"type":"Buffer","data":[58,1,66,38,9,165,11,216,187,0,85,245,77,170,98,220,73,21,67,143]},"announce":[],"urlList":[]}}