{"title":"Embarcadero Delphi XE5 with Update 1","uid":9154906,"size":5019125760,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3a3fd2df031ada71a7ac21ae7c0b637aa794c0e4&amp;dn=Embarcadero+Delphi+XE5+with+Update+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":3,"uploader":"crazyzone","files":-1,"time":1383758490,"description":"What's New in RAD Studio XE5?\n\nRAD Studio provides the best development XE5 multidevice for PCs, tablets and smartphones. Use the new features in RAD Studio XE5 to create applications for Android, iOS, Windows and Mac; connect more data, more easily, just to start!\nWhat's New in RAD Studio XE5?\n\n    ARM compiler for Android in Delphi for device and emulator\n    FM platform for creating native applications for the Android Gingerbread (2.3.3 - 2.3.7), Ice Cream Sandwich (4.0.3, 4.0.4) and Jelly Bean (4.1.x, 4.2.x, 4.3.x) *.\n    Support styles and iOS SDK 7\n    Time Picker Control for Android, Windows, OS X and iOS\n    Component Notification Center for iOS and Android\n    Integrated filter to search for TListView on Android, iOS, Windows and OS X\n    Swipe to delete on Android and iOS\n    Support Share Sheet on Android and iOS\n    Performance improvements of FM platform\n    Delphi RTL for Android\n    Distribution Manager for Android\n    Distribute applications to the emulator for Ice Cream Sandwich and Jelly Bean\n    Distribute applications for Android devices (Debug / App Store)\n    Remote debugging to Android\n    The Professional version includes support FireDAC extended to local databases, including Microsoft Access, SQLite, InterBase ToGo / IBLite, InterBase, localhost embedded MySQL, MySQL Server on localhost, Advantage Database Local engine, localhost PostgreSQL, Firebird embedded, and Firebird on localhost\n    IBLite embeddable database for Android and iOS with free license for unlimited distribution\n    REST Client Library for invoking REST services in a simplified\n    Authorization support, including Basic Authentication, Plans, OAuth1, OAuth2\n    TRestClient components, and TRestRequest TRestResponse\n    Debugging tool for testing REST REST calls and their parameters\n    Multiple Selection in Distribution Manager\n    Search box for easy access in the IDE Insight\n    Device Manager to manage and select the default device in FM Mobile Form designer\n    Libraries upgrade HTML5 Builder (PhoneGap, jQuery Mobile, jQuery and ThemeRoller) \n\nAmong others ...!\nCreate True Native Apps for iOS and Android\nCreate truly native applications for Android and iOS\n\nCreate mobile applications using the skills, knowledge and programming code that you already own. Your Android and iOS have fast native performance and better security than web based applications or scripting languages. Use the full visual designer for interfaces with multiple iOS device types, resolutions and orientations.\nRAD Studio Platform\nRAD Platform Application multidevice\n\nThe development of mobile applications often extends beyond the device, requiring support real-time communication and access to corporate data and services in the cloud. The Application Platform multidevice Delphi makes it possible for developers to create truly one computer connected to the device through back-end services in multiple client operating systems and considering the physical configuration of multiple devices. Connect your applications and services quickly to corporate databases via local infrastructure or in the cloud with connectivity to the corporate database FireDAC, middleware DataSnap n-tier, plus access to RESTful web services via cloud-based providers MBaaS .\nOne Team One Codebase Development of truly native applications multidevice\n\nNow Android was added to the solution application development multidevice RAD Studio, which means you do not need to maintain separate development projects to create their applications natively on multiple platforms (Android, iOS, Windows and OS X). The RAD Studio XE5 facilitates the creation of truly native applications and free scripts that take full advantage of the capabilities and performance of the underlying devices.\nMobile Wizard Access to RESTful web services based on cloud\n\nThe Delphi XE5 has a new REST library, available on all platforms and focused on streamlining called REST web services by any third party provider. The library includes support for authentication and JSON response handling, with mappings and LiveBindings dataset. The three core components facilitate the creation parameters of their requests in different ways, as well as access to hundreds of web services. This technology allows you to work with Mobile Backend as a Service and use the features MBaaS.\n\nAmong its functions include the following:\n\n    REST Client Library for invoking REST services in a simplified\n    Authorization support, including Basic Authentication, Plans, OAuth1, OAuth2\n    TRestClient components, and TRestRequest TRestResponse\n    Debugging tool for testing REST REST calls and their parameters \n\nFireDAC Logo02 193x175 Integrated access to more databases on more devices with FireDAC\n\nComponents and drivers database FireDAC now widely integrated into RAD Studio, Delphi and the C + + Builder. The FireDAC gives you direct access, native, high-speed Delphi and C + + Builder to InterBase, SQLite, MySQL, SQL Server, Oracle, PostgreSQL, DB2, SQL Anywhere, Advantage DB, Firebird, Access, Informix, DataSnap and many other databases and mobile business, local or embedded. Migrate easily from BDE and other technologies.\n\n    Local connectivity / inlaid FireDAC the selected databases in the Professional versions of RAD Studio, Delphi and C + + Builder\n    Local connectivity / embedded and remote FireDAC a wide range of databases in versions Enterprise, Ultimate and Architect, or by purchasing the package add-on client / server version Professional \n\niOS user interface control Support Database Mobile Android and iOS\n\nRAD Studio includes support XE5 database site for iOS and Android and SQLite embedded InterBase via dbExpress, IBX and FireDAC. You also receive a free distribution license and unlimited IBLite for Android and iOS - a new version of the popular free distribution database InterBase ToGo.\n\n[b]Keys:[/b] \nHNAK-S4CS67-ZXNE6E-F4QN\nHNFK-BCN8NN-78N53D-H4RS\nQDF4-CTSDHV-RDFCFE-FEAN\nHNFJ-DPADCW-BDWCFU-FPNN","torrent":{"xt":"urn:btih:3a3fd2df031ada71a7ac21ae7c0b637aa794c0e4","amp;dn":"Embarcadero+Delphi+XE5+with+Update+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a3fd2df031ada71a7ac21ae7c0b637aa794c0e4","infoHashBuffer":{"type":"Buffer","data":[58,63,210,223,3,26,218,113,167,172,33,174,124,11,99,122,167,148,192,228]},"announce":[],"urlList":[]}}