{"title":"FIFA.12-RELOADED","uid":6705358,"size":6983812601,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3a52b4af1707bfa2ea3df1cc8ec14e4c121d9721&amp;dn=FIFA.12-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":10,"uploader":"SnowCrash03","files":-1,"time":1317135740,"description":"                        FIFA 12 (c) Electronic Arts Inc.\n    \n        09/2011 :..... RELEASE.DATE .. PROTECTION .......: EA/Crap\n              1 :.......... DISC(S) .. GAME.TYPE ........: Sports\n   \n\n                                   GAMEiNFOS\n  \n  Winner of 20 &quot;Best Sports Game of E3&quot; awards, including the prestigious E3\n  Game Critics award, FIFA 12 brings to the pitch the game-changing new Player\n  Impact Engine, a physics engine built to deliver real-world physicality in\n  every interaction on the pitch. Experience the way real-world footballers\n  challenge each other for the ball, win possession, and test each other\n  physically. Enjoy an infinite variety of natural and believable outcomes in\n  every collision. Players feel more resilient, push and pull during the fight\n  for possession, and recover from light challenges more easily.\n\n  Revolutionary gameplay innovations make FIFA 12 deeper and more engaging.\n  All-new Precision Dribbling creates a higher fidelity of touch on the ball\n  for better control in tight spaces, more time to make decisions on attack,\n  and more control over the pace of the game. Innovations in attack are\n  balanced by a re-designed defending mechanism, making it as skilful and\n  meaningful as real-world football. With all-new Tactical Defending,\n  positioning and intercepting passes are as important as tackling. Tactics\n  and timing are crucial. Plus, CPU players have been infused with Pro Player\n  Intelligence, a self-awareness that enables them to behave and make\n  decisions based on their own skills and tendencies, and gives them the\n  aptitude to understand the strengths and weaknesses of teammates in every\n  situation.\n  \n\n                                iNSALLNOTES\n\n  1. Unrar.\n  2. Burn or mount the image.\n  3. Install the game. Redistributables as needed in &lt;install&gt;\\__Installer\n     dir afterwards.\n  4. Copy over the cracked content from the Crack dir on the disc to your\n     &lt;install&gt;\\Game dir.\n  5. Play the game. Video config is in &lt;install&gt;\\Game\\fifasetup\\fifasetup.exe.\n  \n  As usual we recommend firewalling the main executable, not using Origin, and\n  avoiding EA.\n\n","torrent":{"xt":"urn:btih:3a52b4af1707bfa2ea3df1cc8ec14e4c121d9721","amp;dn":"FIFA.12-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a52b4af1707bfa2ea3df1cc8ec14e4c121d9721","infoHashBuffer":{"type":"Buffer","data":[58,82,180,175,23,7,191,162,234,61,241,204,142,193,78,76,18,29,151,33]},"announce":[],"urlList":[]}}