{"title":"The Harvard Psychedeli_ How Timothy - Don Lattin.epub","uid":15912741,"size":2163896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a92d4a878032344e2a78f72704fd4ded1c14a7d&amp;dn=The+Harvard+Psychedeli_+How+Timothy+-+Don+Lattin.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":0,"uploader":"mr_mando","files":1,"time":1475130750,"description":"\nThis book is the story of how three brilliant scholars and one ambitious freshman crossed paths in the early sixties at a Harvard-sponsored psychedelic-drug research project, transforming their lives and American culture and launching the mind/body/spirit movement that inspired the explosion of yoga classes, organic produce, and alternative medicine. \r\n\r\nThe four men came together in a time of upheaval and experimentation, and their exploration of an expanded consciousness set the stage for the social, spiritual, sexual, and psychological revolution of the 1960s. Timothy Leary would be the rebellious trickster, the premier proponent of the therapeutic and spiritual benefits of LSD, advising a generation to &quot;turn on, tune in, and drop out.&quot; Richard Alpert would be the seeker, traveling to India and returning to America as Ram Dass, reborn as a spiritual leader with his &quot;Be Here Now&quot; mantra, inspiring a restless army of spiritual pilgrims. Huston Smith would be the teacher, practicing every world religion, introducing the Dalai Lama to the West, and educating generations of Americans to adopt a more tolerant, inclusive attitude toward other cultures' beliefs. And young Andrew Weil would be the healer, becoming the undisputed leader of alternative medicine, devoting his life to the holistic reformation of the American health care system. \r\n\r\nIt was meant to be a time of joy, of peace, and of love, but behind the scenes lurked backstabbing, jealousy, and outright betrayal. In spite of their personal conflicts, the members of the Harvard Psychedelic Club would forever change the way Americans view religion and practice medicine, and the very way we look at body and soul","torrent":{"xt":"urn:btih:3a92d4a878032344e2a78f72704fd4ded1c14a7d","amp;dn":"The+Harvard+Psychedeli_+How+Timothy+-+Don+Lattin.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a92d4a878032344e2a78f72704fd4ded1c14a7d","infoHashBuffer":{"type":"Buffer","data":[58,146,212,168,120,3,35,68,226,167,143,114,112,79,212,222,209,193,74,125]},"announce":[],"urlList":[]}}