{"title":"Cream - Discography 1966-2005 [FLAC]","uid":9418857,"size":7184915928,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3aabf5a6d007b607765445a8e4654c158c368267&amp;dn=Cream+-+Discography+1966-2005+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":16,"uploader":"rudown78","files":522,"time":1388515173,"description":"Cream - Discography 1966-2005 [FLAC]\n\n\nAlthough Cream was only together for a little more than two years, their influence was immense, both during their late-'60s peak and in the years following their breakup. Cream was the first top group to truly exploit the power-trio format, in the process laying the foundation for much blues-rock and hard rock of the 1960s and 1970s. It was with Cream, too, that guitarist Eric Clapton truly became an international superstar. Critical revisionists have tagged the band as overrated, citing the musicians' emphasis upon flash, virtuosity, and showmanship at the expense of taste and focus. This was sometimes true of their live shows in particular, but in reality the best of their studio recordings were excellent fusions of blues, pop, and psychedelia, with concise original material outnumbering the bloated blues jams and overlong solos.\n\nCream could be viewed as the first rock supergroup to become superstars, although none of the three members were that well-known when the band formed in mid-1966. Eric Clapton had the biggest reputation, having established himself as a guitar hero first with the Yardbirds, and then in a more blues-intensive environment with John Mayall's Bluesbreakers. (In the States, however, he was all but unknown, having left the Yardbirds before &quot;For Your Love&quot; made the American Top Ten.) Bassist/singer Jack Bruce and drummer Ginger Baker had both been in the Graham Bond Organisation, an underrated British R&amp;B combo that drew extensively upon the jazz backgrounds of the musicians. Bruce had also been, very briefly, a member of the Bluesbreakers along Clapton, and also briefly a member of Manfred Mann when he became especially eager to pay the rent.\n\nAll three of the musicians yearned to break free of the confines of the standard rock/R&amp;B/blues group, in a unit that would allow them greater instrumental and improvisational freedom, somewhat in the mold of a jazz outfit. Eric Clapton's stunning guitar solos would get much of the adulation, yet Bruce was at least as responsible for shaping the group's sound, singing most of the material in his rich voice. He also wrote their best original compositions, sometimes in collaboration with outside lyricist Pete Brown.\n\nAt first Cream's focus was electrified and amped-up traditional blues, which dominated their first album, Fresh Cream, which made the British Top Ten in early 1967. Originals like &quot;N.S.U.&quot; and &quot;I Feel Free&quot; gave notice that the band were capable of moving beyond the blues, and they truly found their voice on Disraeli Gears in late 1967, which consisted mostly of group-penned songs. Here they fashioned invigorating, sometimes beguiling hard-driving psychedelic pop, which included plenty of memorable melodies and effective harmonies along with the expected crunching riffs. &quot;Strange Brew,&quot; &quot;Dance the Night Away,&quot; &quot;Tales of Brave Ulysses,&quot; and &quot;S.W.L.A.B.R.&quot; are all among their best tracks, and the album broke the band big time in the States, reaching the Top Five. It also generated their first big U.S. hit single, &quot;Sunshine of Your Love,&quot; which was based around one of the most popular hard rock riffs of the '60s.\n\nWith the double album Wheels of Fire, Cream topped the American charts in 1968, establishing themselves alongside the Beatles and Hendrix as one of the biggest rock acts in the world. The record itself was a more erratic affair than Disraeli Gears, perhaps dogged by the decision to present separate discs of studio and live material; the concert tracks in particular did much to establish their reputation, for good or ill, for stretching songs way past the ten-minute mark on-stage. The majestically doomy &quot;White Room&quot; gave Cream another huge American single, and the group was firmly established as one of the biggest live draws of any kind. Their decision to disband in late 1968 -- at a time when they were seemingly on top of the world -- came as a shock to most of the rock audience.\n\nCream's short lifespan, however, was in hindsight unsurprising given the considerable talents, ambitions, and egos of each of its members. Clapton in particular was tired of blowing away listeners with sheer power, and wanted to explore more subtle directions. After a farewell tour of the States, the band broke up in November 1968. In 1969, however, they were in a sense bigger than ever; a posthumous album featuring both studio and live material, Goodbye, made number two, highlighted by the haunting Eric Clapton-George Harrison composition &quot;Badge,&quot; which remains one of Cream's most beloved tracks.\n\nClapton and Baker would quickly resurface in 1969 as half of another short-lived supergroup, Blind Faith, and Clapton of course went on to one of the longest and most successful careers of anyone in the rock business. Bruce and Baker never attained nearly as high a profile after leaving Cream, but both kept busy in the ensuing decades with various interesting projects in the fields of rock, jazz, and experimental music.\n\n\n1966 - Fresh Cream [1996 DCC Remaster]\n1967 - Disraeli Gears [1992 MFSL Remaster]\n1967 - Disraeli Gears [2004 Deluxe Edition]\n1968 - Wheels of Fire [1992 DCC Remaster]\n1969 - Goodbye [1996 MFSL Remaster]\n1995 - Live Cream &amp; Live Cream, Volume II [1995 MFSL Remasters]\n1995 - The Very Best of Cream\n1997 - Those Were the Days [4-CD Box Set]\n2003 - BBC Sessions\n2005 - Gold\n2005 - Royal Albert Hall London May 2-3-5-6, 2005\n\n\nAlbum artwork and rip logs are included. Enjoy!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:3aabf5a6d007b607765445a8e4654c158c368267","amp;dn":"Cream+-+Discography+1966-2005+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aabf5a6d007b607765445a8e4654c158c368267","infoHashBuffer":{"type":"Buffer","data":[58,171,245,166,208,7,182,7,118,84,69,168,228,101,76,21,140,54,130,103]},"announce":[],"urlList":[]}}