{"title":"The Matrix Soundtrack [First, Second &amp; Third] [SvC]","uid":5072853,"size":296320442,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3b13de0a3d6e5080f7f57d13bb3fc6f274349431&amp;dn=The+Matrix+Soundtrack+%5BFirst%2C+Second+%26+Third%5D+%5BSvC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":3,"uploader":"SephirothVsCloudo","files":52,"time":1251562688,"description":"THE MATRIX SOUNDTRACK [FIRST, SECOND &amp; THIRD]\n\nArtist...................: Various\nTitle....................: The Matrix Soundtrack [First, Second &amp; Third]\nGenre....................: Movie Soundtrack\nYear.....................: (2000 - 2003)\nChannels.................: 2 (Stereo) (Dual Channels)\nSample Rate..............: 44,1 KHz\nSample Size..............: 16 Bit \nEncoder..................: LAME 3.98\nEncoder Settings.........: Variable Bit Rate -V 2 (Standard)\nCovers...................: Front\nTags.....................: Proper In The Files\n\nTHE MATRIX - MUSIC FROM THE MOTION PICTURE is a compilation soundtrack released by Maverick Records which features most of main source cues from the film.  Unfortunately the soundtrack is launched by one of the more unlistenable tracks, &quot;Rock is Dead&quot; by Marylin Manson.  Joining this track in the not-so-hot-list would be &quot;Bad Blood&quot; (3) by Ministry, &quot;Look to Your Orb for the Warning&quot; by Monster Magnet, &quot;My Own Personal Summer (Shove It)&quot; by the Deftones and &quot;Du Hast&quot; (12) by Rammstein which tend towards the rock-roots as Manson...albeit Rammestein's track is infused with a techno-dance rhythm.  While helping to keep the sound of The Matrix edgy, these tracks are rugged, but not so &quot;cool.&quot;  Oddly enough none of these songs are used in any significant scenes of the film, if at all.  Following the Rage Against the Machine's unmistakable sound in &quot;Wake Up&quot; (13), &quot;Rock is Dead&quot; does manage to make its way to play over the end credits.\n\nTHE MATRIX RELOADED hardly rests on the laurels of its predecessor and that goes for the music as well. Visually, the movie sets new standards of computer graphic effects, and this time, musically, the Wachowski's wanted to synthesize the orchestral work of Don Davis with the &quot;kinetic-coolness&quot; that can be found in the genre of electronica. After listening to, a disappointing solo attempt by Don Davis at just such a synthesis, namely the original score for BALLISTIC: ECKS VS. SEVER, I believe the Brothers Wachowski, Jason Bentley et al, made a wise choice in selecting both Rob Dougan and Juno Reactor to provide the synthesized-side of this fusion.\n\nAfter a short six-month wait, the trilogy culminates with The Matrix Revolutions, where composer Don Davis is given the lion's share of the musical load. By the time we reach the third film, the Wachowski's have brought us to a place where the amount of screen time spent in the virtual reality of the Matrix is at a minimum. Thus the opportunities for hip, electronica source music, used to musically define the Matrix and the superhero-like abilities it affords the central characters, have disappeared. In their place we hear the collaborative efforts of Don Davis and Juno Reactor again, but moreover we have composer Don Davis' powerful solo compositions. That said, due credit must be given to both Erik Lundborg and Conrad Pope for their stellar work spanning not only Revolutions, but Reloaded, Enter the Matrix and The Animatrix. In the end, the overall tone of The Matrix Revolutions is much more serious than its predecessors. Revolutions gives Don Davis plenty of opportunity to let the orchestra rip and, for the first time, the respective soundtrack release is dominated by his music.\nThe Matrix Revolutions can be principally broken down into two parts: the aforementioned &quot;technorchestral&quot; score, and Don Davis' most lyrical, orchestral music of the trilogy. After the traditional, orchestral Main Title sequence by Davis, we have two collaborative tracks with Juno Reactor: &quot;The Trainman Cometh&quot; (2) and &quot;Tetsujin&quot; (3). In &quot;The Trainman Cometh&quot; we hear Davis subtly re-introducing the Neo/Trinity Love Theme before returning to the combative orchestra versus electronic collaboration with Juno Reactor. Juno Reactor's primary contribution to both tracks is along the avenue of synthesized rhythms, bass drops, and percussive instruments. \n\nAlbums:\n\n2000 - The Matrix\n2003 - The Matrix Reloaded\n2003 - The Matrix Revolutions\n\nTracks:\n\nThe Matrix\n\n01  Marilyn Manson - Rock Is Dead\n02  Propellerheads - Spybreak\n03  Ministry - Bad Blood\n04  Rob D - Clubbed To Death [Kurayamino Mix]\n05  Meat Beat Manifesto - Prime Audio Soup\n06  Lunatic Calm - Leave You Far Behind\n07  Prodigy - Mindfields\n08  Rob Zombie - Dragula [Hot Rod Herman Remix]\n09  Deftones - My Own Summer [Shove It]\n10  Hive - Ultrasonic Sound\n11  Monster Magnet - Look To Your Orb For The Warning\n12  Rammstein - Du Hast\n13  Rage Against The Machine - Wake Up\n\nThe Matrix Reloaded\n\n101  Linkin Park - Session\n102  Marilyn Manson - This Is The New Shit\n103  Rob Zombie - Reload\n104  Rob Dougan - Furious Angels\n105  Deftones - Lucky You\n106  Team Sleep - The Passportal\n107  P.O.D - Sleeping Awake\n108  ÃƒÅ“nloco - Bruises\n109  Rage Against The Machine - Calm Like A Bomb\n110  Paul Oakenfold - Dread Rock\n111  Fluke - Zion\n112  Dave Matthews Band - When The World Ends\n201  Don Davis - Main Title\n202  Don Davis - Trinity Dream\n203  Juno Reactor - Wgocoo Teahouse\n204  Rob Dougan - Chateau\n205  Juno Reactor Vs. Don Davis - Mona Lisa Overdrive\n206  Juno Reactor Vs. Don Davis - Burly Brawl\n207  Don Davis - Matrix Reloaded Suite\n\nThe Matrix Revolutions\n\n01  Don Davis - The Matrix Revolutions Main Title\n02  Juno Reactor &amp; Don Davis - The Trainman Cometh\n03  Juno Reactor &amp; Don Davis - Tetsujin\n04  Pale 3 - In My Head\n05  Don Davis - The Road To Sourceville\n06  Don Davis - Men In Metal\n07  Don Davis - Niobe's Run\n08  Don Davis - Woman Can Drive\n09  Don Davis - Moribund Mifune\n10  Don Davis - Kidfriend\n11  Don Davis - Saw Bitch Workhorse\n12  Don Davis - Trinity Definitely\n13  Don Davis - Neo\n14  Don Davis - Why, Mr. Anderson\n15  Don Davis - Spirit Of The Universe\n16  Juno Reactor Vs. Don Davis - Navras\n\nEnjoy, SvC","torrent":{"xt":"urn:btih:3b13de0a3d6e5080f7f57d13bb3fc6f274349431","amp;dn":"The+Matrix+Soundtrack+%5BFirst%2C+Second+%26+Third%5D+%5BSvC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b13de0a3d6e5080f7f57d13bb3fc6f274349431","infoHashBuffer":{"type":"Buffer","data":[59,19,222,10,61,110,80,128,247,245,125,19,187,63,198,242,116,52,148,49]},"announce":[],"urlList":[]}}