{"title":"Heroes.of.Might.and.Magic.5.Collectors.Edition-RELOADED","uid":5245252,"size":2573177438,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3b1820edfb671fa41cf2fa6881628edd72b4f8e8&amp;dn=Heroes.of.Might.and.Magic.5.Collectors.Edition-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":4,"uploader":"Totenkruez","files":-1,"time":1261954115,"description":"HEROES OF MIGHT &amp; MAGIC V Collector's Edition (c) Ubisoft\n      \n            05/2006 :..... RELEASE.DATE .. PROTECTION .......: Securom\n                  1 :.......... DISC(S) .. GAME.TYPE ........: RBS\n    \n  In the renowned Might &amp; Magic universe, demon swarms spread chaos over\n  the land in a relentless assault.\n  \n  The fate of the world is at stake and heroes from a variety of legendary \n  factions must stand up and defend their causes. Live their fate, lead \n  their forces to victory and unveil the secret goal of the demon lords. \n  Become a strategy gaming legend by raising unique hero characters, \n  assembling armies and defeating enemies using the brand-new dynamic battle\n  system both offline and online.\n\n  HEROES OF MIGHT &amp; MAGIC V Collector's Edition includes the following:\n  \n  * Heroes of Might &amp; Magic 5 (of course)\n  * Unique in-game content including three additional single player \n    scenario maps and a unique hero item &quot;Aura&quot;\n  * A printed map of Ashan\n  * Sixteen page artbook by heroic fantasy artist Olivier Ledroit\n  * A faction document summarising all the creatures' skills\n  * Heroes of Might &amp; Magic 2 (complete game)\n\n  Features:\n  ~~~~~~~~~\n  * Cutting edge technology: For the first time, experience the world of \n    Might &amp; Magic in a full breathtaking 3D animated world supported by a \n    consistent and modern graphic style.\n  * Deep scalable turned-based battle system for challenging and tactical\n    combats: find out the combat system that made the success of the\n    Heroes series or experience the brand new Dynamic Battle System. Choose\n    from over 200 skills, 170 creatures abilities and 40 spells to build \n    up your heroes and their armies.\n  * New darker heroic fantasy universe: discover a completely revamped and\n    more mature universe that features 6 unique factions and over 80 \n    different creatures.\n  * Live the adventure like never before through a grasping storyline that \n    features special objectives, numerous side quests and plot twists.\n  * Complete strategy experience: during 6 campaigns and over 30 missions,\n    experience the finest blend of adventure, strategy, tactics, management\n    and role play ever brewed, through a user friendly yet deep turn based\n    system that favours tactical thinking over button mashing.\n  * Competitive and addictive intense multiplayer parts: The wait is over.\n    Discover for the first time new options that will allow you to play \n    simultaneously or even when it is not your turn!\n  * Heroes of Might and Magic V also introduce the new exclusive Duel mode:\n    challenge your opponent in fierce battles where only the sliest shall\n    prevail.\n  * Experience everlasting adventure thanks to the map editor provided.\n\n\n\n  1. Unrar.\n  2. Burn or mount with Daemon tools.\n  3. Install the game.\n  4. Copy the cracked content located in the Crack directory on the DVD to\n     your installation directory.\n  5. Play the game","torrent":{"xt":"urn:btih:3b1820edfb671fa41cf2fa6881628edd72b4f8e8","amp;dn":"Heroes.of.Might.and.Magic.5.Collectors.Edition-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b1820edfb671fa41cf2fa6881628edd72b4f8e8","infoHashBuffer":{"type":"Buffer","data":[59,24,32,237,251,103,31,164,28,242,250,104,129,98,142,221,114,180,248,232]},"announce":[],"urlList":[]}}