{"title":"MathType with Keygen v. 6.7e","uid":8433835,"size":24680446,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:3b44516b14cbb1aa6894ed994902b11dac24b407&amp;dn=MathType+with+Keygen+v.+6.7e&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"polisdavid","files":-1,"time":1367567717,"description":"Official Web Site: &lt;a href=&quot; http://www.dessci.com/en/products/mathtype_mac/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.dessci.com/en/products/mathtype_mac/&lt;/a&gt;\n\nKeygen courtesy of WeAZeL\n\n* Please note there are 2 editions included and select only what you need with your torrent client:\n\nMTM67e_12112800_EN.dmg = MathType for 10.4-10.6 UB\nMTM67e_12112800_EN.pkg = MathType for 10.7-10.8 Intel\n\nMathType is a powerful interactive equation editor that lets you create mathematical notation for word processing, Web pages, desktop publishing, presentations, and for TeX, LaTeX, and MathML documents.\n\nWorks with Many Applications and Websites\n\n* Apple iWork '09: MathType lets you add equations to \n  documents, presentations, and spreadsheets in Pages, \n  Numbers, and Keynote.\n\n* Microsoft Office 2008 and 2011: MathType lets you add\n  equations to documents, presentations, and spreadsheets in \n  Word, PowerPoint, and Excel.\n\n* Apple iBooks Author: Add and edit equations in the ebooks\n  you are authoring and make the math accessible to people with \n  visual disabilities.\n\n* Many Other Applications and Websites: MathType also\n   works with over 600 applications and websites, including:\n\n- Yahoo Mail, Gmail, Hotmail, Mac Mail, Microsoft Outlook\n- Mathematica, Maple\n- InDesign, QuarkXpress\n- Blackboard, Moodle, WebAssign\n- Wikipedia, Wolfram Alpha\n- Evernote\n\n* Many Ways to Work: MathType can add equations to virtually \n  any application or website into which you can paste or drag a \n  graphic in PDF, EPS, or GIF format or in LaTeX or MathML\n  math languages. Check our Works With section for details on \n  how MathType works with your favorite apps and websites.\n\nMore Symbols, Templates, and Fonts\n\n* More Fonts: MathType has hundreds more symbols and \n  templates than Equation Editor. Besides our exclusive Euclid\n  math fonts, you can also make use of the 1000s of math \n  symbols in fonts already on your computer, as well as math\n  fonts you can download from the Internet.\n\n* Find Symbols: MathType's Insert Symbol dialog allows you \n  to explore the available symbols and insert them with a click or\n  keystroke.\n\nThree Ways to Create Equations\n\n* Point-and-Click Editing with Automatic Formatting: Equations \n  can be created quickly by choosing templates from MathType's \n  palettes and typing into their empty slots. MathType applies \n  mathematical spacing rules automatically as you type.\n\n* Type TeX or LaTeX: If you already know the TeX typesetting \n  language, you can type it into the MathType window or \n  directly into a Word document. TeX editing can be mixed with\n   point-and-click editing so you get the best of both worlds. \n  You can also paste in equations from existing TeX documents.\n\n* Type TeX or LaTeX directly into a Microsoft Word document: \n  With MathType's unique TeX Toggle feature, you can type \n  TeX directly into a Word document. When you are done, use \n  the TeX Toggle command to turn it into a typeset equation. If\n  you want to edit it later, use TeX Toggle again to turn it back \n  into TeX to make your changes.\n\nSaves Time\n\n* Save Expressions in the Toolbar: Drag frequently used \n  equations and expressions to the MathType toolbar so they can\n  be inserted later with just a click or a keystroke.\n\n* Keyboard Shortcuts: MathType has customizable keyboard \n shortcuts for virtually every symbol, template, and command.\n\nEasier to Use\n\n* Toolbar and Menu in Microsoft Word 2011: MathType adds a \n  toolbar and menu to Microsoft Word 2011, allowing quick \n  access to its features and powerful commands to do equation \n  numbering, produce great-looking math web pages, and much \n  more. MathType also works with Word 2008 but lacks the   \n  toolbar and menu support.\n\nBetter Results\n\n* Color: Coloring an equation can make it stand out. Use color\n  to highlight part of an equation and focus your students' \n  attention on it. Show what changed in each step of a multi-step \n  procedure.\n\nSystem Requirements\n\n- OS X.4 - X.6 Universal Binary supporting both Intel and PowerPC Macs\n\n- OS X.6 or later supporting Intel Macs\n\n--- PLEASE SEED ---\n","torrent":{"xt":"urn:btih:3b44516b14cbb1aa6894ed994902b11dac24b407","amp;dn":"MathType+with+Keygen+v.+6.7e","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b44516b14cbb1aa6894ed994902b11dac24b407","infoHashBuffer":{"type":"Buffer","data":[59,68,81,107,20,203,177,170,104,148,237,153,73,2,177,29,172,36,180,7]},"announce":[],"urlList":[]}}