{"title":"Walt Disneys[Cinderella Trilogy]A 3 movie Collection by Winker@K","uid":6386437,"size":2237968419,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3b83fe3b5aaad371773723a50a2021e2b35cb0d3&amp;dn=Walt+Disneys%5BCinderella+Trilogy%5DA+3+movie+Collection+by+Winker%40K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":7,"uploader":"alanwatson","files":-1,"time":1305214068,"description":"1.cinderella\n\nthe original 1950 Walt Disney animated classic. Based upon Charles Perrault's 17th-century fable about a poor stepdaughter transformed into a vision of beauty, sent to the royal ball by her Fairy Godmother to meet her Prince Charming and live happily ever after.\n\nThe kind and beautiful Cinderella dreams of romance and a better life while serving the selfish needs of her wicked stepmother and two jealous stepsisters. With the help of her mischievous mice friends, Gus and Jaq, and a little &quot;Bibbidi-Bobbidi-Boo&quot; from the magical wand of her Fairy Godmother, Cinderella meets the handsome Prince Charming at the Royal Ball. But as she flees the castle before the stroke of midnight breaks the spell, Cinderella leaves behind a single glass slipper... leading to the ultimate fairy tale ending!\n\n\n2.cinderella 2-dreams come true\n\nThis sequel to Disney's classic CINDERELLA, made over 50 years after its predecessor, picks up where the original left off. Cinderella has married Prince Charming and returned to the palace, her new home, after the honeymoon when she learns that adapting to her lifestyle may be even more difficult than escaping her evil stepmother. Finding herself in the role of Royal Hostess but unfamiliar with the traditions of the Royal Court, Cinderella worries that her provincial manner of entertaining will be inappropriate. However, with the help of some familiar mice and her Fairy Godmother, Cinderella hopes that she can produce a celebration that compliments the sensibilities of her new family. Filled with new music, characters from the original film, and a brand new version of &quot;Bibbidi-Bobbidi-Boo,&quot; CINDERELLA 2 is sure to delight a new generation of both children and adults.\n\n3.cinderella 3-a twist in time\n\nWhat If?\n\nDisney's classic fairytale continues in this all-new animated movie. A stepmother's revenge reveals the glass slipper did not fit Cinderella after all, in this spell-binding story about magic falling into the wrong hands. Prince Charming, along with best friends Jaq and Gus, join Cinderella in this all-new feature with enchanting songs, spectacular animation and more wonder and suspense than ever before!\n","torrent":{"xt":"urn:btih:3b83fe3b5aaad371773723a50a2021e2b35cb0d3","amp;dn":"Walt+Disneys%5BCinderella+Trilogy%5DA+3+movie+Collection+by+Winker%40K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b83fe3b5aaad371773723a50a2021e2b35cb0d3","infoHashBuffer":{"type":"Buffer","data":[59,131,254,59,90,170,211,113,119,55,35,165,10,32,33,226,179,92,176,211]},"announce":[],"urlList":[]}}