{"title":"Underground Airlines (2016) by Ben H. Winters","uid":15876992,"size":1778933,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c5aaa909742f03f60e0495a7165936a01d8bbc0&amp;dn=Underground+Airlines+%282016%29+by+Ben+H.+Winters&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":1,"uploader":"Dr.Soc","files":1,"time":1474529719,"description":"Underground Airlines by Ben H. Winters\r\nHardcover: 336 pages\r\nPublisher: Mulholland Books (July 5, 2016)\r\nLanguage: English\r\nISBN-10: 0316261246\r\nISBN-13: 978-0316261241\r\nFormat: ePub\r\n\r\nNow a New York Times bestseller!\r\n\r\nIt is the present-day, and the world is as we know it: smartphones, social networking and Happy Meals. Save for one thing: the Civil War never occurred.\r\n\r\nA gifted young black man calling himself Victor has struck a bargain with federal law enforcement, working as a bounty hunter for the US Marshall Service. He's got plenty of work. In this version of America, slavery continues in four states called &quot;the Hard Four.&quot; On the trail of a runaway known as Jackdaw, Victor arrives in Indianapolis knowing that something isn't right--with the case file, with his work, and with the country itself.\r\n\r\nA mystery to himself, Victor suppresses his memories of his childhood on a plantation, and works to infiltrate the local cell of a abolitionist movement called the Underground Airlines. Tracking Jackdaw through the back rooms of churches, empty parking garages, hotels, and medical offices, Victor believes he's hot on the trail. But his strange, increasingly uncanny pursuit is complicated by a boss who won't reveal the extraordinary stakes of Jackdaw's case, as well as by a heartbreaking young woman and her child who may be Victor's salvation. Victor himself may be the biggest obstacle of all--though his true self remains buried, it threatens to surface.\r\n\r\nVictor believes himself to be a good man doing bad work, unwilling to give up the freedom he has worked so hard to earn. But in pursuing Jackdaw, Victor discovers secrets at the core of the country's arrangement with the Hard Four, secrets the government will preserve at any cost.\r\n\r\nUnderground Airlines is a ground-breaking novel, a wickedly imaginative thriller, and a story of an America that is more like our own than we'd like to believe","torrent":{"xt":"urn:btih:3c5aaa909742f03f60e0495a7165936a01d8bbc0","amp;dn":"Underground+Airlines+%282016%29+by+Ben+H.+Winters","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c5aaa909742f03f60e0495a7165936a01d8bbc0","infoHashBuffer":{"type":"Buffer","data":[60,90,170,144,151,66,240,63,96,224,73,90,113,101,147,106,1,216,187,192]},"announce":[],"urlList":[]}}