{"title":"Karajan Conducts Tchaikovsky   (8 CD Box Set)","uid":5117120,"size":2506864504,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d62811690c93bb32ee73653169eb23cdb954345&amp;dn=Karajan+Conducts+Tchaikovsky+++%288+CD+Box+Set%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":4,"uploader":"eddie1969","files":-1,"time":1255118450,"description":"Karajan Conducts Tchaikovsky 8CDs\n\n\n\nExact Audio Copy | APE (image + cue), English Booklet (HQ Scans)\nDeutsche Grammophon, Release: 2000\nDim. 2.67 Gb\n\nPyotr Ilyich Tchaikovsky was a Russian composer of the Romantic era. He wrote some of the most popular concert and theatrical music in the current classical repertoire, including the ballets Swan Lake, The Sleeping Beauty and The Nutcracker, the 1812 Overture, his First Piano Concerto, seven symphonies, and the opera Eugene Onegin.\n\nBorn into a middle-class family, Tchaikovsky's education prepared him for a career as a civil servant, despite the musical precocity he had demonstrated. Against the wishes of his family he chose to pursue a musical career, and in 1862 entered the St Petersburg Conservatory, graduating in 1865. This formal, Western-oriented training set him apart, musically, from the contemporary nationalistic movement embodied by the group of young Russian composers known as &quot;The Five&quot;, with whom Tchaikovsky sustained a mixed professional relationship throughout his career.\n\nAs his style developed, Tchaikovsky wrote music across a range of genres, including symphony, opera, ballet, instrumental, chamber and song. Although he enjoyed many popular successes, he was never emotionally secure, and his life was punctuated by personal crises and periods of depression. Contributory factors were his suppressed homosexuality and fear of exposure, his disastrous marriage, and the sudden collapse of the one enduring relationship of his adult life, his 13-year association with the wealthy widow Nadezhda von Meck. Amid private turmoil Tchaikovsky's public reputation grew; he was honored by the Tsar, awarded a lifetime pension and lauded in the concert halls of the world. His sudden death at the age of 53 is generally ascribed to cholera, but some attribute it to suicide.\n\nAlthough enduringly popular with concert audiences across the world, Tchaikovsky has at times been judged harshly by critics, musicians and composers. However, his reputation as a significant composer is now generally regarded as secure. In the early and mid-20th century, Western critics dismissed his music as vulgar and lacking in elevated thought, but this disdain has largely dissipated.\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:3d62811690c93bb32ee73653169eb23cdb954345","amp;dn":"Karajan+Conducts+Tchaikovsky+++%288+CD+Box+Set%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d62811690c93bb32ee73653169eb23cdb954345","infoHashBuffer":{"type":"Buffer","data":[61,98,129,22,144,201,59,179,46,231,54,83,22,158,178,60,219,149,67,69]},"announce":[],"urlList":[]}}