{"title":"Workaholics Season 1, 2, and 3 COMPLETE XvID MixedPack","uid":8790848,"size":7309938854,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3e25448fdc1bfd3234c67eabad3beee58c2f5b09&amp;dn=Workaholics+Season+1%2C+2%2C+and+3+COMPLETE+XvID+MixedPack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":4,"uploader":"TheRealMovieGuru","files":40,"time":1375941725,"description":"Workaholics is a single-camera situation comedy television series. The series stars Blake Anderson, Adam DeVine, and Anders Holm of the comedy troupe Mail Order Comedy as three recent college graduate roommates who work at the same telemarketing company, TelAmeriCorp. Television veteran Kevin Etten is the series' showrunner. It is sometimes referred to as a &quot;slacker comedy&quot; series, meaning there is much marijuana-based humor and the characters are somewhat aimless.\n\nWorkaholics was originally ordered by Comedy Central in March 2010 for a projected Summer 2010 debut after a Comedy Central executive saw a series of videos the group had posted on Youtube. The pilot aired as a &quot;TV Sneak Peek&quot; after the March 15, 2011 debut of the Comedy Central Roast of Donald Trump. The program premiered its ten-episode first season on April 6, 2011, at 10:30 p.m. EDT on Comedy Central. In Canada, the show airs on Monday nights at 10:00 p.m. EDT on The Comedy Network.\n\nThe three main characters - Blake, Adam, and Anders - were college roommates, and continue to share a house together as they transition into adulthood. The show's action is generally confined to the main characters' house and their workplace, that of a cubicle the three of them share at a telemarketing company..\n","torrent":{"xt":"urn:btih:3e25448fdc1bfd3234c67eabad3beee58c2f5b09","amp;dn":"Workaholics+Season+1%2C+2%2C+and+3+COMPLETE+XvID+MixedPack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e25448fdc1bfd3234c67eabad3beee58c2f5b09","infoHashBuffer":{"type":"Buffer","data":[62,37,68,143,220,27,253,50,52,198,126,171,173,59,238,229,140,47,91,9]},"announce":[],"urlList":[]}}