{"title":"Poker - Math that Matters","uid":6922093,"size":3157339,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e28cb37b1c5c0df01c6ada3ba9c9a23b2f54d6f&amp;dn=Poker+-+Math+that+Matters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"mischanix","files":1,"time":1325309517,"description":"So some fucking idiot uploaded an executable version.  This is the pdf inside the exe that I unpacked, the password was 'lollol777' and was pretty visible in the .data section of the PE; the executable wanted you to &quot;Pay by SMS&quot; to unlock the pdf.\n\nHopefully now that faggot doesn't profit off of someone else's work.\n\n--------------------------\n\nPoker Math That Matters - Simplifying the Secrets of No-limit Hold'em\n\nLearning the math behind good poker has never been easier. Owen's methods and shortcuts will have you applying math at the poker table overnight. This book goes over the math involved in mastering decisions in no-limit hold'em cash games. There are over 100 quiz questions and answers to help you gauge your understand and practice sharpening your skills. Excerpt from Poker Math That Matters: &quot;Understanding the mathematics of poker has made a dramatic difference in my poker game. This book is an attempt to help those who do not have a strong inclination to math or game theory but would really like to improve their poker skills. I designed this material in an attempt to not leave any reader behind. I started with the most basic concepts and worked up from there. When finished with this book, you will be able to think clearly about no-limit hold'em and analyze even some of the most complex decisions in the game. This will make you a force at the tables, and your wallet will thank you. Besides, as a friend of mine likes to say, winning is just way more fun!&quot; \n\nPaperback: 220 pages\nPublisher: Owen Gaines (2010)\nLanguage: English\nISBN-10: 061539745X\nISBN-13: 978-0615397450","torrent":{"xt":"urn:btih:3e28cb37b1c5c0df01c6ada3ba9c9a23b2f54d6f","amp;dn":"Poker+-+Math+that+Matters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e28cb37b1c5c0df01c6ada3ba9c9a23b2f54d6f","infoHashBuffer":{"type":"Buffer","data":[62,40,203,55,177,197,192,223,1,198,173,163,186,156,154,35,178,245,77,111]},"announce":[],"urlList":[]}}