{"title":"Standup Comedy - Amy Schumer - Cutting (2011)","uid":6688375,"size":48839686,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3e513236077160988b8f80e3153474a74367493f&amp;dn=Standup+Comedy+-+Amy+Schumer+-+Cutting+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":1,"uploader":"rambam1776","files":-1,"time":1316496782,"description":"Amy Schumer: Cutting - Album Review\n\nBy Patrick Bromley, About.com Guide\n\n\nOverlooking the double meaning in the title of Amy Schumer's debut album, Cutting, it's a great example of the comic's approach to stand-up: take a subject that might otherwise be sensitive or off-limits (in this case, teenage cutting) and turn it into comedy. She's the kind of comic who knows that a shock is a quick and easy way to get a laugh, particularly when it comes out of the mouth of an unassuming young woman --- the kind that thinks that inserting the word &quot;AIDS&quot; into any punchline is automatically funny. Schumer's comedy is very much in the vein of what Sarah Silverman introduced into the mainstream. Whether or not Schumer would list Silverman among her influences, I cannot say, but it's hard to overlook the way that Silverman's spectre looms large over Cutting.\n\nDespite much of the album's overt willingness to be dark or shocking, Schumer knows how to write a joke. There's a lot of very funny stuff on Cutting -- enough to make me wish that Schumer was a little more willing to resist indulging some of her instincts. When she's not destroying political correctness for its own sake, she's comes up with some terrific black comedy one-liners, and her album shows a real intelligence and knack for using language.\n\nThat leaves Cutting kind of a mixed bag. There are a lot of good jokes in the album's first half, but by about the midway point it becomes clear that it doesn't have a lot more to offer -- it doesn't go anywhere when it needs to. Schumer is happy to repeat the same kind of joke over and over, and after a while the shock value wears off. We become desensitized to it, leaving Schumer backed somewhat into a corner. That doesn't mean she's unable to get off the occasional winner, but the element of surprise was one of her strongest assets in the early goings. Once that's gone, the album starts to drag a bit.\n\nUltimately, I laughed a whole lot during Cutting, a fact that probably shouldn't be ignored when discussing a comedy album. It shows Schumer as a talented writer and stand-up, but also suggests that she's young yet and has some clear room to grow. The record's high alone make it worth checking out.\n\nOh, and it has maybe the best final joke of any comedy album I've heard in a long, long time.\n\nAlbum Release Date: 4/26/11\nLabel: Comedy Central Records","torrent":{"xt":"urn:btih:3e513236077160988b8f80e3153474a74367493f","amp;dn":"Standup+Comedy+-+Amy+Schumer+-+Cutting+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e513236077160988b8f80e3153474a74367493f","infoHashBuffer":{"type":"Buffer","data":[62,81,50,54,7,113,96,152,139,143,128,227,21,52,116,167,67,103,73,63]},"announce":[],"urlList":[]}}