{"title":"RealtimeBondage--Pushing Boundaries Part 3  London River High","uid":15853903,"size":4188418707,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3e946061d813d5394e27045025b122b586921f2d&amp;dn=RealtimeBondage--Pushing+Boundaries+Part+3++London+River+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":8,"uploader":"merzedes","files":1,"time":1474203929,"description":"\nPushing Boundaries Part 3 | London River\r\n\r\nSeptember 17, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nStubborn Slut Suffers at Her Own Hand \r\n\r\nWhen we return to London River in her live feed, it is pretty clear that she has been pushed a little beyond her limits. She can't get her hands to work in order to tie her own ankles. She keeps slipping and her hands are shaking. It's her own fault for coming up with so many ridiculous, brutal torments for herself. And what's worse is she hasn't even gotten to the hardest of them yet. In her final installment, we are going to find out if London can hold herself together when pushed farther beyond her limits than she has ever been pushed.\r\n\r\nThe first plan we have was one of London's own ideas. If you are a regular viewer, you are no doubt familiar with the concept of the zipper: a line of clothespins clipped onto skin and attached to each other by a string. When ripped off, the pain is absolutely excruciating. London, sadistic bitch that she is, has decided that there is room for improvement on this time honored classic. She has decided it is necessary to be bent back over a bench with her wrists and ankles tied to the floor to tighten the skin on her stomach. What's more, she came up with the idea to replace the clothespins with binder clips. With a hitachi between her legs, when the string is pulled, the sound that comes out of her is truly something to behold.\r\n\r\nHer final torment, and one of the more intense torments we have had here on insexondemand.com, is so frightening that it has London sobbing before we even get started. O.T. takes a vibrator and sticks it inside London's pussy. Then, he takes his tray of needles and carefully sticks them one by one through the skin of her labia, until her pussy is pinned shut from the outside. After that he takes a string and laces it through the needles to hold it closed. It turns out that it is possible to break even the most stubborn, hard headed bitch. It just might be that only she knows how to do it. \r\n\r\nScreens \nhttp://www.realtimebondage.com/live/bondage/trailer.php?y=2016&amp;p=09_17lriver14&amp;u=RealTimeBondage-London-River-Pushing-Boundaries-Part-3\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:3e946061d813d5394e27045025b122b586921f2d","amp;dn":"RealtimeBondage--Pushing+Boundaries+Part+3++London+River+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e946061d813d5394e27045025b122b586921f2d","infoHashBuffer":{"type":"Buffer","data":[62,148,96,97,216,19,213,57,78,39,4,80,37,177,34,181,134,146,31,45]},"announce":[],"urlList":[]}}