{"title":"NubileFilms: Aisha (Love Making) 09.04.16","uid":15747995,"size":192608057,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:3eb13c8fa556b528857d826bc85d46bd01f4022f&amp;dn=NubileFilms%3A+Aisha+%28Love+Making%29+09.04.16&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":6,"uploader":"EndYou","files":1,"time":1472994613,"description":"DaughterSwap The Best NEW XXX PACK:  https://thepiratebay.org/torrent/15710946/All_DaughterSwap_Videos_For_2016_The_Best_NEW_XXX_Pack\r\n\r\nMore exclusive porn at:  https://thepiratebay.org/user/EndYou\r\n\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――    \nhttp://imgpremium.com/img-57cc011037baf.html  \nhttp://imgpremium.com/img-57cc0110a084d.html \r\n\r\nNick Ross and Aisha are enjoying some topless time, and it's no surprise when that turns into something much sexier. Peeling off her shorts, Aisha settles onto Nick's lap to ride him through his jeans. That rough friction is pussy pleasing, but not quite what the blonde wants, so she pulls off Nick's jeans and goes to work with her hands and mouth sucking and stroking him to total stiffness.\r\n\r\nNot about to let Aisha have all the fun, Nick urges his blonde angle onto her back and spreads her thighs so that he can settle on his belly between her legs. Using sweet slow strokes of his tongue, he builds the pressure in Aisha's belly by fondling her clit and slit. Once she's practically gushing her pussy juices, he slides two fingers in to hit her g-spot as he continues to stimulate her clitoris for explosive results.\r\n\r\nRising up above his freshly satisfied lover, Nick turns Aisha onto her side and slides his stiffie deep into her fuck hole. His strokes are long and sure, designed for maximum pleasure. Aisha is instantly ready for a second round, and Nick responds by speeding up until he is delivering a full-throttle pussy pounding that shakes her whole body with the force of his thrusts.\r\n\r\nRolling onto his back, Nick watches with rapt attention as Aisha rises above him and then sinks down on his fuck rod until her whole pussy is stuffed. Flexing her hips, she sets off on a stiffie ride that goes at a breakneck pace. Her gasps and moans fill the room as she keeps it up, even reaching forward to fondle her own clit as she seeks another round of satisfaction.\r\n\r\nNick gives Aisha a few moments to come down from her latest trip to heaven before gently rearranging her for a final go. Spreading her thighs, he slowly slides into her juicy channel until he is fully seated. From there he maintains eye contact as his hips do the work, pumping Aisha full of his love until she explodes one last time. Nick is on the verge of a climax, too, which Aisha addresses by jerking him off so that she can aim his cum shot all over her face and tits in a loving finish to their afternoon fuckfest.\r\n\r\nMPEG4 Video (H264) 960x540","torrent":{"xt":"urn:btih:3eb13c8fa556b528857d826bc85d46bd01f4022f","amp;dn":"NubileFilms%3A+Aisha+%28Love+Making%29+09.04.16","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eb13c8fa556b528857d826bc85d46bd01f4022f","infoHashBuffer":{"type":"Buffer","data":[62,177,60,143,165,86,181,40,133,125,130,107,200,93,70,189,1,244,2,47]},"announce":[],"urlList":[]}}