{"title":"OfficeSuite 8 Pro + PDF v8.7.5808 APK [SadeemPC]","uid":15576718,"size":47186533,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:3eff72b96789755cc3edcad58e5fc85bd916362d&amp;dn=OfficeSuite+8+Pro+%2B+PDF+v8.7.5808+APK+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":0,"uploader":"SadeemPC","files":1,"time":1471347184,"description":"OfficeSuite 8 Pro + PDF v8.7.5808\r\nRequirements: Android 4.0+\r\n\r\nOfficeSuite lets you easily view, edit, and create Word, Excel, and PowerPoint documents, convert to/from PDF, and manage your files all with the most feature-rich mobile office solution available for Android smartphones and tablets.\t\r\n\r\nPCMAG AND GOOGLE PLAY EDITORS’ CHOICE AWARDS WINNER\r\n- Installed on 200 million devices in 205 countries and growing\r\n- Over 45 million downloads alongside 55,000 daily activations\r\n- The No. 1 app in Google Play’s Business category with 350,000+ user reviews\r\nPreloaded by top manufacturers including Sony, Amazon, ACER, Alcatel, Toshiba, Sharp, Barnes &amp; Noble, Archos, Polaroid, ViewSonic, Kyocera and Kobo\r\n\r\nTHE LATEST OFFICESUITE 8 NOW BRINGS DESKTOP FEATURES TO A MOBILE LIKE NEVER BEFORE:\r\n- Seamlessly transition between desktop and mobiles using our updated user interface \r\n- PDF security and editing features including digital signatures support, permissions management, text to PDF, and annotations \r\n- Track changes with multiple author support\r\n- More\r\n\r\nKEY FEATURES:\r\n- View, create and edit complex office and attachments all from a familiar desktop-style interface.\r\n- Full compatibility with Microsoft formats including DOC, DOCX, DOCM, XLS, XLSX, XLSM, PPT, PPTX, PPS, PPSX, PPTM, PPSM.\r\n- Support for PDF files including PDF camera scanning and Export to PDF. \r\n- Additional support for common formats like RTF, TXT, LOG, CSV, EML, ZIP; Open Office - ODT, ODS and ODP - support (available as in-app purchase).\r\n- Preserve document formatting and layout and use advanced editing features like never before on a mobile platform. \r\n- Integrated File Browser for quick and easy access to both local and remote files including Recent files, My Documents folders and document templates.\r\n- Sharing via cloud services like Box, DropBox, Google Drive, OneDrive, Amazon Cloud Drive and SugarSync, as well as over email, Bluetooth, and Wi-Fi Direct.\r\n- Available in 56 languages. \r\n- Support for multiple keyboard shortcuts including moving of objects and selections.\r\n\r\nHOW IS OFFICESUITE PRO BETTER THAN OFFICESUITE FREE?\r\n- Format Painter in Word documents.\r\n- Security features - work with password protected files.\r\n- Insert pictures using your camera or from an external file.\r\n- Additional options in Excel including Insert Filter, Conditional Formatting, Define Name, Import Image, Edit Chart, and Save as CSV. \r\n- Edit transitions in PowerPoint slideshows.\r\n\r\nWHAT'S NEW\r\n- Track changes – Track Changes in documents are now visible in all OfficeSuite versions.\r\n- Performance improvements – App speed has been improved so you can work faster than ever.\r\n- Various bug fixes and improvements - password protected PDF files, SD cards, etc.\r\n\r\nHomepage \nhttps://play.google.com/store/apps/details?id=com.mobisystems.editor.office_registered","torrent":{"xt":"urn:btih:3eff72b96789755cc3edcad58e5fc85bd916362d","amp;dn":"OfficeSuite+8+Pro+%2B+PDF+v8.7.5808+APK+%5BSadeemPC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eff72b96789755cc3edcad58e5fc85bd916362d","infoHashBuffer":{"type":"Buffer","data":[62,255,114,185,103,137,117,92,195,237,202,213,142,95,200,91,217,22,54,45]},"announce":[],"urlList":[]}}