{"title":"The Mastery Of Self - A Toltec Guide To Freedom (2016) Gooner","uid":15740251,"size":1386635,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f5f597a6dc0616b16dffd4d2a2c66c5a1102d4c&amp;dn=The+Mastery+Of+Self+-+A+Toltec+Guide+To+Freedom+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":1,"uploader":"GoonerTPB","files":2,"time":1472900148,"description":"The Mastery Of Self - A Toltec Guide To Freedom (2016) (Epub) Gooner\r\n\r\nPublisher: Hierophant Publishing (6 Jun. 2016)\r\nLanguage: English\r\nISBN-10: 1938289536\r\nISBN-13: 978-1938289538\r\n\r\nThe ancient Toltecs believed that life, as we perceive it, is a dream. We each live in our own Personal Dream, and these come together to form the Dream of the Planet, or the world in which we live.\r\nProblems arise when our perception of the Dream becomes clouded with negativity, drama, and judgment (of ourselves and others), because it's in these moments of suffering that we have forgotten that we are the architects of our own reality and we have the power to change our Dream if we choose. In The Mastery of Self bestselling author and teacher don Miguel Ruiz Jr. takes the Toltec philosophy of the Dream of the Planet and offers you a road map to reclaiming your Authentic Self. He reveals how the tools of awareness, understanding, and unconditional love can free you from any inhibiting beliefs, stories, or ideas that are keeping you from living the best life possible. This book can help you discover who you really are at the deepest level, which often lies just beyond any conditioning or domestication you have acquired throughout your life.\r\n\r\nIn addition to identifying the problem and explaining the solution in the context of his Toltec tradition, don Miguel Ruiz Jr. has included in-depth exercises throughout the book that will help you put these teachings into practice. The end result is a book that you can return to again and again.\r\n\r\nTHE MASTERY OF SELF takes the Toltec philosophy of the Dream of the Planet and the personal dream and explains how a person can:\r\n\r\n· Wake up\r\n\r\n· Liberate themselves from illusory beliefs and stories\r\n\r\n· Live with authenticity\r\n\r\nOnce released, we can live as our true, authentic, loving self, not only in solitude and meditation, but in any place - at the grocery store, stuck in traffic etc. - and in any situation or scenario that confronts us","torrent":{"xt":"urn:btih:3f5f597a6dc0616b16dffd4d2a2c66c5a1102d4c","amp;dn":"The+Mastery+Of+Self+-+A+Toltec+Guide+To+Freedom+%282016%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f5f597a6dc0616b16dffd4d2a2c66c5a1102d4c","infoHashBuffer":{"type":"Buffer","data":[63,95,89,122,109,192,97,107,22,223,253,77,42,44,102,197,161,16,45,76]},"announce":[],"urlList":[]}}