{"title":"Kitchen Confidential - Anthony Bourdain [Epub &amp; Mobi] [Storm","uid":9843883,"size":1064622,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f84525de862a3ebd6a496a0af369221e9e5ddf5&amp;dn=Kitchen+Confidential+-+Anthony+Bourdain+%5BEpub+%26amp%3B+Mobi%5D+%5BStorm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":3,"uploader":"krystine","files":-1,"time":1396040079,"description":"Description\nKitchen Confidential\nAuthor: Anthony Bourdain\nPublished: 2008\nPublisher: Bloomsbury USA\nISBN: 9780747550727\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\nKitchen Confidential reveals what Bourdain calls &quot;twenty-five years of sex, drugs, bad behavior and haute cuisine.&quot; \nLast summer, The New Yorker published Chef Bourdain's shocking, &quot;Don't Eat Before Reading This.&quot; Bourdain spared no one's appetite when he told all about what happens behind the kitchen door. Bourdain uses the same &quot;take-no-prisoners&quot; attitude in his deliciously funny and shockingly delectable book, sure to delight gourmands and philistines alike. From Bourdain's first oyster in the Gironde, to his lowly position as dishwasher in a honky tonk fish restaurant in Provincetown (where he witnesses for the first time the real delights of being a chef); from the kitchen of the Rainbow Room atop Rockefeller Center, to drug dealers in the east village, from Tokyo to Paris and back to New York again, Bourdain's tales of the kitchen are as passionate as they are unpredictable. Kitchen Confidential will make your mouth water while your belly aches with laughter. You'll beg the chef for more, please.\n","torrent":{"xt":"urn:btih:3f84525de862a3ebd6a496a0af369221e9e5ddf5","amp;dn":"Kitchen+Confidential+-+Anthony+Bourdain+%5BEpub+%26amp%3B+Mobi%5D+%5BStorm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f84525de862a3ebd6a496a0af369221e9e5ddf5","infoHashBuffer":{"type":"Buffer","data":[63,132,82,93,232,98,163,235,214,164,150,160,175,54,146,33,233,229,221,245]},"announce":[],"urlList":[]}}