{"title":"The Innovator's Dilemma - Clayton M. Christensen - Audiobook MP3","uid":11321713,"size":68502603,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3fd6c80342f1420595d58162ca23629598a50bba&amp;dn=The+Innovator%27s+Dilemma+-+Clayton+M.+Christensen+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1414605924,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Innovator's Dilemma: When New Technologies Cause Great Firms to Fail\n\nWritten by: Clayton M. Christensen\nNarrated by: Don Leslie\nLength: 2 hrs and 21 mins\nAbridged Audiobook\nRelease Date:11-27-07\n\nGreat companies can fail: not because they do anything wrong, but because they do everything right. Meeting customers' current needs leads firms to reject breakthrough innovations, &quot;disruptive technologies&quot;, that create the products and opportunities of the future.\n\nRadical thinking...and a wake-up call. Citing examples from many industries (computers, retailing, pharmaceuticals, automobiles, steel), Clayton M. Christensen explains how to avoid a similar fate. He presents strategies for determining when not to listen to customers, when to pursue small markets at the expense of larger ones, and other ways to ensure long-term growth and profit. This award-winning audiobook shows managers the changes that may be coming: and how to respond for success","torrent":{"xt":"urn:btih:3fd6c80342f1420595d58162ca23629598a50bba","amp;dn":"The+Innovator%27s+Dilemma+-+Clayton+M.+Christensen+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fd6c80342f1420595d58162ca23629598a50bba","infoHashBuffer":{"type":"Buffer","data":[63,214,200,3,66,241,66,5,149,213,129,98,202,35,98,149,152,165,11,186]},"announce":[],"urlList":[]}}