{"title":"Dark History of the Kings and Queens of England","uid":15802132,"size":19251594,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4001c49eab61ba54df8fb67cd90b240bb4320b24&amp;dn=Dark+History+of+the+Kings+and+Queens+of+England&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"marty14","files":1,"time":1473519060,"description":"Dark History of the Kings and Queens of England - Brenda Ralph Lewis [epub]\r\n\r\nDespite its reputation as the longest established in Europe, the history of the English monarchy is punctuated by scandal, murders, betrayals, plots, and treason. Since William the Conqueror seized the crown in 1066, England has seen three civil wars; six monarchs have been murdered or executed; the throne of England has been usurped four times, and won in battle three times; and personal scandals and royal family quarrels abound. A Dark History: The Kings &amp; Queens of England provides an exciting and dramatic account of English royal history from 1066 to the present day.\r\n\r\nThis engrossing book explores the scandal and intrigue behind each royal dynasty, from the ‘accidental’ murder of William II in 1100, through the excesses of Richard III, Henry VIII and ‘Bloody’ Mary, to the conspiracies surrounding the death of Diana, Princess of Wales, in 1997. Carefully researched, superbly entertaining and illustrated throughout with more than 200 colour and black-and-white photographs and artworks, this accessible and immensely enjoyable book highlights the true personalities and real lives of the individuals honoured with the crown of England—and those unfortunate enough to cross their paths","torrent":{"xt":"urn:btih:4001c49eab61ba54df8fb67cd90b240bb4320b24","amp;dn":"Dark+History+of+the+Kings+and+Queens+of+England","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4001c49eab61ba54df8fb67cd90b240bb4320b24","infoHashBuffer":{"type":"Buffer","data":[64,1,196,158,171,97,186,84,223,143,182,124,217,11,36,11,180,50,11,36]},"announce":[],"urlList":[]}}