{"title":"Fall Out Boy Discography","uid":5722773,"size":450153482,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:404594677af0fdcba27ecd928bd62d525ff11f22&amp;dn=Fall+Out+Boy+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":6,"uploader":"Zoey_Redbird","files":136,"time":1280342472,"description":"Fall Out Boy is an American rock band from Wilmette, Illinois, formed in 2001. The band consists of vocalist-rhythm guitarist Patrick Stump, lead guitarist Joe Trohman, bassist Pete Wentz and drummer Andy Hurley.\n\nWith Pete Wentz as the band's primary lyricist and Patrick Stump as the primary composer, Fall Out Boy reached mainstream success with its major label debut, From Under the Cork Tree. Released in 2005, the album won several awards and achieved double platinum status after selling more than 2.5 million albums in the United States alone. To support the album, the band headlined tours around the world in 2005 and 2006. In 2007 the band released the followup Infinity on High to major chart success, reaching #1 on the Billboard 200 and selling 260,000 copies its first week. The lead single, &quot;This Ain't a Scene, It's an Arms Race&quot;, reached #1 on the Pop 100 and #2 on the Billboard Hot 100. On February 2, 2010, the band reportedly broke up although no official press statement was released. Since then, the band has made their status more clear and the break (not breakup) has been re-confirmed.\n\nWith the release of their 2009 compilation Believers Never Die - Greatest Hits, and in regard to the legacy of the band, Allmusic senior-editor Stephen T. Erlewine wrote that Fall Out Boy &quot;seems like one of the quintessential mainstream rock singles bands of the 2000s.&quot;\n\n\n\nI have litterally collected ALL of their albums, songs, remixes, and everything else in here.","torrent":{"xt":"urn:btih:404594677af0fdcba27ecd928bd62d525ff11f22","amp;dn":"Fall+Out+Boy+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"404594677af0fdcba27ecd928bd62d525ff11f22","infoHashBuffer":{"type":"Buffer","data":[64,69,148,103,122,240,253,203,162,126,205,146,139,214,45,82,95,241,31,34]},"announce":[],"urlList":[]}}