{"title":"The Witcher 3: Wild Hunt (Patch v1.10) (GOG)","uid":12541806,"size":10705115834,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:408dae80be809546783301e2213fc824465f88a4&amp;dn=The+Witcher+3%3A+Wild+Hunt+%28Patch+v1.10%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":3,"uploader":"mercs215","files":5,"time":1444405410,"description":"Install instructions:\r\n1. Run &quot;patch_witcher3_1.01-1.10_2.0.0.40&quot;\r\n2. Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS GAME! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nChange log:\r\nPatch 1.10 (9 October 2015)\r\nAUDIO \r\nAdds music after horse race in quest titled Ciri's Story: The Race. \r\nFixes issue whereby ambient music from surroundings of Kaer Muire could override other music. \r\nFixes lack of music if autosave made before fight against pirates was loaded during quest titled Destination: Skellige. \r\nAdds segments to conversations with Triss and Yen before battle at Kaer Morhen. \r\nAdds segements to conversation with Ciri in quest titled Payback. \r\nAdds segments to conversation with Triss in quest titled On Thin Ice. \r\nFixes issue whereby forktail could screech endlessly if ignited with the Igni Sign Igni and then slashed with a sword. \r\nFixes issue entailing unintended loop in combat music during first musical sequence in New Game + mode. \r\nDLC \r\nFixes issues whereby New Game + would not start correctly from certain save files. \r\nGAMEPLAY \r\nFixes rare instances of imcorrect Stamina regeneration. \r\nFixes rare issue whereby player character movement remained accelerated after player used crossbow, cast bombs or engaged in sword combat on horseback. \r\nFixes incorrect weight calculaction in Inventory. \r\nFixes rare issue whereby slow­motion effect of Caranthir's spell was not lifted from player character after the stipulated time. \r\nFixes issue with occasional malfunction of Superior Thunderbolt potion. \r\nFixes issue whereby Firestream Alternate Sign Mode skill could be used despite not being equipped in Character Development panel. \r\nFixes issue whereby Roach would behave incorrectly during horse race in quest titled To Bait a Forktail... \r\nFixes rare issue whereby Toxicity regeneration was blocked if player drank Water Hag decoction. \r\nCrafting diagrams in merchant inventories now include item level information in addition to basic information about craftable item. \r\nFixes color of 'Required level' as displayed in merchant inventories and Stash. Display is now same as in Inventory. If player level is insufficient for item, 'Required level' is red. \r\nIntroduces modification whereby potions and bombs can no longer be sold. \r\nFixes assorted issues with quest and enemy scaling in New Game + mode. \r\nIntroduces multiple improvements in gwent, including option to choose one of three difficulty levels. To set option, go to Options&gt;Game. \r\nIntroduces multiple game balance improvements in New Game + mode. \r\nModifies diagram for Enhanced Legendary Wolven Gauntlets, now craftable without Griffin Gauntlets. \r\nFixes issue whereby Toxicity gain from decoctions was not acurately reflected in character statistics. \r\n Fixes issue whereby high Toxicity level could block exploration when this involved a ladder or stepping onto a boat. \r\nIntroduces enhancement whereby color of rune­enchanted swords now depends on runes used. \r\nFixes rare issue with incorrect display of interaction prompts when appoaching ladders. \r\nFixes issue whereby Geralt remained attached to sinking boat when aiming crossbow. \r\nFixes rare issue whereby player character in combat mode would be propelled into the air when stepping on boat tiller. \r\nFixes rare issue entailing Wild Hunt minions running in circles during quest titled The Battle of Kaer Morhen. \r\nFixes issue whereby ifrits were not invulnerable to all variants of Igni Sign. \r\nImproves game balance for Katakan monster. \r\nImproves balance for Death March difficulty. \r\nImproves in­game information for Card Collector achievement ­ adds indicators to show missing cards. \r\nFixes incorrect loot spawning on hens and geese. \r\nAnd more, read the README","torrent":{"xt":"urn:btih:408dae80be809546783301e2213fc824465f88a4","amp;dn":"The+Witcher+3%3A+Wild+Hunt+%28Patch+v1.10%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"408dae80be809546783301e2213fc824465f88a4","infoHashBuffer":{"type":"Buffer","data":[64,141,174,128,190,128,149,70,120,51,1,226,33,63,200,36,70,95,136,164]},"announce":[],"urlList":[]}}