{"title":"With Hitler to the End: The Memoirs of Hitler's Valet","uid":16033593,"size":1090870,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40a53226e2b1ceedd251268c99572ba3ea2cc4ea&amp;dn=With+Hitler+to+the+End%3A+The+Memoirs+of+Hitler%27s+Valet&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":7,"uploader":"marty14","files":1,"time":1476454743,"description":"With Hitler to the End: The Memoirs of Hitler's Valet - Heinz Linge [epub]\r\n\r\nHeinz Linge worked with Adolf Hitler for a ten year period from 1935 until the Führer's death in the Berlin bunker in May 1945. He was one of the last to leave the bunker and was responsible for guarding the door while Hitler allegedly killed himself. During his years of service, Linge was responsible for all aspects of Hitler's household and was constantly by his side. He claims that only Eva Braun stood closer to Hitler over these years. \r\n\r\nThrough a host of anecdotes and observations, Linge recounts the daily routine in Hitler's household; his eating habits, his foibles, his preferences, his sense of humour and his private life with Eva Braun. In fact, Linge believed Hitler's closest companion was his dog Blondi. After the war Linge said in an interview, &quot;it was easier for him to sign a death warrant for an officer on the front than to swallow bad news about the health of his dog&quot;.\r\n\r\nLinge also charts the changes in Hitler's character during the period of his service, and the latter's fading health from around 1942. During his last days, Hitler's right eye began to hurt intensely and Linge was responsible for administering cocaine drops to kill the pain. In a number of instances - such as with the Stauffenberg bomb plot of July 1944 - Linge gives an excellent eyewitness account of events. He also gives thumbnail profiles of the prominent members of Hitler's 'court': Hess, Speer, Bormann and Ribbentrop amongst them. \r\n\r\nThough Linge held an SS rank, he claims not to have been a Nazi Party member. His profile of Hitler is not blindly uncritical, but it is nonetheless affectionate. The Hitler that emerges is a multifaceted individual: unpredictable and demanding, but not of an otherwise unpleasant nature","torrent":{"xt":"urn:btih:40a53226e2b1ceedd251268c99572ba3ea2cc4ea","amp;dn":"With+Hitler+to+the+End%3A+The+Memoirs+of+Hitler%27s+Valet","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40a53226e2b1ceedd251268c99572ba3ea2cc4ea","infoHashBuffer":{"type":"Buffer","data":[64,165,50,38,226,177,206,237,210,81,38,140,153,87,43,163,234,44,196,234]},"announce":[],"urlList":[]}}