{"title":"Security Mom (2016) (Epub) Gooner","uid":15862823,"size":328588,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4113ffb05bcf4f1fdc2b371d930cf9fa45514f83&amp;dn=Security+Mom+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1474319478,"description":"Security Mom - An Unclassified Guide to Protecting Our Homeland and Your Home (2016) (Epub) Gooner\r\n\r\nPublisher: Simon &amp; Schuster (5 April 2016)\r\nLanguage: English\r\nISBN-10: 1476733740\r\nISBN-13: 978-1476733746\r\n\r\nIt's time to put the home back into our homeland. Part prescription and part memoir, this exceptional view of America s security concerns by a leading government Homeland Security advisor, Pulitzer Prize finalist columnist, CNN analyst and mother of three delivers a message and a plan: security begins at home. \r\n\r\nSoccer Moms are so last decade. Juliette Kayyem is a Security Mom. A national security expert who worked at the highest levels of government, and also a mom of three, she s lived it all from the fears of being a target of an anthrax hoax, to the challenges of managing the BP Oil spill, to the more intimate challenges of defeating lice in her children's hair and now she tells it all. Weaving her personal story of marriage and motherhood into a fast-paced account of managing the nation's most compelling disasters, Juliette recounts the milestones that mark the path of her unpredictable, daring, funny, and ultimately relatable life. \r\n\r\nIn her insider's look at American emergency and disaster management, Juliette distills years of professional experience into smart, manageable guidelines for keeping your family safe in an unpredictable world. From stocking up on coloring books to stashing duplicate copies of valuable papers out of state, Juliette's wisdom does more than just prepare us to survive in an age of mayhem it empowers us to thrive. Her message, the result of years working where tragedy has thrived, is ultimately positive: starting in our homes, each of us every mom, dad, aunt, uncle, yes every citizen has the capacity to build a more resilient nation. \r\n\r\n&quot;Security Mom&quot; is an utterly modern tale about the highs and lows of having-it-all parenthood and a candid, sometimes shocking, behind-the-scenes look inside the high-stakes world of national security. Unlike so many in her field who seem invested on terrifying citizens into paralysis, Juliette's motto has always been don't scare, prepare! In her signature refreshing style, Juliette reveals how she came to learn that homeland security is not simply about tragedy and terror; it is about what we can do every day to keep each other strong and safe.&quot;","torrent":{"xt":"urn:btih:4113ffb05bcf4f1fdc2b371d930cf9fa45514f83","amp;dn":"Security+Mom+%282016%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4113ffb05bcf4f1fdc2b371d930cf9fa45514f83","infoHashBuffer":{"type":"Buffer","data":[65,19,255,176,91,207,79,31,220,43,55,29,147,12,249,250,69,81,79,131]},"announce":[],"urlList":[]}}