{"title":"FantasyMassage - Tiffany Brookes (The Full Release Package)","uid":12440425,"size":275654818,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:41cab789c6f9b80cfca0525ee5a5312d537dd7d2&amp;dn=FantasyMassage+-+Tiffany+Brookes+%28The+Full+Release+Package%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":10,"uploader":"EndYou","files":1,"time":1442573384,"description":"                                    -------------\n                                    :Description:\n                                    -------------\nAfter a hard and long week Chris Cock calls for an in-house massage, specifying he is looking for the full release package. Tiffany Brookes is just the girl to take care of all of his needs. Asking him which area she should focus on, she removes all of his clothing and shows him to the bed where she can get to work.While Tiffany massages her client, they become acquainted, learning that they both have a lot things in common. Chris, being a hard working businessman doesn't have time for a girlfriend, but wishes he could come back to a woman at the end of a day that could rub him down after a hard days work. Tiffany also single, is planning on hanging out with her girlfriends over the weekend, and probably getting into some trouble. But learning more about her clients career success, she can't resist her sexual desire towards Chris' single status, flipping him over, and straddling his big cock. While massaging his chest, she makes it evident she is looking for more than just a business relationship.Chris is adamant about his full release package, looking forward to fuck Tiffany's tight pussy. She removes her tight white spandex, exposing her round, firm ass cheeks. She makes her way down towards Chris' boner, sucking on his hard cock and stroking it with both hands, exactly what he needs to make his day complete. Chris wants a taste of Tiffany's shaved pussy, he unfolds her lips, stretching her labia like bubble gum. Chris tells her to bend over on all fours, pushing his big black cock inside her, hearing her moan in sexual frenzy, erupting with orgasmic bliss.\n\n                                    -------------\n                                    :Screenshots:\n                                    -------------\n                           &lt;a href=&quot; http://imgpremium.com/image/qv&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgpremium.com/image/qv&lt;/a&gt;\n                           &lt;a href=&quot; http://imgpremium.com/image/qX&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgpremium.com/image/qX&lt;/a&gt;","torrent":{"xt":"urn:btih:41cab789c6f9b80cfca0525ee5a5312d537dd7d2","amp;dn":"FantasyMassage+-+Tiffany+Brookes+%28The+Full+Release+Package%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41cab789c6f9b80cfca0525ee5a5312d537dd7d2","infoHashBuffer":{"type":"Buffer","data":[65,202,183,137,198,249,184,12,252,160,82,94,229,165,49,45,83,125,215,210]},"announce":[],"urlList":[]}}