{"title":"OfficeSuite 8 + PDF Editor Premium 8.7.5803 APK [SadeemPC].zip","uid":15486455,"size":47267170,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:41db7d41fa55f44ccaa1648d5ed1f3ad368b5202&amp;dn=OfficeSuite+8+%2B+PDF+Editor+Premium+8.7.5803+APK+%5BSadeemPC%5D.zip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":0,"uploader":"SadeemPC","files":1,"time":1470325813,"description":"OfficeSuite 8 + PDF Editor Premium 8.7.5803\r\n\r\nOfficeSuite lets you easily view, edit, and create Word, Excel, and PowerPoint documents, convert to/from PDF, and manage your files all with the most feature-rich mobile office solution available for Android smartphones and tablets.\r\n\r\nOFFICESUITE 8 OUT NOW! WITH THIS MAJOR UPDATE YOU GET:\r\n• Completely new desktop similar user interface and experience to help you easily switch working on your mobile device\r\n• Track changes (Premium feature)\r\n• PDF security and editing features (digital signatures, permissions management, add text to PDF, annotations)\r\n• More\r\nThe only office solution allowing you to convert PDF files to Word, Excel or ePUB (available in OfficeSuite Premium).\r\nPCMAG EDITOR'S CHOICE AND GOOGLE PLAY EDITORâ™S CHOICE MOBILE OFFICE\r\nOfficeSuite is the trusted leader for reliably editing Microsoft Office and PDF documents and attachment on Android.\r\n• Installed on over 160 million devices in 205 countries\r\n• Over 55,000 registrations per day\r\n• No. 1 app in Google Play Business category\r\n• 45 million downloads and over 280,000 reviews on Google Play\r\nKEY FEATURES:\r\n• Ability to view, create and edit complex Microsoft Office and PDF files and attachments with a single complete feature-rich application.\r\n• Full compatibility with Microsoft formats DOC, DOCX, DOCM, , XLS, XLSX, XLSM, PPT, PPTX, PPS, PPSX, PPTM, PPSM and support of common formats as PDF, RTF, TXT, LOG, CSV, EML, ZIP; Open Office formats available as in-app purchase – ODT, ODS and ODP in OfficeSuite Premium.\r\n• Intact document formatting and layout and ability to create advanced documents on the device.\r\n• Rich editing features for advanced document creation and touch-up on the device.\r\n• Easy file access to local, remote files and email attachment.\r\n• Integrated File Browser allowing you to access and manage your local and remote storage files; Quick access to Recent files, My documents folders and document templates.\r\n• Sharing via could, email, Bluetooth, Wi-Fi Direct.\r\n• Integration with various cloud services as Box, DropBox, Google Drive, OneDrive and SugarSync.\r\n• Security features - work with password protected files (available in OfficeSuite Premium).\r\n• Spell checker, predictive text keyboard, PDF camera scanner, Microsoft compatibility Font Pack and many more features available as in-app upgrade to OfficeSuite Premium.\r\n• Save to PDF (in OfficeSuite Premium). Convert PDF files to Word, Excel or ePUB (available in OfficeSuite Premium)\r\n• Available in 56 languages.\r\n• Optimized for work with keyboards with support of multiple keyboard shortcuts and moving of objects and selections.\r\nA number of manufacturers such as Sony, Amazon, ACER, Alcatel, Toshiba, Sharp, Barnes and Noble, Archos, Polaroid, ViewSonic, Kyocera and Kobo trusted MobiSystems and preloaded OfficeSuite worldwide.\r\n\r\nWhats New :\r\n• Fixed issues related to password protected PDF files\r\n• Performance improvements\r\n\r\nRequires Android: 4.0 +","torrent":{"xt":"urn:btih:41db7d41fa55f44ccaa1648d5ed1f3ad368b5202","amp;dn":"OfficeSuite+8+%2B+PDF+Editor+Premium+8.7.5803+APK+%5BSadeemPC%5D.zip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41db7d41fa55f44ccaa1648d5ed1f3ad368b5202","infoHashBuffer":{"type":"Buffer","data":[65,219,125,65,250,85,244,76,202,161,100,141,94,209,243,173,54,139,82,2]},"announce":[],"urlList":[]}}