{"title":"The Frontiers of Imperial Rome","uid":15854590,"size":36705922,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43ea8b09491cd018c3a5b982370bf6db3a093a5e&amp;dn=The+Frontiers+of+Imperial+Rome&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":0,"uploader":"marty14","files":1,"time":1474226812,"description":"The Frontiers of Imperial Rome - David J. Breeze [epub]\r\n\r\nAt its height, the Roman Empire was the greatest empire yet seen, its borders stretching from the rain-swept highlands of Scotland in the north to the sun-scorched Nubian desert in the south. But how were the vast and varied stretches of frontier defined and defended? \r\n\r\nMany of Rome's frontier defenses have been the subject of detailed and ongoing study and scholarship. Three frontier zones are now UNESCO World Heritage sites (the Antonine Wall having recently been granted this status - the author led the bid), and there is growing interest in their study. This wide-ranging survey will describe the varying frontier systems, describing the extant remains, methods and materials of construction and highlighting the differences between various frontiers. Professor Breeze considers how the frontiers worked, discussing this in relation to the organization and structure of the Roman army, and also their impact on civilian life along the empire's borders. He then reconsiders the question of whether the frontiers were the product of an overarching Empire-wide grand strategy, questioning Luttwak's seminal hypothesis.\r\n\r\nThis is a detailed and wide-ranging study of the frontier systems of the Roman Empire by a leading expert. Intended for the general reader, it is sure also to be of great value for academics and students in this field. The appendixes will include a brief guide to visiting the sites today","torrent":{"xt":"urn:btih:43ea8b09491cd018c3a5b982370bf6db3a093a5e","amp;dn":"The+Frontiers+of+Imperial+Rome","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43ea8b09491cd018c3a5b982370bf6db3a093a5e","infoHashBuffer":{"type":"Buffer","data":[67,234,139,9,73,28,208,24,195,165,185,130,55,11,246,219,58,9,58,94]},"announce":[],"urlList":[]}}