{"title":"Major League 1, 2, 3 - Comedy Eng 720p [H264-mp4]","uid":11258227,"size":3853473427,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:4429c1d59db351dfa2bdd9cbf6dd5d6908f0dab1&amp;dn=Major+League+1%2C+2%2C+3+-+Comedy+Eng+720p+%5BH264-mp4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":13,"uploader":"eyezin","files":-1,"time":1413928564,"description":"........................................................\n..:++++++++++++++++++++++++++++++++++++++++++++++++++:..\n..:++++++++++++++++++++Major League++++++++++++++++++:..\n..:++++++++++++++++++++++Trilogy+++++++++++++++++++++:..\n..:++++++++++++++++++++++++++++++++++++++++++++++++++:..\n........................................................\n\n=&gt;-Major League 1..................: http://www.imdb.com/title/tt0097815/\n=&gt;-Major League 2..................: http://www.imdb.com/title/tt0110442/\n=&gt;-Major League 3..................: http://www.imdb.com/title/tt0120742/\n\nMajor League.\nThe Cleveland Indians have gone 34 years without a division title. Team owner\nDonald Phelps has died, and his snobby wife Rachel Phelps, a former showgirl,\nhas taken over as the new owner. Some in the media think Rachel shouldn't be\nthe owner of a baseball team. Rachel hates Cleveland, so she makes plans to\nmove the Indians to the warmer climate of Miami, Florida, but she can't break\nthe team's lease with Cleveland unless the team's attendance for the season is\nbelow 800,000. Rachel's plan is to put together a team so awful that the season\nattendance will be lower than 800,000. Rachel and general manager Charlie Donovan\nhire a manager for the Indians Lou Brown, who has been the manager of the minor\nleague Toledo Mud Hens for the past 30 years. Charlie then recruits some misfit\nplayers catcher Jake Taylor, who is a major league standout with knee problems,\nRicky &quot;Wild Thing&quot; Vaughn, who is a pitcher who throws wildly, third baseman\nRoger Dorn, who is a product endorser and former major league star who will do\nanything to avoid injury, outfielder Willie Mays Hayes, who runs fast enough to\nsteal a lot of bases but can't hit very well, and Pedro Cerrano, who is an\noutfielder who practices voodoo. As expected, the Indians get off to a slow start,\nbut when they discover that Rachel wants the team to lose so she can move the team,\nthe Indians get their act together and start winning games and raising their\nattendance, as Jake tries to win back his ex-girlfriend Lynn Wells, and the\nIndians do what they can to win the division title.\n\nStars.\n=&gt;-Charlie Sheen.\n=&gt;-Tom Berenger.\n\nDirector.\n=&gt;-David S Ward.\n\nMajor League II.\nLast season, the Cleveland Indians won the division title, but they were defeated\nin the American League championship series (ALCS) by the Chicago White Sox. The\nsuccess of last season has changed the attitudes of the Indians. Pitching\nsensation Ricky &quot;Wild Thing&quot; Vaughn is now a yuppie who feels like he's lost\nhis edge on his fastball. Homerun hitter Pedro Cerrano underwent a spiritual\nconversion from aggressive voodoo to placid Buddhism, and his batting has declined.\nRoger Dorn retired and has replaced Rachel Phelps as the owner of the team. Catcher\nJake Taylor has also retired to become one of the coaches who work for manager Lou\nBrown. Willie Mays Hayes is still as fast as ever, but he has added some power to\nhis hitting. The Indians get off to another slow start, then Roger makes a big move\nby signing arrogant power hitting catcher Jack Parkman, who is a bully. Also, minor\nleague catcher Rube Baker is called up to the Indians, even though Rube has a\nthrowing problem. The signing of Jack Parkman has put Roger in a financially tough\nspot, so Roger later trades Jack to the Chicago White Sox, the team that stopped\nthe Indians from going to the World Series last season. In return, the Indians\nhave received left fielder Isuro Tanaka, who is a gifted fielder. Roger then sells\nthe team back to Rachel Phelps, because Roger needs the money. Rachel sees this as\nan opportunity to get revenge on the Indians for what happened last season, so\nshetries to find ways to make them have a losing season this time. When Lou suffers\na heart attack, he convinces Jake to take over as the Indians' substitute manager.\nJake leads the Indians to their second consecutive division title, and another shot\nat the ALCS and their opponents are again the Chicago White Sox. This time, the\nIndians are determined to win, and they'll do whatever it takes to do it.\n\nStars.\n=&gt;-Charlie Sheen.\n=&gt;-Tom Berenger.\n\nDirector.\n=&gt;-David S Ward.\n\nMajor League Back to the Minors.\nAging minor league pitcher Gus Cantrell is planning to retire, but then Roger\nrecruits Gus to be the manager of the South Carolina Buzz, the Twins AAA minor\nleague team. Gus's mission is to make a real team out of a bunch of players who\ninclude ballet dancer turned ballplayer Lance Lance the Dance Pere, Frank Pops\nMorgan, Rube Baker, Taka Tanaka, Pedro Cerrano, Hog Ellis, home run hitter Billy\nDowntown Anderson, and Carlton Doc Windgate, who throws the slowest fastball in\nprofessional baseball. Gus ends up clashing with Leonard Huff, the snobby,\narrogant manager of the twins. One night in Minnestoa, Gus and his girlfriend\nMaggie Reynolds are having dinner with Roger and Huff at an expensive-looking\nrestaurant, where Huff challenges Gus to a game between the Buzz and the Twins,\nthen Huff starts a fight with Gus, who accepts the challenge. The game is\nscheduled to take place at the Hubert H. Humphrey Metrodome in Minnesota. The\nTwins take a 3-0 lead in the 6th inning, but Billy hits a home run that ties\nthe game at 3-3 in the 8th inning, but in the top of the 9th inning, with two \nouts, while the Twins are up to bat, and Doc is one strike away from striking\nout bullying home run hitter Carlos Liston, Huff has the stadium's lights turned\noff so the game can end with a tie rather than give the Buzz a chance to win in\nhe bottom of the 9th, and the media says that the Twins were still outplayed by\nthe Buzz. Huff now wants to bring Billy up to the Twins, even though Billy is not\nyet ready to go up to the Twins. Billy jumps on the opportunity and turns his\nback on Gus. Without Billy, the Buzz start losing again. With the Twins, Billy\nstarts hitting poorly, proving Huff wrong about Billy. Gus manages to get the\nBuzz back on track, and Billy is sent back down to the Buzz, where Gus teaches\nBilly how to hit for a higher batting average. Gus leads the Buzz to a division\ntitle in their league, then Gus issues a challenge for Huff to bring the Twins to\nBuzz stadium for another game. The way Gus has issued the challenge, if the Twins\nwin, he'll give his salary for the year to Huff, and if Gus and the Buzz beat the\nTwins, Gus can take over as the manager of the Twins. Huff accepts the challenge\nand takes the Twins to South Carolina to play against the Buzz. This time, the\nBuzz are determined to complete the game and beat the Twins.\n\nStars.\n=&gt;-Scott Bakula.\n=&gt;-Corbin Bernsen.\n\nDirector.\n=&gt;-John Warren.\n\nInfo\n=&gt;-Genre.....................: Action : Drama : Sci-Fi.\n=&gt;-Release Date..............: 1989 : 1994 : 2003.\n=&gt;-Language..................: English.\n=&gt;-File Size.................: 1.23GiB : 1.11GiB : 1.21GiB.\n=&gt;-Overall bit rate..........: 1648Kbps : 1660Kbps : 1656Kbps.\n=&gt;-Movie Runtime.............: 1h 46mn : 1h 39mn : 1h 44mn.\n\nVideo\n=&gt;-Codec.....................: H.264/MPEG-4 AVC.\n=&gt;-Aspect Ratio..............: 16:9.\n=&gt;-Resolution................: 1280:720 : 1280:540.\n=&gt;-Bit rate..................: 1 500 Kbps.\n\nAudio\n=&gt;-Codec.....................: mp4a: MPEG-4 AAC LC.\n=&gt;-Channels..................: 2 channel Stereo.\n=&gt;-Bit Rate..................: 152 Kbps.\n=&gt;-Maximum bit rate..........: 192 Kbps","torrent":{"xt":"urn:btih:4429c1d59db351dfa2bdd9cbf6dd5d6908f0dab1","amp;dn":"Major+League+1%2C+2%2C+3+-+Comedy+Eng+720p+%5BH264-mp4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4429c1d59db351dfa2bdd9cbf6dd5d6908f0dab1","infoHashBuffer":{"type":"Buffer","data":[68,41,193,213,157,179,81,223,162,189,217,203,246,221,93,105,8,240,218,177]},"announce":[],"urlList":[]}}