{"title":"Runtastic PRO Running, Fitness 6.8 APK [SadeemPC].zip","uid":14382207,"size":40923433,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:446c570964e1c176156210b5962c07591e297bf8&amp;dn=Runtastic+PRO+Running%2C+Fitness+6.8+APK+%5BSadeemPC%5D.zip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"SadeemPC","files":1,"time":1461242381,"description":"Runtastic PRO Running, Fitness 6.8 APK\r\n\r\nRuntastic uses GPS to map your fitness activities - running, biking, walking - and track your progress (distance, speed, calories, and more). Be part of a global fitness community that is both fun and motivational. \r\n\r\nTake your fitness to a new level with Runtastic PRO: The best running, fitness &amp; tracking app on Android!\r\n\r\nRuntastic PRO uses GPS to map and track sports and fitness activities, such as: running, jogging, biking &amp; walking. The 4.5+ rated app tracks cardio workout progress (duration, distance, elevation change, calories burned &amp; more) to help you build healthy lifestyle habits and reach exercise goals. What’s more? Runtastic was recently overhauled to enhance your user experience! Take Runtastic out for a run and enjoy our improved app design and navigation, optimized features &amp; new functionality.\r\nDownload our incredible running app today and become part of a global fitness community of 40+ million registered users that is fun and motivational today – whether you're looking to improve your overall health, build cardio endurance or train for a marathon!\r\n\r\nPRO APP FEATURES:\r\n* Voice Coach: Audio feedback based on your personal preferences\r\n* Auto Pause: Session is paused automatically when you stop moving\r\n* Runtastic Earth View: Watch workouts in 3D (free Google Earth App required)\r\n* Routes: Create or find exercise routes, sync them to your smartphone\r\n* Interval training, coaching and dynamic split (km/mi) tables\r\n* Training Goals: Select heart rate zone, calorie goal or pace goal to optimize training\r\n* Challenge a Run: Compete against yourself by challenging past activity results\r\n* Colored Traces: Colors indicate training changes, incl. pace, elevation, slope\r\n* Geotagging: Take pics during exercise &amp; view photos online with map trace\r\n* Powersong: Activate to boost workout at just the right moment\r\n* Use for running, jogging, biking, skating, cross country skiing &amp; hand biking\r\n* Ad free\r\n\r\nAPP FEATURES:\r\n* Map workouts in real-time with GPS &amp; monitor exercise progress\r\n* Personal training diary, advanced statistics &amp; graphs\r\n* LIVE Tracking &amp; Cheering: Share location, receive messages for motivation to run further\r\n* Mapping: Detailed live mapping &amp; historic mapping (Google Maps)\r\n* Customizable dashboard configuration: Display preferred training statistics\r\n* Use Runtastic Training Plans to make progress &amp; reach fitness goals\r\n* Manual entry of workouts: Add treadmill, spinning &amp; weight lifting workouts\r\n* Monthly &amp; overall metrics: Distance, number of workouts, duration &amp; calories burned\r\n* Post-activity details: Enter mood &amp; surface info, receive hydration recommendation\r\n* Orbit Connect: View activity stats on Runtastic Orbit, our new 24-hour wearable\r\n* Integrate Runtastic activities to your MyFitnessPal account\r\n* Share sports activities on Google+,&amp; Twitter\r\n* Enjoy music with Google Play Music, Spotify, Pandora, SoundCloud &amp; more, directly within the Runtastic app (available on Android 4.4 only)\r\n* Control your Runtastic app with Android Wear: Start a run or bike activity via voice command, read your favorite stats from your wrist &amp; display your post-workout session details, including maps, on Android Wear.\r\n* LiveWare™ extension for Sony SmartWatch\r\n\r\nADDITIONAL TRAINING RESOURCES\r\nYou can also choose an expert training plan to reach your goals. Training plans provide coaching &amp; inspiration for fitness goals, incl.: weight loss, building endurance, jogging a 10k, running a half-marathon, running a marathon or attaining a bikini body! Further health and fitness tips are available on the Runtastic Fitness YouTube Channel - your subscription is FREE. And, Runtastic has partnered with Universal Music – the world’s undisputed leader in music publishing – to help users increase motivation, workout length &amp; calories burned! Let’s go!\r\n\r\nWhats New :\r\nNew in Runtastic 6.7\r\n* Set yearly running goal: Reach your personal best with Runtastic by setting a 2016 running goal for yourself.\r\n* NEW Story Run: Get moving with &quot;Running for Results&quot; and make your interval runs better than ever!\r\n\r\nRequires Android: Varies with device","torrent":{"xt":"urn:btih:446c570964e1c176156210b5962c07591e297bf8","amp;dn":"Runtastic+PRO+Running%2C+Fitness+6.8+APK+%5BSadeemPC%5D.zip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"446c570964e1c176156210b5962c07591e297bf8","infoHashBuffer":{"type":"Buffer","data":[68,108,87,9,100,225,193,118,21,98,16,181,150,44,7,89,30,41,123,248]},"announce":[],"urlList":[]}}