{"title":"Go Set a Watchman - Harper Lee - Audiobook MP3","uid":12122974,"size":202479114,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:44a73dd0752708fa3ba900b97e5167ec5fbcbca8&amp;dn=Go+Set+a+Watchman+-+Harper+Lee+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":1,"uploader":"Squiddy82","files":8,"time":1436873179,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nGo Set a Watchman: A Novel\n\nWritten by: Harper Lee\nNarrated by: Reese Witherspoon\nLength: 6 hrs and 57 mins\nUnabridged Audiobook\nRelease Date:07-14-15\n\nAn historic literary event: the publication of a newly discovered novel, the earliest known work from Harper Lee, the beloved, best-selling author of the Pulitzer Prize-winning classic To Kill a Mockingbird.\n\nOriginally written in the mid-1950s, Go Set a Watchman was the novel Harper Lee first submitted to her publishers before To Kill a Mockingbird. Assumed to have been lost, the manuscript was discovered in late 2014.\n\nGo Set a Watchman features many of the characters from To Kill a Mockingbird some 20 years later. Returning home to Maycomb to visit her father, Jean Louise Finch - Scout - struggles with issues both personal and political, involving Atticus, society, and the small Alabama town that shaped her.\n\nExploring how the characters from To Kill a Mockingbird are adjusting to the turbulent events transforming mid-1950s America, Go Set a Watchman casts a fascinating new light on Harper Lee's enduring classic. Moving, funny, and compelling, it stands as a magnificent novel in its own right","torrent":{"xt":"urn:btih:44a73dd0752708fa3ba900b97e5167ec5fbcbca8","amp;dn":"Go+Set+a+Watchman+-+Harper+Lee+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44a73dd0752708fa3ba900b97e5167ec5fbcbca8","infoHashBuffer":{"type":"Buffer","data":[68,167,61,208,117,39,8,250,59,169,0,185,126,81,103,236,95,188,188,168]},"announce":[],"urlList":[]}}