{"title":"Carrie Underwood - Discography","uid":6296392,"size":465497057,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:44f784600876a74363e4c0664f1dc83c87154bf1&amp;dn=Carrie+Underwood+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":9,"uploader":"piratetorrent1989","files":56,"time":1302009943,"description":"Carrie Marie Underwood (born March 10, 1983) is an American country singer-songwriter and actress who rose to fame as the winner of the fourth season of American Idol, in 2005.\n\nUnderwood has since become a multi-platinum selling recording artist, a multiple Grammy Award winner, a member of the Grand Ole Opry, a Golden Globe Award nominee, a three-time Academy of Country Music and Country Music Association Female Vocalist winner, a GMA Dove award winner, and he reigning ACM Entertainer of the Year. She is the first-ever female artist to win back-to-back Academy of Country Music (ACM) Awards for Entertainer of the Year (2009/10).\n\nHer debut album, Some Hearts, was certified seven times platinum, and as of February 2006, was the fastest selling debut country album in Nielsen SoundScan history. It was also the best-selling solo female debut album in country music history, as of February 2008. Some Hearts yielded three number one hits on the Billboard Hot Country Songs and a #1 hit on the Billboard Hot 100 Songs. Her second album, Carnival Ride, was released on October 23, 2007. It has sold over 3 million copies as of January 2010, being certified 3 times Platinum, and produced four number one hits on the Billboard Hot Country Songs. Underwood released her third album, Play On, on November 3, 2009. It has been certified 2 times Platinum by the RIAA and has produced three number one hits on the Billboard Hot Country Songs so far. As of May 2010, Underwood has sold 20 million singles and over 16 million albums worldwide.\n\nHaving 10 #1 Hits on Billboard Hot Country Songs, Underwood is tied with Reba McEntire as the Female Country Artist with Most #1 Hits on such chart from 1990 to present. She's also the only solo Country Artist to have a #1 hit on Billboard Hot 100 Songs in the 2000 decade, as &quot;Inside Your Heaven&quot; reached the top of the chart on July 2005. Some Hearts, Underwood's debut album, was named the Best Country Album of the 2000 Decade by Billboard, and she's the only Female Artist to appear on the Top 10 of Billboard's Best Country Artists of the 2000 Decade list, ranked at #10. She was also ranked #50 on the Artists of the Decade list by Billboard. In 2010, Underwood was #3 on Billboard's Hot Country Songs Artists, #4 on the Top Country Album Artists and #23 on Top Artists of 2010.","torrent":{"xt":"urn:btih:44f784600876a74363e4c0664f1dc83c87154bf1","amp;dn":"Carrie+Underwood+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44f784600876a74363e4c0664f1dc83c87154bf1","infoHashBuffer":{"type":"Buffer","data":[68,247,132,96,8,118,167,67,99,228,192,102,79,29,200,60,135,21,75,241]},"announce":[],"urlList":[]}}