{"title":"Forgetting Sarah Marshall(2008)DVDRip.AC3(ENG)-DROCK","uid":6320028,"size":732992415,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:452762bdce12474df00fc7d5cf80b384d2e8f6cc&amp;dn=Forgetting+Sarah+Marshall%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":3,"uploader":"drock232","files":-1,"time":1302918870,"description":"In desperate need of a vacation after being unceremoniously dumped by his TV-star girlfriend, a man travels to a lavish Hawaiian resort to nurse his wounds and forget his heartache, only to discover that his ex and her handsome new boyfriend are currently staying at the exact same island hot spot. Peter Bretter (Jason Segel) may be just another struggling musician, but for the past six years he's been dating Sarah Marshall (Kristen Bell), one of the hottest stars on television. Sarah is everything in the world to Peter, so when she kindly but firmly tells him that they should each go their separate ways, he is absolutely devastated. Later, after attempting to salvage his ego by awkwardly attempting to become a womanizer and nearly losing his job because of a nervous breakdown, an emotionally fragile Peter attempts to put the past behind him by escaping to the sun-soaked beaches of Oahu. While at first it seems as if Peter has discovered the perfect prescription for a bad case of lost love, his plan soon turns to dust when Sarah and her new rock-star boyfriend, Aldous (Russell Brand), turn up at the exact same resort. Though accepting Sarah's lavish new lifestyle won't be easy for the crestfallen Peter, the laid-back companionship of flirtatious resort employee Rachel (Mila Kunis) -- not to mention a continuous regimen of fruity cocktails -- goes a long way in mending the wounds of a broken heart. Forgetting Sarah Marshall was penned by Segel and produced by Judd Apatow. Fun with Dick and Jane screenwriter Nicholas Stoller makes his directorial debut. The cast also includes Paul Rudd, Bill Hader, Jack McBrayer, and Jonah Hill. \n\nRipped with Handbrake.\n\nLength: 1 Hour 51 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:452762bdce12474df00fc7d5cf80b384d2e8f6cc","amp;dn":"Forgetting+Sarah+Marshall%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"452762bdce12474df00fc7d5cf80b384d2e8f6cc","infoHashBuffer":{"type":"Buffer","data":[69,39,98,189,206,18,71,77,240,15,199,213,207,128,179,132,210,232,246,204]},"announce":[],"urlList":[]}}