{"title":"Hitler's Engineers: Fritz Todt and Albert Speer, Master Builders","uid":16033433,"size":37987565,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4695f83628b147626457ce4c475f398aafb00be0&amp;dn=Hitler%27s+Engineers%3A+Fritz+Todt+and+Albert+Speer%2C+Master+Builders&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":6,"uploader":"marty14","files":1,"time":1476452296,"description":"Hitler's Engineers: Fritz Todt and Albert Speer, Master Builders of the Third Reich - Blaine Taylor [epub]\r\n\r\nCopiously illustrated and carefully described, this is the first full treatment of two of the Third Reich's most important figures. While Nazi Germany’s ascendancy owed much to military skill, the talent of its engineers allowed it to survive longer than would normally be expected. This unique work focusing on Dr. Fritz Todt and Albert Speer, based on many previously-unpublished photographs and artwork from captured Nazi records, describes how engineering, as well as military skill, allowed the Third Reich to survive. \r\n\r\nDr. Todt was the brilliant builder of the world's first superhighway system (the Autobahn) that still exists today, as well as the architect of the German West Wall (Siegfried Line) that predated the later Atlantic and East Walls. The builder, also, of each of the wartime Führer Headquarters, as well as the submarine pens, Dr. Todt was killed in a still-mysterious airplane crash that may well have been a Nazi death plot, though he was given a State Funeral by Hitler, \r\n\r\nTodt was succeeded in death as German Minister of Armaments and War Production by the Führer's longtime personal architect Albert Speer, who was credited by the Allies after the war as having prolonged the conflict by at least a year. Called a genius by Hitler himself, Speer designed and built the prewar Nüremberg Nazi Party Congress rally stands and buildings, many of which can still be visited.\r\n\r\nMore importantly, under the constant rain of Allied bombs and the encroachment of Soviet advances from the East, Speer managed to keep the German industrial machine running until the spring of 1945, though it was driven ever further underground. He also allocated resources to fortifications and counterattacks (the V-missile installations) against both West and East, in attempts to stave off defeat. Convicted as a war criminal at Nüremberg, Speer served his entire 20 year-long sentence at Spandau Prison, then went on to become a best-selling author who died in London on Sept. 1, 1981, the anniversary of the German invasion of Poland","torrent":{"xt":"urn:btih:4695f83628b147626457ce4c475f398aafb00be0","amp;dn":"Hitler%27s+Engineers%3A+Fritz+Todt+and+Albert+Speer%2C+Master+Builders","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4695f83628b147626457ce4c475f398aafb00be0","infoHashBuffer":{"type":"Buffer","data":[70,149,248,54,40,177,71,98,100,87,206,76,71,95,57,138,175,176,11,224]},"announce":[],"urlList":[]}}