{"title":"Tom Waits - Closing Time (1990) 320 vtwin88cube","uid":7043262,"size":113342070,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46c7537bd7ccbb437d98083d88d712b1f9643ed6&amp;dn=Tom+Waits+-+Closing+Time+%281990%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":2,"uploader":"vtwin88cube","files":-1,"time":1329632795,"description":"\n\n\nTom Waits\nClosing Time (1990)\n\n\n\n\nIn the 1970s, Tom Waits combined a lyrical focus on desperate, low-life characters with a persona that seemed to embody the same lifestyle, which he sang about in a raspy, gravelly voice. From the '80s on, his work became increasingly theatrical as he moved into acting and composing. Growing up in Southern California, Waits attracted the attention of manager Herb Cohen, who also handled Frank Zappa, and was signed by him at the beginning of the 1970s, resulting in the material later released as The Early Years and The Early Years, Vol. 2.\n\n\n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\nReleased:\t\t1973\n\n\n\n\nTom Waits' debut album is a minor-key masterpiece filled with songs of late-night loneliness. Within the apparently narrow range of the cocktail bar pianistics and muttered vocals, Waits and producer Jerry Yester manage a surprisingly broad collection of styles, from the jazzy &quot;Virginia Avenue&quot; to the up-tempo funk of &quot;Ice Cream Man&quot; and from the acoustic guitar folkiness of &quot;I Hope That I Don't Fall in Love With You&quot; to the saloon song &quot;Midnight Lullaby,&quot; which would have been a perfect addition to the repertoires of Frank Sinatra or Tony Bennett. Waits' entire musical approach is stylized, of course, and at times derivative -- &quot;Lonely&quot; borrows a little too much from Randy Newman's &quot;I Think It's Going to Rain Today&quot; -- and his lovelorn lyrics can be sentimental without being penetrating. But he also has a gift for gently rolling pop melodies, and he can come up with striking, original scenarios, as on the best songs, &quot;Ol' 55&quot; and &quot;Martha,&quot; which Yester discreetly augments with strings. Closing Time announces the arrival of a talented songwriter whose self-conscious melancholy can be surprisingly moving. \n\n\n\nAudio-Info:\n\n\n\n\n01.Ol' '55\n02.I Hope That I Dont Fall In Love With You\n03.Virginia Avenue\n04.Old Shoes (&amp; Picture Postcards)\n05.Midnight Lullaby\n06.Martha\n07.Rosie\n08.Lonely\n09.Ice Cream Man\n10.Little Trip To Heaven (On The Wings Of Your Love)\n11.Grapefruit Moon\n12.Closing Time\n\n\n\n\n\n\n\n\n\n            ****Support The Artists &amp; Buy It If You Like It.****\n\n\n                ****Enjoy &amp; Please Don't Forget To Seed!****\n\n\n\n\n","torrent":{"xt":"urn:btih:46c7537bd7ccbb437d98083d88d712b1f9643ed6","amp;dn":"Tom+Waits+-+Closing+Time+%281990%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46c7537bd7ccbb437d98083d88d712b1f9643ed6","infoHashBuffer":{"type":"Buffer","data":[70,199,83,123,215,204,187,67,125,152,8,61,136,215,18,177,249,100,62,214]},"announce":[],"urlList":[]}}