{"title":"College Rules 8 XXX","uid":13132053,"size":2082491505,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:46e0fa642aa76560d6afa337aceb4891920ca5ad&amp;dn=College+Rules+8+XXX+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"SudoSu","files":1,"time":1451849722,"description":"http://youpornbook.com\r\n------------------------------------------------------------\r\n             ....... : Screenshots : .......    \r\n------------------------------------------------------------ \nhttp://imgkiss.com/image/tIjDS \nhttp://imgkiss.com/image/tIuqi\r\n------------------------------------------------------------\r\n                ....... : Info : .......    \r\n------------------------------------------------------------\r\nCast: All Amateurs\r\n\r\nThe Best College Sex Videos You Have Ever Seen! Real Sex Videos From Colleges And Universities Across The Country! Universities and Community Colleges From Around The World! Happy Birthday Mike - Girlfriends can be awesome at times; especially the ones that make crazy sex videos for your birthday and let you fuck around with their friends. Yes, this week's submission winner comes from Hailey. She is Mike's girlfriend and she wanted to give him the best birthday gift any dude could ask for: a chance to get it on with her and her friends. Happy Birthday, Mike! The Bad Girls At Kai - After reviewing this video, there was no contest as to who should win. This submission has it all; an ass-shaking contest, girl-on-girl action and some hard pounding. Not to mention a shit load of big round asses and cute blondes.\r\n\r\nI hope you guys enjoy this one just as much as we did here! Hardcore Parking - This week's winners did it all, they filmed themselves pranking each other and doing stupid. The girls were horny and ready to win so it starts off with a smoking hot blonde stripping and getting fucked by her roommate, then a couple of girls decided to dike it out in a car right before class. These girls looked so fucking hot just going to town on each other it was pretty impressive! Everybody's Fucking - Here's another update of the awesome College Rules. We can pretty much see, there are no rules. Nothing but cock, tits, ass and delicious pussy. So don't you waste any time and come watch everybody fuck!","torrent":{"xt":"urn:btih:46e0fa642aa76560d6afa337aceb4891920ca5ad","amp;dn":"College+Rules+8+XXX+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46e0fa642aa76560d6afa337aceb4891920ca5ad","infoHashBuffer":{"type":"Buffer","data":[70,224,250,100,42,167,101,96,214,175,163,55,172,235,72,145,146,12,165,173]},"announce":[],"urlList":[]}}