{"title":"Battle - A History of Combat and Culture.pdf","uid":15487880,"size":70088964,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:479def2c63247d1c42322061da189f906e4618a5&amp;dn=Battle+-+A+History+of+Combat+and+Culture.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"STBGD","files":1,"time":1470341872,"description":"Battle: A History of Combat and Culture\r\nPerseus Books Group | 2003 | ISBN: 0813333717 | English | 448 pages | PDF | 67 MB\r\n\r\nBattle: A History of Combat and Culture spans the globe and the centuries to explore the way ideas shape the conduct of warfare. Drawing its examples from Europe, the Middle East, South Asia, East Asia, and America, John A. Lynn challenges the belief that technology has been the dominant influence on combat from ancient times to the present day. In battle, ideas can be more far more important than bullets or bombs. Clausewitz proclaimed that war is politics, but even more basically, war is culture. The hard reality of armed conflict is formed by – and, in turn, forms – a culture’s values, assumptions, and expectations about fighting. The author examines the relationship between the real and the ideal, arguing that feedback between the two follows certain discernable paths. Battle rejects the currently fashionable notion of a &quot;Western way of warfare&quot; and replaces it with more nuanced concepts of varied and evolving cultural patterns of combat. After considering history, Lynn finally asks how the knowledge gained might illuminate our understanding of the war on terrorism","torrent":{"xt":"urn:btih:479def2c63247d1c42322061da189f906e4618a5","amp;dn":"Battle+-+A+History+of+Combat+and+Culture.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"479def2c63247d1c42322061da189f906e4618a5","infoHashBuffer":{"type":"Buffer","data":[71,157,239,44,99,36,125,28,66,50,32,97,218,24,159,144,110,70,24,165]},"announce":[],"urlList":[]}}