{"title":"Dreamweaver CS6 HTML5, CSS3, Responsive Design, and jQuery Mobil","uid":8729529,"size":17050171,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48871c2035cd9b1dd28988eb398a5ccd4df5ef2c&amp;dn=Dreamweaver+CS6+HTML5%2C+CSS3%2C+Responsive+Design%2C+and+jQuery+Mobil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"Ehhhhtozebec","files":-1,"time":1374566944,"description":"Overview\n\nDreamweaver is the most powerful and industry-leading web design software that utilizes cutting edge web technologies such as HTML5, CSS3, and jQuery for web and mobile development. These technologies have radically reconfigured the process of designing web content and function in the widest possible range of browsing environments, ranging from desktops to mobile devices.\n\n&quot;Dreamweaver CS6: HTML5, CSS3, Responsive Design, and jQuery&quot; is essentially three books in one: an introduction to building websites; Dreamweaver CS6: HTML5, CSS3, Responsive Design; and an in-depth explanation of how to build inviting, accessible mobile sites with Dreamweaver CS6, responsive design, and jQuery Mobile.\n\nThis book serves both as the essential reference for Dreamweaver CS6, and a valuable addition to even the most extensive set of resources for modern web design, with or without Dreamweaver..\n\nThe book starts off by teaching you to create sites and pages with Dreamweaver CS6 and how to use HTML5 for page structure. Then we will learn some cutting-edge design and animation with CSS3.\n\nThe book also shows how to create and enhance mobile sites with jQuery Mobile. You will also learn to customize themes with ThemeRoller.\n\n&quot;Dreamweaver CS6: HTML5, CSS3, Responsive Design, and jQuery Mobile&quot; covers the entire spectrum of web design with Dreamweaver, with an emphasis on multi-media (full screen and mobile) design and jQuery Mobile.\n\n\nProduct Details\n\nISBN-13: 9781849694742\nPublisher: Packt Publishing\nPublication date: 4/23/2013\nPages: 268\n\nMeet the Author\n\nDavid Karlins is the author of Adobe Creative Suite 5 Web Premium How-Tos: 100 Essential Techniques (Adobe Press, 2010) along with dozens of other books and videos on web, and digital graphic and interactive design. His articles and reviews appear in publications ranging from Macworld to Business Wee, and David's consulting and design clients have ranged from Hewlett-Packard to the Himalayan Fair. His classes and seminars in New York City and the San Francisco Bay Area explore themes ranging from effective intranet culture to Web strategies for periodicals.","torrent":{"xt":"urn:btih:48871c2035cd9b1dd28988eb398a5ccd4df5ef2c","amp;dn":"Dreamweaver+CS6+HTML5%2C+CSS3%2C+Responsive+Design%2C+and+jQuery+Mobil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48871c2035cd9b1dd28988eb398a5ccd4df5ef2c","infoHashBuffer":{"type":"Buffer","data":[72,135,28,32,53,205,155,29,210,137,136,235,57,138,92,205,77,245,239,44]},"announce":[],"urlList":[]}}