{"title":"Clinical Biochemistry - An Illustrated Colour Text (5th Ed)(gnv6","uid":10043768,"size":34603079,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:488aa86817554372b2b11823301fe38ef4bcbfd6&amp;dn=Clinical+Biochemistry+-+An+Illustrated+Colour+Text+%285th+Ed%29%28gnv6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":3,"uploader":"gnv65","files":-1,"time":1398505754,"description":"Clinical Biochemistry - An Illustrated Colour Text (5th Ed)\nby Allan Gaw, Michael J. Murphy, Rajeev Srivastava and Robert A. Cowan\nChurchill Livingstone | July 2013 | ISBN-10: 0702051799 | PDF | 196 pages | 32.9 mb\n\nThis fully revised edition of Clinical Biochemistry offers essential reading for today's medical student and all those who require a concise, practical introduction to this subject. Topics are clearly presented in a series of double-page 'learning units', each covering a particular aspect of clinical biochemistry. \nFour sections provide a core grounding in the subject:\n-    Introducing clinical biochemistry gives a basic insight in to the workings of a modern hospital laboratory and the interpretation of test results;\n-    Core biochemistry covers the bulk of routine analyses undertaken and their relevance in a clinical setting;\n-    Endocrinology covers the thyroid, adrenal, pituitary and gonadal function testing;\n-    Specialised investigation provides an overview of less requested yet important analyses.\n\nEvery 'learning unit' has been thoroughly checked and updated to reflect the latest field developments and clinical best practice and all new material is included on:\n-    Myocardial infarction\n-    Gastrointestinal disorders\n-    Osteoporosis\n-    Proteinuria\n-    The diagnosis of diabetes\n-    Trace metals\n-    Screening tests\n-    Paediatrics\n-    Covers clinical biochemistry from the point of view of the clinician using the diagnostic service\n-    Presents topics in easily accessible two-page spreads\n-    Includes mini case histories, key point boxes, flowcharts, and summary points\n-    Well illustrated with four-color drawings and clinical photographs\n-    New appendix added of annotated web resources for students to take further many of the topics covered in the book.\n-   To reflect the difficulties people have sometimes in analyzing hyper- and hypo-kalaemia, the existing spread is split into two - one spread on hyperkalaemia and another on hypokalaemia.\n-   The spread on hypertension will be revised and updated to reflect the fact that biochemistry is used as much or more in guiding treatment as it is in screening for secondary hypertension.\n-   Spreads on Myocardial Infarction, Cancer and Tumour Markers will all substantially revised and updated.","torrent":{"xt":"urn:btih:488aa86817554372b2b11823301fe38ef4bcbfd6","amp;dn":"Clinical+Biochemistry+-+An+Illustrated+Colour+Text+%285th+Ed%29%28gnv6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"488aa86817554372b2b11823301fe38ef4bcbfd6","infoHashBuffer":{"type":"Buffer","data":[72,138,168,104,23,85,67,114,178,177,24,35,48,31,227,142,244,188,191,214]},"announce":[],"urlList":[]}}