{"title":"Mathworks Matlab R2013a UNIX ISO (8.1.0.604) x86_64","uid":8315857,"size":5484261897,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:48a4c1cdb5a33c30c676cc0b5a189630a36683a2&amp;dn=Mathworks+Matlab+R2013a+UNIX+ISO+%288.1.0.604%29+x86_64&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":2,"uploader":"rshings","files":5,"time":1364585838,"description":"Mathworks Matlab R2013a UNIX ISO (8.1.0.604) x86_64\n\nHello, I've installed it on Fedora Core 17, AMD64, and it works, serial number and license is included in directory serial/. Enjoy!\n\n\nDownloaded from:\n\n\n\nMathworks Matlab 8.1.0.604 R2013a (Mac/Linux) | 5.2 Gb\n\nMathWorks announced Release 2013a (R2013a) of its MATLAB and Simulink product families. New in this release is the introduction of Fixed-Point Designer, which combines the functionality of Fixed-Point Toolbox and Simulink Fixed Point. Also included are capabilities within Phased Array System Toolbox and SimRF that strengthen wireless and radar communications system design. R2013a also updates 80 other products, including Polyspace embedded software verification products.\n\nFor MATLAB, R2013a highlights include:\n\n- MATLAB: Unit test framework for the MATLAB language\n- Financial Instruments Toolbox: Calibration and Monte Carlo simulation for Hull-White, Linear Gaussian and LIBOR market models\n- Image Processing Toolbox: Image segmentation using active contours, C code generation for 10 functions, and GPU acceleration for 11 functions\n- Image Acquisition Toolbox: Kinect for Windows sensor support for acquiring images, depth maps, and skeleton data\n- Statistics Toolbox: Support vector machines (SVMs) for binary classification, PCA algorithms for missing data, and Anderson-Darling goodness-of-fit test\n- Data Acquisition Toolbox: Support Package for Digilent Analog Discovery Design Kit\n- Vehicle Network Toolbox: XCP support for accessing ECUs on CAN bus\n- Communications System Toolbox: Sphere Decoder and Constellation Diagram System objects\n- Computer Vision System Toolbox: Viola-Jones object detection training, FREAK feature extraction, and other new functions\n- DSP System Toolbox: Spectrum Analyzer and Logic Analyzer scopes and triggering of time scopes\n- Phased Array System Toolbox: Polarization support, array tapers, and apps for sensor array analysis, waveform analysis, and radar equation calculation.\n\nR2013a highlights for Simulink include:\n\n- Simulink: Simulation Performance Advisor, masking of linked library blocks, and active variant control via logical expressions\n- SimRF: Circuit Envelope solver for fast simulation and model load time\n- SimMechanics: Published XML schema for importing models from CAD and other systems\n- Simulink Design Verifier: Array out-of-bounds checking\n- Simulink Coder: Reduced data copies for Simulink functions called from Stateflow\n- Fixed-Point Designer: A new product that combines the functionality of Fixed-Point Toolbox and Simulink Fixed Point\n- HDL Verifier: HDL testbench generation from MATLAB","torrent":{"xt":"urn:btih:48a4c1cdb5a33c30c676cc0b5a189630a36683a2","amp;dn":"Mathworks+Matlab+R2013a+UNIX+ISO+%288.1.0.604%29+x86_64","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48a4c1cdb5a33c30c676cc0b5a189630a36683a2","infoHashBuffer":{"type":"Buffer","data":[72,164,193,205,181,163,60,48,198,118,204,11,90,24,150,48,163,102,131,162]},"announce":[],"urlList":[]}}