{"title":"MediEvil: Dilogy (1998-2000) (RUS/Multi-3/v.1.1) (PC)","uid":8373180,"size":1376862208,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:48b2e7e85aad8e1716f44d5280c0531ea94321e6&amp;dn=MediEvil%3A+Dilogy+%281998-2000%29+%28RUS%2FMulti-3%2Fv.1.1%29+%28PC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"Maks2012","files":1,"time":1365974508,"description":"MediEvil: Dilogy (1998-2000) (RUS/Multi-3/v.1.1) (PC) by Ma2012ks\n\nLanguages:\nMediEvil 1. Game language: only Russian\nMediEvil 2. Presence of languages in game: Russian, German, French\n\nVersion: 1.0.0.1\n\n\nDescription:\n\nMediEvil 1\nDescription:\nEvents of game begin with small digression to the past, showing to the player the invented medieval kingdom under the name Galloumir. In 1286 the angry sorcerer necromancer by the name of Pledge lifted army of demons and made an attempt kingdom capture, but the valorous knight sir Deniel Fortescue headed resistance and overcame the villain, having become the greatest hero. But already in initial prompt show that he was recognized as the hero unfairly, actually Fortescue died from a casual arrow in the first battle, and armies coped with the sorcerer without any his participation.\nHundred years later the Pledge unexpectedly appears again, recovers dead persons, captures souls of countrymen and at the head of army you indulge again tries to seize the kingdom. But the spell applied by it on a twist of fate extends and on a crypt where it is buried pseudo-hero Dan Fortescue who too is restored to life and decides to win against the necromancer that though somehow to justify for the disgraceful past and to get to the Hall of Heroes.\n\nMediEvil 2\nDescription:\nMediEvil 2 forever became one of those games which are kept in mind.\nAction of this part of game happens 500 years later after events of the first part. Scene of action London of 1888. The country prospers, each citizen feels happy, the industry is on lifting. But, everything is good if there was no God Palerton - the angry conjurer and the wizard. It finds the old book of God of Pledge, the villain from the first part. In this book it is described that it is necessary to make to conquer the world. And to the main character, I Will put Fortescue it is necessary to save again the world from a nightmare of hunger, ruin and war.\n\n\nIn addition:\n\n- Game choice for installation in Autorun-e.\n- ERRORS ARE CORRECTED: &quot;. ISN'T COMPLETELY CONFIGURED GO TO CONFIG. &quot;, &quot;. BIOS not found [BIOS *****.BIN]&quot;.\n- At game by the gamepad Vibro's (MediEvil 1) function works.\n- Small changes.","torrent":{"xt":"urn:btih:48b2e7e85aad8e1716f44d5280c0531ea94321e6","amp;dn":"MediEvil%3A+Dilogy+%281998-2000%29+%28RUS%2FMulti-3%2Fv.1.1%29+%28PC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48b2e7e85aad8e1716f44d5280c0531ea94321e6","infoHashBuffer":{"type":"Buffer","data":[72,178,231,232,90,173,142,23,22,244,77,82,128,192,83,30,169,67,33,230]},"announce":[],"urlList":[]}}