{"title":"Best Coast-Fade Away EP (2013)","uid":9079756,"size":52365179,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:48f6cac38057a11e7f66ff1c4fa57a532009c8f6&amp;dn=Best+Coast-Fade+Away+EP+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"-wxm-","files":-1,"time":1382367198,"description":"Best Coast-Fade Away EP (2013)\n\n01 This Lonely Morning\n02 I Wanna Know\n03 Who Have I Become\n04 Fear of My Identity\n05 Fade Away\n06 Baby I'm Crying\n07 I Don't Know How\n\nFade Away, the first release on Bethany Cosentino's Jewel City label, in partnership with Kobalt Label Services, sets Best Coast off on a new burst of independence and creativity, which includes another album they'll start recording in November for release this Spring. And it reflects the increased confidence that Cosentino and her bandmate, multi-instrumentalist Bobb Bruno, gained in the three surreal years since their breakthrough album Crazy For You. Celebrated as darlings of the lo-fi, it lead to defiantly hi-fi events like performing with childhood idols Green Day and No Doubt, dueting with Kendrick Lamar and Iggy Pop, having Drew Barrymore direct their Chloe Moretz-starring video, creating a new collection for Urban Outfitters, and working with the widescreen producer Jon Brion, who's overseen masterpieces by Kanye West and Fiona Apple, on an album that made Rolling Stone and Spin Magazine's Top Albums of 2012. Producing and mixing this time alongside Bethany and Bobb was Wally Gagel, who's recorded over twenty iTunes Originals sessions, including one with Best Coast back in 2011. This new freedom led Cosentino to a faster-paced, energetic set of songs inspired by Mazzy Star, Patsy Cline, My Bloody Valentine and Ambien. &quot;Everything in this band has worked out so organically that sometimes it scares me that something bad is going to happen. I don't even understand why this is happening. I made some songs, I put them up on the internet, and here I am now. I feel like the luckiest person in the world. If I wasn't doing this, I don't know what I would be doing.&quot; - Bethany Cosentino.","torrent":{"xt":"urn:btih:48f6cac38057a11e7f66ff1c4fa57a532009c8f6","amp;dn":"Best+Coast-Fade+Away+EP+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48f6cac38057a11e7f66ff1c4fa57a532009c8f6","infoHashBuffer":{"type":"Buffer","data":[72,246,202,195,128,87,161,30,127,102,255,28,79,165,122,83,32,9,200,246]},"announce":[],"urlList":[]}}