{"title":"The Divine Comedy: Volume 2 Purgatorio by Dante Alighieri","uid":15816485,"size":2527759,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:49679e54179843bda8bbfbc47a2437f9a365c002&amp;dn=The+Divine+Comedy%3A+Volume+2+Purgatorio+by+Dante+Alighieri&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":0,"uploader":"marty14","files":1,"time":1473691547,"description":"The Divine Comedy: Volume 2 Purgatorio - Dante Alighieri translated by Robert and Jean Hollander [epub]\r\n\r\nIn the second book of Dante’s epic poem The Divine Comedy, Dante has left hell and begins the ascent of the mount of purgatory. Just as hell had its circles, purgatory, situated at the threshold of heaven, has its terraces, each representing one of the seven mortal sins. With Virgil again as his guide, Dante climbs the mountain; the poet shows us, on its slopes, those whose lives were variously governed by pride, envy, wrath, sloth, avarice, gluttony, and lust. As he witnesses the penance required on each successive terrace, Dante often feels the smart of his own sins. His reward will be a walk through the garden of Eden, perhaps the most remarkable invention in the history of literature.\r\n\r\nNow Jean Hollander, an accomplished poet, and Robert Hollander, a renowned scholar and master teacher, whose joint translation of the Inferno was acclaimed as a new standard in English, bring their respective gifts to Purgatorio in an arresting and clear verse translation. Featuring the original Italian text opposite the translation, their edition offers an extensive and accessible introduction as well as generous historical and interpretive commentaries that draw on centuries of scholarship and Robert Hollander’s own decades of teaching and reasearch","torrent":{"xt":"urn:btih:49679e54179843bda8bbfbc47a2437f9a365c002","amp;dn":"The+Divine+Comedy%3A+Volume+2+Purgatorio+by+Dante+Alighieri","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49679e54179843bda8bbfbc47a2437f9a365c002","infoHashBuffer":{"type":"Buffer","data":[73,103,158,84,23,152,67,189,168,187,251,196,122,36,55,249,163,101,192,2]},"announce":[],"urlList":[]}}