{"title":"GTA Underground 2","uid":3791704,"size":754042849,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:49acf04ce7d14ba8020fa6e33cae7e6e8eb83c7f&amp;dn=GTA+Underground+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":0,"uploader":"ale4","files":16,"time":1188606127,"description":"The phenomenon that started on the PC with a commitment to expansive non-linear gameplay,\nirrevrent humor, and unparalleled action has gone on to become a household name worldwide.\nThe Russians were the first to launch man into space and are now proud to present the\nworld class gaming experience that is Grand Theft Auto: Undergound 2, built from the GTA\nVice City Platform with a twist of Need For Speed: Underground.\n\nYou get the best of both worlds. The cars, sound track, and all the little things that\nmade Import Racing famous thrown into a 3D world of GTA that we have all grown to know and\nlove.\n\nEssentially, you get 2 games in one. If you are a GTA enthusiast, then this is a must\ndownload. Guaranteed to excite and be enjoyable to witness the work of Genius Programmers\nat work while combining two classic games into a Blockbuster.\n\nHighlights:\n- Cheats for GTA Vice City will continue to work.\n- Best of GTA Vice City and NFS Undergound.\n- Imagine &quot;Too Fast Too Furious&quot; and GTA Vice City had a Baby.\n- Soundtrack is superb.. with only the hottest underground tracks\n- Every car looks like it was in the &quot;Need for Speed&quot; Movie with Ground Effects, Body\nKits, Spoilers, Nice Rims with low profile tires, realistic racing exhaust, even Police\nCars are dropped 2 inches for the low profile look, Tinted Windows, and a new cast of\nImport Cars for you to Steal and Car Jack!\n- Expanded Controls\n- Integrated support for all major gamepads, joysticks, and steering wheels.\n- Optimized Graphics\n- Players Skins\n- Enganced Audio\n- Replay","torrent":{"xt":"urn:btih:49acf04ce7d14ba8020fa6e33cae7e6e8eb83c7f","amp;dn":"GTA+Underground+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49acf04ce7d14ba8020fa6e33cae7e6e8eb83c7f","infoHashBuffer":{"type":"Buffer","data":[73,172,240,76,231,209,75,168,2,15,166,227,60,174,126,110,142,184,60,127]},"announce":[],"urlList":[]}}