{"title":"Animal Kingdom Complete Season 1","uid":15547332,"size":3909378121,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4a24ed57c96fc4e27bb5b0aa5b35666cd933d8d1&amp;dn=Animal+Kingdom+Complete+Season+1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":18,"uploader":null,"files":10,"time":1470987768,"description":"Complete Season 1 of Animal Kingdom (2016 TV Show), all episodes are 720p.\r\n\r\nThe series centers on 17-year-old Joshua &quot;J&quot; Cody, who moves in with his freewheeling relatives in their Southern California beach town after his mother dies of a heroin overdose. Headed by boot-tough matriarch Janine &quot;Smurf&quot; Cody and her right-hand Baz, who runs the business and calls the shots, the clan also consists of Pope, the oldest and most dangerous of the Cody boys; Craig, the tough and fearless middle son; and Deran, the troubled, suspicious &quot;baby&quot; of the family.\r\n\r\nS1, Ep1\r\n14 Jun. 2016 Pilot\r\nA 17-year-old boy moves in with his grandmother and uncles in their Southern California beach town after his mother ODs.\r\n\r\nS1, Ep2\r\n14 Jun. 2016 We Don't Hurt People\r\nThe Codys must deal with the aftermath of the heist as they discover all did not go as planned. Smurf dispatches her boys to tie up loose ends, but her efforts are complicated by Baz and Pope's growing rivalry. As Pope gets increasingly volatile, J finds himself in the middle.\r\n\r\nS1, Ep3\r\n21 Jun. 2016 Stay Close, Stick Together\r\nWhile Craig recovers from a wound, Baz and Craig deal with some old associates down in Mexico. Meanwhile, strapped for cash, Pope takes charge and ropes Deran and J into a job without Smurf's knowledge. Threatened by J's participation, Deran sends him a terrifying message.\r\n\r\nS1, Ep4\r\n28 Jun. 2016 Dead to Me\r\nAs the boys gear up for Pope's birthday, Smurf wants to know if they're playing by her rules. J learns more about his mother's estrangement from the family.\r\n\r\nS1, Ep5\r\n5 Jul. 2016 Flesh Is Weak\r\nPope goes to extreme measures to bring Deran home.\r\n\r\nS1, Ep6\r\n12 Jul. 2016 Child Care\r\nSmurf tries to keep the family intact when Pope tests positive for drugs; Baz convinces his brother to rob a house as part of his plan; J faces a moral dilemma.\r\n\r\nS1, Ep7\r\n19 Jul. 2016 Goddamn Animals\r\nCraig and Deran throw a party as Smurf handles unfinished business. Meanwhile, Baz is forced to accelerate his timetable as he finalizes his big scheme, and J makes a perilous error.\r\n\r\nS1, Ep8\r\n26 Jul. 2016 Man In\r\nTensions soar as the Codys prepare for their big heist. Also, Catherine gets a shock and must make a big family decision, and the police put pressure on J.\r\n\r\nS1, Ep9\r\n2 Aug. 2016 Judas Kiss\r\nThe Codys aim for the biggest score of their lives as the cops put J in an impossible position. Meanwhile, Catherine arrives to make amends, raising Smurf's suspicions in the process, and Pope is enlisted to investigate.\r\n\r\nS1, Ep10\r\n9 Aug. 2016 What Have You Done\r\nWhile Pope and Smurf try to keep Baz from figuring out the truth about Catherine, the money from their Camp Pendleton heist comes through. But there are bigger problems within the Cody Gang","torrent":{"xt":"urn:btih:4a24ed57c96fc4e27bb5b0aa5b35666cd933d8d1","amp;dn":"Animal+Kingdom+Complete+Season+1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a24ed57c96fc4e27bb5b0aa5b35666cd933d8d1","infoHashBuffer":{"type":"Buffer","data":[74,36,237,87,201,111,196,226,123,181,176,170,91,53,102,108,217,51,216,209]},"announce":[],"urlList":[]}}