{"title":"Kristanix Email Sender Deluxe v2.34 with Key [TorDigger]","uid":7911931,"size":9744454,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4a6ee4e74387c09b281c7729ad0d47352097758e&amp;dn=Kristanix+Email+Sender+Deluxe+v2.34+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":1,"uploader":"TorDigger","files":3,"time":1355241413,"description":"Email Sender Deluxe\n\nThe perfect tool for email marketing and newsletters!\n\nWith Email Sender Deluxe, sending out personalized bulk email and newsletters to your customers and clients just got a whole lot easier! Simply choose your recipients, write your email and hit Send! You can easily import recipients from databases, Excel, text files or enter them manually. \n\nYou can store email templates, so you don't have to type the whole newsletter again the next time you send one. \n\nEmail Sender Deluxe allows you to easily preview each email before it is sent to the recipients, letting you see the email they see. Attaching files to the emails is easy as well. This bulk email sender software also allows you to send to an unlimited number of recipients. And it's fast! This mass mailer utilizes multiple sending connections, maximizing the speed. \n\nIf you send out newsletters regularly, need to notify your customers about new products and services, or just need a great email software, Email Sender Deluxe is here to help you! \n\nFeatures\n\nSend emails quickly and easily! Each recipient will get their own email, and won't see who else the email is sent to.\nSend personalized emails! You can insert recipient fields such as &quot;First Name&quot; or &quot;Country&quot; into your email.\nEasily import recipients from text files, CSV files and Excel spreadsheets.\nSupports import recipients from ODBC databases like Oracle, SQL Server, Access and MySQL.\nSupports sending email using SMTP server, DNS Send, Pickup Service and Amazon Simple Email Service (Amazon SES).\nUse the powerful WYSIWYG editor to easily create your HTML emails.\nSetup pausing to accommodate the email sending to your SMTP server's limits.\nSend email using multiple connections, maximizing the speed.\nPreview all emails before they are sent.\n\nSupported OS:\n\nWindows XP/Vista/7\n\nHomepage: http://www.emailsenderdeluxe.com/\n\nInstallation Instructions:\n\n- Install program\n- Use given key to register.\n- Done, Enjoy.","torrent":{"xt":"urn:btih:4a6ee4e74387c09b281c7729ad0d47352097758e","amp;dn":"Kristanix+Email+Sender+Deluxe+v2.34+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a6ee4e74387c09b281c7729ad0d47352097758e","infoHashBuffer":{"type":"Buffer","data":[74,110,228,231,67,135,192,155,40,28,119,41,173,13,71,53,32,151,117,142]},"announce":[],"urlList":[]}}