{"title":"Directing the Story: Professional Storytelling and Storyboarding","uid":9388037,"size":26680462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a74cc9e3c6ec1e300309a7167e2095241dee878&amp;dn=Directing+the+Story%3A+Professional+Storytelling+and+Storyboarding&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1387833423,"description":"rancis Glebas, a top Disney storyboard artist, teaches artists a structural approach to clearly and dramatically presenting visual stories. They will learn classic visual storytelling techniques such as conveying meaning with images and directing the viewer's eye. Glebas also teaches how to spot potential problems before they cost time and money, and he offers creative solutions on how to solve them.\n\nReview\n\nFrancis Glebas has put together a really comprehensive and thought-provoking look at the art and craft of film making, specifically directing. His approach, which is to ask a lot of seemingly innocent questions, has much the same effect as the good storytelling he is trying to teach us.it draws us in and makes us think. I can't imagine anyone, in or out of our business, who won't find any number of helpful ideas as they work their way through the filmmaking jungles!!\n- Roy Disney, Director Emeritus and consultant for The Walt Disney Company\n\nFrancis Glebas was one of our most talented storyboard artists at Disney, and it was our great fortune to have him on the story team. He has a wealth of experience to share.\n- Jeffrey Katzenberg, CEO, Dreamworks Animation\n\nAbout the Author\n\nFrancis Glebas worked as a story artist for Disney Feature Animation on Aladdin, Lion King, Pocahontas, Hunchback of Notre Dame, Dinosaur, Treasure Planet and Hercules. He also directed Pomp and Circumstance starring Donald Duck in Fantasia 2000 and Piglet's BIG Movie. Francis is also an award-winning independent live action movie maker with almost 40 years' experience. He currently teaches storyboarding at Gnomon School of Visual Effects. Francis also works as a creative consultant, having worked with the Irish Government, Korean Government, General Motors, Los Alamos Labs, Walt Disney Imagineering and other film studios.","torrent":{"xt":"urn:btih:4a74cc9e3c6ec1e300309a7167e2095241dee878","amp;dn":"Directing+the+Story%3A+Professional+Storytelling+and+Storyboarding","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a74cc9e3c6ec1e300309a7167e2095241dee878","infoHashBuffer":{"type":"Buffer","data":[74,116,204,158,60,110,193,227,0,48,154,113,103,226,9,82,65,222,232,120]},"announce":[],"urlList":[]}}