{"title":"Oxford Very Short Introductions (Kindle Books)","uid":10689884,"size":132900000,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4acb23a390891dcc8abc07a36aca9ebdfc8b9e6e&amp;dn=Oxford+Very+Short+Introductions+%28Kindle+Books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"Ulysses31","files":44,"time":1407107177,"description":"\nThe Bible: A Very Short Introduction -- John Riches\n \n\nCosmology: A Very Short Introduction -- Peter Coles \n \n\nParticle Physics: A Very Short Introduction -- Frank Close \n \n\nThe Cold War: A Very Short Introduction -- Robert J. McMahon\n \n\nAntisemitism: A Very Short Introduction -- Steven Beller \n\n\nFascism: A Very Short Introduction -- Kevin Passmore \n \n\nFoucault: A Very Short Introduction -- Gary Gutting \n\n\nNationalism: A Very Short Introduction -- Steven Grosby \n\n\nAtheism: A Very Short Introduction -- Julian Baggini \n \n\nEmpire: A Very Short Introduction -- Stephen Howe\n \n\nThe British Empire: A Very Short Introduction -- Ashley Jackson \n\n\nRussell: A Very Short Introduction -- A. C. Grayling \n\n\nWittgenstein: A Very Short Introduction -- A. C. Grayling \n \n\nAnarchism: A Very Short Introduction -- Colin Ward\n \n\nThe Soviet Union: A Very Short Introduction -- Stephen Lovell \n \n\nThe Russian Revolution: A Very Short Introduction -- S. A. Smith \n \n\nThe Spanish Civil War: A Very Short Introduction -- Helen Graham \n\n\nMarx: A Very Short Introduction -- Peter Singer \n \n\nCapitalism: A Very Short Introduction -- James Fulcher\n\n\nCommunism: A Very Short Introduction -- Leslie Holmes \n \n\nRussian History: A Very Short Introduction -- Geoffrey Hosking \n \n\nPolitical Philosophy: A Very Short Introduction -- David Miller\n \n\nGlobal Economic History: A Very Short Introduction -- Robert C. Allen \n \n\nJung: A Very Short Introduction -- Anthony Stevens \n \n\nSleep: A Very Short Introduction -- Steven W. Lockley \n \n\nRisk: A Very Short Introduction -- Baruch Fischhoff \n \n\nProbability: A Very Short Introduction -- John Haigh \n \n\nThe French Revolution: A Very Short Introduction -- William Doyle \n \n\nThe European Union: A Very Short Introduction -- John Pinder \n \n\nThe Celts: A Very Short Introduction -- Barry Cunliffe \n \n\nFree Speech: A Very Short Introduction -- Nigel Warburton \n \n\nThe Palestinian-Israeli Conflict: A Very Short Introduction -- Martin Bunton \n \n\nQuantum Theory: A Very Short Introduction -- John Polkinghorne\n \n\nRelativity: A Very Short Introduction -- Russell Stannard\n \n\nMathematics: A Very Short Introduction -- Timothy Gowers \n \n\nCatholicism: A Very Short Introduction -- Gerald O'Collins \n \n\nThe Reformation: A Very Short Introduction -- Peter Marshall \n \n\nJudaism: A Very Short Introduction -- Norman Solomon \n \n\nIslam: A Very Short Introduction -- Malise Ruthven\n \n\nChristianity: A Very Short Introduction -- Linda Woodhead \n \n\nThe First World War: A Very Short Introduction -- Michael Howard\n \n\nSocialism: A Very Short Introduction -- Michael Newman \n","torrent":{"xt":"urn:btih:4acb23a390891dcc8abc07a36aca9ebdfc8b9e6e","amp;dn":"Oxford+Very+Short+Introductions+%28Kindle+Books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4acb23a390891dcc8abc07a36aca9ebdfc8b9e6e","infoHashBuffer":{"type":"Buffer","data":[74,203,35,163,144,137,29,204,138,188,7,163,106,202,158,189,252,139,158,110]},"announce":[],"urlList":[]}}