{"title":"BuildBox 2.2.5 Build 1314 (x86x64) Incl Activator / Modules","uid":15935324,"size":270392212,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4b36c1e93e32f2431578f80c46ea47fe263ac89c&amp;dn=BuildBox+2.2.5+Build+1314+%28x86x64%29+Incl+Activator+%2F+Modules&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":6,"uploader":"SadeemPC","files":1,"time":1475387891,"description":"BuildBox 2.2.5 Build 1314 (x86/x64) + Modules\r\n\r\nMake games without programming. Buildbox is a breakthrough game creation experience. Creating games is as easy as dropping images into the software, making changes to their properties and hitting play. Every tool you need to complete your game is included inside Buildbox. You have access to complete management of your assets, integrated level editor, game menu system, advanced ad and in app purchase solution, font editor, gameplay settings and more.\r\n\r\nTrue Drag and Drop Creation\r\nWith Buildbox, creating games does not require any programming or scripting skills. Simply import images, assign them properties and move them around your game scene. Use one of our many presets to get started and preview your game in real time.\r\n\r\nUnlimited Gameplay Possibillities\r\nWith Buildbox 2.0, the possibilities are endless. You can now create nearly any 2D game imaginable with the help of our gameplay settings, character settings, logic pieces and new component control.\r\n\r\nChart Topping Games Made Here\r\nSince itâ™s release, Buildbox has made more Apple Features and Top 100 hits than any other drag and drop game builder.\r\n\r\nInsanely Fast Development\r\nBuildbox is the fastest development tool ever created. Hit games like Color Switch and The Line Zen were made in a a single week using Buildbox… and thatâ™s just the beginning.\r\n\r\nADVANCED FEATURES\r\nOur advanced features allow you to expand the possibilities of what you can create. Mix and match components to make your game uniquely interactive. With the advanced options in Buildbox you can easily make games like some of the top game publishers without any programming or coding knowledge.\r\n\r\nCharacter Components\r\nAdvanced components widely open Buildbox 2.0, letting you create new control styles, gameplay types, special attacks and abilities. These components add a lot of character functionality and are very easy to use. Along with damage, health and character icon, you have the option of advanced move and ghost jump.\r\n\r\nObject Components\r\nComponents to objects work in the same way as character components. You can use damage component to attach damage to various moves and health to attach or include multiple lives.\r\n\r\nCollision Editor\r\nWith the collision editor you have more flexibility as a game designer. You can easily edit the collision shape of any character or object, without changing the sprite image in your game.\r\n\r\nSprite Editor\r\nBuildbox also allows you to easily animate and customize images. You can drag and drop any PNG image into the editor. Resize or scale it down to fit perfectly into your gameâ™s scene. Like magic, create animated sequences and cut scenes using the keyframe animation feature.\r\n\r\nSystem Requirements:\r\n- Windows 7 or Windows 8 or Windows 10\r\n- Intel Core 2 Duo CPU (or AMD equivalent)\r\n- 200MB free disk space (for the software only)\r\n- 1GB RAM\r\n\r\nWhat's New in BuildBox 2 ?","torrent":{"xt":"urn:btih:4b36c1e93e32f2431578f80c46ea47fe263ac89c","amp;dn":"BuildBox+2.2.5+Build+1314+%28x86x64%29+Incl+Activator+%2F+Modules","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b36c1e93e32f2431578f80c46ea47fe263ac89c","infoHashBuffer":{"type":"Buffer","data":[75,54,193,233,62,50,242,67,21,120,248,12,70,234,71,254,38,58,200,156]},"announce":[],"urlList":[]}}