{"title":"Mastering AutoCAD 2014 and AutoCAD LT 2014 [PDF] Ehhhh","uid":8776219,"size":88619924,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c5715c4bde42073f36dbd2c7d79c1b38d7c1d35&amp;dn=Mastering+AutoCAD+2014+and+AutoCAD+LT+2014+%5BPDF%5D+Ehhhh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":4,"uploader":"Ehhhhtozebec","files":-1,"time":1375561388,"description":"Overview\n\nThe ultimate reference and tutorial for AutoCAD software\n\nThis Autodesk Official Press book helps you become an AutoCAD and AutoCAD LT expert and has been fully updated to cover all of AutoCAD's new capabilities. Featuring the popular, empowering presentation style of veteran award-winning author George Omura, this indispensable resource teaches AutoCAD essentials using concise explanations, focused examples, step-by-step instructions, and hands-on projects.\n\nIntroduces you to the basics of the interface and drafting tools\nDetails how to effectively use hatches, fields, and tables\nCovers attributes, dynamic blocks, curves, and geometric constraints\nExplores 3D modeling and imaging\nDiscusses customization and integration\nHelps you prepare for the AutoCAD certification exams\nFeatures a website that includes all the project files necessary for the tutorials\n\nThis detailed reference and tutorial is the perfect resource for becoming proficient with AutoCAD or AutoCAD LT.\n\n\n\nProduct Details\n\nISBN-13: 9781118575048\nPublisher: Wiley, John &amp; Sons, Incorporated\nPublication date: 7/1/2013\nEdition number: 1\nPages: 1248\n\n\nMeet the Author\n\nGeorge Omura is a licensed architect and Autodesk Authorized Author who has more than 30 years of experience in architecture and has been using AutoCAD for more than 20 years. He has worked on design projects ranging from resort hotels to metropolitan transit systems to the San Francisco Library project. He is the all-time bestselling AutoCAD author and was cited as favorite CAD author by members of the Autodesk User Group International (AUGI) in AUGIWorld magazine's &quot;Best of Everything CAD&quot; issue. Brian C. Benton is a senior engineering technician, CAD consultant, author, trainer, and popular blogger (cadablog.com) with 20 years of experience in several design fields. He's the Cadalyst magazine &quot;Tip Patroller&quot; columnist, former AUGI HotNews production manager, and an inaugural member of the Autodesk Expert Elite program.","torrent":{"xt":"urn:btih:4c5715c4bde42073f36dbd2c7d79c1b38d7c1d35","amp;dn":"Mastering+AutoCAD+2014+and+AutoCAD+LT+2014+%5BPDF%5D+Ehhhh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c5715c4bde42073f36dbd2c7d79c1b38d7c1d35","infoHashBuffer":{"type":"Buffer","data":[76,87,21,196,189,228,32,115,243,109,189,44,125,121,193,179,141,124,29,53]},"announce":[],"urlList":[]}}