{"title":"UDEMY MOBILE APP DESIGN LEARN UX UI AND START FREELANCING CAREER","uid":12735320,"size":1027302678,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4cb7fcc8151730337435c9dedba56ebf2ffb98df&amp;dn=UDEMY+MOBILE+APP+DESIGN+LEARN+UX+UI+AND+START+FREELANCING+CAREER&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":9,"uploader":"BarCraft","files":92,"time":1447172102,"description":"JOIN OVER 2700 SUCCESSFUL STUDENTS WHO HAVE ALREADY\r\nTAKEN THIS COURSE!\r\n\r\nYou're going about your day as usual and BAM! You\r\nthink of this awesome app idea. It's simple\r\npeople would love it and you can't find it ANYWHERE\r\nin the app store\r\n\r\nOr maybe you want to develop a highly profitable skill with\r\nwhich you can make a profitable income EVERY DAY by working when\r\nyou want from where ever you want?\r\n\r\nThis course is optimized for anyone who is looking to\r\nefficiently learn the most important design techniques that will\r\nhelp design perfect apps! Because well designed\r\nmobile apps are just as important as well-built\r\napps\r\n\r\nSpecifically, you are going to learn how to design\r\nuser friendly, engaging, beautiful looking mobile\r\napps from scratch, by doing assignments, quizes\r\nand practical work between the lessons\r\n\r\nMobile App Design is not just about how to design pretty app. It's\r\nalso about designing an app that looks great and works\r\nsmoothly\r\n\r\nAlthough this course mainly covers iOS 8 Mobile App Design, but\r\nafter completing it, you are going to develop a skill, with\r\nwhich you are going to start designing mobile apps for all major\r\nplatforms (iOS, Android and Windows Phone) in no\r\ntime!\r\n\r\nCourse content:\r\n\r\n* Learn how to start from scratch with your own app\r\nidea\r\n* Go through all the user researching steps on\r\nfinding your target audience\r\n* How to figure out who to target (marketing tips)\r\n* Learn how to create sketches and wireframes\r\n* Learn User Experience Design (UX) techniques which are trending\r\nin job market right now\r\n* Learn how to use Adobe Photoshop for designing User Interface\r\n(UI) Designs\r\n* I'm going to show you my workflow and how I'm going to start\r\ndesign my own app idea, News Reader App, from\r\nabsolute zero to the great looking iOS 8 design\r\nstyle\r\n* You are going to implement everything you learned\r\nin the previous lessons and in the final section\r\nI'm going to show you a bunch of different tips and\r\nresources, how to start making big money with your\r\nnew skills\r\n* Assignments which are going to help you learn UI / UX Design\r\nfor Mobile App\r\n* Quizes, which will help you recap what you learned in the\r\nprevious section\r\n\r\nMobile App Design: Learn To Design The Perfect App is a\r\ncomprehensive course where you are going to earn exactly those\r\nskills and make money instantly\r\n\r\nMobile App UI / UX Designers typically earns around\r\n$100K/per year working for companies and startups\r\n\r\nBut if you decide to work as a freelancer online\r\nyou can expect to get $100/hour for the work as a UI\r\n/ UX designer\r\n\r\nWhere is no coding or programming required\r\n\r\nAfter this course, you can go to the world and start seeking\r\nfor a jobs at the biggest world companies or startups, or start\r\nfreelancing online on your own and in your own home\r\n\r\nWith those freelancing tips applied, you can expect\r\nto earn $100/h of your work\r\n\r\nWhere is no problem if you don't know Photoshop at\r\nall\r\n\r\nPlus you are going to get Adobe Photoshop for free\r\nfor the first 30 days, so you don't need to buy it\r\n\r\nAll in all, you are going to get 5 courses in one:\r\n\r\nHow to come up with your own app idea\r\n\r\nUser Experience skills to research your target audience and create\r\nsketches and wireframes for the app\r\n\r\nLearn Adobe Photoshop from ground zero\r\n\r\nDesign your own app in Adobe Photoshop\r\n\r\nHow to make money with your new skills, so\r\neffective freelancing and job seeking in the\r\ncompanies and startups\r\n\r\nPlus, you are going to get fast and responsive answers from me\r\nyour instructor\r\n\r\nAlso, if you don't like my course you have 30 days money back\r\nguarantee, so you don't lose anything! NO QUESTIONS ASKED!","torrent":{"xt":"urn:btih:4cb7fcc8151730337435c9dedba56ebf2ffb98df","amp;dn":"UDEMY+MOBILE+APP+DESIGN+LEARN+UX+UI+AND+START+FREELANCING+CAREER","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cb7fcc8151730337435c9dedba56ebf2ffb98df","infoHashBuffer":{"type":"Buffer","data":[76,183,252,200,21,23,48,51,116,53,201,222,219,165,110,191,47,251,152,223]},"announce":[],"urlList":[]}}