{"title":"He Was My Chief: The Memoirs of Adolf Hitler's Secretary","uid":16033281,"size":1022454,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d0e956de6e245edf4a55837accf4b078b1fd5a3&amp;dn=He+Was+My+Chief%3A+The+Memoirs+of+Adolf+Hitler%27s+Secretary&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":5,"uploader":"marty14","files":1,"time":1476450424,"description":"He Was My Chief: The Memoirs of Adolf Hitler's Secretary - Christa Schroeder [epub]\r\n\r\nAs secretary to the Fuhrer throughout the time of the Third Reich, Christa Schroeder was perfectly placed to observe the actions and behavior of Hitler, along with the most important figures surrounding him.\r\n\r\nSchroeder's memoir does not fail to deliver fascinating insights: she notes his bourgeois manners, his vehement abstemiousness and his mood swings. Indeed, she was ostracized by Hitler for a number of months after she made the mistake of publicly contradicting him once too often.\r\n\r\nIn addition to her portrayal of Hitler, there are illuminating anecdotes about Hitler's closest colleagues. She recalls, for instance, that the relationship between Martin Bormann and his brother Albert (who was on Hitler's personal staff) was so bad that the two would only communicate with one another via their respective adjutants - even if they were in the same room. There is also light shed on the peculiar personal life and insanity of Reichsminister Walther Darré.\r\n\r\nSchroeder says she knew nothing of the alleged horrors of the National Socialist government. There is nothing of the sense of perspective or the mea culpa that one finds in the memoirs of Hitler's other secretary, Traudl Junge - who concluded 'we should have known'. Rather the tone that pervades Schroeder's memoir is one of bitterness. This is, without any doubt, one of the most important primary sources from the pre-war and wartime period.\r\n\r\nChrista Schroeder was Hitler's personal secretary for twelve years in total. She worked as his secretary until his suicide in April 1945, living at the Wolfsschanze near Rastenburg. Her memoir Er War Mein Chef was first published in 1985, a year after her death in Munich, aged 76","torrent":{"xt":"urn:btih:4d0e956de6e245edf4a55837accf4b078b1fd5a3","amp;dn":"He+Was+My+Chief%3A+The+Memoirs+of+Adolf+Hitler%27s+Secretary","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d0e956de6e245edf4a55837accf4b078b1fd5a3","infoHashBuffer":{"type":"Buffer","data":[77,14,149,109,230,226,69,237,244,165,88,55,172,207,75,7,139,31,213,163]},"announce":[],"urlList":[]}}