{"title":"Hero and the Terror (1988) [720p]","uid":12082118,"size":793281729,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:4d592c4551dafd6bcc4740551dfbc4193a02191e&amp;dn=Hero+and+the+Terror+%281988%29+%5B720p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":7,"uploader":"UncMoose","files":2,"time":1435795363,"description":"Poster:\n\n\nSynopsis\nThree years ago the city was plagued by Simon Moon, a serial killer, who was so terrible that he was dubbed, &quot;THE TERROR&quot;. Danny O'Brien is a cop who figured out where he was hiding and was confronted by Moon; Moon nearly killed him. But O'Brien through a stroke of luck managed to subdue Moon. The city and the press were so grateful to have &quot;THE TERROR&quot; stopped that O'Brien was christened,&quot;HERO&quot;, which he feels that he doesn't deserve. Moon was confined to a psychiatric facility; he tried to escape in one of their ambulances and it went off a cliff and he was believed to be dead. Three years later, when a theater that the city spent millions on renovating was opened, one of the guests, a woman, disappeared. She would be found later near the theater, dead. And she appears to have been killed in the same manner that Simon Moon killed his victims. While everyone believes that Simon Moon is dead, O'Brien is a bit skeptical. The mayor then schedules a press conference wherein he expects O'Brien to tell them that the killer is not Simon Moon. But O'Brien doesn't believe that is so, especially when he gets the medical examiners report. The Mayor convinces O'Brien that it would be in the city's best interest if they continue to believe that Moon is dead, so that no will try to copycat him. While O'Brien agrees, he is wondering if he is ready to face him again.\n\nScreenshots:\n","torrent":{"xt":"urn:btih:4d592c4551dafd6bcc4740551dfbc4193a02191e","amp;dn":"Hero+and+the+Terror+%281988%29+%5B720p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d592c4551dafd6bcc4740551dfbc4193a02191e","infoHashBuffer":{"type":"Buffer","data":[77,89,44,69,81,218,253,107,204,71,64,85,29,251,196,25,58,2,25,30]},"announce":[],"urlList":[]}}