{"title":"Diaries of a Spaceport Janitor","uid":15854652,"size":84752882,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4e01d95521355606ec1948e76f45d2ba23ea8049&amp;dn=Diaries+of+a+Spaceport+Janitor&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":1,"uploader":"dauphong","files":1,"time":1474229058,"description":"About This Game\r\n\r\n\r\nTake in the trash...\r\n\r\nDiaries of a Spaceport Janitor is an anti-adventure game about picking up trash in an alien bazaar. Play as the Janitor, an Alaensee girlbeast with a municipally-subsidized trash incineration job and dreams of leaving the planet of Xabran's Rock far behind her.\r\n\r\nExplore the Spaceport! Navigate the maze of alleyways, side streets, plazas, and bridges as you search for discarded items to burn. Investigate one of various entrances to the mysterious subterranean sewerdungeon, or climb the ominously symmetrical Ziggurat to get a better view of the urban landscape! If you pay attention and keep track of landmarks, you won't get lost... probably.\r\n\r\nEmbrace routine! Spend your days cleaning up litter, finding food, and testing your luck at lottoshrines scattered throughout the area. Daily tasks form the backbone of your life as the Janitor, providing structure and monotonous security in an uncertain world! Do not deviate from your routine. Pray, work, eat, sleep. Do not deviate from your routine.\r\n\r\nSuffer the Curse! Stick your scentflaps where you shouldn't, and you may just walk away with an ancient cranial entity haunting your every waking moment! Consult local Necresses, pray to the Nine Goddesses, purchase ritual objects, and rub the giant sword to balance your personal luck favorably! Maybe that will make the whispering stop!\r\n\r\nEmbark on an anti-adventure! Find a middle ground between your life of menial drudgery and a culture of exciting quests and powerful heroes, and you might finally find a way off Xabran's Rock!","torrent":{"xt":"urn:btih:4e01d95521355606ec1948e76f45d2ba23ea8049","amp;dn":"Diaries+of+a+Spaceport+Janitor","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e01d95521355606ec1948e76f45d2ba23ea8049","infoHashBuffer":{"type":"Buffer","data":[78,1,217,85,33,53,86,6,236,25,72,231,111,69,210,186,35,234,128,73]},"announce":[],"urlList":[]}}