{"title":"The Girl in the Ice - A gripping serial killer thriller","uid":15946207,"size":15990082,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e279bca5fcca986012114eba6994ea44e8e4810&amp;dn=The+Girl+in+the+Ice+-+A+gripping+serial+killer+thriller&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":0,"uploader":"jazzmonk","files":1,"time":1475512140,"description":"The Girl in the Ice - A gripping serial killer thriller by Robert Bryndza\r\nHer eyes are wide open. Her lips parted as if to speak. Her dead body frozen in the ice…She\r\nis not the only one.\r\nWhen a young boy discovers the body of a woman beneath a thick sheet of ice in a South London\r\npark, Detective Erika Foster is called in to lead the murder investigation.\r\nThe victim, a beautiful young socialite, appeared to have the perfect life. Yet when Erika begins to\r\ndig deeper, she starts to connect the dots between the murder and the killings of three prostitutes, all\r\nfound strangled, hands bound and dumped in water around London.\r\nWhat dark secrets is the girl in the ice hiding?\r\nAs Erika inches closer to uncovering the truth, the killer is closing in on Erika.\r\nThe last investigation Erika led went badly wrong… resulting in the death of her husband. With her\r\ncareer hanging by a thread, Erika must now battle her own personal demons as well as a killer more\r\ndeadly than any she’s faced before. But will she get to him before he strikes again?\r\nA page-turning thriller packed with suspense. If you like Angela Marsons, Rachel Abbott and\r\nKarin Slaughter, discover Rob Bryndza’s new series today – at a special launch price","torrent":{"xt":"urn:btih:4e279bca5fcca986012114eba6994ea44e8e4810","amp;dn":"The+Girl+in+the+Ice+-+A+gripping+serial+killer+thriller","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e279bca5fcca986012114eba6994ea44e8e4810","infoHashBuffer":{"type":"Buffer","data":[78,39,155,202,95,204,169,134,1,33,20,235,166,153,78,164,78,142,72,16]},"announce":[],"urlList":[]}}