{"title":"Reallusion iClone Character Creator 1.51.2001.1 (x64) + Content","uid":15525426,"size":3007299734,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4e72e5e0f1e747a6e0e2ebf4e18584670b71e528&amp;dn=Reallusion+iClone+Character+Creator+1.51.2001.1+%28x64%29+%2B+Content&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":3,"uploader":"SadeemPC","files":19,"time":1470778795,"description":"Reallusion iClone Character Creator 1.51.2001.1 (x64)\r\n\r\nAdditional Content: Reallusion iClone Character Creator 1.5 Essential Pack Complete Bundle.\r\n\r\nCharacter Creator (CC) is an amazing add-on tool for iClone 6 that can create realistic looking, animation ready 3D human models. Unique characters are created through the use of shape morphs, customizable high resolution skin textures, and outfits with clothing containing your own fabric designs. \r\n\r\nMorphable Muscle Shape &amp; Bone Scales\r\nThe brand new, authentic one-mesh CC Characters are designed for versatile body morphs. Besides applying basic figure shapes from the preset library you may also further adjust the body, or individual parts such as: Head, Torso, Chest, Waist, Arm, Hand, Leg and Foot. \r\n\r\nMorphable Face Creation &amp; Editing\r\nTo easily create unlimited authentic human faces, you can either directly apply any of the presets for quick prototypes, or you can further refine the appearance through highly detailed facial sliders, grouped into intuitive segments such as: Skull, Forehead, Eye/Eyelash, Brow, Ear, Nose, Cheek, Jaw, Teeth and Mouth.\r\n\r\nSkin Tone &amp; Texture Roughness\r\nFreely apply different texture patterns to your own masked area. Blend color variations and skin pores and wrinkles to generate the right skin for characters with various ages, genders and ethnicities.\r\n\r\nAging System\r\nThe full body Aging Morphs and Skin Normals options, give you the power to easily transform your characters into elderly ones. This can be applied to different genders and body shapes. Gracefully age your characters’ look or go all out and instantly turn them into seniors by adjusting the slider control.\r\n\r\nSuntan &amp; Tattoo\r\nImport decals (tattoos) and move or resize them on top of the skin as you like. You can also use a mask layer (suntan) combined with the sun tan sliders to simulate natural summer tan lines, a sporty-beach look, or sunburn effects.\r\n\r\nCosmetic Design\r\nLayered Clothing &amp; Conforming Cloth\r\nColor, Segment, Pattern\r\nWeathering &amp; Tear\r\nPatch &amp; Logo\r\n\r\nMinimum System Requirements:\r\n- Dual core CPU or higher\r\n- 4GB RAM\r\n- 5GB free hard disk space\r\n- Display Resolution: 1024 x 768\r\n- Color Depth: True Color (32-bit)\r\n- Graphics Card: NVidia Geforce GTX 400 Series/ AMD Radeon HD 5000 Series\r\n- Video Memory: 1GB RAM\r\n\r\nOperating System:\r\n- Win 7 SP1 / Win 8 / Win 10\r\n- Support for 64-bit operating system only\r\n\r\nNew in Version 1.51.2001.1\r\n• Note: Make sure you have updated all the iClone family programs to the latest version (iClone v6.51, 3DXchange v6.51, Character Creator v1.51) before you launch iClone 6.\r\n• Fixed: Wrong DRM checking caused Appearance Editor to slow down.\r\n• Fixed: Loading ccProject or iAvatar containing sliders created from iAvatar or rlHead with DRM, would sometimes prompt an incorrect message in the Validate DRM window.\r\n• Fixed: Using a .rlHead without an internet connection would show a watermark.\r\n• Fixed: When a watermark displayed, using the Calibration tool would prompt an unnecessary message.\r\n• Fixed: After double-clicking a slider to set the value to Zero, the highlight area of character would display the wrong result","torrent":{"xt":"urn:btih:4e72e5e0f1e747a6e0e2ebf4e18584670b71e528","amp;dn":"Reallusion+iClone+Character+Creator+1.51.2001.1+%28x64%29+%2B+Content","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e72e5e0f1e747a6e0e2ebf4e18584670b71e528","infoHashBuffer":{"type":"Buffer","data":[78,114,229,224,241,231,71,166,224,226,235,244,225,133,132,103,11,113,229,40]},"announce":[],"urlList":[]}}