{"title":"Where the Jews Aren't (2016) by Masha Gessen","uid":15876182,"size":8327108,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e769ecf98393d4b007c8394b1d46fffd19df981&amp;dn=Where+the+Jews+Aren%27t+%282016%29+by+Masha+Gessen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":4,"uploader":"Dr.Soc","files":3,"time":1474513735,"description":"Where the Jews Aren't: The Sad and Absurd Story of Birobidzhan, Russia's Jewish Autonomous Region by Masha Gessen\r\nHardcover: 192 pages\r\nPublisher: Schocken (August 23, 2016)\r\nLanguage: English\r\nISBN-10: 0805242465\r\nISBN-13: 978-0805242461\r\nFormat: Mobi, ePub\r\n\r\nFrom the acclaimed author of The Man Without a Face, the previously untold story of the Jews in twentieth-century Russia that reveals the complex, strange, and heart-wrenching truth behind the familiar narrative that begins with pogroms and ends with emigration.\r\n\r\nIn 1929, the Soviet government set aside a sparsely populated area in the Soviet Far East for settlement by Jews. The place was called Birobidzhan. The idea of an autonomous Jewish region was championed by Jewish Communists, Yiddishists, and intellectuals, who envisioned a haven of post-oppression Jewish culture. By the mid-1930s tens of thousands of Soviet Jews, as well as about a thousand Jews from abroad, had moved there. The state-building ended quickly, in the late 1930s, with arrests and purges instigated by Stalin. But after the Second World War, Birobidzhan received another influx of Jews—those who had been dispossessed by the war. In the late 1940s a second wave of arrests and imprisonments swept through the area, traumatizing Birobidzhanâ™s Jews into silence and effectively shutting down most of the Jewish cultural enterprises that had been created. Where the Jews Arenâ™t is a haunting account of the dream of Birobidzhan—and how it became the cracked and crooked mirror in which we can see the true story of the Jews in twentieth-century Russia","torrent":{"xt":"urn:btih:4e769ecf98393d4b007c8394b1d46fffd19df981","amp;dn":"Where+the+Jews+Aren%27t+%282016%29+by+Masha+Gessen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e769ecf98393d4b007c8394b1d46fffd19df981","infoHashBuffer":{"type":"Buffer","data":[78,118,158,207,152,57,61,75,0,124,131,148,177,212,111,255,209,157,249,129]},"announce":[],"urlList":[]}}