{"title":"Pimsleur German Audiobook Course I, II, III, &amp; Plus","uid":4692115,"size":469649476,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4ec316f41d7c4321be0f79a78ef94ef0ac870790&amp;dn=Pimsleur+German+Audiobook+Course+I%2C+II%2C+III%2C+%26+Plus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"petersky","files":169,"time":1233429551,"description":"Each of the CD's in this commercial program contains about an hour of audio, and with 53 CD's in all, that's a good 53+ hours of practice in speaking German to be had.  The teaching method is well-regarded and considered sound, and the quality of the voice actors and recording is uniformly high.  The full sales pitch is given in the included manual.txt file.\n\nGerman I, II, III ripped from the commercial CD-ROMs (48 discs) into FLAC by Exact Audio Copy and then further compressed into 48 kbps VBR by LAME (using foobar2000). German Plus downloaded from existing torrent in presumably 128 kbps MP3 files (each about 30MB per 30 minute file) and compressed--lossy to lossy (transcoding)--into 48 kbps VBR MP3 files (again with LAME).\n\nThe assumption is that these MP3 files are destined not for audiophiles but rather for people who will listen to each once or twice and greatly value the smaller download over any (negligible for the spoken word) gain in sound quality from distributing the FLAC's or larger lossy files.\n\nAnother way in which fat was reduced is that identical files duplicated across Pimsleur CD's were removed.  This meant that you get one copy, not two, of each of the Readings for the Pimsleur German I.  It also means that you don't get the &quot;Instant Immersion&quot; set, which is really just the first sixteen lessons of Pimsleur German I, packaged with a new name in a market segmentation scheme.\n\nThe other significant difference from other rips of the Pimsleur German learning course is that the reading booklets (for I, II, and III) have been entered into machine-readable txt and printable PDF.  Other rips have used images from scanners embedded in PDF's.  Although the files provided here result in higher quality printed pages, some may still want to track down the images and are free to do so.\n\nA note about German III (copyright 1998) is that it was recorded by a different process (a less production-savvy one) by the course writer, while German I and II (copyright 2002) were recorded more professionally with a separate director and sound engineers.  So if you don't like the sound of German III, you can blame Simon &amp; Schuster.  But it is quite serviceable in fact (not annoyingly bad) once you start doing the course; the main problem is one of perception, that it is jarring at first, given the high quality of German I and II.\n\nEnjoy and please seed.","torrent":{"xt":"urn:btih:4ec316f41d7c4321be0f79a78ef94ef0ac870790","amp;dn":"Pimsleur+German+Audiobook+Course+I%2C+II%2C+III%2C+%26+Plus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ec316f41d7c4321be0f79a78ef94ef0ac870790","infoHashBuffer":{"type":"Buffer","data":[78,195,22,244,29,124,67,33,190,15,121,167,142,249,78,240,172,135,7,144]},"announce":[],"urlList":[]}}