{"title":"Murdoch Mysteries - Season 07 (2013-2014) - 18 HD Episodes","uid":10809243,"size":12655469083,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4edb05eb1eaf6104ad661db66578a058799db71d&amp;dn=Murdoch+Mysteries+-+Season+07+%282013-2014%29+-+18+HD+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":19,"uploader":"bnaron","files":-1,"time":1408407505,"description":"Murdoch Mysteries - Season 07 (2013-2014) - 18 High Definition Episodes\n\n\nSeries Description Courtesy of:\n\nWikipedia, the free encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Murdoch_Mysteries&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Murdoch_Mysteries&lt;/a&gt;\n\nMurdoch Mysteries is a Canadian drama television series aired on both City and CBC Television, featuring Yannick Bisson as William Murdoch, a police detective working in Toronto, Ontario, around the turn of the twentieth century. The television series is based on the series of novels by Maureen Jennings.\n\nThe series takes place in Toronto starting in 1895 and follows Detective William Murdoch (Yannick Bisson) of the Toronto Constabulary, who solves many of his cases using methods of detection that were unusual at the time. These methods include fingerprinting (referred to as &quot;finger marks&quot; in the series), blood testing, surveillance, and trace evidence.\n\nSome episodes feature anachronistic technology whereby Murdoch sometimes uses the existing technology of his time to improvise a crude prototype of a technology that would be more readily recognizable to the show's 21st-century audience. In one episode, for instance, he creates a primitive version of sonar to locate a sunken ship in Lake Ontario. In another, he effectively invents wire-tapping. In still another, a foreign police officer has a photograph which Murdoch needs as evidence, so Murdoch asks the other officer to overlay the photograph with a grid which is numerically coded for the color in each square, and then to transmit the numerical data to Murdoch via telegraph, with the end result that the foreign officer has essentially sent Murdoch a bitmap image they call a &quot;facsimile&quot;, a telefax.\n\nOn April 2, 2013, CBC renewed Murdoch Mysteries for a seventh season, to consist of an extended order of 18 episodes instead of the usual 13. The seventh season had its premiere on September 30, 2013 Alibi premiered the season in the United Kingdom on January 27, 2014. Alibi premiered the season in the United Kingdom on January 27, 2014.\n\n\nEpisode Synopses Courtesy of:\n\nThe On-line TV Database\nAn Open Database for Television Fans &lt;a href=&quot;\nhttp://www.thetvdb.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetvdb.com&lt;/a&gt;\n\n\n2013-09-30 - Murdoch Ahoy (Video:H264 1280x720, 1969kbps, 24fps - Audio:AAC 44.1kHz, 99kbps)\n\nDetective Murdoch and Inspector Brackenreid are aboard the SS Keewatin after the owner, Clarence MacFarlane, receives what he believes is a threat. The Keewatin is about to depart from Toronto on its maiden voyage destined for Rochester, N.Y. and Murdoch thinks they should stay on board, especially after he sees that Julia is one of the invited guests. Their presence proves useful after MacFarlane's daughter Amy, who is engaged to her father's chief financial officer Owen Mathers, falls overboard and is nowhere to be found. As Murdoch investigates he finds there is a real threat against the Keewatin and the true facts behind Amy's disappearance. \n\n\n2013-10-07 - Tour de Murdoch (Video:H264 1280x720, 1960kbps, 24fps - Audio:AAC 44.1kHz, 102kbps)\n\nDetective Murdoch investigates the sudden death of bicycle racer Joe Fenton. Murdoch was himself a participant in the race trying out his newfangled gear shifting device but Fenton was the favorite having won several recent races. Fenton's manager, Chippy Blackburn, was seen giving him a potion and they suspect he may be may be fixing races. Dr. Grace however is having considerable difficulty finding a cause of death and with Dr. Ogden's assistance performs her first brain bisection.\n\n\n2013-10-14 - The Filmed Adventures of Detective William Murdoch (Video:H264 1280x720, 1963kbps, 24fps - Audio:AAC 44.1kHz, 101kbps)\n\nDetective Murdoch and many others attend a special showing of a film that will also include sound. The man behind the scheme is James Pendrick and his main competitor, Thomas Edison, is also present for the showing. The film includes a scene where a shot is fired but when the lights come up, one of the patrons, Pendrick's principal investor, has been shot in the head.\n\n\n2013-10-21 - Return of Sherlock Holmes (Video:H264 1280x720, 1967kbps, 24fps - Audio:AAC 44.1kHz, 100kbps)\n\nMurdoch finds his investigation into a nanny's disappearance assisted by the man who considers himself the real Sherlock Holmes.\n\n\n2013-10-28 - Murdoch of the Living Dead (Video:H264 1280x720, 1968kbps, 24fps - Audio:AAC 44.1kHz, 97kbps)\n\nDetective Murdoch investigates the death of Emily Fuller whose body is found on the riverbank. They trace her to her home where her husband Jeremiah is completely impassive. The dead woman's daughter Betty says her father has been like this since he had been away recently for a few days. Dr. Grace determines that the Emily did not drown, as they had initially suspected, but was strangled by someone with a very large hand. Constable Crabtree thinks he knows what's happened after he finds that Jeremiah is officially dead - he's now a Haitian zombie, risen from the dead. After Dr. Grace finds that a second victim's brain has been operated on, Murdoch thinks he knows who they are dealing with.\n\n\n2013-11-04 - Murdochophobia (Video:H264 1280x720, 1964kbps, 24fps - Audio:AAC 44.1kHz, 101kbps)\n\nDetective Murdoch investigates the death of Sarah Bosen who apparently threw herself from her hospital room window and breaking her neck in the fall. Sarah was being treated by Julia Ogden for arachnophobia and had been making some progress in overcoming her fears. Murdoch however finds a dead spider in her room. The three remaining members of the treatment group begin to have their doubts about their therapy. Julia's colleague, Dr. Charles Linden, thinks her therapy is a waste of time and as far as he is concerned, Sarah's death proves him correct. He launches a formal complaint to have her research terminated. When her other patients are forced to face their phobias, Murdoch concludes that someone is trying to kill her patients. Meanwhile, Crabtree tries to save his pet spider from Dr. Grace's experiments and Dr. Ogden helps Murdoch overcome his own irrational fear.\n\n\n2013-11-18 - Loch Ness Murdoch (Video:H264 1280x720, 1961kbps, 24fps - Audio:AAC 44.1kHz, 102kbps)\n\nDetective Murdoch investigates the death of Katie Buchanan who is found dead at the beach, on a hot summer's day, by her friend Elaine Lawson. Both were entrants in a beauty pageant known as the Miss Purity competition, to select the new face of Alexander soap. Dr. Ogden, who is spending her day off at the beach finds what appears to be a large animal bite on the woman's torso. Katie's boyfriend, James Bennett, had recently left her for another competitor, Marie Nicholson and becomes the prime suspect. Inspector Brackenreid however is certain he saw a monster in Lake Ontario and Murdoch is skeptical until he too sees a creature in the water. Constable Crabtree is dismissive of any suggestion that there might be a monster in the water and pursues a more realistic line of inquiry.\n\n\n2013-11-25 - Republic of Murdoch (Video:H264 1280x720, 1959kbps, 24fps - Audio:AAC 44.1kHz, 102kbps)\n\nDetective Murdoch investigates the death of Peter Farrelly who had a loud altercation with someone the night before his body was found. Dr. Grace determines he was beaten to death. She also found chloral hydrate in his system - a bottle of which they found in the victim's luggage. They believe both the victim and his killer are from Newfoundland and so Murdoch and Crabtree head off to St. John's in the hopes of finding the suspected killer Ezekiel Farrelly. Crabtree was actually raised in St. John's by several aunts who, it turns out, have an interesting occupation. The solution to murder lies with finding an old pirate treasure map.\n\n\n2013-12-02 - A Midnight Train to Kingston (Video:H264 1280x720, 1966kbps, 24fps - Audio:AAC 44.1kHz, 100kbps)\n\nDetective Murdoch, Inspector Brackenreid, Dr. Ogden and several others are transporting serial killer James Gillies to the prison in Kingston, Ontario where he is scheduled to be executed the next day. It creates a bit of a stir among the passengers when they learn who is being transported. Among them are Aaron Rauls, a late arrival on the train and Nathaniel Henry. Both come under suspicion when the police find a dead man, Dennis Bolton who was released from the Don jail just a week ago. There's no direct connection between Bolton and Gillies but both were in the same jail at the same time. As tensions rise, it becomes evident that Gillies has arranged for several ex-convicts to be on the train - all part of his plan to escape.\n\n\n2014-01-06 - Murdoch in Ragtime (Video:H264 1280x720, 1968kbps, 24fps - Audio:AAC 44.1kHz, 99kbps)\n\nDetective Murdoch investigates the murder of Nathan Peters, a jazz musician and renowned band-leader, who was found dead at the docks. His group, the Jubilee Singers, was performing nearby and his wife had already reported him missing. Dr. Emily Grace determines that he died in the early hours of the morning from a blow to the head causing a subdural hemorrhage. The evidence in the case begins to point to one of the Jubilee Singers as the perpetrator. Much to George Crabtree's \n\n\n2014-01-13 - Journey to the Centre of Toronto (Video:H264 1280x720, 1973kbps, 24fps - Audio:AAC 44.1kHz, 101kbps)\n\nMurdoch investigates a rash of tunneling robberies that Crabtree is convinced were perpetrated by a species of mole people.\n\n\n2014-01-20 - Unfinished Business (Video:H264 1280x720, 1962kbps, 24fps - Audio:AAC 44.1kHz, 100kbps)\n\nAfter a dying man confesses a murder in what appears to be an open and shut case, Murdoch finds a body but suspects the real killer might still be alive.\n\n\n2014-01-27 - The Murdoch Sting (Video:H264 1280x720, 1961kbps, 24fps - Audio:AAC 44.1kHz, 99kbps)\n\nMurdoch orchestrates an elaborate sting when a past suspect returns with a deadly con.\n\n\n2014-03-03 - Friday the 13th, 1901 (Video:H264 1280x720, 1968kbps, 24fps - Audio:AAC 44.1kHz, 99kbps)\n\nJulia and Emily go to a bachelorette party; Murdoch and the boys get involved in a high stakes curling match.\n\n\n2014-03-10 - The Spy Who Came Up to the Cold (Video:H264 1280x720, 1960kbps, 24fps - Audio:AAC 44.1kHz, 97kbps)\n\nThe assassination of U.S. President McKinley in Buffalo prompts a roundup of Canada's anarchists, landing Murdoch in the middle of a web of international espionage and intrigue.\n\n\n2014-03-24 - Kung Fu Crabtree (Video:H264 1280x720, 2888kbps, 23fps - Audio:AAC 44.1kHz, 239kbps)\n\nWhen a Chinese dignitary visiting Toronto is poisoned, Crabtree teams up with the prime suspect, who he believes to be innocent, in order to track down the real killer.\n\n\n2014-03-31 - Blast of Silence (Video:H264 1280x720, 1979kbps, 24fps - Audio:AAC 44.1kHz, 100kbps)\n\nA local industrialist is tied to the top of a telephone pole with a noise-activated bomb strapped to his chest. While Murdoch and his colleagues deal with the dilemma, Mayor Clarkson orders nearby businesses to be shut down to minimize sound pollution. However, the politician finds himself the criminal's next target. \n\n\n2014-04-07 - The Death of Dr. Ogden (Video:H264 1280x720, 1962kbps, 24fps - Audio:AAC 44.1kHz, 101kbps)\n\nMurdoch orchestrates an elaborate sting when a past suspect returns with a deadly con.\n\n\n","torrent":{"xt":"urn:btih:4edb05eb1eaf6104ad661db66578a058799db71d","amp;dn":"Murdoch+Mysteries+-+Season+07+%282013-2014%29+-+18+HD+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4edb05eb1eaf6104ad661db66578a058799db71d","infoHashBuffer":{"type":"Buffer","data":[78,219,5,235,30,175,97,4,173,102,29,182,101,120,160,88,121,157,183,29]},"announce":[],"urlList":[]}}