{"title":"Guns N Roses Use Your Illusion II","uid":8261780,"size":109772581,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4edf21b4a2d4fc837e2b3955a6b76fe8b92da77f&amp;dn=Guns+N+Roses+Use+Your+Illusion+II+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"Ironmaiden2013","files":-1,"time":1363398679,"description":"Use Your Illusion II is the fourth studio album by the American rock band Guns N' Roses. It was one of two albums released in conjunction with the Use Your Illusion Tour, and as a result the two albums are sometimes considered a double album. Bolstered by the lead single &quot;You Could Be Mine&quot;, Use Your Illusion II was the slightly more popular of the two albums, selling 770,000 copies its first week and debuting at No. 1 on the U.S. charts, ahead of Use Your Illusion I's first week sales of 685,000.[7] Both albums have since been certified 7Ã— Platinum by the RIAA.[8] It was also No. 1 on the UK Albums Chart for a single week. The album has recently received critical acclaim again in 2011, being featured on Triple M Radio's Life-Changing Album series in Australia, with the station playing numerous tracks with commentary.[9] This was the last Guns N' Roses album to feature rhythm guitarist Izzy Stradlin. It also included the last Guns N' Roses song to feature drummer Steven Adler (Civil War).\n\nOverview\n\nThe Use Your Illusion albums were a stylistic turning point for Guns N' Roses  In addition, Use Your Illusion II is more political than most of their previous work, with songs like &quot;Civil War&quot;, a cover of Bob Dylan's &quot;Knockin' on Heaven's Door&quot;, and &quot;Get in the Ring&quot; dealing respectively with the topics of violence, law enforcement, and media bias. The thematic material deals less with drug use than previous Guns N' Roses albums. Use Your Illusion I featured mostly songs pre-Appetite for Destruction (with notable exceptions) while Use Your Illusion II featured more tracks written during and after Appetite For Destruction.\n\nThe band's cover of &quot;Knockin' on Heaven's Door&quot; had been released almost a year earlier on the Days of Thunder soundtrack, while &quot;Civil War&quot; was debuted at the 1990 Farm Aid concert. That concert also featured Guns N' Roses playing a cover of the U.K. Subs song &quot;Down on the Farm,&quot; a studio version of which would later appear on the band's 1993 release of cover songs, &quot;The Spaghetti Incident?&quot;. &quot;Civil War&quot; was released as a B-side to &quot;You Could Be Mine&quot;. The song had also been released on a charity album called Nobody's Child, a fund-raising compilation for Romanian orphans.\n\n&quot;You Could Be Mine&quot; was released in June 1991 and is featured in the film Terminator 2: Judgment Day. The song was not released on the actual T2 soundtrack. The band also filmed a video featuring Arnold Schwarzenegger in character as the Terminator, with a loose plot featuring Axl Rose as its &quot;target&quot;. The original subject matter of the song dealt with Izzy Stradlin's failed relationship with ex-girlfriend Angela Nicoletti.\n\nThe Use Your Illusion albums can be considered a single cohesive work, and certain elements of Use Your Illusion II underscore this intent. For instance, both albums have a version of the song &quot;Don't Cry&quot;, and both have one cover song; &quot;Live and Let Die&quot; by Paul McCartney (Use Your Illusion I) and &quot;Knockin' on Heaven's Door&quot; by Bob Dylan (Use Your Illusion II). Each also has at least one track sung by other members of the band: lead vocals on &quot;So Fine&quot; are performed by bassist Duff McKagan and the song was dedicated to Johnny Thunders, who died from a drug overdose before the recording of the album.\n\nThe song &quot;Get in the Ring&quot; finds the band lashing out at a career's worth of critics and enemies. Among those referred to by name are editors of several entertainment magazines.\n\n&quot;My World,&quot; the final track, was a surprise to a few members of the band. The track was essentially Axl Rose solo, and most band members did not even know it existed until the album was released.\n\nTo achieve the final mix of the album, the band had some difficulty, especially during the mixing stages of the production of both albums. According to a 1991 cover story by Rolling Stone magazine, after mixing 21 tracks with engineer/producer Bob Clearmountain, the band fired Clearmountain when he tried to replace the real drums with samples. According to Slash's autobiography, &quot;one afternoon we discovered a notepad of his where he'd notated all the drum samples he planned to mix in over Matt's drum tracks&quot; the band decided to scrap the mixes and start from scratch with engineer Bill Price of Sex Pistols fame.[10]\n\nSlash has stated that most of the material for the album was written on acoustic guitars in a couple of nights at his house (the Walnut House), after several months of non-productivity\n\nTrack Listing:\n\n1. \t&quot;Civil War&quot;   \n2. \t&quot;14 Years&quot;   \t\n3. \t&quot;Yesterdays&quot;   \t\n4. \t&quot;Knockin' on Heaven's Door&quot;\n5. \t&quot;Get in the Ring&quot;   \n6. \t&quot;Shotgun Blues&quot;   \t\n7. \t&quot;Breakdown&quot;  \n8. \t&quot;Pretty Tied Up&quot;   \n9. \t&quot;Locomotive&quot;   \t\n10. \t&quot;So Fine&quot;   \n11. \t&quot;Estranged&quot;   \t\n12. \t&quot;You Could Be Mine&quot;   \n13. \t&quot;Don't Cry&quot; (Alternate lyrics) \n14. \t&quot;My World&quot; \n\nThis is my favorite Guns N'Roses album. I have to admit that I hate Axl Rose as much as I love his voice but still this was a very good band that lasted for a very short time. I believe they could have still be together with all the original members but they were lazy, alcoholics and drug addicts. That's why today they are just a legend. And the so called Guns N'Roses (Chinese Democracy) Album is not Guns N'Roses at all. To me Guns N'Roses is the original Band that is in this album, not just Axl Rose with some other musicians. Anyways that's just my opinion I don't expect you to think like I do. Regardless of anything they had their glory days and this album captures GNR at their best.\n\nEnjoy and Seed if you can.\n\nIf You sync this on I Tunes it will have the lyrics.\n","torrent":{"xt":"urn:btih:4edf21b4a2d4fc837e2b3955a6b76fe8b92da77f","amp;dn":"Guns+N+Roses+Use+Your+Illusion+II+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4edf21b4a2d4fc837e2b3955a6b76fe8b92da77f","infoHashBuffer":{"type":"Buffer","data":[78,223,33,180,162,212,252,131,126,43,57,85,166,183,111,232,185,45,167,127]},"announce":[],"urlList":[]}}