{"title":"The Hot Chick(2002)DVDRip.AC3(ENG)-DROCK","uid":6393318,"size":733433137,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4f599950e8540f708821d41789f917cfe20535b4&amp;dn=The+Hot+Chick%282002%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":1,"uploader":"drock232","files":-1,"time":1305428174,"description":"A carefree young woman wakes up to discover her greatest nightmare is a reality -- she's become trapped in the body of Rob Schneider -- in this shape-shifting comedy. Jessica (Rachel McAdams) is a beautiful teenager whose life would be the envy of any high school student -- she's head of the cheerleading squad, her boyfriend, Billy (Matthew Lawrence), is the quarterback of the football team, and she's pretty and popular enough to get nearly anyone to do what she wants. However, Jessica is soon to find out how the other half lives, in more ways than she counted upon; she shoplifts a pair of earrings from an shop specializing in African curios run by Mambuza (Angie Stone), unaware that they carry the curse of Princess Nawa. Thanks to the curse, the next morning Jessica awakes to find that her spirit has entered the body of Clive (Rob Schneider), a sweaty and hirsute small-time crook. As Jessica tries to figure out how she can return to her old body, she has to lead the cheerleading squad to victory and attend her senior prom while looking like a less-than-handsome 30-year-old man. Billy is understandably puzzled by the changes in Jessica, while her best friend, April (Anna Faris), finds her feelings about Jessica change a bit once she volunteers to be her prom date. The Hot Chick is the first theatrical feature for director Tom Brady; Brady co-wrote an earlier Schneider vehicle, The Animal, and was on the writing staff for his television series Men Behaving Badly.\n\nRipped with Handbrake.\n\nLength: 1 Hour 44 Minutes \n\nFile Type: MP4","torrent":{"xt":"urn:btih:4f599950e8540f708821d41789f917cfe20535b4","amp;dn":"The+Hot+Chick%282002%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f599950e8540f708821d41789f917cfe20535b4","infoHashBuffer":{"type":"Buffer","data":[79,89,153,80,232,84,15,112,136,33,212,23,137,249,23,207,226,5,53,180]},"announce":[],"urlList":[]}}