{"title":"The Human Superorganism (2016) by Rodney Dietert","uid":15760799,"size":902896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f62282fd5bd872640ea8d6ee787b49472083360&amp;dn=The+Human+Superorganism+%282016%29+by+Rodney+Dietert&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":0,"uploader":"Dr.Soc","files":1,"time":1473110618,"description":"Rodney Dietert, &quot;The Human Superorganism: How the Microbiome Is Revolutionizing the Pursuit of a Healthy Life&quot;\r\nISBN: 1101983906 | 2016 | EPUB | 352 pages | 882 KB\r\n\r\nThe origin of asthma, autism, Alzheimer's, allergies, cancer, heart disease, obesity, and even some kinds of depression is now clear. Award-winning researcher on the microbiome, professor Rodney Dietert presents a new paradigm in human biology that has emerged in the midst of the ongoing global epidemic of noncommunicable diseases.\r\n\r\nThe Human Superorganism makes a sweeping, paradigm-shifting argument. It demolishes two fundamental beliefs that have blinkered all medical thinking until very recently: 1) Humans are better off as pure organisms free of foreign microbes; and 2) the human genome is the key to future medical advances. The microorganisms that we have sought to eliminate have been there for centuries supporting our ancestors. They comprise as much as 90 percent of the cells in and on our bodies—a staggering percentage! More than a thousand species of them live inside us, on our skin, and on our very eyelashes. Yet we have now significantly reduced their power and in doing so have sparked an epidemic of noncommunicable diseases—which now account for 63 percent of all human deaths.\r\n\r\nUltimately, this book is not just about microbes; it is about a different way to view humans. The story that Dietert tells of where the new biology comes from, how it works, and the ways in which it affects your life is fascinating, authoritative, and revolutionary. Dietert identifies foods that best serve you, the superorganism; not new fad foods but ancient foods that have made sense for millennia. He explains protective measures against unsafe chemicals and drugs. He offers an empowering self-care guide and the blueprint for a revolution in public health. We are not what we have been taught. Each of us is a superorganism. The best path to a healthy life is through recognizing that profound truth","torrent":{"xt":"urn:btih:4f62282fd5bd872640ea8d6ee787b49472083360","amp;dn":"The+Human+Superorganism+%282016%29+by+Rodney+Dietert","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f62282fd5bd872640ea8d6ee787b49472083360","infoHashBuffer":{"type":"Buffer","data":[79,98,40,47,213,189,135,38,64,234,141,110,231,135,180,148,114,8,51,96]},"announce":[],"urlList":[]}}