{"title":"And Man Created God: The World at the Time of Jesus","uid":15796243,"size":2831617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f7f1aca440437041abc5d3cd80628f5bfb34af7&amp;dn=And+Man+Created+God%3A+The+World+at+the+Time+of+Jesus&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":0,"uploader":"marty14","files":1,"time":1473460633,"description":"And Man Created God: The World at the Time of Jesus - Selina O'Grady [epub]\r\n\r\nAt the time of Jesus' birth, the world was full of gods. Thousands of them jostled, competed, and merged with one another. In Syria, ecstatic devotees castrated themselves in the streets to become priests of Atargatis. In Galilee, holy men turned oil into wine, healed the sick, drove out devils, and claimed to be the Messiah. Every day thousands of people were flocking into brand-new multiethnic cities. The ancient world was in ferment as it underwent the first phase of globalization, and in this ferment, rulers and ruled turned to religion as a source of order and stability.\r\n\r\nTo explore the power that religious belief has had over societies through the ages, Selina O'Grady takes the reader on a dazzling journey across the empires of the ancient world and introduces us to rulers, merchants, messiahs, priests, and holy men. Throughout, she seeks to answer why, amongst the countless religious options available, the empires at the time of Jesus &quot;chose&quot; the religions they did. Why did China's rulers hitch their fate to Confucianism? Why was a tiny Jewish cult led by Jesus eventually adopted by Rome's emperors? The Jesus cult, followed by no more than one hundred people at the time of his death, should, by rights, have disappeared in a few generations. Instead it became the official religion of the Roman Empire. Why did Christianity grow so quickly to become the predominant world religion? And Man Created God, an important, thrilling and necessary new work of history, looks at why and how religions have had such an immense impact on human history, and in doing so, uncovers the ineradicable connection between politics and religion―a connection that still defines us in our own age","torrent":{"xt":"urn:btih:4f7f1aca440437041abc5d3cd80628f5bfb34af7","amp;dn":"And+Man+Created+God%3A+The+World+at+the+Time+of+Jesus","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f7f1aca440437041abc5d3cd80628f5bfb34af7","infoHashBuffer":{"type":"Buffer","data":[79,127,26,202,68,4,55,4,26,188,93,60,216,6,40,245,191,179,74,247]},"announce":[],"urlList":[]}}