{"title":"Hitler's Scientists: Science, War and the Devil's Pact","uid":16033470,"size":4375513,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4fc783c75f5ae638b48063fa8698a02fb137c06d&amp;dn=Hitler%27s+Scientists%3A+Science%2C+War+and+the+Devil%27s+Pact&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":3,"uploader":"marty14","files":1,"time":1476452839,"description":"Hitler's Scientists: Science, War and the Devil's Pact - John Cornwell [epub]\r\n\r\nWhen Hitler came to power in the 1930s, Germany had led the world in science, mathematics, and technology for nearly four decades. But while the fact that Hitler swiftly pressed Germany's scientific prowess into the service of a brutal, racist, xenophobic ideology is well known, few realize that German scientists had knowingly broken international agreements and basic codes of morality to fashion deadly weapons even before World War I. In Hitler's Scientists, British historian John Cornwell explores German scientific genius in the first half of the twentieth century and shows how Germany's early lead in the new physics led to the discovery of atomic fission, which in turn led the way to the atom bomb, and how the ideas of Darwinism were hijacked to create the lethal doctrine of racial cleansing. \r\n\r\nBy the war's end, almost every aspect of Germany's scientific culture had been tainted by the exploitation of slave labor, human experimentation, and mass killings. Ultimately, it was Hitler's profound scientific ignorance that caused the Fatherland to lose the race for atomic weapons, which Hitler would surely have used. Cornwell argues that German scientists should be held accountable for the uses to which their knowledge was put-an issue with wide-ranging implications for the continuing unregulated pursuit of scientific progress","torrent":{"xt":"urn:btih:4fc783c75f5ae638b48063fa8698a02fb137c06d","amp;dn":"Hitler%27s+Scientists%3A+Science%2C+War+and+the+Devil%27s+Pact","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fc783c75f5ae638b48063fa8698a02fb137c06d","infoHashBuffer":{"type":"Buffer","data":[79,199,131,199,95,90,230,56,180,128,99,250,134,152,160,47,177,55,192,109]},"announce":[],"urlList":[]}}