{"title":"Fringe Season 1, 2, 3, 4 &amp; 5 + Extras BDRip DVDRip TSV","uid":8806849,"size":41219900217,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4fca249e688c430e181fb4edcd03647d840e8d7d&amp;dn=Fringe+Season+1%2C+2%2C+3%2C+4+%26amp%3B+5+%2B+Extras+BDRip+DVDRip+TSV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":62,"uploader":"TSV","files":-1,"time":1376355832,"description":"All episodes from all 5 seasons Bluray rip/DVDRip + all the extras (Deleted Scenes, Interviews, Behind the Scenes etc.)\n\nPlease seed at a decent speed for as long as possible,\n\n\nEnjoy,\n\nTSV.\n\n\n\n\nFringe is an American science fiction television series created by J. J. Abrams, Alex Kurtzman, and Roberto Orci. It premiered on the Fox Broadcasting network on September 9, 2008, and concluded on January 18, 2013, after five seasons and 100 episodes. The series follows Olivia Dunham (Anna Torv), Peter Bishop (Joshua Jackson), and Walter Bishop (John Noble), members of a Federal Bureau of Investigation &quot;Fringe Division&quot; team based in Boston, Massachusetts under the supervision of Homeland Security. The team uses &quot;fringe&quot; science and FBI investigative techniques to investigate a series of unexplained, often ghastly occurrences, which are related to mysteries surrounding a parallel universe. The series has been described as a hybrid of The X-Files, Altered States, and The Twilight Zone.\n\nThe series format combines elements from procedural dramas as well as those found in serials. The series began as a more traditional &quot;mystery of the week&quot; series, and became more serialized in later seasons. A majority of episodes contain a standalone plot, with several episodes also exploring the series' overarching mythology.\n\nEarly critical reception of the first season was lukewarm but became more favorable in subsequent seasons, when the series began to explore its mythology, including parallel universes and alternate timelines. The show, as well as the cast and crew, has been nominated for many major awards. Despite its move to the &quot;Friday night death slot&quot; and low ratings, the series has received a cult following. The series has also spawned two six-part comic book series and an alternate reality game.","torrent":{"xt":"urn:btih:4fca249e688c430e181fb4edcd03647d840e8d7d","amp;dn":"Fringe+Season+1%2C+2%2C+3%2C+4+%26amp%3B+5+%2B+Extras+BDRip+DVDRip+TSV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fca249e688c430e181fb4edcd03647d840e8d7d","infoHashBuffer":{"type":"Buffer","data":[79,202,36,158,104,140,67,14,24,31,180,237,205,3,100,125,132,14,141,125]},"announce":[],"urlList":[]}}