{"title":"The Acacia Strain - Coma Witch  mp3  (2014)","uid":11200829,"size":155951066,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5054686e22092a1e9d00f4d712c55c5c67713475&amp;dn=The+Acacia+Strain+-+Coma+Witch++mp3++%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":0,"uploader":"analogkid6103","files":11,"time":1413167815,"description":"\nThe Acacia Strain is a deathcore band from Chicopee, Massachusetts formed in 2001. The band has gone through several lineup changes and vocalist Vincent Bennett is the only current original member. The Acacia Strain is currently signed to Rise Records.\nimage\nOriginally founded in 2001, the band itself has undergone numerous changes in the member line-up. To date they have released six studio albums, as well as two split albums: one with Loyal to the Grave (on which they covered the Slayer song &quot;Seasons in the Abyss&quot; ) and another with This or the Apocalypse, War from a Harlots Mouth, Fact, and Aggressive Dogs. The band has worked with acclaimed producers Adam Dutkiewicz and Chris &quot;Zeuss&quot; Harris.\n\nIn December 2009, The Acacia Strain toured as direct support for Hatebreed as part of the Stillborn Fest alongside Crowbar, The Casualties, and Thy Will Be Done.\n\nThe band released their DVD, The Most Known Unknown, on February 16, 2010. The band reached the Billboard Top 200 albums chart in 2008 with Continent and 2010 with Wormwood.\n\nThey performed at Warped Tour 2011 on the Advent Clothing stage along with We Came As Romans, Set Your Goals, Winds of Plague, Miss May I, and others.\n\nIn April 17, 2012, it was announced that The Acacia Strain had signed to Rise Records, announcing plans for a new album in October 2012.\n\nOn April 25, 2012, a new song, titled &quot;Servant in the Place of Truth&quot;, was released digitally, and at the time was also in anticipation of their upcoming album, which will be released in the fall\n\nOn July 18, 2012, The Acacia Strain announced the title of their new upcoming album, Death is the Only Mortal. It is set for release on October 9, 2012.\n\nOn August 10, 2012, The band announced the track listing for Death is the Only Mortal and released the album art via their Facebook page. However, the single &quot;Servant in the Place of Truth&quot; is not listed on the album. Guitarist Daniel &quot;DL&quot; Laskiewicz later confirmed that it was just a non-album single.\n\nOn September 6, 2012, an official single off &quot;Death is the Only Mortal&quot; was released titled &quot;Victims of the Cave&quot; as a lyric video on Rise Records' YouTube channel.\n\nIn November 2012 The band performed at the U.K. Van's Warped Tour as well as supporting Architects on the U.K leg of the &quot;Daybreaker 'Almost' World Tour&quot;.\n\nOn November 27, 2012, The Acacia Strain was involved in a rollover accident, which prevented them from touring with Veil of Maya thereafter.\n\nOn May 18, 2013, Daniel &quot;DL&quot; Laskiewicz announced via his Facebook page that The Acacia Strain had moved on without him and that he was no longer a part of the band.\n\nOn June 4, 2013, the band announced that they had introduced two new full-time guitarists to join their line-up, Devin Shidaker (ex-Oceano) and Richard Gomez (ex-Molotov Solution).\nimage\nOn August 12, the band revealed the upcoming title of the album to be Coma Witch, which is set for release on October 14. The band also released the music video for the first single of the album, &quot;Cauterizer&quot;.\n\n\n\nBand Members\n\nVincent Bennett (Vocals)\nDevin Shidaker (Guitars)\nRichard Gomez (Guitars)\nJack Strorg (Bass)\nKevin Boutot (Drums)\n\n\n\nDiscography\n\n...And Life Is Very Long (2002)\n3750 (2004)\nThe Dead Walk (2006)\nContinent (2008)\nWormwood (2010)\nDeath Is The Only Mortal (2012)\nComa Witch (2014)\n\n\n\nComa Witch (2014)\n\n\n\n01 - Human Disaster\n02 - Cauterizer\n03 - Send Help\n04 - Holy Walls of the Vatican\n05 - VVorld Demise\n06 - Nailgun\n07 - Graveyard Shift\n08 - Bridgepainter\n09 - Whale Shark\n10 - Delusionalisphere\n11 - Observer\nGenre: Core\nSubgenre: Deathcore / Metalcore\nBitrate: 320 k\nSize: 148.73 MB\nShow/Hide Files:\n11 files","torrent":{"xt":"urn:btih:5054686e22092a1e9d00f4d712c55c5c67713475","amp;dn":"The+Acacia+Strain+-+Coma+Witch++mp3++%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5054686e22092a1e9d00f4d712c55c5c67713475","infoHashBuffer":{"type":"Buffer","data":[80,84,104,110,34,9,42,30,157,0,244,215,18,197,92,92,103,113,52,117]},"announce":[],"urlList":[]}}