{"title":"Grizzly Bear - Yellow House (2006)","uid":5785778,"size":120584762,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:50cda31b0f7caded7dfcf870fc379098888adc31&amp;dn=Grizzly+Bear+-+Yellow+House+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":2,"uploader":"nightissuchproximity","files":-1,"time":1282615214,"description":"ARTIST: Grizzly Bear\nTITLE: Yellow House\nLABEL: Warp Records\nGENRE: Indie\nBITRATE: 320kbps avg\nPLAYTIME: 0h 50m total\nRELEASE DATE: 2006-09-05\nRIP DATE: 2006-06-25\n\nTrack List\n----------\n1.  Easier                           3:43\n2.  Lullabye                         5:14\n3.  Knife                            5:14\n4.  Central and Remote               4:54\n5.  Little Brother                   6:24\n6.  Plans                            4:16\n7.  Marla                            4:56\n8.  On a Neck, On a Spit             5:46\n9.  Reprise                          3:19\n10. Colorado                         6:14\n\nRelease Notes:\n\nHome-recorded songs can feel incomplete whilst being as tantalizingly indicative\nas the sketches before a painting. The outlines, though interesting in their own\nrespect, are not as satisfying as the finished version. Grizzly Bear, however,\nhave approached song writing as a craft to master from their very first album,\nHorn of Plenty onwards. Enamored by how a song &quot;reads&quot;, they were fully present\nfrom prologue to denouement even though singer/songwriter Edward Droste recorded\nthem by himself in his Brooklyn bedroom. Fuelled by a bout of post-relationship\ninspiration, those first songs celebrated the creative liberation of the\nProTools era. They explored the depths of break-ups through crystal-clear tones,\nfield sounds and woozy, complex harmonies.\n\nDroste has now gathered a band: Christopher Bear (name entirely coincidental)\nplayed drums and helped polish Horn of Plenty in its final stages; Chris Taylor\nsoon followed the duo post HOP release and was responsible for electronics,\nwoodwinds and bass; Daniel Rossen sang, played guitar and contributed new songs.\nThe line-up was complete, and as a newly established four piece, they began\nmusical exploration. The music was sweet, and the instrumentation and live show\ngrew in ambition. The songs were remixed by figureheads at the forefront of the\nelectronic music scene: Efterklang, Dntel and Soft Pink Truth.\n\nThe new material that comprises Yellow House (released on Warp Records on\nSeptember 4th) puts the band at the vanguard of contemporary song writing. The\nalbum was self-recorded during an idyllic summer. The makeshift studio was\nprovided by Droste's mom's living room in a yellow house just off Cape Cod.\n\nMagical, haunting melodies are still their mainstay. Grizzly Bear always craft\ntheir songs from start to finish - meticulous instrumentation and arrangements\nare their specialty. On Yellow House, Grizzly Bear still flex their lo-fi\nconnoisseurship, but with a better recording - DIY embellished with Taylor's\nfine sonic engineering acumen. Droste and Rossen share initial song writing\nduties, although the entire band collaborates to breath life into the tracks.\n\nGrizzly Bear rediscovered &quot;Marla&quot; - a lovely downtrodden waltz written by\nDroste's aunt in the 1930s - and rescued it from history and revamped it in\nsignature Grizzly Bear style: with piano, strings, brushed drums and haunting\nlayered voices, dusted over with the faintest hint of electronics. It sounds\nlike a gorgeous day in a dusty attic. Then there is &quot;Little Brother&quot;, a folky\nguitar piece flanked by flute, and &quot;Lullabye,&quot; the sweetest\ncirrus-cloud-of-a-piece hinged on the hopeful chorus, &quot;Chin up! Cheer up!&quot; The\nphrase is layered to a massive crescendo of voices, and sounds like a sacred\nincantation. &quot;Knife&quot; is pure, sublime Grizzly Bear. &quot;Colorado&quot; is an enveloping,\nsweeping, and dare I say epic-sounding finale to a far-reaching and ambitious\nalbum.\n\nGrizzly Bear do not skimp. They're remarkable not just for their attention to\ndetail but for their concern for how a song FEELS: flush with heart and\nmelancholy, their music is seductive and intimate, deep with hazy-eyed choruses,\nwhistles, piano and banjo. They know melody and ambiance are necessary\ncomplements. This is experimental mood music with love for classics and\nstandards. It's the kind of stuff you yearn to crank up when you're lying in bed\non a Sunday.\n\nGrizzly Bear now calls Warp Records home. The label is well known for nurturing\ntalents like Aphex Twin, Squarepusher, Jamie Lidell, Maximo Park, Broadcast and\nPrefuse 73. Yellow House, will mark the bands debut for the label, melding the\nguerrilla spirit of the digital age with the classic American songbook.\n\nGrizzly Bear is Christopher Bear (drummer/vocals), Edward Droste\n(singer/guitarist), Daniel Rossen (singer/guitarist) and Christopher Taylor\n(bass/woodwinds/electronics).\n\n","torrent":{"xt":"urn:btih:50cda31b0f7caded7dfcf870fc379098888adc31","amp;dn":"Grizzly+Bear+-+Yellow+House+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50cda31b0f7caded7dfcf870fc379098888adc31","infoHashBuffer":{"type":"Buffer","data":[80,205,163,27,15,124,173,237,125,252,248,112,252,55,144,152,136,138,220,49]},"announce":[],"urlList":[]}}