{"title":"Rise of Nations - Gold Editon (PC) . MaSSaCRiSiS","uid":8415029,"size":1095284835,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:50cfa0592f5a0089faaa8ffa1d580afe451e9066&amp;dn=Rise+of+Nations+-+Gold+Editon+%28PC%29+.+MaSSaCRiSiS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":0,"uploader":"lokii_187","files":-1,"time":1367011753,"description":"Rise of Nations - Gold Edition (PC Game)\n----------------------------------------------------------------------------------\n\nTwo Rise of Nations: Gold Edition includes both the award-winning Rise of Nations and the critically acclaimed expansion pack, Rise of Nations: Thrones and Patriots. Rise of Nations is an epic, historical, real-time strategy game. Gamers experience the pulse-pounding thrill and speed of real-time gaming combined with the epic scope and depth of turn-based strategy games. The game brings to life 6,000 years of history from the ancient age to the information age -- not just in warfare but in city building, trade and diplomacy. Despite the long timeline in the game, Rise of Nations is designed with the casual audience in mind, meaning gamers will be able to move through the game quickly. Rise of Nations: Thrones &amp; Patriots adds a barrage of new features to the original game. The expansion introduces six new nations, four unique single-player campaigns, more than 20 original units, new wonders and government types.\n\n-----------------------------------------------------------------------------------\nFEATURES\n\n-Lead one of 24 nations in the single player campaigns or on a multiplayer battlefield; each nation has its own distinctive national powers and special units\n\n-Engage in five single player campaigns and more than 130 scenarios\nCampaigns include Alexander the Great, Napoleon, the New World, Cold War and the ultimate challenge, the Entire World\n\n-Command more than 240 different units and lead your armies to fight on land, sea or in the air with everything from slingers, musketeers, tanks, Persian War elephants, aircraft carriers and more\n\n-Create a truly strategic game experience by using national borders, flank attacks, spies and generals\n\n-Decide between six government types, from socialism to capitalism, despotism to republic, with different powers to customize your nation with\n\n-Combining the speed of real-time gaming with the epic scope of turn-based strategy games, Rise of Nations: Gold Edition allows players to have a fast and fun experience with the option to complete a game in less than an hour\n\n-Achieve victory through both nonmilitary and quasi-military strategies, including espionage, political maneuvering, technology races and population growth\nChallenge up to eight players on the Internet or via local area network, including in-game matchmaking\n\nT for Teen: Realistic Violence, Blood and Gore\nGenre: Real-Time Strategy\nPublisher: Microsoft\nDeveloper: Big Huge Games\n\n               *******LET US ALL GET SEEDY TO HELP THE NEEDY*******\n\nA Lokii_187 [MaSSaCRiSiS] Production","torrent":{"xt":"urn:btih:50cfa0592f5a0089faaa8ffa1d580afe451e9066","amp;dn":"Rise+of+Nations+-+Gold+Editon+%28PC%29+.+MaSSaCRiSiS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50cfa0592f5a0089faaa8ffa1d580afe451e9066","infoHashBuffer":{"type":"Buffer","data":[80,207,160,89,47,90,0,137,250,170,143,250,29,88,10,254,69,30,144,102]},"announce":[],"urlList":[]}}