{"title":"Sex Trafficking - Inside the Business of Modern Slavery (gnv64)","uid":11725488,"size":28930666,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5154809f54dc032b324c51c1fa4cef589f131660&amp;dn=Sex+Trafficking+-+Inside+the+Business+of+Modern+Slavery+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":36,"leechers":2,"uploader":"gnv65","files":5,"time":1425028314,"description":"Sex Trafficking - Inside the Business of Modern Slavery\nby Siddharth Kara\nColumbia University Press | July 2010 | ISBN-10: 0231139616 | ePUB/PDF | 20.8/5.97 mb\nPDF conversion is mine.\n\nEvery year, hundreds of thousands of women and children are abducted, deceived, seduced, or sold into forced prostitution, coerced to service \n\nhundreds if not thousands of men before being discarded. These trafficked sex slaves form the backbone of one of the world's most profitable illicit \n\nenterprises and generate huge profits for their exploiters, for unlike narcotics, which must be grown, harvested, refined, and packaged, sex slaves \n\nrequire no such &quot;processing,&quot; and can be repeatedly &quot;consumed.&quot;\n\nKara first encountered the horrors of slavery in a Bosnian refugee camp in 1995. Subsequently, in the first journey of its kind, he traveled across four \n\ncontinents to investigate these crimes and take stock of their devastating human toll. Kara made several trips to India, Nepal, Burma, Thailand, Laos, \n\nVietnam, the United Kingdom, Italy, the Netherlands, Denmark, Albania, Moldova, Mexico, and the United States. He witnessed firsthand the sale of \n\nhuman beings into slavery, interviewed over four hundred slaves, and confronted some of those who trafficked and exploited them.\n\nIn this book, Kara provides a riveting account of his journey into this unconscionable industry, sharing the moving stories of its victims and revealing \n\nthe shocking conditions of their exploitation. He draws on his background in finance, economics, and law to provide the first ever business analysis of \n\ncontemporary slavery worldwide, focusing on its most profitable and barbaric form: sex trafficking. Kara describes the local factors and global \n\neconomic forces that gave rise to this and other forms of modern slavery over the past two decades and quantifies, for the first time, the size, growth, \n\nand profitability of each industry. Finally, he identifies the sectors of the sex trafficking industry that would be hardest hit by specifically designed \n\ninterventions and recommends the specific legal, tactical, and policy measures that would target these vulnerable sectors and help to abolish this form \n\nof slavery, once and for all.\n\nThe author will donate a portion of the proceeds of this book to the anti-slavery organization, Free the Slaves.\n\nAbout the Author &lt;a href=&quot;\nhttp://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Siddharth_Kara.jpg/175px-Siddharth_Kara.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Siddharth_Kara.jpg/175px-Siddharth_Kara.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Siddharth_Kara&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Siddharth_Kara&lt;/a&gt;\nSiddharth Kara is an author, activist and one of the world's foremost experts on modern day slavery and human trafficking. He is an Adjunct Lecturer \n\nin Public Policy and Director of the Program on Human Trafficking and Modern Slavery at the Kennedy School of Government at Harvard \n\nUniversity and also a Visiting Scientist on Forced Labor at the Harvard School of Public Health. He is best known for his award-winning book, Sex \n\nTrafficking: Inside the Business of Modern Slavery (2009) and his most recent book, Bonded Labor: Tackling the System of Slavery in South Asia \n\n(2012).\n\nCONTENTS\nPreface\nAcknowledgments\n1. Sex Trafficking: An Overview\n2. India and Nepal\n3. Italy and Western Europe\n4. Moldova and the Former Soviet Union\n5. Albania and the Balkans\n6. Thailand and the Mekong Subregion\n7. The U nited States\n8. A Framework for Abolition: Risk and Demand\nAppendIx A : Selected Tables and Notes\nAppendix B: Contemporary Slavery Economics\nAppendix C: Selected Human Development\nStatistics\nNotes\nWorks Cited\nIndex\n &lt;a href=&quot;\nhttp://s15.postimg.org/pa7lqei63/Sex_Trafficking_Inside_the_Business_of_Modern.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s15.postimg.org/pa7lqei63/Sex_Trafficking_Inside_the_Business_of_Modern.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:5154809f54dc032b324c51c1fa4cef589f131660","amp;dn":"Sex+Trafficking+-+Inside+the+Business+of+Modern+Slavery+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5154809f54dc032b324c51c1fa4cef589f131660","infoHashBuffer":{"type":"Buffer","data":[81,84,128,159,84,220,3,43,50,76,81,193,250,76,239,88,159,19,22,96]},"announce":[],"urlList":[]}}