{"title":"[Scott_Spencer]ZBrush Digital Sculpting Human Anatomy(pdf){Zzzzz","uid":11075278,"size":13333831,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51e7164fe714e19f53002b786540af75ac7fc1d4&amp;dn=%5BScott_Spencer%5DZBrush+Digital+Sculpting+Human+Anatomy%28pdf%29%7BZzzzz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":"zombie_rox","files":2,"time":1411326801,"description":"Taking into account that many of today's digital artists -- particularly 3D character animators -- lack foundational artistic instruction, this book teaches anatomy in a coherent and succinct style. A clear writing style explains how to sculpt an accurate human figure, starting with the skeleton and working out to muscle, fat, and skin. Insightful explanations enable you to quickly and easily create and design characters that can be used in film, game, or print, and allows you to gain a strong understanding of the foundational artistic concepts.\n\nNote: CD-ROM/DVD and other supplementary materials are not included as part of eBook file.\n\nPublisher: Sybex; 1 edition (January 7, 2010)\nLanguage: English\nISBN-10: 0470450266\nISBN-13: 978-0470450260\n\nEditorial Reviews\nFrom the Back Cover\nCreate memorable human figures for movies and games\n\nTo create compelling characters, you need to make them realistic, and ZBrush by itself can take you only so far. You also need solid artistic skills. This full-color, illustrated guide teaches you the basics of human anatomy, so you can create captivating human figures that really come to life on screen.\n\nUsing ZBrush 3.5 tools, you'll sculpt a heroic male figure, learning each body part as you go, including head, neck, torso, arms, legs, bones, and muscle. This book emphasizes concepts that have guided artists for centuries, such as gesture, form, and proportion, helping you develop foundational skills you can draw upon throughout your career. Transform your animation into professional-level artistry with this must-have guide.\n\n    Understand the basic tenets of form, proportion, gesture, and rhythm\n\n    Master basic anatomical terms for skeletal regions and muscle groups\n\n    Break down the regions of the body into simple geometric shapes\n\n    Begin roughing in your figure with Claytubes and other tools\n\n    Create the impression of flesh over underlying muscle and bone\n\n    Learn ZBrush remeshing and color-mapping techniques\n\n    Flesh out your figure with fine detail and costuming\n\n    Repurpose your figure for film, video games, Web, or digital output\n\n    Build skills you can also apply to MayaÂ®, 3ds Max, Blender, and Photoshop\n\nVALUABLE COMPANION DVD\n\nEnhance your learning with video instruction that walks you through the projects in the book. You'll also find anatomy models to use for practice.\n\nUse ZBrush tools to perfect the fine detail of muscle construction\n\nSculpt different kinds of fabric to clad a heroic character\n\nLay the groundwork for believable facial expression with a solid foundation\nAbout the Author\nScott Spencer is a freelance character designer and sculptor currently working at the Weta Workshop in Wellington, New Zealand. Scott has worked on titles such as Iron Man, Golden Axe, Species 3, and others. His work can be seen in film, video games, and a variety of collectible figures. ","torrent":{"xt":"urn:btih:51e7164fe714e19f53002b786540af75ac7fc1d4","amp;dn":"%5BScott_Spencer%5DZBrush+Digital+Sculpting+Human+Anatomy%28pdf%29%7BZzzzz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51e7164fe714e19f53002b786540af75ac7fc1d4","infoHashBuffer":{"type":"Buffer","data":[81,231,22,79,231,20,225,159,83,0,43,120,101,64,175,117,172,127,193,212]},"announce":[],"urlList":[]}}