{"title":"Fields of Blood: Religion and the History of Violence","uid":15861652,"size":2687109,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51fa6a8a7be94e2d0cf1ecf9089b966babab7e0a&amp;dn=Fields+of+Blood%3A+Religion+and+the+History+of+Violence&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"marty14","files":1,"time":1474306149,"description":"Fields of Blood: Religion and the History of Violence - Karen Armstrong [epub]\r\n\r\nFor the first time, religious self-identification is on the decline in American. Some analysts have cited as cause a post-9/11perception: that faith in general is a source of aggression, intolerance, and divisiveness—something bad for society. But how accurate is that view? With deep learning and sympathetic understanding, Karen Armstrong sets out to discover the truth about religion and violence in each of the world’s great traditions, taking us on an astonishing journey from prehistoric times to the present. \r\n\r\nWhile many historians have looked at violence in connection with particular religious manifestations (jihad in Islam or Christianity’s Crusades), Armstrong looks at each faith—not only Christianity and Islam, but also Buddhism, Hinduism, Confucianism, Daoism, and Judaism—in its totality over time. As she describes, each arose in an agrarian society with plenty powerful landowners brutalizing peasants while also warring among themselves over land, then the only real source of wealth. In this world, religion was not the discrete and personal matter it would become for us but rather something that permeated all aspects of society. And so it was that agrarian aggression, and the warrior ethos it begot, became bound up with observances of the sacred.\r\n\r\nIn each tradition, however, a counterbalance to the warrior code also developed. Around sages, prophets, and mystics there grew up communities protesting the injustice and bloodshed endemic to agrarian society, the violence to which religion had become heir. And so by the time the great confessional faiths came of age, all understood themselves as ultimately devoted to peace, equality, and reconciliation, whatever the acts of violence perpetrated in their name","torrent":{"xt":"urn:btih:51fa6a8a7be94e2d0cf1ecf9089b966babab7e0a","amp;dn":"Fields+of+Blood%3A+Religion+and+the+History+of+Violence","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51fa6a8a7be94e2d0cf1ecf9089b966babab7e0a","infoHashBuffer":{"type":"Buffer","data":[81,250,106,138,123,233,78,45,12,241,236,249,8,155,150,107,171,171,126,10]},"announce":[],"urlList":[]}}