{"title":"Dennis The Menace(1993)DVDRip.AC3(ENG)-DROCK","uid":6226043,"size":733680968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:52a7890966f22d0143e78752bc6b1dfa4d505d82&amp;dn=Dennis+The+Menace%281993%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":1,"uploader":"drock232","files":-1,"time":1299512587,"description":"John Hughes continues the trend he began with the Home Alone series in Dennis the Menace, the Hughes-scripted film version of Hank Ketcham's long-running comic strip, cartoon show, and television comedy. The film opens as Dennis (Mason Gamble) is seen careening down a sidewalk in a beautiful and idealistic suburban town on his training-wheeled bike -- cans on string clattering behind him, baseball cards flapping in the spokes of the wheel, his red wagon filled to the brim and his dog following him. &quot;Hey! Mister Wilson!&quot; he screams and slams his bike to a halt in front of his much put-upon neighbor, Mr. Wilson (Walter Matthau). Half of the film concerns vignettes of small-town Hank Ketcham life as Dennis' mom Alice (Lea Thompson) starts a new job, Dennis stays over at his friend Margaret's (Amy Sakasitz) house, and Mr. Wilson and his gentle, well-meaning wife, Martha (Joan Plowright), mind Dennis during the night of a big garden party. Through all this, Dennis continually gets into Mr. Wilson's hair. But then the Home Alone plot kicks in -- with an unsubtle dose of O. Henry -- when Switchblade Sam (Christopher Lloyd) makes an appearance. Switchblade Sam is a homeless drifter who combs the neighborhood stealing purses and small home items. But when Switchblade Sam steals Mr. Wilson's collection of gold coins, Dennis comes to the rescue and inflicts Dennis the Menace-type tortures upon the thief in order to reclaim the coins for Mr. Wilson. \n\nRipped with Handbrake.\n\nLength: 1 Hour 36 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:52a7890966f22d0143e78752bc6b1dfa4d505d82","amp;dn":"Dennis+The+Menace%281993%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52a7890966f22d0143e78752bc6b1dfa4d505d82","infoHashBuffer":{"type":"Buffer","data":[82,167,137,9,102,242,45,1,67,231,135,82,188,107,29,250,77,80,93,130]},"announce":[],"urlList":[]}}