{"title":"mIRC 7.36 + Patch [SWEG]","uid":10772055,"size":2413616,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:53089ed074ec0849d02720449e42dd55d7787835&amp;dn=mIRC+7.36+%2B+Patch+%5BSWEG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":0,"uploader":"Swegin8r","files":1,"time":1408091260,"description":"Includes the mIRC v7.36 installation package, a patch and a text file containing instructions.\n\nInstall as usual. Use the provided patch then enter any name and serial combination to register the program. Done! Enjoy!\n\n\n-----------------------------------------------------------------------------------\n\n\nmIRC is a full featured Internet Relay Chat client for Windows that can be used to communicate, share, play or work with others on IRC networks around the world, either in multi-user group conferences or in one-to-one private discussions.\n\nIt has a clean, practical interface that is highly configurable and supports features such as buddy lists, file transfers, multi-server connections, IPv6, SSL encryption, proxy support, UTF-8 display, UPnP, customizable sounds, spoken messages, tray notifications, message logging, and more.\n\nmIRC also has a powerful scripting language that can be used both to automate mIRC and to create applications that perform a wide range of functions from network communications to playing games.\n\nmIRC has been in development for over a decade and is constantly being improved and updated with new technologies.\n\n-----------------------------------------------------------------------------------\n\nWHY UPGRADE?\n\n-Fixed slow mark/copy text in windows that contain long lines.\n-Fixed listbox lines in Options dialog and other windows being chopped when DPI settings are set to a high value.\n-Reverted change to alias/identifiers that caused a script to be halted with a recursion error warning.\n-Fixed listbox with checkboxes bug that caused checkboxes to be checked if you scrolled through them with the up/down keys.\n-Changed channel folder dialog so that it can now be resized.\n-Changed online timer dialog to display information more clearly.\n-Fixed Shift+Tab beeping when switching to listbox in channel window.\n-Fixed $fullscreen not working on a non-primary monitor.\n-Updated the find/replace dialogs in the script editor to remember their positions for the current mIRC session.\n-Updated mIRC to include OpenSSL support without needing external DLLS.\n-Fixed lock dialog bug that caused mIRC to ask for a password if the on startup option was enabled without setting a password.\n-Fixed $input() 'b' switch so that the dialog window close button is also temporarily disabled.\n-Fixed isignore only accepting types, now also accepts switches.\n-Fixed CAP server-time time value not being used when timestamping an event in the log file.\n-Other changes and bug fixes.","torrent":{"xt":"urn:btih:53089ed074ec0849d02720449e42dd55d7787835","amp;dn":"mIRC+7.36+%2B+Patch+%5BSWEG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53089ed074ec0849d02720449e42dd55d7787835","infoHashBuffer":{"type":"Buffer","data":[83,8,158,208,116,236,8,73,208,39,32,68,158,66,221,85,215,120,120,53]},"announce":[],"urlList":[]}}