{"title":"Hegemony.III.Clash.of.the.Ancients.v3.2.Rebellion-HI2U","uid":15623842,"size":892083277,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:535f1c729068274bb069cb630abc63dea95ff640&amp;dn=Hegemony.III.Clash.of.the.Ancients.v3.2.Rebellion-HI2U&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":3,"uploader":"Itanium2","files":2,"time":1471895542,"description":"Hegemony III: Clash of the Ancients v3.2 Rebellion\r\n\r\n(c) Longbow Games\r\n\r\nRelease 22/08/2016\r\n\r\nProtection: Steam\r\nGame Size: 1 DISC\r\nGame Type: Strategy,Simulation,Historical,RTS \r\n\r\n[RELEASE NOTES]\r\n\r\nThe Battle for the Ancient World has Begun!\r\n\r\nCenturies before Caesar, Alexander or Philip, the forested hills and\r\nrocky coasts of ancient Italy draw cultures from across the\r\nMediterranean with promises of wealth and prosperity. Bronze-clad\r\nhoplites from the powerful Greek city-states set sail across the\r\nAdriatic to carve out bridgeheads of Hellenic culture amongst the\r\nnative Italic hill tribes, while aggressive bands of Gallic Skirmishers\r\nmake the trek South across the Alps in search of fertile new land. And\r\nalong the marshy banks of the Tiber river, a small upstart city called\r\nRome battles for independence from the established Etruscan\r\nconfederacy\r\n\r\nBut only one faction can rise to become the greatest empire the\r\nMediterranean has ever seen. Will Rome fulfil its destiny to rule the\r\nancient world or will history be rewritten to forge a new Etruscan\r\nGallic, or Greek hegemony!\r\n\r\nCommand Armies:\r\n\r\nDirect armies of hoplites and legionaries on the battlefield in paused\r\nor real-time. Plot flanking manoeuvres or snap units into larger\r\nformations using intuitive and precise controls\r\n\r\nManage Resources:\r\n\r\nConstruct and protect your network of farms and supply lines to feed\r\nyour growing empire, while raiding enemy resources to weaken them\r\nbefore the final assault\r\n\r\nCreate Worlds:\r\n\r\nUse the built-in map editor to create your own historical or fantasy\r\nworlds and then share them with the community using Steam Workshop\r\n\r\n25+ Factions:\r\n\r\nChoose from over 25 factions from 4 unique cultures including the\r\nGallic Celts, Etruscans, Romans, Latins, Samnites, and Greeks\r\n\r\nDynamic Campaign:\r\n\r\nSack Rome as the Gauls! Relive the Samnite wars! Dynamic objectives\r\nadapt to your strategy allowing you to recreate history or plot your\r\nown path to hegemony\r\n\r\n30+ New Units:\r\n\r\nCommand your army in a time when the arms and tactics evolve with every\r\nconflict. Tribal warriors must take up the hoplon shields of their\r\nenemies to fight back againt the invading Greeks, while early Roman\r\nlegions learn to adapt the time-tested phalanx in order to survive the\r\nGallic assault\r\n\r\nSeamless Map:\r\n\r\nCampaign from the rocky coasts of Magna Graecia to the fertile valleys\r\nof Cisalpine Gaul on an all-new map at 4x the detail of Hegemony Rome\r\nUse the series' trademark strategic zoom to seamlessly move between the\r\ntactical and strategy maps at any time, maximizing your abilities to\r\ninspect, control and manage your growing empire\r\n\r\nDozens of New Features:\r\n\r\nGrow your cities, unlock new faction skills, trade resources, purchase\r\nslaves, and many more new features make this the most in-depth Hegemony\r\ngame ever! \r\n\r\n[INSTALL NOTES] \r\n\r\n1 Unpack \r\n2 Mount / burn image \r\n3 Install \r\n4 Copy content from 'Crack' folder and replace game dir files \r\n5 Play game \r\n6 If U like it, buy it!","torrent":{"xt":"urn:btih:535f1c729068274bb069cb630abc63dea95ff640","amp;dn":"Hegemony.III.Clash.of.the.Ancients.v3.2.Rebellion-HI2U","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"535f1c729068274bb069cb630abc63dea95ff640","infoHashBuffer":{"type":"Buffer","data":[83,95,28,114,144,104,39,75,176,105,203,99,10,188,99,222,169,95,246,64]},"announce":[],"urlList":[]}}