{"title":"Faith No More - Superhero (Single) 2015 ak61","uid":11740594,"size":13507106,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:53a113b97ced27dad48d1e953cc141955b2164af&amp;dn=Faith+No+More+-+Superhero+%28Single%29+2015+ak61&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":3,"uploader":"analogkid6103","files":2,"time":1425793724,"description":"Faith No More is an American rock band from San Francisco, California, formed in 1981. The band was originally named Faith No Man. Billy Gould, Roddy Bottum and Mike Bordin are the longest remaining members of the band, having been involved with Faith No More since its inception. The band underwent several lineup changes early in their career, along with some major changes later on. After releasing six albums, Faith No More officially announced their breakup on April 20, 1998. They have since reunited, embarking on The Second Coming Tour from 2009-2012.\n\nOn September 2, 2014, bassist Bill Gould announced that Faith No More had been working on their seventh studio album Sol Invictus, which is set for release in May 2015. The latest version of Faith No More to perform consists of Mike Bordin, Roddy Bottum, Billy Gould, Jon Hudson, and Mike Patton.\n\nIn November, Faith No More revealed that their new material was influenced by The Cramps, Link Wray and Siouxsie and the Banshees. Speaking to Revolver, Gould described the song &quot;Cone of Shame&quot; as &quot;blues-based rock and roll&quot;. Describing another track &quot;Matador&quot;, he said: &quot;parts of it remind me of the first Siouxsie and the Banshees album. We used real pianos and that brings this organic quality to it to the music&quot;. Faith No More will headline Australia's Soundwave in February and March 2015.\n\nOn February 10, 2015 the band announced that their new album, Sol Invictus, will be released in May 2015. The second single from the album, &quot;Superhero&quot;, was shared by the band on March 1st 2015","torrent":{"xt":"urn:btih:53a113b97ced27dad48d1e953cc141955b2164af","amp;dn":"Faith+No+More+-+Superhero+%28Single%29+2015+ak61","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53a113b97ced27dad48d1e953cc141955b2164af","infoHashBuffer":{"type":"Buffer","data":[83,161,19,185,124,237,39,218,212,141,30,149,60,193,65,149,91,33,100,175]},"announce":[],"urlList":[]}}