{"title":"The Last Mile by David Baldacci (ePub, Mobi)","uid":14358580,"size":2002657,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5440f56729d66ae3b69418ed261c390502d441e7&amp;dn=The+Last+Mile+by+David+Baldacci+%28ePub%2C+Mobi%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":2,"uploader":"Skyeater","files":3,"time":1461077223,"description":"The Last Mile (Amos Decker #2)\r\nby David Baldacci\r\n\r\n--------------\r\n\r\nIn his #1 New York Times bestseller Memory Man, David Baldacci introduced the extraordinary detective Amos Decker-the man who can forget nothing. Now, Decker returns in a spectacular new thriller . . . \r\nTHE LAST MILE\r\nConvicted murderer Melvin Mars is counting down the last hours before his execution--for the violent killing of his parents twenty years earlier--when he's granted an unexpected reprieve. Another man has confessed to the crime.\r\nAmos Decker, newly hired on an FBI special task force, takes an interest in Mars's case after discovering the striking similarities to his own life: Both men were talented football players with promising careers cut short by tragedy. Both men's families were brutally murdered. And in both cases, another suspect came forward, years after the killing, to confess to the crime. A suspect who may or may not have been telling the truth.\r\nThe confession has the potential to make Melvin Mars--guilty or not--a free man. Who wants Mars out of prison? And why now?\r\nBut when a member of Decker's team disappears, it becomes clear that something much larger--and more sinister--than just one convicted criminal's life hangs in the balance. Decker will need all of his extraordinary brainpower to stop an innocent man from being executed","torrent":{"xt":"urn:btih:5440f56729d66ae3b69418ed261c390502d441e7","amp;dn":"The+Last+Mile+by+David+Baldacci+%28ePub%2C+Mobi%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5440f56729d66ae3b69418ed261c390502d441e7","infoHashBuffer":{"type":"Buffer","data":[84,64,245,103,41,214,106,227,182,148,24,237,38,28,57,5,2,212,65,231]},"announce":[],"urlList":[]}}