{"title":"The Stone Roses - Discography (1987-1995) [FLAC]","uid":8812261,"size":2160098648,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:544c0e4734546d60b3edfea47bb49af3e7b34ded&amp;dn=The+Stone+Roses+-+Discography+%281987-1995%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":6,"uploader":"politux","files":-1,"time":1376487714,"description":"\n  The Stone Roses - Discography (1987-1995) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, Britpop\n  Source: CD\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  Albums\n\n  1989 The Stone Roses\n  1992 Turnes into Stone\n  1994 Second Coming\n\n  Singles\n\n  1987 Sally Cinnamon\n  1988 Elephant Stone\n  1989 She Bang the Drums\n  1991 Waterfall\n  1994 Love Spreads\n  1995 Foold Gold '95\n  1995 Begging You\n  \n  Meshing '60s-styled guitar pop with an understated '80s dance beat, the Stone Roses defined the British guitar pop scene of the late '80s and early '90s. After their eponymous 1989 debut album became an English sensation, countless other groups in the same vein became popular, including the Charlatans UK, Inspiral Carpets, and Happy Mondays. However, the Stone Roses were never able to capitalize on the promise of their first album, waiting five years before they released their second record and slowly disintegrating in the year-and-a-half after its release.\n\n  The Stone Roses emerged from the remains of English Rose, a Manchester-based band formed by schoolmates John Squire (guitar) and Ian Brown (vocals). In 1985, the Stone Roses officially formed, as Squire and Brown added drummer Reni (born Alan John Wren), guitarist Andy Couzens, and bassist Pete Garner. The group began playing warehouses around Manchester, cultivating a dedicated following rather quickly. Around this time, the group was a cross between classic British '60s guitar pop and heavy metal, with touches of goth rock. Couzens left the group in 1987, followed shortly afterward by Garner. Garner was replaced by Mani (born Gary Mounfield) and the group recorded its first single, &quot;So Young,&quot; which was released to little attention by Thin Line Records. At the end of 1987, the Stone Roses released their second single, &quot;Sally Cinnamon,&quot; which pointed the way toward the band's hook-laden, ringing guitar pop. By the fall of 1988, the band secured a contract with Silvertone Records and released &quot;Elephant Stone,&quot; a single that set the band's catchy neo-psychedelic guitar pop in stone.\n\n  Shortly after the release of &quot;Elephant Stone,&quot; the Stone Roses' bandwagon took off in earnest. In early 1989, the group was playing sold-out gigs across Manchester and London. In May, the Stone Roses released their eponymous debut album, which demonstrated not only a predilection for '60s guitar hooks, but also a contemporary acid house rhythmic sensibility. The Stone Roses received rave reviews and soon a crop of similar-sounding bands appeared in the U.K. By the end of the summer, the Stone Roses were perceived as leading a wave of bands that fused rock &amp; roll and acid house culture. &quot;She Bangs the Drums,&quot; the third single pulled from the debut, became the group's first Top 40 single at the end of the summer. In November, the group had its first Top Ten hit when &quot;Fool's Gold&quot; climbed to number eight. By the end of the year, the band had moved from selling out clubs to selling out large theaters in the U.K.\n\n  For the first half of 1990, re-releases of the band's earlier singles clogged the charts. The group returned in July 1990 with the single &quot;One Love,&quot; which entered the charts at number four. Prior to the release of &quot;One Love,&quot; the Stone Roses organized their own festival at Spike Island in Widnes. The concert drew over 30,000 people and would prove to be their last concert in England for five years. After Spike Island, the group became embroiled in a vicious legal battle with Silvertone Records. the Stone Roses wanted to leave the label but Silvertone took out a court injunction against them, preventing the group from releasing any new material. For the next two years, the band fought Silvertone while allegedly preparing the follow-up to its debut album. However, the Stone Roses did next to nothing as the court case rolled on. In the meantime, several major record labels began negotiating with the band in secret. In March of 1991, the lawsuit went to court. Two months later, the band won its case against Silvertone and signed a multi-million deal with Geffen Records.","torrent":{"xt":"urn:btih:544c0e4734546d60b3edfea47bb49af3e7b34ded","amp;dn":"The+Stone+Roses+-+Discography+%281987-1995%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"544c0e4734546d60b3edfea47bb49af3e7b34ded","infoHashBuffer":{"type":"Buffer","data":[84,76,14,71,52,84,109,96,179,237,254,164,123,180,154,243,231,179,77,237]},"announce":[],"urlList":[]}}