{"title":"Future Islands - Singles (2014) [FLAC]","uid":9826685,"size":282862043,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:55089320875ae331b18d9246663861c867848264&amp;dn=Future+Islands+-+Singles+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"politux","files":-1,"time":1395790251,"description":"  Future Islands - Singles (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Post-Punk\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Seasons (Waiting on You)\n  02 Spirit \n  03 Sun in the Morning\n  04 Doves\n  05 Back in the Tall Grass \n  06 A Song for Our Grandfathers\n  07 Light House\n  08 Like the Moon \n  09 Fall from Grace\n  10 A Dream of You and Me\n\n  After a solid run of albums that showed growth each time, Future Islands explode into greatness on their fourth album, and first for 4AD, 2014's Singles. Streamlining their synth-heavy, experimental, almost danceable sound of the past into something laser-focused, new wave familiar, and very, very immediate, the album is a great leap forward that's filled with intensely catchy songs and allows vocalist Samuel T. Herring to shine like the star he's always been. His David Thomas of Pere Ubu meets David Prater of Sam &amp; Dave singing style is both more expansive than ever and more restrained. He ducks and bobs around the pulsing disco beats and glittering synths like a boxer, sometimes knocking you out with histrionic growls and deep-throated snarls, sometimes setting you up with lightly crooned pleading that hits like a heart punch. \n\n  It's a masterful performance that's matched by Chris Coady's expert production and the work of bassist/guitarist William Cashion and guitarist/synthist J. Gerrit Welmers (as well as session drummer Denny Bowen). Coady smooths the group's sound out without sacrificing any punch, then layers in horns, backing vocals, and keys until the album shines like a well-polished diamond. Cashion's bass work is the key supporting player, rumbling like a propulsive motor and laying down melodic lines he must have learned through hours of studying Peter Hook's best work. Welmers' keyboard work isn't far behind, as he always drops in the right fills and uses the perfect colors to fill in behind the action. It's a perfectly constructed sound that gives Herring the freedom to spill his guts without fear, and in the end works to make the record's title sound truer than they probably even imagined. Every song sounds like a past, present, and future hit single, with ringing hooks, grooves that won't leave your hips alone, and the kind of cutting emotional depth that will leave blood pooling around your feet as it slashes you again and again. Pick any song, like the achingly pretty &quot;Seasons (Waiting on You)&quot; or the understated &quot;Light House&quot; or the after-hours Roxy Music-inspired &quot;Like the Moon,&quot; and it'll be the kind of song that will stop people in their tracks in a crowded bar, the kind that you play over and over when you run across it streaming on a website, the kind that you tell all your friends about. A whole album of songs like that feels like a dream come true. It's real, though, and the vocals, the songs, the music, and the production work together to make Singles a one-of-a-kind experience that's nearly perfect.","torrent":{"xt":"urn:btih:55089320875ae331b18d9246663861c867848264","amp;dn":"Future+Islands+-+Singles+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55089320875ae331b18d9246663861c867848264","infoHashBuffer":{"type":"Buffer","data":[85,8,147,32,135,90,227,49,177,141,146,70,102,56,97,200,103,132,130,100]},"announce":[],"urlList":[]}}