{"title":"Parenthood.2010.S05.HDTV.x264 (Season 5 Complete)","uid":11156635,"size":6805016574,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:552e57e87daae1a6d32d05cd40dbda66b5057719&amp;dn=Parenthood.2010.S05.HDTV.x264+%28Season+5+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":9,"uploader":"BlackRoth","files":-1,"time":1412438951,"description":"[*] Parenthood.2010.S05.HDTV.x264 Season 5 Complete [*]\n\n\nA family tree with Zeek (Craig T. Nelson) and Camille Braverman (Bonnie Bedelia) serving as the patriarch and matriarch. After forty-six years of marriage, they've managed to keep their foundation intact by burying their problems underneath the surface for the sake of their now-adult children. Adam (Peter Krause) is the first-born and the ripest apple the tree has to offer. He runs a shoe company, has a supportive wife, two children (boy and girl) and a beautiful home to share with them. He's a dog short of &quot;The American Dream&quot;. Sarah (Lauren Graham), is the unstable daughter returning home at thirty-eight years of age with her rebellious daughter and sensitive son to live with Zeek and Camille. Crosby (Dax Shepard), is a happy-go-lucky bachelor living in the now, on a docked boat. He has no idea that his frivolous life is about to change tremendously. Then there is Julia (Erika Christensen). She is the bread-winning shot-calling lawyer, whose husband mans the stay-at-home-dad duties. Each family will face their own challenges, but how they propose to deal with them is what will keep them together or tear them apart.\n\nWritten by Jordan Ray Allen @ iMDB.com\n\n\n\nWhat's in this torrent?\n\n\n- Episodes 1-22 HDTV by LOL and 2HD\n\n\n\nThis torrent has been brought to you by BlackRoth.\n\nDISCLAIMER: This torrent has no intention of distributing among people who don't own the original product. This is meant to be a sample in order to help you make a decision whether buying it or not. If you like the contents, I encourage you to purchase them. Support quality products.\t","torrent":{"xt":"urn:btih:552e57e87daae1a6d32d05cd40dbda66b5057719","amp;dn":"Parenthood.2010.S05.HDTV.x264+%28Season+5+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"552e57e87daae1a6d32d05cd40dbda66b5057719","infoHashBuffer":{"type":"Buffer","data":[85,46,87,232,125,170,225,166,211,45,5,205,64,219,218,102,181,5,119,25]},"announce":[],"urlList":[]}}