{"title":"Image Burn Version 2.5.5.0","uid":6592687,"size":5514668,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:55425ebd750e4feae1cf2bdc58ef6476a2b54177&amp;dn=Image+Burn+Version+2.5.5.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"Extermino","files":-1,"time":1312887655,"description":"ImgBurn supports a wide range of image file formats - including BIN, CCD, CDI, CUE, DI, DVD, GI, IMG, ISO, MDS, NRG and PDI.\n\nIt can burn Audio CD\\\\\\'s from any file type supported via DirectShow / ACM - including AAC, APE, FLAC, M4A, MP3, MP4, MPC, OGG, PCM, WAV, WMA and WV.\n\nYou can use it to build DVD Video discs (from a VIDEO_TS folder), HD DVD Video discs (from a HVDVD_TS folder) and Blu-ray Video discs (from a BDAV / BDMV folder) with ease.\n\nIt supports Unicode folder/file names, so you shouldn\\\\\\'t run in to any problems if you\\\\\\'re using an international character set.\n\nImgBurn supports all the Microsoft Windows OS\\\\\\'s - Windows 95, Windows 98, Windows Me, Windows NT4, Windows 2000, Windows XP, Windows 2003, Windows Vista, Windows 2008 and Windows 7 (including all the 64-bit versions). If you use Wine, it should also run on Linux and other x86-based Unixes.\n\nIt\\\\\\'s a very flexible application with several advanced features that are often lacking in other tools, especially when it comes to burning DVD Video discs. It supports all the latest drives without the need for updates (including booktype / bitsetting / advanced settings on many of the major ones - i.e. BenQ, LiteOn, LG, NEC, Plextor, Samsung, Sony).\n\nThere is an image queue system for when you\\\\\\'re burning several images (which you can automatically share between multiple drives if you have more than one) and an easy-to-use layer break selection screen for double layer DVD Video jobs. The Automatic Write Speed feature allows you store your favourite burn speed settings on a per \\\\\\'Media ID\\\\\\' basis, right down to a drive by drive level. Data captured during the burn (write speed, buffer levels etc) can be displayed / analysed using DVDInfoPro.\n\nWhilst ImgBurn is designed to work perfectly straight out of the box, advanced users will appreciate just how configurable it is.\n\nOh and let\\\\\\'s not forget the best thing about it.... it\\\\\\'s 100% FREE ;-)","torrent":{"xt":"urn:btih:55425ebd750e4feae1cf2bdc58ef6476a2b54177","amp;dn":"Image+Burn+Version+2.5.5.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55425ebd750e4feae1cf2bdc58ef6476a2b54177","infoHashBuffer":{"type":"Buffer","data":[85,66,94,189,117,14,79,234,225,207,43,220,88,239,100,118,162,181,65,119]},"announce":[],"urlList":[]}}