{"title":"Secret Wars I 01-12 (1984-1985|Digital|Son of Ultron Empire)","uid":9860837,"size":775296040,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:55ad6ccd2b62febec55b19c21af2a51e10a5412e&amp;dn=Secret+Wars+I+01-12+%281984-1985%7CDigital%7CSon+of+Ultron+Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":1,"uploader":"VikTSlick","files":12,"time":1396295040,"description":"This is one of the first major crossover events in Marvel history, and it was a huge success and led to a sequel (which isn't that great) and plenty of other yearly company blowouts since then, with varying degrees of competence in execution. Though a little dated and without much of a plot, the action sequences, the thrill seeing of all these characters - good and bad - together, and things like Spider-Man's famous black costume and Doom's seizing of power always bring a smile to my face when I read it. Jim Shooter and Mike Zeck make the battles exciting and Bob Layton's art is still as terrific as ever. Promotional info for the collected edition - &quot;Drawn from Earth across the stars, the Marvel Universe's greatest villains and heroes are set against one another by the mysterious and unbelievably powerful Beyonder, with the winner promised the ultimate prize. But as battle lines are drawn, new alliances forged and old enemies clash, one among them is not willing to settle for anything less than godhood. Can even the combined might of the Avengers, Spider-Man, the Fantastic Four and the X-Men prevent Dr. Doom from becoming the most powerful being in the universe?&quot;\n\nThough previously done in digital format by Danger-Empire, these are the newer HR versions by Son of Ultron-Empire and they look great. Thanks to them for all their hard work, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:55ad6ccd2b62febec55b19c21af2a51e10a5412e","amp;dn":"Secret+Wars+I+01-12+%281984-1985%7CDigital%7CSon+of+Ultron+Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55ad6ccd2b62febec55b19c21af2a51e10a5412e","infoHashBuffer":{"type":"Buffer","data":[85,173,108,205,43,98,254,190,197,91,25,194,26,242,165,30,16,165,65,46]},"announce":[],"urlList":[]}}