{"title":"Ernest Cline - Armada","uid":12122831,"size":342145208,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:561dd50812fe9985a8943e21b16ad64dafd43eae&amp;dn=Ernest+Cline+-+Armada&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":1,"uploader":"Cybotage","files":29,"time":1436869169,"description":"The new novel from the best-selling author of Ready Player One\n\nIt's just another day of high school for Zack Lightman. He's daydreaming through another boring math class, with just one more month to go until graduation and freedom - if he can make it that long without getting suspended again. Then he glances out his classroom window and spots the flying saucer. At first Zack thinks he's going crazy. A minute later he's sure of it. Because the UFO he's staring at is straight out of the videogame he plays every night, a hugely popular online flight simulator called Armada - in which gamers just happen to be protecting the Earth from alien invaders.\n\nBut what Zack's seeing is all too real. And his skills - as well as those of millions of gamers across the world - are going to be needed to save the Earth from what's about to befall it.\n\nYet even as he and his new comrades scramble to prepare for the alien onslaught, Zack can't help thinking of all the science-fiction books, TV shows, and movies he grew up reading and watching and wonder: Doesn't something about this scenario seem a little too...familiar?\n\nArmada is at once a rollicking, surprising thriller, a classic coming-of-age adventure, and an alien-invasion tale like nothing you've ever heard before - one whose every minute is infused with author Ernest Cline's trademark pop-culture savvy.\n\n\nRead by Whil Wheaton\nFormat: MP3\nBitrate: 64 Kbps\nUnabridged","torrent":{"xt":"urn:btih:561dd50812fe9985a8943e21b16ad64dafd43eae","amp;dn":"Ernest+Cline+-+Armada","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"561dd50812fe9985a8943e21b16ad64dafd43eae","infoHashBuffer":{"type":"Buffer","data":[86,29,213,8,18,254,153,133,168,148,62,33,177,106,214,77,175,212,62,174]},"announce":[],"urlList":[]}}