{"title":"Tribes - We Need You to Lead Us - Seth Godin [Qwerty80]","uid":7937368,"size":230168,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:564adcfca69f11e872f413172abfbe05972f5f02&amp;dn=Tribes+-+We+Need+You+to+Lead+Us+-+Seth+Godin+%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"KatQwerty","files":3,"time":1355895205,"description":"[IMG]http://kastatic.com/i2/u/2418732/IsJiyxMZcp.png[/IMG][image=3hRZIkOHgW]\n\nA tribe is any group of people, large or small, who are connected to one another, a \n\nleader, and an idea. For millions of years, humans have been seeking out tribes, be \n\nthey religious, ethnic, economic, political, or even musical (think of the \n\nDeadheads). It?s our nature.\n \n \nNow the Internet has eliminated the barriers of geography, cost, and time. All those \n\nblogs and social networking sites are helping existing tribes get bigger. But more \n\nimportant, they?re enabling countless new tribes to be born?groups of ten or ten \n\nthousand or ten million who care about their iPhones, or a political campaign, or a \n\nnew way to fight global warming.\n \nAnd so the key question: Who is going to lead us?\n \nThe Web can do amazing things, but it can?t provide leadership. That still has to \n\ncome from individuals? people just like you who have passion about something. The \n\nexplosion in tribes means that anyone who wants to make a difference now has the \n\ntools at her fingertips.\n \nIf you think leadership is for other people, think again?leaders come in surprising \n\npackages. Consider Joel Spolsky and his international tribe of scary-smart software \n\nengineers. Or Gary Vaynerhuck, a wine expert with a devoted following of enthusiasts. \n\nChris Sharma leads a tribe of rock climbers up impossible cliff faces, while Mich \n\nMathews, a VP at Microsoft, runs her internal tribe of marketers from her cube in \n\nSeattle. All they have in common is the desire to change things, the ability to \n\nconnect a tribe, and the willingness to lead.\n \nIf you ignore this opportunity, you risk turning into a ?sheepwalker??someone who \n\nfights to protect the status quo at all costs, never asking if obedience is doing you \n\n(or your organization) any good. Sheepwalkers don?t do very well these days.\n \nTribes will make you think (really think) about the opportunities in leading your \n\nfellow employees, customers, investors, believers, hobbyists, or readers. . . . It?s \n\nnot easy, but it?s easier than you think.\n \n \n \n \n","torrent":{"xt":"urn:btih:564adcfca69f11e872f413172abfbe05972f5f02","amp;dn":"Tribes+-+We+Need+You+to+Lead+Us+-+Seth+Godin+%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"564adcfca69f11e872f413172abfbe05972f5f02","infoHashBuffer":{"type":"Buffer","data":[86,74,220,252,166,159,17,232,114,244,19,23,42,191,190,5,151,47,95,2]},"announce":[],"urlList":[]}}