{"title":"Adam Curtis - Bitter Lake (2015) BBC","uid":12838031,"size":1045013608,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:565d02bf9980a0787fadceb2938796df2d295b56&amp;dn=Adam+Curtis+-+Bitter+Lake+%282015%29+BBC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":5,"uploader":"iocat","files":1,"time":1448477084,"description":"Bitter Lake is a 2015 BBC documentary film by filmmaker Adam Curtis. It argues that Western politicians keep simplifying the stories they tell, into a simple-to-digest by the public &quot;good&quot; vs. &quot;evil&quot; argument, due to society's overwhelming chaos and disorder, which they neither grasp nor understand.\r\n\r\nThe film attempts to explain several complex and interconnected narratives. One of the narratives is how past governments, including Russia and the West, with their continued, largely failing, interventions in Afghanistan, keep repeating such failures, without properly understanding the country's cultural background or its past political history and societal structure.\r\n\r\nIt also outlines the US's alliance with Saudi Arabia, especially the former's agreement to buy Saudi oil, for control of a key energy supplier during the cold-war era, with Saudi Arabia gaining wealth and security in return, with agreement withstanding provided it was allowed to continue its violent and fundamentalist interpretation of Islam, Wahhabism, uninhibited from external influence. This in turn has fed like a feedback loop back into the many troubles the world faces with regards to various pseudo-Jihadic forces spanning the 1970s to present day; be they the Mujahideen, Taliban, Al-Qaeda, and into IS.\r\n\r\nCurtis describes the film as an attempt to add an &quot;emotional&quot; dimension to the context of the historical narrative in order to draw its audience in – hence it's over two hours in length and availability exclusively through the BBC iPlayer – in order to give the viewer something beyond the disconnected news reports they're usually fed from most traditional broadcast journalism, along with putting historical facts in a truer broader context.\r\n\r\nBBC iPlayer has given me the opportunity to do this - because it isn’t restrained by the rigid formats and schedules of network television. [...]\r\n\r\nI have got hold of the unedited rushes of almost everything the BBC has ever shot in Afghanistan. It is thousands of hours - some of it is very dull, but large parts of it are extraordinary. Shots that record amazing moments, but also others that are touching, funny and sometimes very odd.\r\n\r\nThese complicated, fragmentary and emotional images evoke the chaos of real experience. And out of them I have tried to build a different and more emotional way of depicting what really happened in Afghanistan.\r\n\r\nA counterpoint to the thin, narrow and increasingly destructive stories told by those in power today.\r\nThe title is taken from the 1945 meeting of US president Franklin D. Roosevelt and King Abdulaziz of Saudi Arabia, on a ship in the Great Bitter Lake on the Suez Canal, where much of the events to follow could be said to have originated.\r\n\r\nThe film was released on Sunday 25 January 2015 exclusively on the BBC iPlayer.\r\n \nhttps://en.wikipedia.org/wiki/Bitter_Lake_(film)\r\n\r\niPlayer rip re-encoded with FFMPEG libx264 with CRF of 23 reducing the file size by 33%, original AAC sound &amp; resolution 832x468","torrent":{"xt":"urn:btih:565d02bf9980a0787fadceb2938796df2d295b56","amp;dn":"Adam+Curtis+-+Bitter+Lake+%282015%29+BBC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"565d02bf9980a0787fadceb2938796df2d295b56","infoHashBuffer":{"type":"Buffer","data":[86,93,2,191,153,128,160,120,127,173,206,178,147,135,150,223,45,41,91,86]},"announce":[],"urlList":[]}}