{"title":"Exanima 0.5.1.1 [SimpleSetup]","uid":11916956,"size":689440000,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:57c49430d73642549356d1878bb8332e8357730f&amp;dn=Exanima+0.5.1.1+%5BSimpleSetup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":0,"uploader":"lolla87","files":1,"time":1431554086,"description":"\n\nTitle: Exanima\nGenre: Action, Adventure, RPG, Simulation, Early Access\nDeveloper: Bare Mettle Entertainment\nPublisher: Bare Mettle Entertainment\t\nRelease Date: 29 Apr, 2015\nInterface Language: Â English\nFull Audio Language: None\nSubtitles Language: None\n\nSystem Requirements:\n\nMinimum: \n\n     OS: Windows XP (SP3)\n    Processor: Intel Core2 or AMD Athlon II dual core\n    Memory: 2 GB RAM\n    Graphics: Intel HD 4000 or AMD Radeon HD 2600 or Nvidia GeForce 8600 with 512MB VRAM\n    Hard Drive: 2 GB available space\n    Sound Card: Integrated audio\n    Additional Notes: Wine / CrossOver compatible on Mac OS X or Linux with appropriate OpenGL driver \n\nRecommended:\n\n     Processor: 3 Ghz Intel Core i5 quad core or 3.5 Ghz AMD FX hex core or better\n    Graphics: AMD Radeon HD 5850 or Nvidia GeForce GTX 280 with 1GB VRAM or better\n    Additional Notes: Faster GPU with more VRAM recommended for very high settings or resolutions \n\n\nAbout This Game\n\nExplore, fight, survive and unravel mysteries in this unique and unforgiving 3D isometric RPG set in an original dark, low fantasy world. Exanima's exceptional attention to detail and realistic simulation of all things aim to provide a deeply immersive and dynamic gameplay experience.\n\nFeatures include a deep skill based combat system, complex and smart AI, fully interactive environments, an advanced damage model with accurate collisions and locational protection, roguelike elements and an arena mode to hone your combat skills.\n\n&quot;Those who would enter the underworld shall not only forfeit their lives...\n...but bring oblivion to all mankind.&quot;\n\nWARNING: THIS GAME IS ACTUALLY DIFFERENT!\nThis game features a very deep, truly physics based combat system. This is not just some animation feature, it is a fundamental difference that is central to gameplay. Real momentum, forces and collisions are always at play here, every nuance of your inputs is crucial to the outcome. This will likely be unlike anything you've played before and may take some practice, but can be hugely rewarding and the skill cap is virtually infinite. It is not particularly fast paced or difficult but it does require you to pay attention, it is very tactical and just casually pressing buttons won't get you very far!\n\nOur goal is to create a deep and immersive RPG world based on a more advanced simulation supporting an unprecedented level of dynamic and emergent gameplay. All of the technology we use including the game engine is our own, developed from the ground up to realise this vision.\n\nExanima is born as a prelude to Sui Generis (SG), our ambitious open world RPG that has been in development for over two years following a successful Kickstarter campaign. Exanima is a smaller yet complete game in its own right, a dungeon crawler that takes place in SG's Underworld some twenty years prior to its events. Both games are being developed in concert, many of SG's more ambitious features will make an appearance in Exanima as development continues.\n\nExanima provides a reasonably complete and meaningful game experience, but many more features are on their way! We have met our most challenging and significant development goals, now we are ready to bring new features to light and make an even more fun and compelling adventure. Here are some of the planned features, with many already being close to completion:\n\n    Per session and global character skill progression\n    Large non-linear main game following early content\n    Build and permanently save characters by completing early content\n    New encounters, items and environments\n    Ranged combat and new close quarter manoeuvres\n    Numerous moddable thaumaturgic powers\n    More complete arena game modes featuring outdoor arenas\n    Complex NPC interactions and dialogue\n    Cooperative and competitive LAN multiplayer \n\n\nJust setup and play. \nby Simple Setup","torrent":{"xt":"urn:btih:57c49430d73642549356d1878bb8332e8357730f","amp;dn":"Exanima+0.5.1.1+%5BSimpleSetup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57c49430d73642549356d1878bb8332e8357730f","infoHashBuffer":{"type":"Buffer","data":[87,196,148,48,215,54,66,84,147,86,209,135,139,184,51,46,131,87,115,15]},"announce":[],"urlList":[]}}