{"title":"The Bible Collection (Complete 1 - 17) DivX","uid":6490115,"size":19761037312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5852efcbd1cb7db73c1d52877e7c56fbdfd6bb28&amp;dn=The+Bible+Collection+%28Complete+1+-+17%29+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":11,"uploader":"JustPirateBay2011","files":-1,"time":1308849493,"description":"\tThe Bible Collection (Complete 1 - 17) DivX\n\nFirst broadcast on Turner Network Television (TNT), the Bible Collection is a great collection of movies that retell the stories of ten Hebrew Bible and three New Testament characters. Abraham, with its outstanding performance by Richard Harris in the lead role, started this series out on the right foot. It was followed by Joseph, David, Moses, Samson and Delilah and Jacob. After TNT left the project, four more Hebrew Bible movies were made: Genesis, Solomon, Jeremiah, and Esther. Each of these Bible movies is beautifully scored by Ennio Morricone and features solid to excellent direction, cinematography, and acting. Some are obviously better than others but each attempts a faithful recreation of the events using the Bible as its primary source. My personal favourites are Abraham, Joseph, and Solomon. In recent years, the series has continued into the New Testament with three movies: Jesus, St. Paul, and The Apocalypse.\n\nStars of the series include: Ben Kingsley, Elizabeth Hurley, Sean Bean, Leonard Nimoy, Dennis Hopper, Michael Gambon, Richard Harris, Barbara Hershey, Matthew Modine, Lara Flynn Boyle, Martin Landau and more!\n\nI have included &quot;The Gospel of John&quot; as an addition to &quot;Jesus Vol 1&quot;. Personally speaking i believe this to be the best portrayal of the Lord out there!, and it's word for word out of &quot;The Good News Bible&quot;.\n\nEnjoy","torrent":{"xt":"urn:btih:5852efcbd1cb7db73c1d52877e7c56fbdfd6bb28","amp;dn":"The+Bible+Collection+%28Complete+1+-+17%29+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5852efcbd1cb7db73c1d52877e7c56fbdfd6bb28","infoHashBuffer":{"type":"Buffer","data":[88,82,239,203,209,203,125,183,60,29,82,135,126,124,86,251,223,214,187,40]},"announce":[],"urlList":[]}}