{"title":"The Mammoth Book of Best New Erotica - Maxim Jakubowski","uid":11717119,"size":7750069,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5939c81a963fd4dcabd0fd55fad154f8a0e11533&amp;dn=The+Mammoth+Book+of+Best+New+Erotica+-+Maxim+Jakubowski&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"Mohammad_AT","files":33,"time":1424629393,"description":"01. The Mammoth Book of Best New Erotica - Volume 1 - Maxim Jakubowski\n\nMaxim Jakubowski's skilful editorship has resulted in a collection of the best erotic writing from 2000-2001. Contributors come from the UK and America, plus Europe, the Antipodes, South America and the Asian subcontinent. The book contains a mixture of established talents such as Michael Hemmingson, M. Christian, Marilyn Jaye Lewis, Susannah Indigo, Sarah Veitch and Mark Ramsden, plus acclaimed authors who are welcome newcomers to this genre, such as Lauren Henderson, Matt Thorne and Helen Lederer. Stories include: Saucy goings-on in a British Rail carriage(Helen Lederer) A trilogy of stories about threesomes - as seen from all angles! (Daniel James Cabrillo) The merits of Jane Austen vs the Internet when it comes to steamy sex (Lauren Henderson) The not-so-secret life of a cinema usherette(Jacqueline Lucas) A young man follows an Internet trail of sex with surprising results (Matt Thorne) The erotic interaction between an author and his editor (Anya Ross)\n\n\n02. The Mammoth Book of Best New Erotica - Volume 2 - Maxim Jakubowski\n\nFrom dust cover flap: Edited by Maxim Jakubowski. When it comes to erotica, bigger is always better! That's what this colossal collection of seduction proves, with nearly 50 tantalizing tales. Featuring only the best new erotic stories, you'll get 500 pages of mind-blowing encounters with something for every erotic taste...Find out how a one-time sexually frustrated librarian learned to get her kicks at the hands of a bisexual stud with a knack for fixing problems-and causing them!-in &quot;Greek Fever&quot;. See what happens to a naughty girl when she gets punished by her lesbian lover in &quot;Surrender Dorothy&quot;. In &quot;Tell Me a Story&quot;, savor the plight of a woman who wins a trip for writing a fiery tale of domination and possession-and wins the interest of her professor, who aches to act it out with her. This mammoth-sized anthology proves that there's simply no such thing as too much when it comes to great sex! Includes stories by some of today's raciest erotica writers! Susannah Indigo Thomas S. Roche Marilyn Jaye Lewis Alison Tyler Maxim Jabukowski Emma Kaufmann *Poppy Z. Brite and lots more!\n\n\n03. The Mammoth Book of Best New Erotica - Volume 3 - Maxim Jakubowski\n\nWitty and arousing, here is the very finest in new erotic writing from the year 2007-08. With more than 40 stories this acclaimed annual offers an addictive menu of sex from all around the world. This year features outstanding work from both established masters and newer talents including Sage Vivant, O'Neil De Noux, Sophie Mouette, Thomas S. Roche, M. Christian, Saskia Walker and Alison Tyler. The stories include:Jeremy Edwards, Slightly AjarLisette Ashton, Victoria's HandKelly Jameson, A Night in CameroonM. Christian, I Am Jo's VibratorThomas S. Roche, Amour NoirLandon Dixon, Matching Skirt and KneepadsRachel Kramer Bussel, Late for a Spanking\n\n\n04. The Mammoth Book of Best New Erotica - Volume 4 - Maxim Jakubowski\n\nThis is a fabulous collection of new writing from all over the world during 2003-4, selected by bestselling editor Maxim Jakubowski. These tales explore the extraordinary variety of the erotic experience, as men and women play out the eternal rhythms of desire. Here is explicit sexual drama in all its forms from some of the best writers in the field.\n\n\n05. The Mammoth Book of Best New Erotica - Volume 5 - Maxim Jakubowski\n\nIn the realm of the senses, everything can be explored. A fabulous collection of new writing from all over the world during 2004-05, selected by bestselling editor Maxim Jakubowski. These tales explore the extraordinary variety of the erotic experience, as men and women play out the eternal rhythms of desire. Here is explicit sexual drama in all its forms from some of the best writers in the field.\n\n\n06. The Mammoth Book of Best New Erotica - Volume 6 - Maxim Jakubowski\n\nIn the realm of the senses, everything can be explored A seductive collection of new writing from all over the world during 2005-06, selected by bestselling editor Maxim Jakubowski. These tales explore the extraordinary variety of the erotic experience, as men and women play out the eternal rhythms of desire. Here is explicit sexual drama in all its forms from some of the best writers in the field. PRAISE FOR THE BOOK 'Few publications will boast as many climaxes.' Oliver Robinson, Observer\n\n\n07. The Mammoth Book of Best New Erotica - Volume 7 - Maxim Jakubowski\n\nHere in one seductive volume is the finest erotic writing of the year 2006-2007, from around the world. Containing more than 40 new stories, The Mammoth Book of Best New Erotica offers an addictive menu of sex in all its splendour. These tales trace the extraordinary variety of the erotic experience, as men and women play out the eternal rhythms of desire. In the realm of the senses, everything can be explored. Here is explicit sexual drama in all its forms from some of the best writers in the field.\n\n\n08. The Mammoth Book of Best New Erotica - Volume 9 - Maxim Jakubowski\n\nExciting, intimate, experimental - a selection of the best of recent erotic writing. Featuring more than 40 new stories of sexual encounters from every part of the world, The Mammoth Book of Best New Erotica offers the most outstanding work of both well-known names and fresh new talents, such as Lisette Ashton, Polly Frost, Maxim Jakubowski, Marilyn Jaye-Lewis, Laurence Klavan (a first ever erotic story by this winner of an Edgar award for crime fiction), Rachel Kramer Bussel, Kristina Lloyd, Thomas S. Roche, Alison Tyler and Ian Watson.\n\n\n09. The Mammoth Book of Best New Erotica - Volume 10 - Maxim Jakubowski\n\nUnputdownable short erotic fiction from the most outstanding writers in the field. Once again, Maxim Jakubowski has put together a masterful selection of over 40 stories of sexual encounters from every corner of the world. From both acclaimed writers and exceptional newcomers, this is powerful erotica which explores the full range of human sensual and sexual experience.\n\n\n10. The Mammoth Book of Best New Erotica - Volume 11 - Maxim Jakubowski\n\nUnputdownable short erotic fiction from the most outstanding writers in the field. Once again, Maxim Jakubowski has put together a masterful selection of over 40 stories of sexual encounters from every corner of the world. From both acclaimed writers and exceptional newcomers, this is powerful erotica which explores the full range of human sensual and sexual experience.\n\n\n11. The Mammoth Book of Best New Erotica - Volume 12 - Maxim Jakubowski\n\nA collection of 48 original, sensual and provocative sexual adventures, the twelfth volume of The Mammoth Book of Best New Erotica offers the very best new work of both deservedly well-known names and up-and-coming talents, including Peggy Munson, for the first time; Elissa Wald; French author Emma Becker; award-winning SF writer Kij Johnson; an acclaimed crime author writing as Pat McStone; San Francisco photographer Charles Gatewood; and newcomer I. J. Miller.\n\nHere you will find an exciting diversity of erotic writing which explores the full breadth of human emotional, sensual and sexual experience - vanilla is emphatically not the only flavour - in stories which are by turns intriguing, shocking, fascinating and enchanting","torrent":{"xt":"urn:btih:5939c81a963fd4dcabd0fd55fad154f8a0e11533","amp;dn":"The+Mammoth+Book+of+Best+New+Erotica+-+Maxim+Jakubowski","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5939c81a963fd4dcabd0fd55fad154f8a0e11533","infoHashBuffer":{"type":"Buffer","data":[89,57,200,26,150,63,212,220,171,208,253,85,250,209,84,248,160,225,21,51]},"announce":[],"urlList":[]}}