{"title":"A Brief History of Numbers","uid":12344466,"size":5147846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59ad3ca55e3a21143ab683e2118c1917c47aec7c&amp;dn=A+Brief+History+of+Numbers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"mdusanjay","files":1,"time":1441331972,"description":"A Brief History of Numbers by Leo Corry\n\nOverview: The world around us is saturated with numbers. They are a fundamental pillar of our modern society, and accepted and used with hardly a second thought. But how did this state of affairs come to be? In this book, Leo Corry tells the story behind the idea of number from the early days of the Pythagoreans, up until the turn of the twentieth century. He presents an overview of how numbers were handled and conceived in classical Greek mathematics, in the mathematics of Islam, in European mathematics of the middle ages and the Renaissance, during the scientific revolution, all the way through to the mathematics of the 18th to the early 20th century. Focusing on both foundational debates and practical use numbers, and showing how the story of numbers is intimately linked to that of the idea of equation, this book provides a valuable insight to numbers for undergraduate students, teachers, engineers, professional mathematicians, and anyone with an interest in the history of mathematics","torrent":{"xt":"urn:btih:59ad3ca55e3a21143ab683e2118c1917c47aec7c","amp;dn":"A+Brief+History+of+Numbers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59ad3ca55e3a21143ab683e2118c1917c47aec7c","infoHashBuffer":{"type":"Buffer","data":[89,173,60,165,94,58,33,20,58,182,131,226,17,140,25,23,196,122,236,124]},"announce":[],"urlList":[]}}