{"title":"The Streets - discography (4 studio albums + 1 EP)","uid":4476102,"size":366439688,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:59c3b769d5277944bb2e471e937366438d371854&amp;dn=The+Streets+-+discography+%284+studio+albums+%2B+1+EP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":2,"uploader":"phrozin1","files":-1,"time":1225351641,"description":"Mike Skinner (born 27 November 1978), more commonly known by his stage name The Streets, is a rapper from Birmingham, England.\n\nSkinner acquired his first keyboard at the age of five after moving to Birmingham from Barnet, North London. As a teenager, he built a miniature recording studio in his bedroom. He began writing hip hop and garage music in his home in West Heath in Birmingham, with a crew of other rappers including best friend Chris Panton. He describes his background as &quot;Barratt class: suburban estates, not poor but not much money about, really boring.&quot; Skinner started making songs at the age of fifteen.\n\nHe has suffered from epilepsy since the age of seven.\n\nIn the late 1990s, following secondary education at Bournville School, Skinner was a student at Sutton Coldfield College, near Birmingham, and was working in fast food jobs while trying to start his own independent record label and sending off demos. The Streets started out as a group project but quickly became a one-man act as band members fell away. At the end of 2000, the Locked On label, who had had success with The Artful Dodger featuring Craig David, agreed to release &quot;Has It Come To This&quot; under the name The Streets. Skinner moved from Birmingham to Brixton to pursue his recording career.\n\nDespite having been raised in Birmingham, an area with a distinctive regional accent, he speaks with a London-influenced accent. Some critics have accused Skinner of using a &quot;Mockney&quot; accent.[4] He can be heard speaking in his normal accent at the beginning of the song &quot;Fake Streets Hats&quot;. Because of his accent, Skinner is identified with Birmingham; a keen supporter of Birmingham City, he even wore the club&amp;#039;s replica shirt on stage.\n\n&quot;Has It Come To This&quot; proved to be a breakthrough hit for The Streets, going top-twenty in March 2001. For his debut album, Original Pirate Material, Skinner wanted to take UK garage in a new direction with material reflecting the lifestyle of clubbers in Britain. The track Let&amp;#039;s Push Things Forward reflects the philosophy of the album. The album was released and proved to be successful both with critics and the general public alike. In the UK, the album was nominated for the prestigious Mercury Music Prize and was favourite with the bookies to win it (it was later won by Ms. Dynamite). The Streets was nominated for best album, best urban act, best breakthrough artist and best British male artist in the 2002 BRIT Awards. The NME named it as one of their top five albums of 2002. The cover image is Towering Inferno by the acclaimed photographer Rut Blees Luxemburg.\n\nSubsequent singles included &quot;Don&amp;#039;t Mug Yourself&quot;, &quot;Weak Become Heroes&quot; and Let&amp;#039;s Push Things Forward which all reached the top 40 in the UK. Many of his songs have a UK garage feel but have in the main found popularity in the &amp;#039;indie&amp;#039; scene. Original Pirate Material had debuted and peaked at number 12 in the UK album charts, and wouldn&amp;#039;t reach any higher until his next album was released.\n\nThe success of Original Pirate Material in the UK led to a US release of the album through Vice/Atlantic in late 2002. Though the album was not a commercial success in the States, it was received positively by Rolling Stone, Spin Magazine, The New York Times, Blender, USA Today and the LA Times all nominating it as one of the albums of the year. The album was named Entertainment Weekly&amp;#039;s &quot;album of the year&quot;. The album reached number two on the Billboard electronic charts and the top 20 on the independent and Heatseeker charts in the US in 2003.\n\n\n=================================================================\nArtist    -  The Streets       \nAlbum     -  various                                          \nGenre     -  hip hop                                             \nLabel     -  679 Recordings, The Beats\nYear      -  2000 - present                                            \nTracks    -  n/a                                               \nPlaytime  -  n/a\nFile Type -  .mp3\nSize      -  349.46 MB\nkbps      -  VBR / 256 avg.\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/phrozin1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/phrozin1&lt;/a&gt; \n\nEnjoy. Please seed for others. Thanks.        \n=================================================================                                    \n\nThe Streets discography:\n\nOriginal Pirate Material - 25 May 2002 \nAll Got Our Runnins (EP) - 5 September 2003\nA Grand Don&amp;#039;t Come for Free - 18 May 2004\nThe Hardest Way to Make an Easy Living - 10 April 2006\nEverything Is Borrowed - 15 September 2008 ","torrent":{"xt":"urn:btih:59c3b769d5277944bb2e471e937366438d371854","amp;dn":"The+Streets+-+discography+%284+studio+albums+%2B+1+EP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59c3b769d5277944bb2e471e937366438d371854","infoHashBuffer":{"type":"Buffer","data":[89,195,183,105,213,39,121,68,187,46,71,30,147,115,102,67,141,55,24,84]},"announce":[],"urlList":[]}}