{"title":"Tony Northrup's DSLR Book(ePUB,Retail){32Skulls}","uid":10991815,"size":10266798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59d81b2eed463d338fe5c52f0bcc44d2d3465694&amp;dn=Tony+Northrup%27s+DSLR+Book%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"32Skulls","files":-1,"time":1410017269,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\nStunning Digital Photography is much more than a book; it's a hands-on, self-paced photography class with over 9 hours of online training videos and free help from the author and other readers. That's why award-winning author and photographer Tony Northrup's book is the #1 photography e-book with over 100,000 readers.\n\nThis book gives you five innovations no other book offers:\n1) Free video training. Watch over 9 hours of fast-paced, hands-on video tutorials integrated into the book to support and reinforce the lessons. View the videos using any web browser or by scanning QR codes with your smartphone.\n2) Hands-on practices. Complete the practices at the end of every chapter to get the real world experience you need.\n3) Practice quizzes. At the end of Chapters 2-13 you have the option of taking an online quiz to apply what you learned in the chapter and make sure you didn't miss anything important.\n4) Classroom support. Join an author led private community of supportive, helpful people who also want to improve their photography.\n5) Free ebook with lifetime updates. When you buy the book and join the private Stunning Digital Photography readers community, you can download the ebook and copy it to your smartphone or ereader for easy reference. The ebook is regularly updated with new content and videos as new photography trends and equipment emerge, so it never becomes outdated.\n\nIn this book, beginner photographers will master:\n* Using composition to take great photos with any camera\n* Adjusting exposure to control the brightness of your photos\n* Setting your shutter speed to freeze action or blur motion\n* Controlling your aperture to blur or focus the background\n* Setting your ISO for bright and dark environments\n* Finding beautiful natural light for landscapes and portraits\n* Using flash without the ugly effects\n* Troubleshooting blurry, dark, and bad pictures\n* Taking great pictures of pets\n* Wildlife photography (mammals, birds, insects, fish, and more)\n* Taking pictures at night, including fireworks, stars, and meteors\n* Photographing sunrises, sunsets, landscapes, cityscapes, flowers, forests, waterfalls, rivers, fireworks, and more\n\nAdvanced photographers can skip forward to learn the pro's secrets for:\n* Posing men and women, with checklists\n* Taking candid, casual, formal, and underwater portraits\n* Using RAW files\n* Using HDR to overcome lighting challenges or create art\n* Macro/close-up photography\n* Using diffusers, reflectors, and other light modifiers\n* Remotely triggering multiple flashes for inexpensive studio lighting\n* Building a permanent studio in your home\n* Using studio lighting on any budget\n* Shooting your first wedding\n* High speed photography\n* Location scouting/finding the best spots and times\n* Planning shoots around the sun and moon\n* Creating star trails using two techniques: long exposure and image stacking\n* Light painting\n* Eliminating noise\n* Focus stacking for infinite depth-of-field\n* Underwater photography\n* Getting close to wildlife\n* Using electronic shutter triggers\n\n\nBy Tony Northrup\nPublished by Mason Press in 2012\nEPUB, Retail, 241 pages, English ","torrent":{"xt":"urn:btih:59d81b2eed463d338fe5c52f0bcc44d2d3465694","amp;dn":"Tony+Northrup%27s+DSLR+Book%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59d81b2eed463d338fe5c52f0bcc44d2d3465694","infoHashBuffer":{"type":"Buffer","data":[89,216,27,46,237,70,61,51,143,229,197,47,11,204,68,210,211,70,86,148]},"announce":[],"urlList":[]}}