{"title":"Lonely Planet Scotland (7th Ed) (AZW3,Retail){32Skulls}","uid":10956805,"size":14600836,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59d8dbf7466d2391c0bdbaa16e326a0b725e7d0d&amp;dn=Lonely+Planet+Scotland+%287th+Ed%29+%28AZW3%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"32Skulls","files":-1,"time":1409685212,"description":"                       â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\nLonely Planet Scotland is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Celebrate with locals at a lively Edinburgh festival, go bird-watching in the Shetland Islands, or sit back with single-malt whisky after a day of gallery-hopping in Glasgow; all with your trusted travel companion. Get to the heart of Scotland and begin your journey now!\n\nInside Lonely Planet Scotland Travel Guide:\n\n\nFull-colour maps and images throughout\n\nHighlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\n\nInsider tips save you time and money and help you get around like a local, avoiding crowds and trouble spots\n\nEssential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\n\nHonest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\n\nCultural insights give you a richer and more rewarding travel experience - including customs, history, art, literature, cinema, music, sport, landscapes, wildlife, cuisine, drink, and more\n\nFree, convenient pull-out Edinburgh map (included in print version), plus over 40 colour local maps\n\nUseful features - including Walking Tours, What's New, and Month-by-Month (annual festival calendar)\n\n\nCovers: Orkney Islands, Shetland Islands, Northern Highlands, Inverness, Central Highlands, Northeast, Central, Southern Highlands, Glasgow, Edinburgh, Southern Scotland, and more\n\n\nBy Neil Wilson, Lonely Planet, Andy Symington\nPublished by Lonely Planet in 2013\nAZW3, Retail, 512 pages, English ","torrent":{"xt":"urn:btih:59d8dbf7466d2391c0bdbaa16e326a0b725e7d0d","amp;dn":"Lonely+Planet+Scotland+%287th+Ed%29+%28AZW3%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59d8dbf7466d2391c0bdbaa16e326a0b725e7d0d","infoHashBuffer":{"type":"Buffer","data":[89,216,219,247,70,109,35,145,192,189,186,161,110,50,106,11,114,94,125,13]},"announce":[],"urlList":[]}}