{"title":"Business Model You - A One-Page Method For Reinventing Your Care","uid":8673002,"size":42177457,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a9c4be5d15d9bb445cd481434910a8d58aaaf08&amp;dn=Business+Model+You+-+A+One-Page+Method+For+Reinventing+Your+Care&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":0,"uploader":"gnv65","files":-1,"time":1373533181,"description":"Business Model You: A One-Page Method For Reinventing Your Career \nby Timothy Clark, Alexander Osterwalder and Yves Pigneur\nWiley | March 2012 | ISBN-10 1118156315 | PDF | 257 pages | 40.2 mb &lt;a href=&quot;\nhttp://www.amazon.com/Business-Model-You-One-Page-Reinventing/dp/1118156315&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Business-Model-You-One-Page-Reinventing/dp/1118156315&lt;/a&gt;\n\nThe global bestseller Business Model Generation introduced a unique visual way to summarize and creatively brainstorm any business or product idea on a single sheet of paper. Business Model You uses the same powerful one-page tool to teach readers how to draw &quot;personal business models,&quot; which reveal new ways their skills can be adapted to the changing needs of the marketplace to reveal new, more satisfying, career and life possibilities. Produced by the same team that created Business Model Generation, this book is based on the Business Model Canvas methodology, which has quickly emerged as the world's leading business model description and innovation technique.\n\nThis book shows readers how to:\n-    Understand business model thinking and diagram their current personal business model\n-    Understand the value of their skills in the marketplace and define their purpose\n-    Articulate a vision for change\n-    Create a new personal business model harmonized with that vision, and most important, test and implement the new model\n\nWhen you implement the one-page tool from Business Model You, you create a game-changing business model for your life and career.\n\nAbout the Authors\nTim Clark is a teacher, trainer, author, entrepreneur, and former university professor who leads the global personal business model movement at BusinessModelYou.com. After selling his startup to a NASDAQ listed entity in a multi-million-dollar transaction, he completed doctoral research in international business model portability and went on to author or edit five books on entrepreneurship, business models, and personal development, including the international bestsellers Business Model You and Business Model Generation, which together have sold half a million copies in 26 languages.\nAlexander Osterwalder (1974) is an entrepreneur, speaker and business model innovator. Together with Professor Yves Pigneur he invented the Business Model Canvas, a practical tool to visualize, challenge and (re-) invent business models. The Canvas is used by leading organizations around the world, like GE, P&amp;G, Ericsson, and 3M.\nAlexander holds a PhD from HEC Lausanne, Switzerland, and is a founding member of The Constellation, a global not-for-profit organization aiming to make HIV/AIDS and Malaria history.","torrent":{"xt":"urn:btih:5a9c4be5d15d9bb445cd481434910a8d58aaaf08","amp;dn":"Business+Model+You+-+A+One-Page+Method+For+Reinventing+Your+Care","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a9c4be5d15d9bb445cd481434910a8d58aaaf08","infoHashBuffer":{"type":"Buffer","data":[90,156,75,229,209,93,155,180,69,205,72,20,52,145,10,141,88,170,175,8]},"announce":[],"urlList":[]}}