{"title":"Jal (Water) (2014)-DVD.Rip-HEVC-x265.AAC.Esubs-700MB-[DDR]","uid":11855651,"size":735114697,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5aa86c3686950d28544260d03536341b26de945c&amp;dn=Jal+%28Water%29+%282014%29-DVD.Rip-HEVC-x265.AAC.Esubs-700MB-%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":6,"uploader":"SaM","files":1,"time":1430154974,"description":"\nSynopsis:\n[SIZE=3]This week, we of DDR celebrate the diversity of India and bring you, apart from our regular releases, two special award winning films. The First is Jal (Water) a 2014 film from the Western most corner of India - the Raan of Kutch. Although the language is nominally Hindi, it is actually the local dialect of the Raan.\n\nThe second is Crossing Bridges, a film from the Eastern-most end, Arunachal Pradesh in the Shertupken language. Both films have English Subtitles.\n\nEach brings out vividly the beauty of the landscape and give you glimpses of the culture of the land. Each brings out conflicts that people face. Yet both films are so very different.\n\nJal is the story of Bakka, a special person in the water starved Raan of Kutch, for he is a water diviner - a man who can tell you where to find water. That makes him special, almost a god! Yet Bakka's own village has very little water, while a neighbouring enemy village has it in plenty. Then come a group of foreign environmentalists who want to save the flamingoes who migrate to the land. They drill for water but can only find it with the help of Bakka..\n\nBakka meantime is in love with Kesar, the daughter of the headman of the enemy village. Kajri of his own village loves him and apart from the threesome, there are others who are jealous of Bakka. The intrigues rise to a fever pitch with a shattering climax..\n\nCrossing Bridges on the other hand is the story of Tashi, a web designer who loses his city job and has to go back to his village. Everything there is alien, for he has lost his connect to the past. As he waits for another job to materialise, he gradually begins to rediscover his roots, He meets and falls in love with Anila, a school teacher and just as he adjusts to the village life, the city beckons again, for he gets a new job offer...\n\nComments on Jal:\nThis is a breathtakingly beautiful film. It brings out the harsh beauty of the Rann of Kutch like no other film that I have seen. As Pooja Gupte's camera hovers over the landscape and catches the dusty hot winds and the swirling dust, you realise that this film is worth seeing for the cinematography alone. The story too is a compelling one of local enmities and intrigues. If it has a trace of Romeo &amp; Juliet, it also has a local flavour in full measure. What helps is the superb music direction by the Singer-Percussionist duo of Sonu Nigam &amp; Bickram Ghosh. From the theme song Jal Dey, by Shobha Gurtu to the last strains of the song as the film fades out, the music blends into the story and becomes a part of it. For a debut film, Girish Malik does a fine job and we will, I hope see lots of him in the future.\n\nActing by Purab Kohli as Bakka adds to the film. He is at once debonair and ebullient and when the chips are down, bewildered and scared. He is well backed up by the two leading actresses Kirti Kulhari as Kesar and Tannishtha Chatterjee as Kajri. Others do well too.\n\nIf there is a grouse, it is that at over 2 hours, the film is overly long. Some of the scenes do seem unnecessary and editing could have improved the film more.\n\nOverall this is a film that you should see for its breathtaking visuals and captivating music. It tells a poignant tale and delivers an important message - water is a scarce and valuable commodity.\n\nBoth Jal &amp; Crossing Bridges are films that entertain, but are really for the discerning audience..\n\nCrossing Bridges is being uploaded separately.\n\nUploader's Notes:\nThe original DVD had an unpleasant yellow tint which I have corrected and that helps in bringing out the beauty of the Rann in full. I think a Web HD print had been uploaded in the past, but the color correction alone makes this rip worth downloading. Don't take my word for it. See the screenshots and the sample (Its from the exact center of the film) and judge for yourself.\n\nBe aware that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC or Media Player Classic or SMPlayer. Earlier versions may not work\n\nIMDB Link: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2708550/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2708550/&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://extraimago.com/image/2ap&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/2ap&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/2aB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/2aB&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/2aP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/2aP&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/2aX&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/2aX&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/2ar&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/2ar&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/2aG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/2aG&lt;/a&gt;","torrent":{"xt":"urn:btih:5aa86c3686950d28544260d03536341b26de945c","amp;dn":"Jal+%28Water%29+%282014%29-DVD.Rip-HEVC-x265.AAC.Esubs-700MB-%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aa86c3686950d28544260d03536341b26de945c","infoHashBuffer":{"type":"Buffer","data":[90,168,108,54,134,149,13,40,84,66,96,208,53,54,52,27,38,222,148,92]},"announce":[],"urlList":[]}}