{"title":"Gundam 00 Complete Series BDRip [1280x720 Dual-Audio]","uid":7332508,"size":15726597117,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:5aeac86b3bec6433927515638b822ab0d1afa51c&amp;dn=Gundam+00+Complete+Series+BDRip+%5B1280x720+Dual-Audio%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":17,"uploader":"Daman4Iife","files":-1,"time":1338954401,"description":" Season 01\nIt is the year A.D. 2307. Fossil fuels on Earth have been depleted entirely, with mankind turning to the next available power source: solar energy. During this time, 3 orbital elevators with solar power generation systems are built, each under control by the Union (formerly United States of America), the Human Reformist Alliance (Russia, China and India) and the AEU (Europe). However, not all countries are able to enjoy the benefits of this system, leading to widespread resentment and war. Arising out of the conflict, a mysterious non-profit military organization known as Celestial Being appears, dedicated to end all warfare using Mobile Suits called Gundam. This begins the stories of Gundam Meisters (pilots) Setsuna F. Seiei, Lockon Stratos, Allelujah Haptism and Tieria Erde as they are thrown into conflict between the 3 superpowers and the other various factions.\n\nSeason 02\nFour years have passed since the final battle between Celestial Being and the UN Forces. Humanity, having established the Earth Sphere Federation, forms an independent security preservation force, A-Laws, separate from the formal Federation army to further unify nations and the will of mankind. But the reality was the inhumane oppression of misuse of powers, doctrines, and ideologies in the name of unity.\n\nSaji Crossroad has followed the path to becoming a space engineer to keep his promise to Louise Halevy, who in turn was compelled to become involved in Federation government reform and joined A-Laws as a mobile suit pilot during the four-year gap.\n\nMeanwhile, Setsuna F. Seiei, having survived the climactic battle four years ago, witnessed a change in the world due to the actions of Celestial Being. With the defeat of Alejandro Corner, he dreamed of a peaceful world without conflict; but before his own eyes was the reality of the continuing strain on peace, the oppression caused by A-Laws. He decides once more to fight with Gundam, the power with the potential to change the world.\n\nContainer ...........................: Matroska\nFile size ...........................: 290MB\nOverall bit rate ..................: 1800 Kbps\nWidth ................................: 1280\nHeight ...............................: 720\nDisplay aspect ratio .............: 16:9\nFrame rate ..........................: 23.976 fps\nAudio .................: Jap AAC 48KHz:\nSubtitles:English\nEpisodes: 50","torrent":{"xt":"urn:btih:5aeac86b3bec6433927515638b822ab0d1afa51c","amp;dn":"Gundam+00+Complete+Series+BDRip+%5B1280x720+Dual-Audio%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aeac86b3bec6433927515638b822ab0d1afa51c","infoHashBuffer":{"type":"Buffer","data":[90,234,200,107,59,236,100,51,146,117,21,99,139,130,42,176,209,175,165,28]},"announce":[],"urlList":[]}}