{"title":"Rocky IV - Soundtrack (1985) 128kbps [RussTheStalker]","uid":4437993,"size":41926158,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5b12a315401c7607c22fe2a55e8e7f7eadb67a1c&amp;dn=Rocky+IV+-+Soundtrack+%281985%29+128kbps+%5BRussTheStalker%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":1,"uploader":"r_monckman","files":10,"time":1223662474,"description":" &lt;a href=&quot;http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:k9ftxqugld0e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:k9ftxqugld0e&lt;/a&gt;\n\nReview:\n\nQuite simply, Rocky IV was a movie for the ages. The story of a man who had it all, only to lose so much overnight. Revolving around tension and alienation at the personal, political, spiritual and athletic levels, Sylvester Stallone&amp;#039;s portrayal of Rocky Balboa in Rocky IV was without question the most multi dimensional role of his career. This isn&amp;#039;t to shirk the original Rocky, which dealt with questions of class, ethnicity, and overcoming obstacles to victory...but Rocky IV was more of a movie to be related to on a universal scale.\n\nThis indomitable spirit is best exemplified by the album&amp;#039;s lead off track &quot;Burning Heart&quot;. The logical sequel to Survivor&amp;#039;s epic, instantly recognizable and painfully unforgettable sports anthem &quot;Eye Of The Tiger&quot; finds the central protagonist a bit more mature and refined; world weary from his battles and exponentially more introspective than he was in his burning youth. This torch is then passed to John Cafferty; who soundtrack fans will no doubt recognize from his work on Eddie &amp; The Cruisers, Eddie &amp; The Cruisers 2: Eddie Lives and Eddie &amp; The Cruisers: The Unreleased Tapes. Here, Cafferty has replaced his Brown Beaver Band with the urgent, yet mildly dated synthesizer work of Vince DiCola, whose name you will be hearing again in this review shortly.\n\nDecidedly pacing the album&amp;#039;s soundtrack as well as setting the calm before the storm, the soundtrack producers wisely teamed up Kenny Loggins and Gladys Knight for &quot;Double Or Nothing&quot;. Astute viewers of the film will no doubt recall the placement of this tune where our hero Rocky Balboa is washing his car and attempting to be convinced by long time friend Apollo Creed to help him train for one last fight against the Russian hitting machine/movie antagonist Ivan Drago (with stoic wife convincingly played by future Flavor Flav arm candy Brigitte Nielsen). Anyways, this combination was no doubt inspired by a similar pairing of blue eyed soul boy with r&amp;b legendary diva: George Michael and Aretha Franklin would hit the top of the charts with their fantastic duet &quot;I Knew You Were Waiting For Me&quot; (which is sadly not included here).\n\nThis boxing exhibition leads to disastrous results, with Creed&amp;#039;s death in the ring at the hands of Drago, but not before being serenaded to his grave by the godfather of soul himself, James Brown. Perhaps the soundtrack&amp;#039;s second most popular tune (second only to &quot;Eye Of The Tiger&quot; which makes a return appearance for good sales, no doubt), &quot;Living In America&quot; perfectly sums up the decadence, extravagance and sheer bloated pompousness of the eighties. It also reinforces the symbolism of Creed&amp;#039;s death: that Americans, through this hedonism, have become fat, soft and bloated themselves, especially when compared to the steel and precision of Russian boxers.\n\nCreed&amp;#039;s death leaves a scarring impression on Balboa, but Rocky&amp;#039;s loss is thankfully our gain, as we are treated to one of the best montage sequences in all of cinema history, with soundtrack contributed by Benny Mardones&amp;#039; (of &quot;Into The Night&quot; soft rock ballad fame) songwriting partner Robert Tepper. Taking clips from the first three movies in the series, we find Balboa reflecting carefully on his life and the choices he&amp;#039;s made, all while driving with extreme recklessness; weaving through the city highways at breakneck speed in an imported sports car. Though barely heard from again after this, Tepper&amp;#039;s voice no doubt left an impression on the landscape of rock music, as Nickelback&amp;#039;s Chad Kroeger undoubtedly made a conscious investment to emulate Tepper&amp;#039;s emotive, yet throaty delivery, a move that would catapult the mediocre band into superstardom and swimming pools filled with money.\n\nDeciding to train in Russia for a boxing match on Christmas Day (again, the symbolism runs rampant and deep here) , we are treated to yet another montage and the first of two synth-based instrumentals from composer Vince DiCola, who quietly steals the show with &quot;Training Montage&quot;. Easily a proto-jock jam, this ranks up there with some of the finest sports anthems ever. And while it doesn&amp;#039;t have the accessibility of Queen&amp;#039;s &quot;We Will Rock You&quot; or Gary Glitter&amp;#039;s &quot;Rock &amp; Roll Part Two&quot;, it&amp;#039;s emotional peaks and valleys set the perfect contrast to what&amp;#039;s on screen. The art of training runs deep within each man, with Balboa training in a desolate area of what appears to be Siberia, it&amp;#039;s simply man versus the elements. In contrast, Drago trains in a state of the art facility with top technology, doctors and the finest steroids rubles can provide. But within each of these boxers, it&amp;#039;s also a battle to conquer themselves. To push themselves beyond anything possibly capable before in the history of sport, let alone boxing.\n\nAfter intensive training, the match eventually ensues and provides intense peaks and valleys, with Drago and Balboa struggling to gain the advantage, both physically and psychologically. This is scored by DiCola&amp;#039;s &quot;War/Fanfare From Rocky&quot;. Easily the weaker of the two pieces, this still compliments the movie&amp;#039;s climax and eventual dÃƒÂ©nouement with grace and class. Eventually, Balboa does win, but not without a redeeming social message that wins over the hearts and minds of not only the Prime Minister of Russia, but the Russian army and people themselves.\n\nThe final song not mentioned on this soundtrack belongs to one song wonder Touch. With finding a suitable Journey soundalike in the eighties being a near impossible chore, Scotti Bros. and Stallone made the decision to go with Touch&amp;#039;s stirring rendition of the song. The decision paid off in spades, as it still remains one of the best songs in the entire Rocky soundtrack catalog. While it was meant first and foremost to be entertainment, Rocky IV transcended both sports and politics to offer the thought provoking message: that if we all look past the surfaces of one another, if we can somehow disregarded our minor differences, we will see that we are all the same. That if his perceptions and cultural attitudes can change through education and acceptance, then we all can change. It was also the highest grossing movie in the Rocky series.\n\nTrack List:\n\n01 - Burning Heart - Survivor  [3:51]\n02 - Heart&amp;#039;s on Fire - John Cafferty  [4:06]\n03 - Double or Nothing - Gladys Knight, Kenny Loggins  [3:46]\n04 - Eye of the Tiger - Survivor  [3:46]\n05 - War - Vince DiCola  [5:54]\n06 - Living in America - James Brown  [4:42]\n07 - No Easy Way Out - Robert Tepper  [4:21]\n08 - One Way Street - Go West  [4:37]\n09 - The Sweetest Victory - Touch  [4:25]\n10 - Training Montage - Vince DiCola  [3:40]","torrent":{"xt":"urn:btih:5b12a315401c7607c22fe2a55e8e7f7eadb67a1c","amp;dn":"Rocky+IV+-+Soundtrack+%281985%29+128kbps+%5BRussTheStalker%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b12a315401c7607c22fe2a55e8e7f7eadb67a1c","infoHashBuffer":{"type":"Buffer","data":[91,18,163,21,64,28,118,7,194,47,226,165,94,142,127,126,173,182,122,28]},"announce":[],"urlList":[]}}