{"title":"Clips4Sale - Mom, You Promised!","uid":15847702,"size":715845909,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5b76a174469824cedf73c8bf2b4bb352f6a45f45&amp;dn=Clips4Sale+-+Mom%2C+You+Promised%21+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":1,"uploader":"SudoSu","files":1,"time":1474123242,"description":"http://youpornbook.com\r\n\r\n――――――――――――――――\r\n Screen source:\r\n―――――――――――――――― \nhttp://imgreborn.com/?v=412915 \nhttp://imgreborn.com/?v=998597\r\n\r\n&quot;I can't believe I'm doing this... with my own s0n... Just a second...&quot; She says, getting up and walking quickly out of the room. &quot;I'll be right back, I&quot;m just getting a towel.&quot; She comes back in with a small towel and gets back on her knees. &quot;Are you sure this is what you want? A blowjob from your own m0ther? . &quot;Can you imagine what your father would do if he could see us now? His wife on her knees asking their s0n where and how he wants to cum on her? He'd have a heart attack!&quot; She continues sucking him off, smiling and moaning. &quot;He bought me this bed. Did you know that? And now I'm sucking your dick on it.&quot; She grabs a nearby bottle of baby oil and squirts it on her boobs. Then she rubs his cock on and between her boobs. &quot;Do you like m0mmy's boobs? They feel so soft against your hard cock. Don't cum yet. Don't you cum.&quot; She sucks on his balls. &quot;Do you ever imagine fucking me? Burying this dick in your own m0m? Maybe bending me over at the sink while I do the dishes, or over the washing machine? Yea I bet you do. I bet you've imagined covering me in cum almost as much as you've imagined filling me with cum. Filling m0mmy's pussy, and m0mmy's throat with cum... Is that right? ...I thought so... M0mmy has these same fantasies baby... M0mmy wants your cum so fucking bad.&quot; She sucks hard on his cock, whimpering. &quot;I'm gonna open my mouth baby and I want you to cum all over m0mmy's tongue okay? I want to taste you! I want you to fill m0mmy's mouth with cum! Please... give it to me sweety, cum for m0mmy, cum right into m0mmy's mouth.&quot; His cock erupts stream after stream of cum and she happily opens her mouth with her tongue way out to catch it all. She whimpers with ecstasy feeling the hot cum on her cheeks, dripping down onto her shiny tits. &quot;That was fucking hot sweetheart. M0mmy wants more.&quot;\r\n\r\nLatest DVD porn at:  https://thepiratebay.org/search/WebGift/\r\n\r\nMore exclusive content at:  https://thepiratebay.org/user/SudoSu/","torrent":{"xt":"urn:btih:5b76a174469824cedf73c8bf2b4bb352f6a45f45","amp;dn":"Clips4Sale+-+Mom%2C+You+Promised%21+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b76a174469824cedf73c8bf2b4bb352f6a45f45","infoHashBuffer":{"type":"Buffer","data":[91,118,161,116,70,152,36,206,223,115,200,191,43,75,179,82,246,164,95,69]},"announce":[],"urlList":[]}}