{"title":"Scott Walker + Sunn O))) - Soused  mp3  320k   2014","uid":11023100,"size":110134537,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5b940ce41a53de5135e0ec2187301973b50ba344&amp;dn=Scott+Walker+%2B+Sunn+O%29%29%29+-+Soused++mp3++320k+++2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"analogkid6103","files":6,"time":1410627618,"description":"Scott Walker - Sunn o Soused  mp3  320k   2014 What we got...\nScott Walker:\n\nScott Walker (born Noel Scott Engel; January 9, 1943) is an American-born singer-songwriter, composer and record producer. He is noted for his distinctive baritone voice and for the unorthodox career path which has taken him from 1960s pop icon to 21st century avant-garde musician.\n\nOriginally coming to fame in the mid-1960s singing orchestral pop ballads as the frontman of The Walker Brothers, Walker went on to a solo career balancing a light entertainment/MOR ballad approach with increasing artistic innovations in arrangement and writing perspective. Despite a series of acclaimed albums, a disastrous drop in sales forced him back into straight Middle of the road recordings with little of his own artistic input. This in turn eventually led to a Walker Brothers reunion in the mid-1970s (although the latter eventually moved, by mutual consent, into more avant-garde areas).\n\nSince the mid-1980s Walker has revived his solo career while drastically reinventing his artistic and compositional methods, via a series of acclaimed and vividly avant-garde albums. These combine his iconic singing voice with an unsettling avant-garde approach owing more to modernist and post-modernist classical composition than it does to his pop singer past. The change in approach has been compared to &quot;Andy Williams reinventing himself as Stockhausen&quot;.\n\nWalker continues to release solo material, and is currently signed to 4AD Records. As a record producer or guest performer he has worked with a number of artists including Pulp, Ute Lemper and Bat For Lashes.\n\nDespite being American, Walker's success has largely been in the United Kingdom, where his first 3 solo albums reached the top ten. Walker has lived in the UK since 1965; he became a British citizen in 1970.\n\nSunn O))):\n\nSunn (styled as Sunn O)))) is an American metal band from Seattle, Washington that formed in 1998. It is mainly known for its synthesis of diverse genres including drone, ambient, noise, and extreme metal. Supported by a varying cast of collaborators, the band has two core members: Stephen O'Malley (also of Khanate and Burning Witch) and Greg Anderson (of Goatsnake and Engine Kid).\n\nOn December 17, 2009, the song &quot;Hunting &amp; Gathering (Cydonia)&quot; from the CD Monoliths &amp; Dimensions was named the Heaviest Song of All-Time by Jason Ellis on The Jason Ellis Show on Sirius/XM. Greg Anderson then appeared on The Jason Ellis Show on January 12, 2010.\n\nThe group played the ATP New York 2010 music festival in Monticello, New York, during September 2010, where it collaborated with Boris to perform the Altar album live.\n\nFor live performances, Hungarian-born Attila Csihar has performed as prime vocalist since 2003.File Name \tSize\n02 - Herod 2014.mp3 \t27.49 MB\n03 - Bull.mp3 \t21.47 MB\n04 - Fetish.mp3 \t20.99 MB\n01 - Brando.mp3 \t19.99 MB\n05 - Lullaby.mp3 \t15.02 MB\nFolder.jpg \t84.16 KB[image=E6PjWyJFN0]","torrent":{"xt":"urn:btih:5b940ce41a53de5135e0ec2187301973b50ba344","amp;dn":"Scott+Walker+%2B+Sunn+O%29%29%29+-+Soused++mp3++320k+++2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b940ce41a53de5135e0ec2187301973b50ba344","infoHashBuffer":{"type":"Buffer","data":[91,148,12,228,26,83,222,81,53,224,236,33,135,48,25,115,181,11,163,68]},"announce":[],"urlList":[]}}