{"title":"American Chess-nuts  (gnv64)","uid":15898488,"size":38842964,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5be52810048a7acf31317ee4603d9960d41bcbd3&amp;dn=American+Chess-nuts++%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":6,"uploader":"gnv65","files":4,"time":1474982444,"description":"American Chess-nuts - A Collection Of Problems, By Composers Of The Western World\r\nby Eugene Beauharnais Cook, W. R. Henry, Charles Alexander Gilberg\r\nAdelmour W. King | 1868 | ISBN: N/A | scanned PDF | 650 pages | 37 mb\r\n\r\nAn ancient book that contains problems by Americam composers published in various newspapers &amp; periodicals.\r\nThis work is intended to consist of a pretty complete collection of such problems as have appeared in newspapers, etc. It now contains about four thousand positions.\r\nIn selecting problems for the book, the object was to represent leading composers by as full a collection of their works as possible, and to assign flo niche to every author of merit. The older as well as the newer compositions are given, so as fairly to represent American Problemists.\r\nThroughout the work, unless otherwise stated, White has the first move. The solutions are given as compactly as is consistant with clearness-only the initial moves of the two-move nutlets being noted. The names of composers are arranged alphabetically under each division of problems, when known, the address is given the first time an author's name appears.\r\nThe foreign Chess Magazines, and many leading newspapers abroad allotting space to Chess, were duly searched for American Problems. Canada and Cuba have supported Chess-giving newspapers. At home, the native works on Chess, and periodicals devoted thereto, published prior to May, Ib61, were carefully scanned.\r\n \nhttp://s15.postimg.org/h0man6mhn/American_Chess_nuts.jpg","torrent":{"xt":"urn:btih:5be52810048a7acf31317ee4603d9960d41bcbd3","amp;dn":"American+Chess-nuts++%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5be52810048a7acf31317ee4603d9960d41bcbd3","infoHashBuffer":{"type":"Buffer","data":[91,229,40,16,4,138,122,207,49,49,126,228,96,61,153,96,212,27,203,211]},"announce":[],"urlList":[]}}