{"title":"Zafehouse Diaries 1.2.31","uid":9385572,"size":37230394,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5c4dfaf27a42d9e72d2da22514439fcc066f41ee&amp;dn=Zafehouse+Diaries+1.2.31&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"Dan9412","files":10,"time":1387796486,"description":"ZIP file contains game folder. Unzip and play. This is not a GOG release.\n\nChangelog:\nv1.2.3:\n\nAdded: Item Editor. It is now possible to easily add your own items to the game via the Custom Content Manager. The editor allows you to export and import named item &quot;packs&quot; so you can share you creations with other players. Please note that items are complex objects and while we've done our best to catch all the bugs, it should be considered a work-in-progress. This feature is not intended to replace modding, which allows you a greater degree of control over item creation.\nAdded: Holding the Control key and left-clicking on an item in the Supply tab item list, or an item list on the Movement screen, will move that item to a new category called &quot;Odds and ends&quot;. You can use this to filter out items you're no longer interested in and they won't appear under their regular category. You can reverse this change using Control-LMB again on the item.\nTweak: The item lists on the Supply tab and the Movement screen have been modified to separate protection gear and ammunition into their own categories. Also, categories for which no items exist won't appear.\nTweak: Items with stats in excess of five stars will have a plus sign appended to those stats.\nFixed: An issue where melee protection bonuses were not being applied correctly to zombie grab checks.\nFixed: Pain suppression effects, such as those given by painkillers, were sometimes not applied correctly.\nFixed: An issue where the mouse cursor would appear locked in the top-left corner of the screen when using bookmarks.\nFixed: A few diary reporting issues and typos with the new sniping report and lynch mob dilemma.\nFixed: The &quot;Survivors hurt each other&quot; difficulty setting now affects a game in progress.\n\nv1.2.31:\n\nTweak: All custom survivors marked as &quot;use every game&quot; will now be added to each session, before survivors marked &quot;use randomly&quot;.\nTweak: Custom survivors marked &quot;use randomly&quot; now have a 10% chance to appear, down from 25%.\nTweak: (Steam) Custom location photos are no longer considered custom content for the purposes of disabling achievements.\nBalance: The corpse cleaning task has had its difficulty reduced. In addition, even poorly skilled survivors will make progress on this task, albeit very slowly.\nFixed: Scrap now once again appears in item lists.\nFixed: Items are now once again junked from worst to best, rather than best to worst.\nFixed: The Piper no longer takes critical items, such as vehicle parts, if you trade with him.\nFixed: Medicine effectiveness is correctly reported when you hover over a medical item.\nFixed: Painkillers no longer state that they fix broken limbs.\nModding: The &quot;Effectiveness&quot; value for medical items is disabled if that item does not treat injuries.\nModding: Fixed an issue with custom tool items where star ratings were not reported correctly.\nModding: The item editor now provides more information when it detects that an item has not been given a plural name. ","torrent":{"xt":"urn:btih:5c4dfaf27a42d9e72d2da22514439fcc066f41ee","amp;dn":"Zafehouse+Diaries+1.2.31","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c4dfaf27a42d9e72d2da22514439fcc066f41ee","infoHashBuffer":{"type":"Buffer","data":[92,77,250,242,122,66,217,231,45,45,162,37,20,67,159,204,6,111,65,238]},"announce":[],"urlList":[]}}