{"title":"Stephen Fry - More Fool Me [unab] 2014","uid":11144605,"size":872308254,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5d2cba81937b016990c0222d1f256b748befa071&amp;dn=Stephen+Fry+-+More+Fool+Me+%5Bunab%5D+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":2,"uploader":"rambam1776","files":-1,"time":1412232727,"description":"Stephen Fry - More Fool Me [Unabridged] [2014]\nRead by the Author, 192 kbps\n\nStephen Fry invites readers to take a glimpse at his life story in the unputdownable More Fool Me.\n\n\n'Oh dear I am an arse. I expect there'll be what I believe is called an &quot;intervention&quot; soon. I keep picturing it. All my friends bearing down on me and me denying everything until my pockets are emptied. Oh the shame'\n\nIn his early thirties, Stephen Fry - writer, comedian, star of stage and screen - had, as they say, 'made it'. Much loved in A Bit of Fry and Laurie, Blackadder and Jeeves and Wooster, author of a critically acclaimed and bestselling first novel, The Liar, with a glamorous and glittering cast of friends, he had more work than was perhaps good for him.\n\nWhat could possibly go wrong?\n\nThen, as the 80s drew to a close, he discovered a most enjoyable way to burn the candle at both ends, and took to excess like a duck to breadcrumbs. Writing and recording by day, and haunting a never ending series of celebrity parties, drinking dens, and poker games by night, in a ludicrous and impressive act of bravado, he fooled all those except the very closest to him, some of whom were most enjoyably engaged in the same dance.\n\nHe was - to all intents and purposes - a high functioning addict. Blazing brightly and partying wildly as the 80s turned to the 90s, AIDS became an epidemic and politics turned really nasty, he was so busy, so distracted by the high life, that he could hardly see the inevitable, headlong tumble that must surely follow . . .\n\nContaining raw, electric extracts from his diaries of the time, More Fool Me is a brilliant, eloquent account by a man driven to create and to entertain - revealing a side to him he has long kept hidden.\n\nStephen Fry is an award-winning comedian, actor, presenter and director. He rose to fame alongside Hugh Laurie in A Bit of Fry and Laurie (which he co-wrote with Laurie) and Jeeves and Wooster, and was unforgettable as Captain Melchett in Blackadder. He also presented Stephen Fry: The Secret Life of the Manic Depressive, his groundbreaking documentary on bipolar disorder, to huge critical acclaim. His legions of fans tune in to watch him host the popular quiz show QI each week.","torrent":{"xt":"urn:btih:5d2cba81937b016990c0222d1f256b748befa071","amp;dn":"Stephen+Fry+-+More+Fool+Me+%5Bunab%5D+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d2cba81937b016990c0222d1f256b748befa071","infoHashBuffer":{"type":"Buffer","data":[93,44,186,129,147,123,1,105,144,192,34,45,31,37,107,116,139,239,160,113]},"announce":[],"urlList":[]}}