{"title":"The.End.of.Evangelion.1997.DVDRIP.MKV.H264-ZX","uid":3408495,"size":1466808079,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5d65bf747df9cbd766433c30b6a0979636a2c72e&amp;dn=The.End.of.Evangelion.1997.DVDRIP.MKV.H264-ZX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"TheFluff","files":3,"time":1131813731,"description":"NOTE: This movie is encoded with Nero Digital H.264/AVC and contained in a Matroska (.mkv) multimedia container file. To play it, you WILL need a H.264 decoder (not necessarily Nero's) and a Matroska splitter. To view the subs, you will need a subtitling filter for directshow (i.e. vsfilter). ALSO NOTE THAT VLC 0.8.2 WILL NOT BE ABLE TO PLAY THIS MOVIE. To conclude the technobabble: to watch it on Windows, uninstall all other codecs/codec packs you have, then download and install CCCP ( http://cccp.kickassanime.org ). To watch on MacOS, Linux or BSD, a CVS build of MPlayer is recommended (NOT 1.0pre7try2, that one is known to have issues with h264 playback). In return for this, you get the most awesome video quality you've ever seen in a ripped movie.\n\nThis torrent concludes the series of ZX Evangelion torrents on TPB. The series is now complete. Enjoy! -TheFluff\n\nNow, the NFO:\n                   -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n                  &amp;laquo;           Zhentarim DivX Presents           &amp;raquo;\n                   -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n\n                           Title : The End of Evangelion (25: Air/26: My Pure Heart For You) - Renewal v3\n                        AnimeNFO : http://www.animenfo.com/animetitle,1055,jqwqwc,evangelion__end.html\n                           Parts : 1\n                           Genre : Action / Sci-Fi / Alternate ending / Brainfuck / Enlightenment catalysator\n                    Release Date : April 2005\n                  Feature Length : 1 hour 27 minutes\n                            Size : 1.36gb (Read further on how to split into 2x699mb)\n\n                           Audio : Japanese 5.1 HE-AAC (48khz), English 5.1 HE-AAC (48khz) &amp; Dub crew's commentary, Vorbis quality 3\n                       Subtitles : English (srt), English kanji translations (srt) &amp; German (srt)\n                Video Frame Rate : 23.97 fps\n                Video Resolution : 704x480 Anamorphic, displayed in original 16:9 format\n                     Video Codec : Nero H.264 avc\n                          Source : R2 NTSC DVD (video &amp; Jap audio) R1 NTSC DVD (English audio &amp; subs)\n                          Ripper : Rayek\n\n\n                 Additional info : http://anidb.info/perl-bin/animedb.pl?show=anime&amp;aid=202\n                                   http://www.imdb.com/title/tt0169858/\n\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n\n How to use mkv files:\n\n   If you haven't set up your system for Matroska playback, check the FAQ on this URL:\n\n   http://zhentarim.net/zx/playbackfaq.php\n\n  Note: To playback a Nero avc matroska file you will also need a avc decoder, preferably Nero's own.\n  The other alternative is ffdshow, included in the zx playback pack: http://zhentarim.net/zx-pp.php\n\n\nThis encode is to replace the earlier version using 6chan ogg vorbis as Japanese audio, which proved to be a bad choice.\nSince avc/H.264 appeared and 5.1 ogg vorbis have downmix problems plus is inferior to 5.1 he-aac in all other aspects,\na reencode was pretty obvious. Hybrid encode made from 2 DVD's; the video &amp; 5.1 jap audio sources is from the new R2 renewal DVD,\nEnglish audio &amp; subs was taken from Manga's evil R1 release.\n\nDue to differences between frames in the new renewal and old original release retiming of the English audio was needed in the movies,\nas well as the episodes. Seems like the old evangelion masters basically were missing some frames here and there,\nand had too many at other places compared to the new renewal version.\n\nEditing &amp; retiming the English 5.1 track was first done by making a 5.1 wav,\nthen each of the 6 channels was edited &amp; retimed separately. The editing included besides retiming,\nthings like importing audio effects from the superior Japanese mix that?s not included in mangas rag-tag audiojob.\nExamples are the sound of Shinji's tears hitting Asukas face at the end of the movie, and the &quot;growling&quot; of unit 01 at 00:56:29,\nwhen its about to merge with the lance of Longinus. Since besweet pukes when trying to feed it audition made 5.1 wav files, \nwinamps discwriter plugin was used to make a copy that besweet liked.\n\nIrritatingly, all this proved to be for nothing since tinkering with a ac3 source,\nsomehow introduce noticeable lower audio quality to the finished he-aac from the edited file.\nThus having to drop the editing if decent audio quality was to be maintained, only retiming was done.\nThis was achieved by subjecting the ac3 file to insane activity with Delaycut and besplit .lst files &amp; joining.\nUsing that method the different segments that was having delay added or removed, was joined to form the final track.\nSo unless you are a total dub fanatic the Japanese track really is recommended,\nboth acting &amp; effects are better there. The commentary track was much less painfully retimed.\n\nThe r1 English 5.1 track was also lower bitrate then the Japanese one (384kbps vs. 448kbps, standard Manga quality),\nsince Mangle entertainment just upmixed the 2.0 track to 6 channels plus crammed 6 other audio tracks on the butchered r1 DVD.\nTherefore the English audio may appear even lower then the Japanese one, and if you are thinking downmixed 5.1 volume is too low,\nread up on 5.1 movie audio. As a hint the explanation has something to do with that when downmixing from 6 to 2 channels,\nand not make your 2 crappy loudspeakers/headphones puke at the same time, some things must be done with the audio.\nMovies' sound mixes are still made for cinema first and foremost, not for playback on a small stereo home setup.\n\nFortunately volume can be turned up with obvious methods like turning the big round button on your receiver to the left,\nvia audio controls on the control panel, and also further with ac3filter in zoomplayer if you are partially deaf (or want to be).\nRetiming also done with the subs using subtitle workshop and some small manual error fixing and editing to improve the translation.\n\nVery good source, little filtering had to be done to do pre-h264 damage control, so concentration could be put into improving the video.\nThis since with h264 avc you can achieve both greater sharpness/details &amp; less noise/blocks simultaneously on clean sources,\nwithout having the usual crap appear if you know what you're doing. A real win-win situation.\n\n\nIn summary, the major differences from the previous encode is:\n\n - Nero H.264 avc instead of divx5.11.\n\n - Fixed some chapter errors &amp; subtitle spelling.\n\n - Fixed the subtitles at 00:09:21, there used to be too many %'s.\n\n - Improved the subtitles at 00:21:22 --&gt; 00:21:30 in the prime ministers office to appear in more sensible forms.\n   \n - Also improved the subtitles at 00:22:52 --&gt; 00:24:00, to make the &quot;I don?t want to die&quot; lines actually appear when they're spoken.\n   \n - Same sort of improving done at 00:39:47 --&gt; 00:40:28 on the &quot;I'll kill you&quot; lines. Mangas sub crew was either underpaid, lazy or both.\n\n - Much more jumping scene changes/sectioning &amp; frame errors fixed, the avs for this encode was noticeably bigger then the 3 sub tracks combined,\n   which means I used yatta &amp; clicked the mouse a lot.\n\n - Removed the annoying blue ripple effects in lower right corner at 0:03:51-0:04:01, 0:34:58-0:35:01 and 0:40:36-0:40:37 with Photoshop.\n   Amazing they at the studio didn?t remove this from a otherwise perfect source. Another proof corporate DVD authors are the scum of the earth.\n\n - Subs (partial) for the halftime credits added to the 2nd sub track and the letters flashing at 01:15:54 have been translated,\n   and added at the end of this file, since there was no space for them in the movie plus only Superman could have read it fast enough anyway.\n   Now there?s also a German subtitle track.\n\n - Last but not least, the Japanese surround track is now 5.1 he-aac instead of evil 6chan vorbis,\n   and the English track is now upgraded from 2.0 vorbis to 5.1 he-aac surround as well.\n\n\nThanks to Carrie Asagiri for translating the in-movie letters, and nmap for hiring/threatening her into it.\nAlso thanks to Buso-senshi and Tachikoma for the German subs, and Mentar for proofing them. Danke.\n\n\nHow to split it into 2x699mb files: Learn to use Mkvtoolnix - http://www.bunkus.org/videotools/mkvtoolnix/\nSet max files to 2, and make the split at 699M, (Not 700M) this will have the file split exactly at a scenechange (00:56:29)\n\n\n Credits: Come visit our web page at http://zhentarim.net/\n\n BUY it! If you like this, please support the creators of this anime by purchasing it.\n\n\n\n\n\n\n------------------------------------------------------------------------------------------------------------------------------------------\n\nHere follows a translation of the 24 frames flashing at 01:15:54, containing mails sent to Gainax/Anno in the aftermath of Eva's TV ending.\n\n------------------------------------------------------------------------------------------------------------------------------------------\n\n\nNote: (?) means that the text is cut in the original pic and I can?t translate those parts.\n\nLetter 01\n---------\n\nAfter seeing ?Evangelion? I felt very impressed, so I somehow sent this letter. I?m a middle school student like Shinji.\nFirst of all, I saw Eva and now it seems like I truly recognize myself, and this feeling is because of Eva. I want to say thank you for this.\nWhy do I say this? To explain it would take a while, but Shinji and I are alike; depressed and helpless and introverted.\nI remember watching Eva and seeing Shinji being worried and troubled and I felt the same in my heart. In ?EVA?,\nthere was an analysis that said how Shinji couldn?t run away from the pain or the unpleasant feelings that were attached,\nand I have felt like this way too. At the beginning, I really like it (?) that?s why this anime gives me that light feeling (?)\nbut gradually Ms. Ogata (?)\nIn the last scene on TV, Shinji accepts everyone and they all congratulate him; that was a very nice end and I felt very happy.\nAnother friend (?) that last scene (?)\nThis year I graduate from middle school, and now my focus is on being a high school student, and so that?s why I?ll now make my best effort.\nI?m going to see the EVA movie. I?m worried about what will happen to Shinji in the movie (but I like the last scene on the TV series a lot).\nAnd thanks to EVA, I?ve started like myself and that has made me very happy. (?) Mr. Anno, please keep working on EVA a lot more.\n(?) ? and thank you so much for everything!!\n\n\n\nLetter 02\n---------\n\nIs the same text as in Letter 1 but with different calligraphy.\n\n\nLetter 03\n---------\n\nIs the same text as in Letter 1 right side but with different calligraphy.\n\n\nLetter 04\n---------\n\nIs the same pic as Letter 3\n\n\nLetter 05\n---------\n\n(?) I also felt inside myself the same excitement that Shinji felt.\nThe last scenes made me appreciate my own existence even more.\nThe feelings of the very last scene parallel the feelings of the main character, Shinji.\n(?) everybody was finally witnessing (?) EVA?s last moments.\n\n\nLetter 06\n---------\n\n(?) that?s how I feel.\nThanks to Mr. Anno and all the staff for helping to liberate our hearts and souls, and for all of these feelings. Thank you very much.\n\n\nLetter 07\n---------\n\n(?) Studying the grafitti, how is it possible that it says that? (?) ? it seems that some religious group (?) I?m not aware of my own evil? (?)\n\nNote: Letter 07 and Letter 12 are the same but together are kinda complete, even so there are missing parts.\nDue to this, is very difficult to be translated, because it seems to have no sense.\nBut this email is about the graffitis in Gainax?s wall and the guy seems to be laughing about this,\nand about some religious groups and fans that maybe were the ones who made this paintings.\n\n\nLetter 08\n---------\n\nTenchuu: Heaven?s punishment (well deserved)\n\n\nLetter 09\n---------\n\nRapeman\n\nNote: I can?t understand the first kanji, is written in a way that is very difficult to be read. \n\n\nLetter 10\n---------\n\nDie\n\n\nLetter 11\n---------\n\nOn the left wall: Sex, bullshit\nOn the front wall: rapeman\nOver ?Gainax shop? announce: Die\n\n\nLetter 13\n---------\n\nAT Field  03/23, 7:05\n(&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e1a88a8885d2d7d4d4a18c83cf888f878e9584938ccf8f84cf8b91&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;)\nGainax made a terrible work!!!\nIt?s also pathetic.\nI?ve been waiting since the summer for something like this?!\nPlease, make it for the Golden Week.\n\nNote: This email is very difficult to be translated. This guy wrote in the most lower level of Japanese,\n      he has some orthographic errors and sometimes I don?t know if he is congratulating to Gainax or if he is just insulting them.\n      When I put (?) is because I don?t get it what he really wanted to say. And when he mentioned the Golden Week,\n      he is talking about a whole week of holidays in Japan in May. He must be talking about one of the movies,\n      and asking that the premiere could be in the Golden Week.\n\nRentaruya  03/23, 6:07\n(&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d3b2beb2b7b293beaba3fdbeb6a0bbbdb6a7fdbca1fdb9a3&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;)\n\nAmazing!!!\nWhat a great production of REBIRTH!! Even many days after I saw the movie, I still can?t stop thinking about it, this really astounded me!!!\nThis movie really develops a very deep and serious theme.\nShinji?s falls into despair and Asuka?s arrogance appears to be some sort of escape from the darkness in her heart.\nThese people have difficulties in dealing with their feelings; and so in their own ways -- Shinji by totally collapsing and falling apart,\nand Asuka by letting her arrogance cover up her inner weakness -- they each work towards the same goal: to come to terms with themselves. \n\nNote: the last part, after Asuka?s sentences, is the general idea, is like the guy is seeing in Shinji and Asuka,\n      two examples of escaping from reality with two different ways of do it. One falling apart and the other avoiding her own darkness.\n      But at the end both of them have the same expectations. Just in case it became a little confuse ;D, btw isn`t a literal translation,\n      I?m trying to take the main idea because that last sentence was difficult to explain in English in a literal way.\n\n\nLetter 14\n---------\n\nPOW 03/23, 11:47\n(&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7b0f561a1f1a1813123b151208140e120a55151e0f&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;)\n\nIs Gainax able to maintain their business? \nREBIRTH ends in the middle, and since the beginning I couldn?t even understand it. Continuing (?) don?t make us have those dark expectations (*).\nThat?s what I?d consider being successful in their work. But I think that not creating expectations is like a crime.\nAnyway, since this was released, Gainax has become well-known in the anime world. This time (?.) I?d like it. (*)\nI?m 16 years old, young, and talented, and this movie made me think about life and the meaning of our existence, and when I thought about this (?)\n\nNote: The (?) means that some part of text is missing, due to the fact that in the pic there was a cut part.\n      Due to this I can?t fully translate the last part since I?m missing the whole meaning.\n\n\nLetter 15\n---------\n\nThe Tokumei 03/17, 6:54\n\nWhen I saw this movie, I knew Evangelion for the first time.\nWhen I looked at the main characters, I could see my high school self in them.\nI think that this anime has a lot of fascinating things, but the one that affects me the most is the main character?s mysterious charm. \nI feel that the main thing that this movie teaches us is about the importance of being honest with our own lives.\nToday I started to find a lot of meaning inside Evangelion.\nAfter seeing this, I have a lot of expectations for the other movie.\n\nHaruhito Nomura 03/19, 1:08\n\nIt was too long.\nMy true mental state has various thoughts all mixed together, and this doesn?t allow me to think properly.\nThis movie made me think about myself and really feel the emotions that are deep in my heart.\nI?m waiting for the next movie. Good luck and please make it your best!!!\n\n\nLetter 16-19\n------------\n\nAre the same as 20-23 but some parts are missing. \n\n\nLetter 20-23\n------------\n\nSince is a whole letter split in 3 parts, I translated like a whole thing which was more easy, since some parts were twice between the parts.\n\nToshiki Ueyama\n\nI went to see DEATH and REBIRTH Saturday night.\n?Why did I even see this movie?? ? that was the impression I had when I went out of the theater.\nWhy, after I saw REBIRTH, were my teeth were chattering, and why was I shivering for nearly an hour?\nI didn?t understand why I was shivering, was it for something scarring or for something painful?\nWhen I was on the train, returning home, I had that terrible painful feeling, but also at the same time, happiness started to grow inside of me.\nPerhaps the shivering was a way to express all those confusing feelings of fear and euphoria.\nRegarding to Hideaki Anno?s mentality (meaning, Evangelion) I feel terrified, but at the same time I felt like I could identify with it too.\nAbout the movie?s contents ? it is just amazing.\nThe animation?s quality, isn?t it the best animation now?\nHowever, the way in which is shown in the director?s cut the human?s fragility was very painful.\nI could feel the pain of the TV series again. I could feel inside my heart the feelings inside Hideaki Anno?s heart.\nSo in my heart, I sympathized with ?I?m not alone. To feel loneliness is better.?\nI still feel a strange sensation even after watching the movie, because of these two opposite feelings mixing in myself.\nI?m waiting for the summer to see ?End of Evangelion?, and I know that that will be even more painful, but I will feel happy and enjoy it.\nI don?t think that there are many people who feel this way, but in my case, EVA made me think about myself and was like a mirror of myself.\nPeople of the staff, do your best with the summer movie, and good luck!!\nAnd until then, show us a ?painful? and ?happy? movie!!!\n\n\nLetter 24 (last)\n---------\n\nAnno, I?ll kill you!!!\nAnno, I?ll kill you!!!\n\n\n------------------------------------\n\n\nI felt exactly the same way as #24 after encoding this eva-madness for over a year now.\nHere ends longest nfo rant in recorded history.","torrent":{"xt":"urn:btih:5d65bf747df9cbd766433c30b6a0979636a2c72e","amp;dn":"The.End.of.Evangelion.1997.DVDRIP.MKV.H264-ZX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d65bf747df9cbd766433c30b6a0979636a2c72e","infoHashBuffer":{"type":"Buffer","data":[93,101,191,116,125,249,203,215,102,67,60,48,182,160,151,150,54,162,199,46]},"announce":[],"urlList":[]}}