{"title":"Gustavo Cerati - Bocanada (1999) WMA320","uid":6103334,"size":169805035,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5dd0a58d12c3b6f39ea15ca1d28e2d8505a9cf9b&amp;dn=Gustavo+Cerati+-+Bocanada+%281999%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1295062050,"description":"Gustavo AdriÃƒÂ¡n Cerati Clark (Buenos Aires, 11 de agosto de 1959), conocido como Gustavo Cerati, es un guitarrista, cantante, mÃƒÂºsico, cantautor, compositor y productor discogrÃƒÂ¡fico argentino de rock latino.\n\nSe hizo conocido por haber formado parte de la banda Soda Stereo (1982-1997) en la que fue guitarrista y vocalista. Su trabajo tanto en solitario como junto a Soda Stereo lo posicionan como uno de los mejores mÃƒÂºsicos de rock iberoamericano. Su carrera como solista se iniciÃƒÂ³ a comienzos de los aÃƒÂ±os 1990 en paralelo a dicha banda debido a un receso que se habÃƒÂ­a tomado el grupo por una fuerte crisis. En esa instancia Cerati publicÃƒÂ³ su primer ÃƒÂ¡lbum como solista, Amor Amarillo; pero con el regreso de Soda Stereo su carrera solista quedÃƒÂ³ en suspenso hasta la disoluciÃƒÂ³n absoluta de la banda. DespuÃƒÂ©s de Soda Stereo, Cerati ha experimentado desde la mÃƒÂºsica electrÃƒÂ³nica (Plan V) hasta la mÃƒÂºsica sinfÃƒÂ³nica. A lo largo de su carrera como solista ha ganado y ha sido nominado para numerosos premios Grammy Latino, MTV, Gardel. En 2007 Soda Stereo regresÃƒÂ³ en una gira llamada Me verÃƒÂ¡s volver, luego de la cual sus integrantes retomaron sus actividades por separado. Desde el 15 de mayo de 2010, luego de una descompensaciÃƒÂ³n, Gustavo se encuentra en coma y bajo respiraciÃƒÂ³n mecÃƒÂ¡nica. Su estado es grave pero estable y con un futuro incierto.\n\nBocanada es su segundo disco solista, el primero luego de la disoluciÃƒÂ³n de Soda Stereo. Una de las cosas destacables del disco, es que en el mismo, cada detalle ha sido concebido como un todo, con una regularidad que recuerda un poco al ÃƒÂ¡lbum conceptual de Soda Stereo &quot;CanciÃƒÂ³n Animal&quot;, aun cuando la sonoridad no sea la misma.\n\npor WIKIPEDIA\n\nTRACKLIST:\n\n01 - Tabu.wma                                                    \n02 - EngaÃƒÂ±a.wma                                                  \n03 - Bocanada.wma                                                \n04 - Puente.wma                                                  \n05 - Rio Babel.wma                                               \n06 - Beautiful.wma                                               \n07 - Perdonar Es Divino.wma                                      \n08 - Verbo Carne.wma                                             \n09 - Raiz.wma                                                    \n10 - Y Si El Humo Esta En Foco....wma                            \n11 - Paseo Inmoral.wma                                           \n12 - Aqui &amp; Ahora (Los Primeros Tres Minutos).wma                \n13 - Aqui &amp; Ahora (Y Despues).wma                                \n14 - Alma.wma                                                    \n15 - Balsa.wma   \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:5dd0a58d12c3b6f39ea15ca1d28e2d8505a9cf9b","amp;dn":"Gustavo+Cerati+-+Bocanada+%281999%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dd0a58d12c3b6f39ea15ca1d28e2d8505a9cf9b","infoHashBuffer":{"type":"Buffer","data":[93,208,165,141,18,195,182,243,158,161,92,161,210,142,45,133,5,169,207,155]},"announce":[],"urlList":[]}}