{"title":"This Orient Isle: Elizabethan England and the Islamic World","uid":15932702,"size":42839610,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ee1dbbbc4d79461882b220b99cd87a59e06bbbc&amp;dn=This+Orient+Isle%3A+Elizabethan+England+and+the+Islamic+World&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"marty14","files":1,"time":1475369516,"description":"This Orient Isle: Elizabethan England and the Islamic World - Jerry Brotton [epub]\r\n\r\nIn 1570, when it became clear she would never be gathered into the Catholic fold, Elizabeth I was excommunicated by the Pope. On the principle that 'my enemy's enemy is my friend', this marked the beginning of an extraordinary English alignment with the Muslim powers who were fighting Catholic Spain in the Mediterranean, and of cultural, economic and political exchanges with the Islamic world of a depth not again experienced until the modern age. England signed treaties with the Ottoman Porte, received ambassadors from the kings of Morocco and shipped munitions to Marrakesh.\r\n\r\nBy the late 1580s hundreds, perhaps thousands, of Elizabethan merchants, diplomats, sailors, artisans and privateers were plying their trade from Morocco to Persia. These included the resourceful mercer Anthony Jenkinson who met both Süleyman the Magnificent and the Persian Shah Tahmasp in the 1560s, William Harborne, the Norfolk merchant who became the first English ambassador to the Ottoman court in 1582 and the adventurer Sir Anthony Sherley, who spent much of 1600 at the court of Shah Abbas the Great. The previous year, remarkably, Elizabeth sent the Lancastrian blacksmith Thomas Dallam to the Ottoman capital to play his clockwork organ in front of Sultan Mehmed.\r\n\r\nThe awareness of Islam which these Englishmen brought home found its way into many of the great cultural productions of the day, including most famously Marlowe's Tamburlaine, and Shakespeare's Titus Andronicus and The Merchant of Venice. The year after Dallam's expedition the Moroccan ambassador, Abd al-Wahid bin Mohammed al-Annuri, spent six months in London with his entourage. Shakespeare wrote Othello six months later.\r\n\r\nThis Orient Isle shows that England's relations with the Muslim world were far more extensive, and often more amicable, than we have appreciated, and that their influence was felt across the political, commercial and domestic landscape of Elizabethan England. It is a startlingly unfamiliar picture of part of our national and international history","torrent":{"xt":"urn:btih:5ee1dbbbc4d79461882b220b99cd87a59e06bbbc","amp;dn":"This+Orient+Isle%3A+Elizabethan+England+and+the+Islamic+World","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ee1dbbbc4d79461882b220b99cd87a59e06bbbc","infoHashBuffer":{"type":"Buffer","data":[94,225,219,187,196,215,148,97,136,43,34,11,153,205,135,165,158,6,187,188]},"announce":[],"urlList":[]}}