{"title":"Coldplay - Parachutes","uid":5554841,"size":50452425,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:60108db54876235743db640392d56922de1c6e49&amp;dn=Coldplay+-+Parachutes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":2,"uploader":"masterjug","files":17,"time":1273657079,"description":"Artist-Coldplay\nAlbum-Parachutes\nYear-2000\nParachutes is the debut album by English alternative rock band Coldplay, released by the record label Parlophone on 10 July 2000 in the United Kingdom. The album was produced by the band and British record producer Ken Nelson, excluding one track which was produced by Chris Allison. Parachutes has spawned the hit singles &quot;Shiver&quot;, &quot;Yellow&quot;, &quot;Trouble&quot;, and &quot;Don't Panic&quot;.\n\nThe album was generally both a critical and commercial success. Upon release, the album quickly reached number one in the United Kingdom, and has since been certified seven-time platinum. In the United States, the album peaked at number 51 on the Billboard 200, and has since been certified two-time platinum. It won the Grammy Award for Best Alternative Music Album in 2002, and has earned the band various accolades since its release. Parachutes is number 12 on the list of the 20 biggest-selling albums of the 21st century in the United Kingdom.\n\nThe album won Best British Album at the 2001 Brit Awards.\nParachutes was critically acclaimed in Europe. Michael Hubbard of MusicOMH noted that it is an album of &quot;remarkable depth, especially when one considers the youthful ages of the band members&quot;[23] while The Guardian newspaper described the album as &quot;one of the year's most uplifting albums&quot;, adding that it features &quot;elegant songs, classic guitars and gorgeous singing&quot;.[20]\n\nThe album also received generally positive reviews among international critics. A review in Billboard magazine claims that Parachutes &quot;brings nothing new to the table&quot;, writing that its &quot;musical reference points are immediately recognizable and difficult to overlook&quot;. Despite this, the review adds, &quot;Coldplay seems talented enough to transcend this early identity crisis&quot;, referring to them as a newly-introduced band in the United States.[24] Matt Diehl of Rolling Stone magazine said that the album &quot;ultimately rises above its influences to become a work of real transcendence&quot;.[25] MacKenzie Wilson of Allmusic commented that it introduces the band as &quot;young musicians still honing their sweet harmonies&quot;, adding, &quot;Parachutes deserved the accolades it received because it followed the general rule when introducing decent pop songs: keep the emotion genuine and real.&quot;[26]","torrent":{"xt":"urn:btih:60108db54876235743db640392d56922de1c6e49","amp;dn":"Coldplay+-+Parachutes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60108db54876235743db640392d56922de1c6e49","infoHashBuffer":{"type":"Buffer","data":[96,16,141,181,72,118,35,87,67,219,100,3,146,213,105,34,222,28,110,73]},"announce":[],"urlList":[]}}