{"title":"TeacherFucksTeens: Christiana Cinn, Tiffany Watson The Big Game","uid":15840425,"size":366117619,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:607de9812d886bdffb9d39fb68b3953ed85eecc4&amp;dn=TeacherFucksTeens%3A+Christiana+Cinn%2C+Tiffany+Watson+The+Big+Game&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":3,"uploader":"EndYou","files":1,"time":1474034308,"description":"... : More exclusive porn at : ...\r\n    https://thepiratebay.org/user/EndYou\r\n\r\n          ... : Screenshots : ... \nhttp://imgpremium.com/img-57dbde64ad382.html  \nhttp://imgpremium.com/img-57dbde6534fb6.html \r\n\r\nChristiana Cinn is picking up Tiffany Watson and Rion King for the big game. Rion is ready, but Tiffany isn't. When Christiana goes upstairs to check on her, Tiffany is mostly naked! She agrees to let Christiana live out her dreams and try on a cheerleading uniform, and soon both girls down to their thongs and comparing their boobs.\r\n\r\nWhen Rion comes upstairs to see what's taking them so long, he spies the girls massaging one another's tits. He steps in after Christiana offers to teach Tiffany some things, and soon finds himself in the middle of a threesome with his favorite teacher and the girl he likes. Looking down at the two girls as they work together to suck him off, Rion knows that he is in heaven.\r\n\r\nWhen Christiana tells Tiffany to lay back and then helps Rion work his way into her twat, her moans of excitement fill the room. Once Christiana has made sure that her students are situated, she plants her own pussy on Tiffany's mouth to give the blonde a lesson in eating out a woman. Soon all three are eagerly fucking and sucking as the lessons get hotter and hornier.\r\n\r\nUrging Tiffany into a 69 that lets the blonde eat out her teacher's creamy snatch, Christiana makes sure that Rion is in the proper position to take Tiffany from behind. That setup is just what Tiffany needs to have a powerful orgasm that brings Rion over the edge, too. When he pulls out to cum on Tiffany's back and Christiana's face, he leaves both of his lovers fully content and happily covered in his jizz.\r\n\r\nMPEG4 Video (H264) 960x540","torrent":{"xt":"urn:btih:607de9812d886bdffb9d39fb68b3953ed85eecc4","amp;dn":"TeacherFucksTeens%3A+Christiana+Cinn%2C+Tiffany+Watson+The+Big+Game","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"607de9812d886bdffb9d39fb68b3953ed85eecc4","infoHashBuffer":{"type":"Buffer","data":[96,125,233,129,45,136,107,223,251,157,57,251,104,179,149,62,216,94,236,196]},"announce":[],"urlList":[]}}