{"title":"Suze Orman - Laws of Money, Lessons of Life","uid":8578864,"size":311141181,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:60b7ff9f6712c648f112071054f930d950e94ddd&amp;dn=Suze+Orman+-+Laws+of+Money%2C+Lessons+of+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"yTSa6","files":77,"time":1371366371,"description":"Suze Orman-\nLaws of Money, Lessons of Life\n\nLearn Strategies that May Help You Keep What You Have and Create What You Deserve.\n\nIn these audio CDs, Suze Orman introduces a program that may transform every financial action taken with your money from this point on. The five laws can be personalized--no matter what type of financial situation you may have--and by using them as your guide, you can learn strategies that may help you keep what you have and create what you deserve. \n\nTHE LAWS OF MONEY:\n\nLaw Number 1. Truth Creates Money, Lies Destroy It.\nLaw Number 2. Look at What You Have, Not at What You Had.\nLaw Number 3. Do What Is Right for You, Before You Do What Is Right for Your Money.\nLaw Number 4. Invest in the Known Before the Unknown.\nLaw Number 5. Always Remember: Money Has No Power of Its Own.\n\nLaws of Money, Lessons of Life (Guide Book)\n\nAbout the Author:\nSuze Orman is the author of three consecutive New York Times bestsellers, The Road to Wealth, The Courage to Be Rich, and The 9 Steps to Financial Freedom, and the national bestseller You've Earned It, Don't Lose It. She is the personal finance editor on CNBC and the host of The Suze Orman Show, a national CNBC-TV show that airs every weekend. She is also a contributing editor to O The Oprah Magazine. Suze wrote, coproduced, and hosted three PBS pledge shows based on her bestselling books, which are among the most successful fundraisers in the history of public television. A new PBS special based on The Laws of Money, the Lessons of Life premieres in 2003.\nSuze has also been called a &quot;one-woman financial-advice powerhouse&quot; by USA Today. In 1999, she was named by Smart Money magazine to its list of the top thirty powerbrokers in the United States. Suze was recently selected as one of five distinguished recipients of the prestigious 2002 TJFR Group Business News Luminaries Award, which honors lifetime achievement in business journalism. In 2003, she was inducted into the Books for a Better Life Awards' Hall of Fame in recognition of her ongoing contributions to self-improvement. She was also profiled in Worth magazine's 100th issue as among those &quot;who have revolutionized the way America thinks about money.&quot; Suze's popular web site, SuzeOrman.com, features, among other valuable financial information, her monthly e-newsletter.","torrent":{"xt":"urn:btih:60b7ff9f6712c648f112071054f930d950e94ddd","amp;dn":"Suze+Orman+-+Laws+of+Money%2C+Lessons+of+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60b7ff9f6712c648f112071054f930d950e94ddd","infoHashBuffer":{"type":"Buffer","data":[96,183,255,159,103,18,198,72,241,18,7,16,84,249,48,217,80,233,77,221]},"announce":[],"urlList":[]}}