{"title":"D'Angelo  - Voodoo [2000] [FLAC]","uid":8090184,"size":459922655,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:611cb8ee303f761e1b3819a7cd676ec32452b9bb&amp;dn=D%27Angelo++-+Voodoo+%5B2000%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":1,"uploader":"dickspic","files":16,"time":1359698444,"description":"[color=red][b]Number 23 of the ROLLING STONE &quot;100 BEST ALBUMS OF THE 2000S&quot;[/b][/color]\n\n1.\t&quot;Playa Playa&quot; \n2.\t&quot;Devil's Pie&quot; \n3.\t&quot;Left &amp; Right&quot; (feat. Method Man &amp; Redman)\t\n4.\t&quot;The Line&quot; \n5.\t&quot;Send It On&quot; \n6.\t&quot;Chicken Grease&quot; \n7.\t&quot;One Mo'Gin&quot; \n8.\t&quot;The Root&quot; \n9.\t&quot;Spanish Joint&quot; \n10.\t&quot;Feel Like Makin' Love&quot; \n11.\t&quot;Greatdayindamornin' / Booty&quot; \n12.\t&quot;Untitled (How Does It Feel)&quot; \n13.\t&quot;Africa&quot; \n\n\nVoodoo is the second studio album by American R&amp;B and neo soul musician D'Angelo, released January 11, 2000 on the Virgin-imprint label Cheeba Sound Recordings in the United States and February 14 that same year on EMI Music in the United Kingdom. Recording sessions for the album took place at Electric Lady Studios in New York City throughout 1998 and 1999, featuring an extensive line-up of R&amp;B, jazz and hip hop artists, including Ahmir &quot;?uestlove&quot; Thompson and Russell Elevado. Voodoo features a significantly funkier and experimental sound with live instrumentation and a vintage production style, in contrast to the urban contemporary style of D'Angelo's debut album Brown Sugar (1995). It also exhibits his maturity and diversity in lyrical themes including spirituality, sexuality, love, growth and fatherhood.\n\nFollowing heavy promotion and an anticipated release, Voodoo was met with a considerable amount of commercial and critical recognition, as it became a chart success within weeks after its release, with the help of the hit single &quot;Untitled (How Does It Feel)&quot; and its controversial music video. Despite some criticism for its loose, experimental structure, the album received general praise from music publications and critics who praised its diverse musical style and vintage production, while it was voted at or near the top of many publications' &quot;best album&quot; lists. It has also been recognized as a creative milestone of the neo soul genre and has been considered by music writers as D'Angelo's magnum opus. Despite its charting and critical praise, the album did not achieve the sales and single-oriented success of his debut album.\n\nIn addition to its critical and commercial legacy, Voodoo is also notable for serving as the last studio album released by D'Angelo before his period of legal controversies and absence from the music scene after the end of the album's international supporting tour in late 2000, which had also been marked by internal issues. On March 1, 2000, Voodoo was certified platinum in sales by the Recording Industry Association of America (RIAA), following sales in excess of over one million copies. In 2003, the album was ranked number 488 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\n[url=&quot;http://dickthespic.org/&quot;]dickthespic.org[/url]","torrent":{"xt":"urn:btih:611cb8ee303f761e1b3819a7cd676ec32452b9bb","amp;dn":"D%27Angelo++-+Voodoo+%5B2000%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"611cb8ee303f761e1b3819a7cd676ec32452b9bb","infoHashBuffer":{"type":"Buffer","data":[97,28,184,238,48,63,118,30,27,56,25,167,205,103,110,195,36,82,185,187]},"announce":[],"urlList":[]}}