{"title":"Uriel's Machine: Reconstructing the Disaster Behind Our History","uid":15891943,"size":4187462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61859df236864363fa8f607abe7e3bd678a9a15c&amp;dn=Uriel%27s+Machine%3A+Reconstructing+the+Disaster+Behind+Our+History&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":5,"uploader":"marty14","files":1,"time":1474763344,"description":"Uriel's Machine: Reconstructing the Disaster Behind Human History - Christopher Knight, Robert Lomas [epub]\r\n\r\nModern scientific investigations show that Earth has been hit many times by objects such as comets and meteorites. Laboratory work on comet impact effects demonstrates that comets could cause tidal waves to exceed three miles tall and near 400 miles per hour. In the last 10,000 years, there have been two impacts of such proportion: a seven-fold impact into all the world's oceans around 7640 B.C., and a single impact into the Mediterranean Sea about 3150 B.C., the time of Noah's Flood.\r\n\r\nUriel's Machine proves ancient Europeans not only survived the 7640 B.C. flood, but developed a highly advanced civilization dedicated to predicting and preparing for future meteoric impacts. Building an international network of sophisticated astronomical observatories, these ancient astronomers created accurate solar, lunar, and planetary calendars, measured the diameter of the Earth, and precisely predicted comet collisions years in advance. This was the true purpose of megalithic structures such as Stonehenge. In 3150 B.C., the ancients' predictions proved true, and their device- Uriel's Machine-allowed the reconstruction of civilization in a shattered world.\r\n\r\nUriel's Machine also presents evidence that:\r\n\r\n* There was a single global language on Earth\r\n* A single female was a common ancestor to all living humans\r\n* Angels bred with human women to create The Watchers, giant half-human beings\r\n* The oral tradition of Freemasonry records real events","torrent":{"xt":"urn:btih:61859df236864363fa8f607abe7e3bd678a9a15c","amp;dn":"Uriel%27s+Machine%3A+Reconstructing+the+Disaster+Behind+Our+History","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61859df236864363fa8f607abe7e3bd678a9a15c","infoHashBuffer":{"type":"Buffer","data":[97,133,157,242,54,134,67,99,250,143,96,122,190,126,59,214,120,169,161,92]},"announce":[],"urlList":[]}}