{"title":"Need For Speed Most Wanted 2005 By G","uid":11823354,"size":2213408283,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:61a16f1cfabfaed0aaa2098b510d374daf260a4e&amp;dn=Need+For+Speed+Most+Wanted+2005+By+G&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":3,"uploader":"Ggamer1","files":160,"time":1429371725,"description":"Need for Speed: Most Wanted (commonly abbreviated to as NFS: MW or just Most Wanted) is a racing video game developed by EA Black Box and published by Electronic Arts. It is the ninth installment in the Need for Speed series. The game features street racing-oriented game play, with certain customization options from the Need for Speed: Underground series. The game is succeeded by Need for Speed: Carbon, which serves as a sequel to Most Wanted.\nMost Wanted is like other Need for Speed games, where the player selects one car and races against a time limit or other racers to reach a destination. Police chases have once again been integrated into certain racing sessions, in which the police employ vehicles and tactics to stop the player's car and arrest the player, like Need for Speed III: Hot Pursuit, Need for Speed: Hot Pursuit 2, and Need for Speed: Carbon. As players take control of faster cars and increasingly rely on nitrous oxide speed boosts, the oxide meter now refills automatically for the first time since its introduction in Underground, and driving sequences become fast-paced and intense similar to the Burnout series.\n\nThree distinct regions are offered in the city of Rockport, along with cycling weather. Racing events take place between sunrise and sunset, unlike in the Underground where the events took place at night. A Grand Theft Auto-like Free Roam mode is provided as in Need for Speed: Underground 2, but is still limited to Career mode, as well as pursuit-based events in other modes.\n\nBrand promotion from Underground 2 still continues strongly, with Old Spice and the presence of Burger King restaurants, Castrol oil, Axe Unlimited and Edge shaving gel. The Cingular logo is still visible in the game's wireless communication system. Performance, body and visual parts that can be bought in the game are also from real life companies. However, Best Buy stores did not return from Underground 2","torrent":{"xt":"urn:btih:61a16f1cfabfaed0aaa2098b510d374daf260a4e","amp;dn":"Need+For+Speed+Most+Wanted+2005+By+G","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61a16f1cfabfaed0aaa2098b510d374daf260a4e","infoHashBuffer":{"type":"Buffer","data":[97,161,111,28,250,191,174,208,170,162,9,139,81,13,55,77,175,38,10,78]},"announce":[],"urlList":[]}}