{"title":"Age of Empires II Gold Edition","uid":6619776,"size":616499697,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6293ac5822661ecd242d7836370c252ab02af6cb&amp;dn=Age+of+Empires+II+Gold+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":1,"uploader":"mevidek","files":3,"time":1313935897,"description":"The full Age of Empires II Gold Edition Game, all completely free!\n\nFor installation instructions (READ FIRST), read the txt. file, found in the folder. The file reads:\n\n\nAge of Empires II Gold Edition by mevidek\n\nContents:\n-Instructions for Age of Empires II Installation.\n-Instructions for Age of Empires II The Conquerors Expansion\n-System Requirements\n-Game information\n\nInstructions for Age of Empires II installation:\n\n1. Mount \\'Age of Empires II The Age of Kings (base game)\\' using a program for iso files. This could be\nvirtual clone drive, daemon tools, or anything you prefer.\n2. Wait for autostart, or press (or run as administrator) AOE SETUP.\n3. Proceed through the installation, and if a key is required, use the following serial: 53532-442-6345557-11265\n4. Select any kind of installation you would like.\n5. Wait for game to finish installing.\n6. You can now play the game, view readme, or setup options which allows you to quit. To install Age\nof Empires II The Conquerors Expansion, select setup options and quit. (DO NOT REGISTER ONLINE!)\n\nInstructions for Age of Empires II The Conquerors Expansion:\n\n1. Mount \\'Age of Empires II Conquerors Expansion\\'. Read above for details on how to mount iso files.\n2. Wait for autostart or press (or run as administrator) AOC SETUP.\n3. Proceed through the installation, and if a key is required, use the same serial as above.\n4. Select any kind of installation you would like.\n5. Wait for game to finish installing.\n6. You can now play the game, view readme, or setup options which allows you to quit. (DO NOT REGISTER\nONLINE!)\n\nSystem requirements:\n\nWindows 95/98/ME - 32 MB RAM\nWindows NT 4.0 (service pack 5)/2000 - 64 MB RAM \n(And above)\n-----------------\nProcessor 166 MHz\n-----------------\nHard Drive 550 MB\n-----------------\nVideo Card 2 MB/2D\n-----------------\nOther - Audio board with speakers or headphones\n-----------------\nOnline/Multiplayer Requirements - 28.8 Kbs modem or better. Internet Explorer 4.0 or Netscape Communicator\n4.0\nAge of Empires II Gold Edition unites the exciting gameplay of both Microsoft Age of Empires II: The Age of Kings \nand Age of Empires II: The Conquerors Expansion - plus additional content - for one compelling gaming experience.\nAge of Empires II: The Age of Kings spans 1, 000 years, from the fall of Rome through the Middle Ages, in which players control\nthe destiny of one of thirteen civilizations. \nAge of Empires II: The Conquerors Expansion will challenge veterans and novices to wage war on an epic scale with all-new civilizations,\nunique units and technologies, and campaigns based on infamous conquerors such as Attila the Hun, El Cid and Montezuma.\n\n\nEnjoy! (All in English, although other languages may be supported).\n\nDon\\'t forget to download my other torrents!","torrent":{"xt":"urn:btih:6293ac5822661ecd242d7836370c252ab02af6cb","amp;dn":"Age+of+Empires+II+Gold+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6293ac5822661ecd242d7836370c252ab02af6cb","infoHashBuffer":{"type":"Buffer","data":[98,147,172,88,34,102,30,205,36,45,120,54,55,12,37,42,176,42,246,203]},"announce":[],"urlList":[]}}