{"title":"Beethoven - 9th Symphony - Cond. by Leonard Bernstein [320]","uid":7014350,"size":178741445,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6318514c49c9e624cd9399b64a17515210f7979a&amp;dn=Beethoven+-+9th+Symphony+-+Cond.+by+Leonard+Bernstein+%5B320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":1,"uploader":"rambam1776","files":-1,"time":1328599260,"description":"Leonard Bernstein - Beethoven's 9th Symphony (Ode to Joy)\n\nFull Liner Notes Scan included\n\n1980 Deutsche Grammophon 410-859-2\n\nThe Symphony No. 9 in D minor, Op. 125, is the final complete symphony of Ludwig van Beethoven. Completed in 1824, the symphony is one of the best known works of the Western classical repertoire. Among critics, it is universally considered to be among Beethoven's greatest works, and is considered by some to be the greatest piece of music ever written. It has been adapted for use as the European Anthem.\n\nThe symphony was the first example of a major composer using voices in a symphony (thus making it a choral symphony). The words are sung during the final movement by four vocal soloists and a chorus. They were taken from the &quot;Ode to Joy&quot;, a poem written by Friedrich Schiller in 1785 and revised in 1803, with additions made by the composer.\n\n01 - Allegro ma non troppo\n02 - Molto vivace\n03 - Adagio molto e cantabile\n04 - Presto - Allegro assai\n05 - Recitative - Allegro assai\n\nPolitical significance has attached to Beethoven's Ninth: Leonard Bernstein conducted a version of the 9th, with &quot;Freiheit&quot; (&quot;Freedom&quot;) replacing &quot;Freude&quot; (&quot;Joy&quot;), to celebrate the fall of the Berlin Wall during Christmas 1989. This concert was performed by an orchestra and chorus made up of many nationalities: from Germany, the Bavarian Radio Symphony Orchestra and Chorus, the Chorus of the Berlin Radio Symphony Orchestra, and members of the SÃƒÂ¤chsische Staatskapelle Dresden; from the Soviet Union, members of the Orchestra of the Kirov Theatre, from the United Kingdom, members of the London Symphony Orchestra; from the USA, members of the New York Philharmonic, and from France, members of the Orchestre de Paris. Soloists were June Anderson, soprano, Sarah Walker, mezzo-soprano, Klaus KÃƒÂ¶nig, tenor, and Jan-Hendrik Rootering, bass.\n\nBernstein made his first recording of the Beethoven Ninth in 1964 with the New York Philharmonic, for Columbia Masterworks, with soloists Martina Arroyo (soprano), Regina Safarty (mezzo), Nicholas di Virgilio (tenor), Norman Scott (bass), and the Juilliard Chorus. It was later reissued on CD. It was the first of three complete recordings of the Ninth that Bernstein made. He made his second recording of the piece with the Vienna Philharmonic for Deutsche Grammophon, in 1979. This second one featured Gwyneth Jones (soprano), Hanna Schwarz (mezzo), RenÃƒÂ© Kollo, and Kurt Moll (bass), with the chorus of the Vienna State Opera.","torrent":{"xt":"urn:btih:6318514c49c9e624cd9399b64a17515210f7979a","amp;dn":"Beethoven+-+9th+Symphony+-+Cond.+by+Leonard+Bernstein+%5B320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6318514c49c9e624cd9399b64a17515210f7979a","infoHashBuffer":{"type":"Buffer","data":[99,24,81,76,73,201,230,36,205,147,153,182,74,23,81,82,16,247,151,154]},"announce":[],"urlList":[]}}