{"title":"Michael Savage - The Enemy Within - Saving America from the Libe","uid":15891726,"size":801310,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64374ef3c39519c0fe36102d7f1800f27c471fa2&amp;dn=Michael+Savage+-+The+Enemy+Within+-+Saving+America+from+the+Libe&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"roflcopter2110","files":1,"time":1474759959,"description":"http://boltimg.com/images/Y5Hgw.jpg\r\n\r\nMichael Savage - The Enemy Within - Saving America from the Liberal Assault on Our Schools, Faith, and Military - pdf\r\n\r\nAmerica's bravest, brashest voice is back as ferocious and cutting as ever.\r\n\r\n&quot;Where has six decades of radical, mad-dog  liberalism brought us?&quot; Savage asks in his electrifying new book. &quot;I'll tell you where: America is teetering on the cliffs of insanity.&quot;\r\n\r\nWritten with the fire, the conviction, and the clear vision of a modern-day prophet, Savage returns with a vengeance in this lightning rod of a book, speaking for all Americans who are fed up and ticked off at the corrosive influence of today's &quot;psycho liberals&quot;?the Democrats, as he calls them.\r\n\r\n&quot;They're speeding down the pathway of good intentions. Their mantra: Celebrate perversity, embrace ultra-tolerance, pay rape-a-nations (so-called reparations), support affirmative racism, and provide government subsidies for every illegal who sneaks across the border. In their haste to push failed socialist ideals, the libs have placed us on a crash course of total destruction.&quot;\r\n\r\nEven while the heated controversy of his New York Times bestseller, The Savage Nation, still simmers, Michael Savage raises his weapons of matchless wit and moxie again, this time aiming his sights on the liberal assault on our most cherished institutions and taking a stand for our schools, our faith, our police and armed forces, and, most important, our families.\r\n\r\nIt isn't always pretty. You might even at times become uncomfortable. But as you read on, you'll find these pages always contain the Savage truth. That is how to fight the Enemy Within.\r\n\r\nFilled with riotous rage and blistering humor, this book inspires as it enflames, encouraging Americans to reclaim our country, our government, our national integrity","torrent":{"xt":"urn:btih:64374ef3c39519c0fe36102d7f1800f27c471fa2","amp;dn":"Michael+Savage+-+The+Enemy+Within+-+Saving+America+from+the+Libe","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64374ef3c39519c0fe36102d7f1800f27c471fa2","infoHashBuffer":{"type":"Buffer","data":[100,55,78,243,195,149,25,192,254,54,16,45,127,24,0,242,124,71,31,162]},"announce":[],"urlList":[]}}