{"title":"[psp] Prince of Persia - Rival Swords","uid":4990331,"size":863885363,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:64cb3c3ea78165ca78dbe7c41987689ee70cda03&amp;dn=%5Bpsp%5D+Prince+of+Persia+-+Rival+Swords&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":2,"uploader":"[psp]","files":1,"time":1247002200,"description":"In the same way that Ubisoft converted Prince of Persia: Warrior Within to Prince of Persia Revelations for the PlayStation Portable, so too has it released an updated version of Two Thrones for the Wii and PSP with Prince of Persia Rival Swords. The Prince's last foray on the PSP was marred by a litany of sound bugs, as well as some unfortunate load times. These issues were clearly addressed in Rival Swords, and while not entirely resolved, their impact is less substantial. Rival Swords, then, is a great translation of Two Thrones, and no doubt through some time-altering voodoo, Ubisoft has padded out the PSP package with some worthwhile additions, making this the most content-laden version of them all.\n\nDespite its scaled-back graphics, Rival Swords has a sharp look to it.\n\nRival Swords/Two Thrones is the conclusion of the Sands of Time trilogy, but the homecoming hasn't gone down according to the Prince's plan. Instead of a sedate life spent getting fat and carousing with the Empress of Time, he finds Babylon burning, a foe once defeated returning immortal, and some maniacal madman installing wicked-confusing elevator systems throughout his city. Vexing for sure, made all the worse when his charge is stabbed in the gut and he inadvertently turns himself into a sand demon. Turns out, using magic to mess with space-time has a nasty way of coming full circle to kick you in the teeth, so by rescuing the Empress from her fate in Warrior Within, the Prince effectively negated his actions in the trilogy's first game, The Sands of Time. What this means is that the Vizier was free to enact his plans of world domination, and, after sidestepping a few plot holes, he promptly does. So, after joining forces again with an old ally for the first time, you're off to rectify your actions by bouncing around all nimbly-bimbly and skewering creeps with a blade--two skills the Prince happens to excel at.\n\nBy interfering with the Vizier's machinations, the Prince infects himself with enchanted sand. The power of the sands manifests itself in the form of the Dark Prince, a decidedly sketchy alter ego of the Prince that you'll occasionally morph into, complete with razor-sharp chains encircling his forearms and phosphorescent tattoos etched onto his blackened skin. Along with the new bod comes a new consciousness, which takes up residence in the Prince's head in a schizophrenic fashion. As the Dark Prince, your lethality is greatly enhanced, letting you eviscerate your enemies with a twirl of that enchanted razor wire. The drawback to this nearly unlimited power is that your life essence slowly ebbs away, though it can be fully replenished by picking up the sand charges that are liberally spread throughout the game. Having your life deteriorate certainly adds a sense of urgency to your actions and can increase the game to a near-frenetic pace, as you are pushed through puzzles and forced to find and bust up mobs or jars of sand so as to avoid becoming dust in the wind yourself.\n\nThe ability to manipulate time plays a prominent role in Rival Swords. As you progress through the game, you'll accrue sand charges by either killing enemies or smashing jars, baskets, or what have you. By and large, these sand charges will be converted by your newly reacquired Dagger of Time (first seen in the now-defunct Sands of Time) into recalls, which are essentially do-overs that let you rewind time to either have another go at hitting a jump or undoing a devastating combo that some goon has just inflicted upon you. Timeliness is a virtue, however, as you'll only be able to rewind time up to a certain point, indicated by a bar nestled in among your other vitals. The dagger eventually acquires other attributes, such as the ability to slow down time and to massacre several enemies at once, which both have their uses. One of the major setbacks to the game is the way that sand charges act as a crutch for the Prince, often trivializing would-be difficult encounters. While this does help you burn through the game, it also goes a long way in making for sloppy gameplay, as it never really encourages you to think before you leap or become anything more than proficient with the Prince's extensive combat capabilities. \n\n\n*&gt;INSTRUCTIONS&lt;*\n\n\nput the .cso into the ISO folder in your psp memory stick's root folder. thats it. enjoy an awesome game :D\n\n*********I AM ACCEPTING PSP GAME REQUESTS***********","torrent":{"xt":"urn:btih:64cb3c3ea78165ca78dbe7c41987689ee70cda03","amp;dn":"%5Bpsp%5D+Prince+of+Persia+-+Rival+Swords","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64cb3c3ea78165ca78dbe7c41987689ee70cda03","infoHashBuffer":{"type":"Buffer","data":[100,203,60,62,167,129,101,202,120,219,231,196,25,135,104,158,231,12,218,3]},"announce":[],"urlList":[]}}