{"title":"Nick Turse - Kill Anything That Moves - The Real American War in","uid":15891507,"size":460470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64e495fd9f89aec1eb2eba6f24972b75926d31d7&amp;dn=Nick+Turse+-+Kill+Anything+That+Moves+-+The+Real+American+War+in&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":2,"uploader":"roflcopter2110","files":1,"time":1474758455,"description":"http://boltimg.com/images/Y0kWe.jpg\r\n\r\nNick Turse - Kill Anything That Moves - The Real American War in Vietnam - epub\r\n\r\nBased on classified documents and first-person interviews, a startling history of the American war on Vietnamese civilians \r\nThe American Empire Project\r\nWinner of the Ridenhour Prize for Reportorial Distinction \r\nAmericans have long been taught that events such as the notorious My Lai massacre were isolated incidents in the Vietnam War, carried out by just a few &quot;bad apples.&quot; But as award-winning journalist and historian Nick Turse demonstrates in this groundbreaking investigation, violence against Vietnamese noncombatants was not at all exceptional during the conflict. Rather, it was pervasive and systematic, the predictable consequence of official orders to &quot;kill anything that moves.&quot;\r\n\r\nDrawing on more than a decade of research into secret Pentagon archives and extensive interviews with American veterans and Vietnamese survivors, Turse reveals for the first time the workings of a military machine that resulted in millions of innocent civilians killed and wounded--what one soldier called &quot;a My Lai a month.&quot; Devastating and definitive, &quot;Kill Anything That Moves&quot; finally brings us face-to-face with the truth of a war that haunts America to this day","torrent":{"xt":"urn:btih:64e495fd9f89aec1eb2eba6f24972b75926d31d7","amp;dn":"Nick+Turse+-+Kill+Anything+That+Moves+-+The+Real+American+War+in","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64e495fd9f89aec1eb2eba6f24972b75926d31d7","infoHashBuffer":{"type":"Buffer","data":[100,228,149,253,159,137,174,193,235,46,186,111,36,151,43,117,146,109,49,215]},"announce":[],"urlList":[]}}