{"title":"PMP Exam Study Guide, 7E [PDF]~StormRG~","uid":9688620,"size":13667231,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6610ea7844f44ab6127896d2ec7af3e49bcc5c22&amp;dn=PMP+Exam+Study+Guide%2C+7E+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":0,"uploader":"steelballz","files":-1,"time":1393822322,"description":"image\nCover from actual book file\n\n\nProduct Description\n\n\n\nPublication Date: July 1 2013 | ISBN-10: 1118531825 | ISBN-13: 978-1118531822 | Edition: 7\nThe ultimate package for preparing you to take the PMP exam\n\nProject management is one of the most desired skills in today's IT marketplace and the Project Management Professional (PMP) exam reflects your level of proficiency and preparedness as a project manager. This comprehensive study guide features the Sybex test engine with two practice PMP exams, electronic flashcards, two hours of audio review, as well as two bonus Certified Associate in Project Management (CAPM) exams. The book covers a wide-range of project management and exam topics, concepts, and key terms. Not only does this must-have resource reflect the very latest version of the exam, it is written by popular project management expert Kim Heldman, who is the author of the six previous editions of this top-selling book.\n\nPrepares you to take the Project Management Professional (PMP) exam as well as the Certified Associate in Project Management (CAPM) exam, both offered by the Project Management Institute (PMI)\nCovers all exam topic areas plus a wide range of project management processes, concepts, and key terms\nUses real-world scenarios and How This Applies to Your Current Project sidebars to fully illustrate concepts\nReaders get access to invaluable study tools with testing software, practice exams, electronic flashcards, and over two hours of audio review\n\nPMP: Project Management Professional Exam Study Guide, Seventh Edition helps you prepare for the PMP exam and also serves as an essential resource for becoming a more astute project manager.\nFrom the Back Cover\n\nYour Ultimate Guide to the PMP Exam\n\nPrepare for the PMP certification exam with this new edition of the PMP Study Guide, which covers all essential concepts from A Guide to the Project Management Body of Knowledge (PMBOKÂ® Guide), Fifth Edition. Study, practice, and review such topics as budgeting, scheduling, how to measure performance, and much more. Fine-tune your skills with audio instruction from author and project management expert Kim Heldman. This detailed book also helps candidates prepare for the Certified Associate in Project Management (CAPM) exam. Inside, find:\n\nFull coverage of all exam topics in a systematic approach, so you can be confident you're getting the instruction you need for the exam\n\nReal-world scenarios that put what you've learned in the context of actual job roles\n\nChallenging review questions in each chapter to prepare you for exam day\n\nExam Essentials, a key feature in each chapter that identifies critical areas you must become proficient in before taking the exam\n\nA project case study at the end of each chapter that walks you through a complex scenario\n\nSybex Exam Prep Tools\n\nGo to www.sybex.com/go/pmpsg7e and download a full set of test prep tools to help you thoroughly prepare for the exam. These include:\n\nTwo practice exams\nTwo bonus practice CAPM exams\nMore than two hours of audio instruction and review\nAnd more\n\nDownload practice exams and chapter review questions\n\nTest your readiness with electronic flashcards\nAbout the Author\n\nKim Heldman, PMP, is a Business Relationship Manager for the Regional Transportation District in Denver, Colorado. She has over 20 years of experience in project management and consulting. Kim is the author of several books on project management, including Project Management JumpStart and the six previous editions of the bestselling PMP: Project Management Professional Exam Study Guide. You can visit her website at www.kimheldman.com.\n\n\n*Note: the 'extras' noted in the description are not included. You must purchase the product to  gain access to them*\nimage\nScientia est potentia\n","torrent":{"xt":"urn:btih:6610ea7844f44ab6127896d2ec7af3e49bcc5c22","amp;dn":"PMP+Exam+Study+Guide%2C+7E+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6610ea7844f44ab6127896d2ec7af3e49bcc5c22","infoHashBuffer":{"type":"Buffer","data":[102,16,234,120,68,244,74,182,18,120,150,210,236,122,243,228,155,204,92,34]},"announce":[],"urlList":[]}}