{"title":"Yanis Varoufakis - The Global Minotaur","uid":11709236,"size":606731,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:662e01f8468ea7ecd7daffc6ff4bc0776f4f489a&amp;dn=Yanis+Varoufakis+-+The+Global+Minotaur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"Papushi","files":1,"time":1424257320,"description":"In this remarkable and provocative book, Greek Finance Minister Yanis Varoufakis explodes the myth that financialisation, ineffectual regulation of banks, greed and globalisation were the root causes of both the Eurozone crisis and the global economic crisis. Rather, they are symptoms of a much deeper malaise which can be traced all the way back to the Great Crash of 1929, then on through to the 1970s: the time when a 'Global Minotaur' was born. Just as the Athenians maintained a steady flow of tributes to the Cretan beast, so Europe and the rest of the world began sending incredible amounts of capital to America and Wall Street. Thus, the Global Minotaur became the 'engine' that pulled the world economy from the early 1980s through to the financial collapse of 2008.\n\nToday's deepening crisis in Europe is just one of the inevitable symptoms of the weakening Minotaur; of a global 'system' which is now as unsustainable as it is imbalanced. Going beyond this, Varoufakis lays out the options available to us for reintroducing a modicum of reason into a highly irrational global economic order.\n\nAn essential account of the socio-economic events and hidden histories that have shaped the world as we now know it","torrent":{"xt":"urn:btih:662e01f8468ea7ecd7daffc6ff4bc0776f4f489a","amp;dn":"Yanis+Varoufakis+-+The+Global+Minotaur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"662e01f8468ea7ecd7daffc6ff4bc0776f4f489a","infoHashBuffer":{"type":"Buffer","data":[102,46,1,248,70,142,167,236,215,218,255,198,255,75,192,119,111,79,72,154]},"announce":[],"urlList":[]}}