{"title":"Extras-Series (Seasons) 1 &amp; 2 Complete","uid":4331266,"size":4349042688,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:675e1d87ddd5981cfe89edbca74ba48d1895dc02&amp;dn=Extras-Series+%28Seasons%29+1+%26+2+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":5,"uploader":"crabbycancer1977","files":12,"time":1218051312,"description":"I&amp;#039;m a big fan of Ricky Gervais (you may know him from the UK&amp;#039;s &quot;The Office&quot; or his hilarious scene with DeNiro in Stardust. This is classic Gervais: completely awkward humor...probably his best to date. This show is seriously the best comedy I&amp;#039;ve seen in a long time...definitely better than anything we have in the U.S. right now. If you like dry humor, and some really awkward shit in true Brit form, you&amp;#039;ll love Extras. Seed and seed alike...this is one you&amp;#039;ll want to share!\n\nThe wiki info is below:\n\nExtras is a BAFTA, Golden Globe and Emmy Award-winning British television sitcom about extras working on film sets and in theatre. The series is co-produced by the BBC and HBO, and is created, written, and directed by Ricky Gervais and Stephen Merchant, both of whom also star in it.\n\nExtras has two seasons of six episodes each as well as a Christmas Special. The first episode aired in the UK on 21 July 2005 on BBC Two and on 25 September 2005 on HBO in the US. The second series premiered in the UK on BBC Two on 14 September 2006 and began airing in the US on HBO and in Australia on ABC on 14 February 2007.[1] The Christmas Special aired on 27 December 2007 on BBC Two and on 16 December 2007 on HBO. Both series are available on DVD in the UK and the US. The series is filmed in a more traditional sitcom style than the mockumentary style used by Gervais and Merchant in their previous series The Office. Each episode has at least one guest star; a television or film celebrity, who play what Gervais and Merchant have referred to as &quot;twisted&quot; versions of themselves[2]; an exaggerated or inverted parody of their famous public personas.","torrent":{"xt":"urn:btih:675e1d87ddd5981cfe89edbca74ba48d1895dc02","amp;dn":"Extras-Series+%28Seasons%29+1+%26+2+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"675e1d87ddd5981cfe89edbca74ba48d1895dc02","infoHashBuffer":{"type":"Buffer","data":[103,94,29,135,221,213,152,28,254,137,237,188,167,75,164,141,24,149,220,2]},"announce":[],"urlList":[]}}