{"title":"BATMAN - WHATEVER HAPPENED TO THE CAPED CRUSADER - NEIL GAIMAN","uid":9690617,"size":67147662,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:67ae5b497834b001d79f2228f7804a7f981cfdba&amp;dn=BATMAN+-+WHATEVER+HAPPENED+TO+THE+CAPED+CRUSADER+-+NEIL+GAIMAN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1393855642,"description":"From Amazon description:\n\nBest-selling author Neil Gaiman (The Sandman) joins a murderer's row of talented artists in lending his unique touch to the Batman mythos! In the story &quot;Whatever Happened to the Caped Crusader?&quot; from Batman #685 and Detective Comics #852 (2009), Gaiman joins artist Andy Kubert and inker Scott Williams for a story that shines a new light on the Batman mythos.\n\n------\n\nFrom Publishers Weekly review:\n\nFollowing the death of Bruce Wayne in 2008's &quot;Batman: R.I.P.&quot; comes Gaiman's loving eulogy not just to Batman but to the Batman of each era since the character's debut. Bolstered by slick art from Kubert (Batman; Captain America), Gaiman's lyrical chops are in fine form, weaving a surreal wake in which characters from Batman's history take turns relating what he meant to them, and their takes on the Dark Knight and the dangerous microcosm he fought for and eventually purportedly died to protect. Although this is obviously a love letter from one of the comics medium's premiere talents, the volume will appeal more to readers well-versed in Batman's continuity than Gaiman's normal legion of fans.\n\n------\n\nFrom STF:\n\nI was surprised yesterday to find this story was apparently unavailable on TPB, except in the MTCDC torrents... enjoy, please seed &amp; share. All credit goes to the original scanners.","torrent":{"xt":"urn:btih:67ae5b497834b001d79f2228f7804a7f981cfdba","amp;dn":"BATMAN+-+WHATEVER+HAPPENED+TO+THE+CAPED+CRUSADER+-+NEIL+GAIMAN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67ae5b497834b001d79f2228f7804a7f981cfdba","infoHashBuffer":{"type":"Buffer","data":[103,174,91,73,120,52,176,1,215,159,34,40,247,128,74,127,152,28,253,186]},"announce":[],"urlList":[]}}