{"title":"Hellsing 01-13 Eng Dub DvDrip-soagg","uid":4594549,"size":3222239232,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:6802dbe93c18bcb6dd04efe7a35f915045118643&amp;dn=Hellsing+01-13+Eng+Dub+DvDrip-soagg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":3,"uploader":"soagg","files":13,"time":1229959240,"description":"Hellsing English Dubbed DvDrip Episodes 01-13\n\nOutline:\nA secret war is brewing in the night, a war in which humanity is only a pawn. The Hellsing organization has been protecting both Queen and Country for centuries, though with each day, the threat of the living dead continues to loom over the unexpected denizens of the world. Even armed with powerful automatic weapons with silver armor-piercing or mercury-ignition rounds, the Hellsing organization finds it difficult to banish these demons from the face of the earth. That is where Alucard comes in, a powerful vampire of unknown origin, though he serves Integra Hellsing with fierce loyalty.\n\nHowever, one night in the town of Cheddar, Alucard comes across a young female police officer who is being held hostage by a vampire priest. Through a question he asked, the young woman, Seras Victoria, decided to become a vampire and Alucard became her master. She must now struggle with the loss of her humanity as she attempts to become a suitable member of the Hellsing organization, though with the terrors of the night growing more and more problematic with each passing day, she must overcome her weaknesses if she wishes to survive.\n\nPlease seed and do write some comments!!\n\nEnjoy!!","torrent":{"xt":"urn:btih:6802dbe93c18bcb6dd04efe7a35f915045118643","amp;dn":"Hellsing+01-13+Eng+Dub+DvDrip-soagg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6802dbe93c18bcb6dd04efe7a35f915045118643","infoHashBuffer":{"type":"Buffer","data":[104,2,219,233,60,24,188,182,221,4,239,231,163,95,145,80,69,17,134,67]},"announce":[],"urlList":[]}}