{"title":"High-res Studio HDRi pack","uid":4478530,"size":240811118,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:681ee0358154bc62e0344e9d44e46528ab5767cc&amp;dn=High-res+Studio+HDRi+pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"Thykka","files":2,"time":1225414771,"description":"- -+- -+- -+- -+- High-res Studio HDRi set -+- -+- -+- -+- -+- -\n\n 1. General\n 2. Public Domain Certification\n 3. Credits\n\n1. General\n\nThis is a set of 19 high resolution High Dynamic Range Images\nfor commercial or non-commercial use. The images are in 32-bit\nRadiance format at 10240*5120px. Smaller images are available at\n\n---\n\n\n2. Public Domain Certification\n\nThe person or persons who have associated work with this\ndocument (the &quot;Dedicator&quot; or &quot;Certifier&quot;) hereby either (a)\ncertifies that, to the best of his knowledge, the work of\nauthorship identified is in the public domain of the country\nfrom which the work is published, or (b) hereby dedicates\nwhatever copyright the dedicators holds in the work of\nauthorship identified below (the &quot;Work&quot;) to the public domain.\nA certifier, moreover, dedicates any copyright interest he may\nhave in the associated work, and for these purposes, is\ndescribed as a &quot;dedicator&quot; below.\n\nA certifier has taken reasonable steps to verify the copyright\nstatus of this work. Certifier recognizes that his good faith\nefforts may not shield him from liability if in fact the work\ncertified is not in the public domain.\n\nDedicator makes this dedication for the benefit of the public at\nlarge and to the detriment of the Dedicator&amp;#039;s heirs and\nsuccessors. Dedicator intends this dedication to be an overt act\nof relinquishment in perpetuity of all present and future rights\nunder copyright law, whether vested or contingent, in the Work.\nDedicator understands that such relinquishment of all rights\nincludes the relinquishment of all rights to enforce (by lawsuit\nor otherwise) those copyrights in the Work.\n\nDedicator recognizes that, once placed in the public domain, the\nWork may be freely reproduced, distributed, transmitted, used,\nmodified, built upon, or otherwise exploited by anyone for any\npurpose, commercial or non-commercial, and in any way, including\nby methods that have not yet been invented or conceived.\n\n\n\ntl;dr: You may use these images any way you want to. You are\nencouraged to credit the author, but this is not mandatory.\n\nsee readme.txt for contact info","torrent":{"xt":"urn:btih:681ee0358154bc62e0344e9d44e46528ab5767cc","amp;dn":"High-res+Studio+HDRi+pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"681ee0358154bc62e0344e9d44e46528ab5767cc","infoHashBuffer":{"type":"Buffer","data":[104,30,224,53,129,84,188,98,224,52,78,157,68,228,101,40,171,87,103,204]},"announce":[],"urlList":[]}}