{"title":"The Murder of King Tut: The Plot to Kill the Child King","uid":15816255,"size":1565377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68b691327e42b8a24c1c6d6d6ea09c43f26bff18&amp;dn=The+Murder+of+King+Tut%3A+The+Plot+to+Kill+the+Child+King&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"marty14","files":1,"time":1473688289,"description":"The Murder of King Tut: The Plot to Kill the Child King - James Patterson, Martin Dugard [epub]\r\n\r\nThrust onto Egypt's most powerful throne at the age of nine, King Tut's reign was fiercely debated from the outset. Behind the palace's veil of prosperity, bitter rivalries and jealousy flourished among the Boy King's most trusted advisors, and after only nine years, King Tut suddenly perished, his name purged from Egyptian history. To this day, his death remains shrouded in controversy. \r\n\r\nEnchanted by the ruler's tragic story and hoping to unlock the answers to the 3,000 year-old mystery, Howard Carter made it his life's mission to uncover the pharaoh's hidden tomb. He began his search in 1907, but encountered countless setbacks and dead-ends before he finally, uncovered the long-lost crypt. \r\n\r\nNow, in The Murder of King Tut, James Patterson and Martin Dugard dig through stacks of evidence - X-rays, Carter's files, forensic clues, and stories told through the ages - to arrive at their own account of King Tut's life and death. The result is an exhilarating true crime tale of intrigue, passion, and betrayal that casts fresh light on the oldest mystery of all","torrent":{"xt":"urn:btih:68b691327e42b8a24c1c6d6d6ea09c43f26bff18","amp;dn":"The+Murder+of+King+Tut%3A+The+Plot+to+Kill+the+Child+King","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68b691327e42b8a24c1c6d6d6ea09c43f26bff18","infoHashBuffer":{"type":"Buffer","data":[104,182,145,50,126,66,184,162,76,28,109,109,110,160,156,67,242,107,255,24]},"announce":[],"urlList":[]}}