{"title":"Metallica-Master_Of_Puppets-(Retail)-1986-HHI","uid":6505233,"size":94671169,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:68f04dc1f1f9a586bfde3a1a25672865135ae1a7&amp;dn=Metallica-Master_Of_Puppets-%28Retail%29-1986-HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":1,"uploader":"raidy","files":11,"time":1309409496,"description":"RELEASE INFORMATION - HAPPY HACKER INDUSTRIES [HHI]\n\nArtist......: Metallica \n Album.......: Master of puppets \n Grabber : EAC \n Encoder : LAME v3.90.3 \n Release Date: 1986 \n Rip Date....: Mar-27-2005 \n Genre.......: Metal \n Quality : VBRkbps / 44.1kHz / Joint-Stereo \n Playtime : 54:50 min \n Ripper : Happy Hacker Industries \n Supplier : HHI \n CD Songs : 08 \n Label.......: Elektra \n Album Info..: \n \n Even though Master of Puppets didn't take as gigantic a leap forward as Ride the \n Lightning, it was the band's greatest achievement, hailed as a masterpiece by critics far outside heavy metal's core audience. It was also a substantial hit, reaching the Top 30 and selling three million copies despite absolutely nonexistent airplay. Instead of a radical reinvention, Master of Puppets is a refinement of past innovations. In fact, it's possible to compare Ride the Lightning and Master of Puppets song for song and note striking similarities between corresponding track positions on each record (although Lightning's closing instrumental has been bumped up to next-to-last in Master's running order). That hint of conservatism is really the only conceivable flaw here. Though it isn't as startling as Ride the Lightning, Master of Puppets feels more unified, both thematically and musically. Everything about it feels blown up to epic proportions (indeed, the songs are much longer on average), and the band feels more in control of its direction. You'd never know it by the lyrics, though -- in one way or another, nearly every song on Master of Puppets deals with the fear of powerlessness. Sometimes they're about hypocritical authority \n (military and religious leaders), sometimes primal, uncontrollable human urges \n (drugs, insanity, rage), and, in true H.P. Lovecraft fashion, sometimes monsters. Yet by bookending the album with two slices of thrash mayhem (&quot;Battery&quot; and &quot;Damage,  Inc.&quot;), the band reigns triumphant through sheer force -- of sound, of will, of  malice. The arrangements are thick and muscular, and the material varies enough in  texture and tempo to hold interest through all its twists and turns. Some critics  have called Master of Puppets the best heavy metal album ever recorded; if it isn't,  it certainly comes close. \n \n \n Track Listing....: \n 01.Battery [05:13] \n 02.Master of puppets [08:36] \n 03.The thing that should not [06:37] \n be \n 04.Welcome home (sanitarium) [06:28] \n 05.Disposable heroes [08:17] \n 06.Leper messiah [05:41] \n 07.Orion [08:28] \n 08.Damage, inc. [05:30] \n ____ \n \n 54:50 min \n 90,3 MB               \n","torrent":{"xt":"urn:btih:68f04dc1f1f9a586bfde3a1a25672865135ae1a7","amp;dn":"Metallica-Master_Of_Puppets-%28Retail%29-1986-HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68f04dc1f1f9a586bfde3a1a25672865135ae1a7","infoHashBuffer":{"type":"Buffer","data":[104,240,77,193,241,249,165,134,191,222,58,26,37,103,40,101,19,90,225,167]},"announce":[],"urlList":[]}}