{"title":"Super_Smash_Bros_for_Nintendo_3DS_USA_3DS-ABSTRAKT","uid":11162387,"size":1193494027,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:693a5c88ec57310c36326e80722028c84b7d4278&amp;dn=Super_Smash_Bros_for_Nintendo_3DS_USA_3DS-ABSTRAKT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":1,"uploader":"ffm58","files":27,"time":1412574001,"description":"Super Smash Bros. for Nintendo 3DS is the first portable entry in the renowned series, in which game worlds collide. Up to four players battle each other locally or online using some of Nintendo's most well-known and iconic characters across beautifully designed stages inspired by classic portable Nintendo games. It's a genuine, massive Super Sma sh Bros. experience that's available to play on the go, anytime, anywhere. \n\nFEATURES: \n\n    Smash and crash through &quot;Smash Run&quot; mode, a new mode exclusive to the Nintendo 3DS version that gives up to four players five minutes to fight solo through a huge battlefield while taking down recognizable enemies from almost every major Nintendo franchise and multiple third-party partners. Defeated enemies leave behind power-ups to collect. Players who collect more power-ups have an advantage once time runs out and the battle with opponents begins. \n    Compete with classic characters from the Super Smash Bros. series like Mario, Link, Samus and Pikachu, along with new challengers like Mega Man, Little Mac and newly announced Palutena, the Goddess of Light from the Kid Icarus games. For the first time players can even compete as their own Mii characters. \n    Customize different aspects of your character when playing locally or online with friends in a variety of multiplayer modes. \n    View most elements of the high-energy action at silky-smooth 60 frames per second and in eye-popping stereoscopic 3D. \n    Fight against friends and family locally or online, or battle random challengers all over the world online in &quot;For Fun&quot; or &quot;For Glory&quot; modes. \n\nRelease Date.: 2014/10/03                  \nGenre........: Fighting \nLanguages....: English                    \nSystem.......: Nintendo 3DS \nFilename.....: AS-SSB.XXX                  \nRegion.......: USA \nSize.........: 16 GBiT                    \nFiles........: 24 x 50 MB","torrent":{"xt":"urn:btih:693a5c88ec57310c36326e80722028c84b7d4278","amp;dn":"Super_Smash_Bros_for_Nintendo_3DS_USA_3DS-ABSTRAKT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"693a5c88ec57310c36326e80722028c84b7d4278","infoHashBuffer":{"type":"Buffer","data":[105,58,92,136,236,87,49,12,54,50,110,128,114,32,40,200,75,125,66,120]},"announce":[],"urlList":[]}}