{"title":"Undeniable: Evolution and the Science of Creation - Bill Nye MP3","uid":11471751,"size":274428333,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:695e33e2196f66a35beb113dec06e878d7cd7951&amp;dn=Undeniable%3A+Evolution+and+the+Science+of+Creation+-+Bill+Nye+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1416097721,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nUndeniable: Evolution and the Science of Creation\n\nWritten by: Bill Nye\nNarrated by: Bill Nye\nLength: 9 hrs and 29 mins\nUnabridged Audiobook\nRelease Date:11-04-14\n\nSparked by a provocative comment to BigThink.com last fall, and fueled by a highly controversial debate with Creation Museum curator Ken Ham, Bill Nye's campaign to confront the scientific shortcoming of creationism has exploded in just a few months into a national crusade. In this book, he expands the points he has made, and claims that this debate is not so much about religion versus science, as about the nature of science itself.\n\nWith infectious enthusiasm, he reveals the mechanics of evolutionary theory, explains how it is rooted in the testable and verifiable scientific method, and why it is therefore a sound explanation of our beginning. He argues passionately that to continue to assert otherwise, to continue to insist that creationism has a place in the science classroom is harmful not only to our children, but to the future of the greater world as well","torrent":{"xt":"urn:btih:695e33e2196f66a35beb113dec06e878d7cd7951","amp;dn":"Undeniable%3A+Evolution+and+the+Science+of+Creation+-+Bill+Nye+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"695e33e2196f66a35beb113dec06e878d7cd7951","infoHashBuffer":{"type":"Buffer","data":[105,94,51,226,25,111,102,163,91,235,17,61,236,6,232,120,215,205,121,81]},"announce":[],"urlList":[]}}