{"title":"Fed Power: How Finance Wins (2016) by Lawrence Jacobs","uid":15876144,"size":1359858,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69f5db61413980881fc62b728da7d360c6538948&amp;dn=Fed+Power%3A+How+Finance+Wins+%282016%29+by+Lawrence+Jacobs&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":2,"uploader":"Dr.Soc","files":1,"time":1474512997,"description":"Fed Power: How Finance Wins By Lawrence Jacobs, Desmond King\r\n2016 | 264 Pages | ISBN: 0199388962 | PDF | 1 MB\r\n\r\n\r\nThe Federal Reserve is the most powerful central bank in the world. Without its central bank, the American economy would be subject to devastating fluctuations and instability. In maintaining this stability, The Fed dictates interest rates and designs bailouts without the usual checks and balances that pervade US policy making. Most commentators treat the Fed as an impartial referee exercising its independence to advance the best interests of America. Wrong. Lawrence Jacobs and Desmond King's Fed Power is the first sustained examination of the Fed as a potent institution in its own right and an engine for producing concealed advantages for a privileged few. The authors trace the Fed's historic development from the fiery tug-of-war over monetary policy during the 19th century to its current position as a powerful cog in the &quot;big government&quot; machine with unparalleled capacity and autonomy to intervene in private markets. Jacobs and King dissect how the Fed's programs during the Great Recession funneled enormous sums to a select few in the finance industry while leaving Main Street businesses adrift and millions of homeowners underwater. Far from serving the national interest, the Fed increased economic inequality in America and further enriched the &quot;one percent.&quot; America is heading into the next financial crisis without an effective central bank. 'End the Fed' is a popular slogan that not only voices the people's displeasure with the Fed's favoritism, but also speaks to a national feeling of the Fed's illegitimacy. Lacking a powerful and capable central bank is a roadmap to mass unemployment and impoverishment. Jacobs and King present an energetic reform agenda to build an accountable central bank in America to ensure the economy remains stable and prosperous","torrent":{"xt":"urn:btih:69f5db61413980881fc62b728da7d360c6538948","amp;dn":"Fed+Power%3A+How+Finance+Wins+%282016%29+by+Lawrence+Jacobs","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69f5db61413980881fc62b728da7d360c6538948","infoHashBuffer":{"type":"Buffer","data":[105,245,219,97,65,57,128,136,31,198,43,114,141,167,211,96,198,83,137,72]},"announce":[],"urlList":[]}}