{"title":"The Good Place - s01e01-02 - Pilot; Flying","uid":15870609,"size":2536089606,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:6a0bbae55598eb71bf5db2e354a9e1db26599829&amp;dn=The+Good+Place+-+s01e01-02+-+Pilot%3B+Flying&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":5,"uploader":"weestrom","files":1,"time":1474421193,"description":"Eleanor has just died and her spirit has arrived at its final resting place. In her first conversation with Michael, the spirit who designed the &quot;neighborhood&quot; which will be her home in the afterlife, he tells her some key pieces of information about the afterlife in general and where she has ended up, including that the concepts of heaven and hell are not exactly accurate, but rather that there is a bad place where most end up, while only a handful of who were the most selfless on earth end up in the good place, where she is. The good place is designed to provide total happiness for its residents, including a residence specifically designed for his or her likes, and being paired with another spirit who is truly a soul mate, that spirit for Eleanor being who was a Senegalese man named Chidi Anagonye. Another important spirit in the good place is Janet, a non-judgmental but ever knowing spirit who can appear at a moment's notice and will provide almost any information requested. After Michael reviews Eleanor's life with her, she decides to confide in Chidi an issue which will definitely affect what happens to her in the good place. The fact of Eleanor being in the good place also has profound effects on her surroundings.\r\n\r\nOn the revelation that Eleanor probably ended up in the good place by mistake, Chidi has not yet decided if he will help her become good so that she can stay. It is especially important to her after she gets just a small glimpse of what the alternative of the bad place is like. Eleanor also believes that the situation can't be as black and white as it appears on the surface if someone like overly chatty and vain Tahani could have made it into the good place. What Chidi decides to do may be affected by what Eleanor chooses with regard to helping Tahani and Jianyu clean up after the &quot;mini-apocalypse&quot; - which probably occurred because of Eleanor's presence in the good place - or going to the flying lesson, which all new arrivals at the good place are taught to do. Meanwhile, Michael is slowly having a meltdown in trying to figure out what he did wrong in creating the neighborhood, unaware that all the problems that have happened are because of Eleanor's presence. And Tahani herself is having a slow burn in her want for Jianyu to say something, anything","torrent":{"xt":"urn:btih:6a0bbae55598eb71bf5db2e354a9e1db26599829","amp;dn":"The+Good+Place+-+s01e01-02+-+Pilot%3B+Flying","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a0bbae55598eb71bf5db2e354a9e1db26599829","infoHashBuffer":{"type":"Buffer","data":[106,11,186,229,85,152,235,113,191,93,178,227,84,169,225,219,38,89,152,41]},"announce":[],"urlList":[]}}