{"title":"Francis of Assisi: The Life and Afterlife of a Medieval Saint","uid":15861806,"size":2742744,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a13f7e0af927faa466607bd880ec6e16029a8be&amp;dn=Francis+of+Assisi%3A+The+Life+and+Afterlife+of+a+Medieval+Saint&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":0,"uploader":"marty14","files":1,"time":1474306960,"description":"Francis of Assisi: The Life and Afterlife of a Medieval Saint - Andre Vauchez [epub]\r\n\r\nIn this towering work, André Vauchez draws on the vast body of scholarship on Francis of Assisi produced over the past forty years as well on as his own expertise in medieval hagiography to tell the most comprehensive and authoritative version of Francis’s life and afterlife published in the past half century. \r\n\r\nAfter a detailed and yet engaging reconstruction of Francis's life and work, Vauchez focuses on the myriad texts—hagiographies, chronicles, sermons, personal testimonies, etc.—of writers who recorded aspects of Francis's life and movement as they remembered them, and used those remembrances to construct a portrait of Francis relevant to their concerns. We see varying versions of his life reflected in the work of Machiavelli, Luther, Voltaire, German and English romantics, pre-Raphaelites, Italian nationalists, and Mussolini, and discover how peace activists, ecologists, or interreligious dialogists have used his example to promote their various causes. Particularly noteworthy is the attention Vauchez pays to Francis’s own writings, which strangely enough have been largely overlooked by later interpreters.\r\n\r\nThe product of a lifetime of study, this book reveals a historian at the height of his powers","torrent":{"xt":"urn:btih:6a13f7e0af927faa466607bd880ec6e16029a8be","amp;dn":"Francis+of+Assisi%3A+The+Life+and+Afterlife+of+a+Medieval+Saint","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a13f7e0af927faa466607bd880ec6e16029a8be","infoHashBuffer":{"type":"Buffer","data":[106,19,247,224,175,146,127,170,70,102,7,189,136,14,198,225,96,41,168,190]},"announce":[],"urlList":[]}}