{"title":"Molecular Biology of the Cell - Alberts - 5th ed","uid":5401801,"size":218601106,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6aaba70b04504d10f9354e1db660059f9f29a752&amp;dn=Molecular+Biology+of+the+Cell+-+Alberts+-+5th+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":0,"uploader":"DarkMaster77","files":-1,"time":1267454273,"description":"It's in color and HQ, of course.\n\nIf you found it useful, please share and keep this torrent alive. First torrent, by the way.\n\nComment!\n\nPS: It's not the Reference edition.\n\nEDIT: Only a few chapters are high quality (digital edition). Most, including index, are color fotocopies (but fairly good ones).\n\n-----------------------------------\n\nTo those crusaders of good who think sharing books is wrong: \n\nScrew you! Try to think of other people who could never afford this book. The world is bigger than your own country and not everybody is in your situation.\n\nFor many, it's either this or studying from black &amp; white photocopies of older editions.\n\n-----------------------------------\n\nFor nearly a quarter century Molecular Biology of the Cell has been the leading cell biology textbook. This tradition continues with the new Fifth Edition, which has been completely revised and updated to describe our current, rapidly advancing understanding of cell biology. To list but a few examples, a large amount of new material is presented on epigenetics; stem cells; RNAi; comparative genomics; the latest cancer therapies; apoptosis (now its own separate chapter); and cell cycle control and the mechanics of M phase (now integrated into one chapter).\n\nThe hallmark features of Molecular Biology of the Cell have been retained, such as its consistent and comprehensive art program, clear concept headings, and succinct section summaries. Additionally, in response to extensive feedback from readers, the Fifth Edition now includes several new features.\n\nIt is now more portable. Chapters 1-20 are printed and Chapters 21-25, covering multicellular systems, are provided as pdf files on the free Media DVD-ROM which accompanies the book.* And for the first time, Molecular Biology of the Cell now contains end-of-chapter questions. These problems, written by John Wilson and Tim Hunt, emphasize a quantitative approach and the art of reasoning from experiments, and they will help students review and extend their knowledge derived from reading the textbook. The Media DVD-ROM, which is packaged with every copy of the book, contains PowerPoint(R) presentations with all of the figures, tables and micrographs from the text (available as JPEGs too). Also included is the Media Player, which plays over 125 movies-animations, videos, and molecular models-all with voice-over narration. A new reader-friendly feature is the integration of media codes throughout the text that link directly to relevant videos and animations. The Media DVD-ROM holds the multicellular systems chapters (21-25) of the text as well.\n\nBy skillfully extracting the fundamental concepts from this enormous and ever-growing field, the authors tell the story of cell biology, and thereby create a coherent framework through which readers may approach and enjoy this subject that is so central to all of biology.\n","torrent":{"xt":"urn:btih:6aaba70b04504d10f9354e1db660059f9f29a752","amp;dn":"Molecular+Biology+of+the+Cell+-+Alberts+-+5th+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6aaba70b04504d10f9354e1db660059f9f29a752","infoHashBuffer":{"type":"Buffer","data":[106,171,167,11,4,80,77,16,249,53,78,29,182,96,5,159,159,41,167,82]},"announce":[],"urlList":[]}}