{"title":"OmniGraffle Pro - 6.0 [Intel/Serial]","uid":8980138,"size":30095356,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:6af97b61dc1721a214dbfbb67fa864df0fbfcef2&amp;dn=OmniGraffle+Pro+-+6.0+%5BIntel%2FSerial%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":1,"uploader":"3pehrthegr8","files":2,"time":1380500084,"description":"Description\nName: OmniGraffle Pro\nVersion: - 6.0\n\nMac Platform: Intel\nIncludes: Serial\n\nOS version: Mac OS X 10.8 or later\nProcessor type(s) &amp; speed: any 64-bit capable Intel\n\nLink for more information: http://www.omnigroup.com/omnigraffle/\n\nOmniGraffle Pro helps you draw beautiful diagrams, family trees, flow charts, org charts, layouts, and (mathematically speaking) any other directed or non-directed graphs. We've had people use Graffle to plan plotlines for a story, make an overview of an operating system, show the evolution of computers, and even show how diseases can spread in a closed population. If you want to organize your thoughts, your projects, or even your friends graphically using boxes and lines, OmniGraffle is your tool.\n\nOmiGraffle Professional has all of the great features in 6.0, plus a powerful toolset for advanced document creation and editing options. For the pro user who's looking for an in-depth diagramming application that's still priced below the competition, you've come to the right place.\n\n\nWHAT'S NEW\nVersion 6.0:\nOmniGraffle 6 offers a complete User Interface redesign from the ground up.\nThe application now runs in a Sandboxed environment.\nApplication resources such as Templates and Stencils, etc. can now be fully managed from within the application.\nImproved and powerful controls have been added to edit and mask placed images directly on the canvas.\nNew artistic Fill and Stroke styles have been added, such as Freehand, Stipple, and Marker.\nCombined shapes can now be uncombined into their starting component shapes.\nNew controls to specify which edge or center of an object is reflected in the Geometry Inspector have been added, along with the ability to set the X and Y coordinates of a selected vertex point.\nLayers can now be toggled between a normal and a Shared layer.\nA new and powerful Font Inspector is now available.\nThe Notes and Data Inspector now allows unique naming of individual objects.\nYou can now set the display zoom level of 100% to reflect one Apple point, one screen pixel, or one PostScript point for work on Retina displays and true WYSIWYG work.\nZoom levels have been increased to 6400%!\nThe color and position of manual Guides can now be set by hand, and can be dragged from one canvas to another.\nA new List Mode has been added when viewing Stencils.\nPhotoshop export has returned, and supports the export of OmniGraffle layers to Photoshop layers.\nLine Labels have a new setting that allows the text to follow the path of the line.","torrent":{"xt":"urn:btih:6af97b61dc1721a214dbfbb67fa864df0fbfcef2","amp;dn":"OmniGraffle+Pro+-+6.0+%5BIntel%2FSerial%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6af97b61dc1721a214dbfbb67fa864df0fbfcef2","infoHashBuffer":{"type":"Buffer","data":[106,249,123,97,220,23,33,162,20,219,251,182,127,168,100,223,15,191,206,242]},"announce":[],"urlList":[]}}