{"title":"Michael Breen - 30 Days to Masterful NLP Anchoring","uid":11768698,"size":1072740565,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6b125860f910950c307de689f0c878a88d2938fd&amp;dn=Michael+Breen+-+30+Days+to+Masterful+NLP+Anchoring&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":4,"uploader":"acer47x","files":15,"time":1426970051,"description":"ear Student of NLP,\n\nI have a few questions for you:\n\n*Have you ever found yourself wondering how to use anchoring in everyday life situations?\n*Do you feel confused or unsure how to anchor someone in a personal, presentation or business situation?\n*Have you ever found yourself explaining what anchoring is yet know you cannot anchor visually or auditorally and silently hoped your listeners wouldn't ask you for a demonstration?\n*Would the thought of someone asking you to stand up and teach anchoring to a group frighten you?\n*Do you work in a job where being able to evoke specific states at will and effect emotions could help you?\n*Have you ever felt your heart race when you kinaesthetically anchored someone and was full sure it looked awkward or you were about to be &quot;found out&quot;?\n*Have you ever felt you lack confidence in your NLP skills and specifically in how to visually or auditory anchor others with ease?\n*Do you feel like you don't know when an anchor is working, or not sure if you've set it correctly or confused when you fire the anchor and you don't get the response that you want?\n*Do you get nervous when you try to intentionally anchor someone in a social or work situation or find yourself feeling false and that your anchoring will be noticed or is clumsy?\n*Are you tired of hearing the same old &quot;Stimulus-Response, pavlov's dog story&quot; as the key to anchoring and want to learn how anchoring REALLY works, so that you can do it with ease visually, auditory or kinaesthetically when you decide?\n*Have you ever seen a great piece of change work, persuasion or influence and wondered how did that and you knew there had to be more than language involved?\n*Have you ever attended a training where you saw one of the great master trainers doing a presentation and suspected they were anchoring, chaining and firing states on you and everyone else in the room, and you didn't have a clue how they did it?\n*Would you like to know what they know about anchoring the almost never gets taught?\n*Do you ever feel self-conscious and stifled when you're around other more 'experienced NLPers' to the point where you don't contribute anything or repeat the things you've heard to try to &quot;keep up&quot; or save face?\n*Have you ever set an anchor and felt a little fear come up as you got to test the trigger because you're afraid the anchor just won't work ... yet again. And felt that tightening of your chest with disappointment?\n*When you first heard about how powerful anchoring is were you so excited about using it, yet after going through several training's, you have resigned yourself to not attempting it anymore, for fear that anchoring doesn't work or that you just won't be able to do it?\n*Do you work in a professional situation where having the power to anchor others intentionally and with ease could be a massive benefit to you and help you achieve the business, relationship, health, financial and personal results you want?\n*Would you like to be able to anchor with the best of them, know how anchoring really works (the secret sauce that very few NLPers ever get to know) and be able to do it in any sensory system, so that it became so natural it was second nature to you?\n\nIf you answered &quot;Yes!&quot; to any of these questions, then I have some important news for you","torrent":{"xt":"urn:btih:6b125860f910950c307de689f0c878a88d2938fd","amp;dn":"Michael+Breen+-+30+Days+to+Masterful+NLP+Anchoring","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b125860f910950c307de689f0c878a88d2938fd","infoHashBuffer":{"type":"Buffer","data":[107,18,88,96,249,16,149,12,48,125,230,137,240,200,120,168,141,41,56,253]},"announce":[],"urlList":[]}}