{"title":"Make - Electronics (Learning by Discovery)(gnv64)","uid":7958468,"size":14510212,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b30a260909805e77e12080712f4b1963ab67cc2&amp;dn=Make+-+Electronics+%28Learning+by+Discovery%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"gnv65","files":-1,"time":1356510080,"description":"Make: Electronics (Learning by Discovery) \nby Charles Platt \nMake | December 2009 | ISBN-10: 0596153740 | True PDF | 360 pages | 13.8 mb &lt;a href=&quot;\nhttp://www.amazon.com/Make-Electronics-Discovery-Charles-Platt/dp/0596153740&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Make-Electronics-Discovery-Charles-Platt/dp/0596153740&lt;/a&gt;\n\nWant to learn the fundamentals of electronics in a fun, hands-on way? With Make: Electronics, you'll start working on real projects as soon as you crack open the book. Explore all of the key components and essential principles through a series of fascinating experiments. You'll build the circuits first, then learn the theory behind them!\n\nBuild working devices, from simple to complex You'll start with the basics and then move on to more complicated projects. Go from switching circuits to integrated circuits, and from simple alarms to programmable microcontrollers. Step-by-step instructions and more than 500 full-color photographs and illustrations will help you use -- and understand -- electronics concepts and techniques.\n\n-    Discover by breaking things: experiment with components and learn from failure\n-    Set up a tricked-out project space: make a work area at home, equipped with the tools and parts you'll need\n-    Learn about key electronic components and their functions within a circuit\n-    Create an intrusion alarm, holiday lights, wearable electronic jewelry, audio processors, a reflex tester, and a combination lock\n-    Build an autonomous robot cart that can sense its environment and avoid obstacles\n-    Get clear, easy-to-understand explanations of what you're doing and why\n\nAbout the Author\nCharles Platt became interested in computers when he acquired an Ohio Scientific C4P in 1979. After writing and selling software by mail order, he taught classes in BASIC programming, MS-DOS, and subsequently Adobe Illustrator and Photoshop. He wrote five computer books during the 1980s.\nHe has also written science fiction novels such as The Silicon Man (published originally by Wired books) and Protektor (from Avon Books). He stopped writing science fiction when he started contributing to Wired magazine in 1993, and became one of its three senior writers a couple of years later.\nCharles began contributing to Make magazine in its third issue and is currently a contributing editor. Make: Electronics is his first book for Make Books. Currently he is designing and building prototypes of medical equipment in his workshop in a northern Arizona wilderness area.","torrent":{"xt":"urn:btih:6b30a260909805e77e12080712f4b1963ab67cc2","amp;dn":"Make+-+Electronics+%28Learning+by+Discovery%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b30a260909805e77e12080712f4b1963ab67cc2","infoHashBuffer":{"type":"Buffer","data":[107,48,162,96,144,152,5,231,126,18,8,7,18,244,177,150,58,182,124,194]},"announce":[],"urlList":[]}}