{"title":"Anatomy of a Ponzi: Scams Past and Present","uid":16044538,"size":1977964,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6bc4540a8835c913e4cc8105ffc3110d6106482f&amp;dn=Anatomy+of+a+Ponzi%3A+Scams+Past+and+Present&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":5,"uploader":"marty14","files":1,"time":1476550190,"description":"Anatomy of a Ponzi: Scams Past and Present - Colleen Cross [epub]\r\n\r\nMany investors faced financial ruin after investing in Ponzi Schemes with Madoff, Stanford and Wall Street crooks, often unknowingly through complex feeder fund arrangements. You may be invested in one of these Ponzi schemes through your mutual fund, pension or retirement funds, yet not even know it.\r\n\r\nMost of the all-time 10 biggest Ponzi schemes collapsed during the 2008 financial crisis, but the worst is yet to come in 2016. Experienced investors and industry professionals alike will be caught in the carnage. Today's volatile financial markets are exactly the right conditions for a Ponzi scheme collapse, and unwitting investors will be left holding the bag. But there is a way to avoid disaster - if you know what to look for.\r\n\r\nLearn how to spot Ponzi scheme red flags and keep your money safe. Many innocent victims suffered financial ruin by not knowing the warning signs until it was too late. Don't be a victim.\r\n\r\nYou'll learn the tricks Bernard Madoff, Scott Rothstein, and others used to defraud investors for years, and the mistakes that ultimately exposed them","torrent":{"xt":"urn:btih:6bc4540a8835c913e4cc8105ffc3110d6106482f","amp;dn":"Anatomy+of+a+Ponzi%3A+Scams+Past+and+Present","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bc4540a8835c913e4cc8105ffc3110d6106482f","infoHashBuffer":{"type":"Buffer","data":[107,196,84,10,136,53,201,19,228,204,129,5,255,195,17,13,97,6,72,47]},"announce":[],"urlList":[]}}