{"title":"Krakatoa: The Day the World Exploded, August 27, 1883","uid":15885420,"size":3269746,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6bd1d0cf2198678aaf286cd567095e6efedc3908&amp;dn=Krakatoa%3A+The+Day+the+World+Exploded%2C+August+27%2C+1883&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":2,"uploader":"marty14","files":1,"time":1474646019,"description":"Krakatoa: The Day the World Exploded, August 27, 1883 - Simon Winchester [epub]\r\n\r\nThe legendary annihilation in 1883 of the volcano-island of Krakatoa - the name has since become a byword for a cataclysmic disaster - was followed by an immense tsunami that killed nearly 40,000 people.\r\n\r\nBeyond the purely physical horrors of an event that has only very recently been properly understood, the eruption changed the world in more ways than could possibly be imagined. Dust swirled round the planet for years, causing temperatures to plummet and sunsets to turn vivid with lurid and unsettling displays of light. The effects of the immense waves were felt as far away as France. Barometers in Bogota and Washington, D.C., went haywire. Bodies washed up in Zanzibar.\r\n\r\nThe sound of the island's destruction was heard in Australia and India and on islands thousands of miles away. Most significant of all - in view of today's new political climate - the eruption helped to trigger a wave of murderous anti-Western militancy by fundamentalist Muslims in Java: one of the first outbreaks of Islamic killings anywhere.\r\n\r\nSimon Winchester's long experience in world wandering, as well as his knowledge of history and geology, gives us an entirely new perspective on this fascinating and iconic event as he brings it tellingly back to life","torrent":{"xt":"urn:btih:6bd1d0cf2198678aaf286cd567095e6efedc3908","amp;dn":"Krakatoa%3A+The+Day+the+World+Exploded%2C+August+27%2C+1883","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bd1d0cf2198678aaf286cd567095e6efedc3908","infoHashBuffer":{"type":"Buffer","data":[107,209,208,207,33,152,103,138,175,40,108,213,103,9,94,110,254,220,57,8]},"announce":[],"urlList":[]}}