{"title":"Gregory Isaacs - Night Nurse 1982 - (Bonus Tracks 2002) - 320Kbp","uid":9426316,"size":135257633,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6bfda1bcdeb3e6ad80e9fe321a8d7499c6dbe7f7&amp;dn=Gregory+Isaacs+-+Night+Nurse+1982+-+%28Bonus+Tracks+2002%29+-+320Kbp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":2,"uploader":"Drebben","files":14,"time":1388704347,"description":"Gregory Isaacs' best studio album, Night Nurse is a short but sweet masterpiece. \n\n\nOne of Isaacs' most popular and enjoyable releases, 1982's Night Nurse sports the kind of slicked-up roots sound that emerged in the early days of dancehall-era reggae. In addition to effortlessly delivering the same smooth, &quot;lonely lover&quot; vocals that graced his many successful sides from the '70s, Isaacs, along with bassist &quot;Flabba&quot; Holt, also produced the tracks here.\n\n\nShowing his secular, dancehall-minded hand, Isaacs works magic on the classic lovers rock titles &quot;Night Nurse,&quot; &quot;Objection Overruled,&quot; and &quot;Cool Down the Pace.&quot; The singer is in his best and most vulnerable lovers mode, though, on outsider themes like &quot;Stranger in Town&quot; and &quot;Sad to Know (You're Leaving).&quot; And as was his way - and many other of his contemporaries for that matter (Dennis Brown, Frankie Paul, etc.) - Isaacs mixes his concerns with the flesh with those of a more spiritual nature, coming up here with two of his finest Rasta-cultural themes in &quot;Material Man&quot; and &quot;Hot Stepper.&quot;\n\n\nBut a gorgeous voice on its own does not a reggae album make, and the instrumentation on Night Nurse is up to par with Gregory Isaacs himself. The backing, provided by the Roots Radics of Barrington Levy and Eek-A-Mouse fame and Wally Badarou on the Prophet synthesizer, does its job absolutely brilliantly. The backing music may seem different to a roots reggae fan, as the traditional horns are completely absent from this album, being replaced by laid back synth melodies and the occasional guitar lick. This provides a chilled and calm atmosphere.\n\n\nAn absolutely amazing album, Night Nurse stands out as Gregory Isaacs' most highly rated and best known effort.\n\n\n\n\nGREGORY ISAACS\n\nNight Nurse     1982\n\n\n- CD\n- 2002\n- Bonus Tracks\n- 320Kbps\n\n\n\nGregory Isaacs, Vocals\n\nwith The Roots Radics:\n\nErrol &quot;Flabba&quot; Holt, Bass\nLincoln &quot;Style&quot; Scott, Drums\nDwight &quot;Brother Dee&quot; Pinkney, Lead Guitar\nEric &quot;Bingy Bunny&quot; Lamont, Rhythm Guitar\nWycliffe &quot;Steelie&quot; Johnson, Keyboards\n\nand\nWally Badarou, Synthesizer\n\n","torrent":{"xt":"urn:btih:6bfda1bcdeb3e6ad80e9fe321a8d7499c6dbe7f7","amp;dn":"Gregory+Isaacs+-+Night+Nurse+1982+-+%28Bonus+Tracks+2002%29+-+320Kbp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bfda1bcdeb3e6ad80e9fe321a8d7499c6dbe7f7","infoHashBuffer":{"type":"Buffer","data":[107,253,161,188,222,179,230,173,128,233,254,50,26,141,116,153,198,219,231,247]},"announce":[],"urlList":[]}}