{"title":"Santana - Santana IV 2016 192ak","uid":14259673,"size":110760399,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6c9f088251be3f10bed7272a3daf9b1cdea29642&amp;dn=Santana+-+Santana+IV+2016+192ak&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"analogkid6103","files":16,"time":1460238748,"description":"\nSantana - Santana IV 2016 192ak\r\n\r\nSantana is an American Latin rock band formed in San Francisco, California in 1967 by Mexican guitarist Carlos Santana. The band first came to widespread public attention when their performance of &quot;Soul Sacrifice&quot; at Woodstock in 1969 provided a contrast to other acts on the bill. This exposure helped propel their first album, also named Santana, into a hit, followed in the next two years by the successful Abraxas and Santana III.\r\n\r\nIn the years that followed lineup changes were common. Carlos Santana's increasing involvement with guru Sri Chinmoy took the band into more esoteric music, though never quite losing its initial Latin influence.\r\nThe origins for the reunion go back several years, when Schon suggested that he and Carlos Santana record together. Santana liked the idea but went one better, proposing that they recruit Rolie, Shrieve and Carabello for what would be called &quot;Santana IV&quot;. After initial writing sessions and rehearsals took place in 2013, the group recorded throughout 2014 and 2015, amassing 16 new tracks that combined all their signature elements – Afro-Latin rhythms, soaring vocals, electrifying blues-psychedelic guitar solos, and irrepressible jubilant percussion work.\r\n\r\nAbout the &quot;Santana IV&quot; team, Santana stated: &quot;It was magical, we didn't have to try to force the vibe – it was immense. From there, we then needed to come up with a balance of songs and jams that people would immediately identify as Santana.&quot;\r\n\r\nSantana IV features 16 all-new tracks written and produced by the band. Joining the core &quot;Santana IV&quot; band in the studio are current Santana members Karl Perazzo (percussion) and Benny Rietveld (bass), with vocalist Ronald Isley guesting on two cuts.\r\n\r\nThe first single from Santana IV, entitled &quot;Anywhere You Want To Go&quot;, was released on 5 February 2016.\r\n    \r\n    \r\nALBUM : Santana IV\r\n   \r\nYEAR : 2016\r\n    \r\nCOUNTRY: USA\r\n    \r\nSTYLE: Rock, Blues\r\n    \r\nDURATION:\t01:15:36\r\n    \r\nFORMAT: MP3\r\n    \r\nQUALITY: 192 kbps\r\n\r\n    \r\nSize: 105 MB (Files: 16)\r\n    \r\n\r\n\r\nDescription\r\n\r\n01. Yambu\r\n02. Shake It\r\n03. Anywhere you Want To Go\r\n04. Fillmore East\r\n05. Love Makes The World Go Round feat. Ronald Isley\r\n06. Freedom In Your Mind feat. Ronald Isley\r\n07. Choo Choo\r\n08. All Aboard\r\n09. Suen_os\r\n10. Caminando\r\n11. Blues Magic\r\n12. Echizo\r\n13. Leave Me Alone\r\n14. You And I\r\n15. Come As You Are\r\n16. Forgiveness","torrent":{"xt":"urn:btih:6c9f088251be3f10bed7272a3daf9b1cdea29642","amp;dn":"Santana+-+Santana+IV+2016+192ak","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c9f088251be3f10bed7272a3daf9b1cdea29642","infoHashBuffer":{"type":"Buffer","data":[108,159,8,130,81,190,63,16,190,215,39,42,61,175,155,28,222,162,150,66]},"announce":[],"urlList":[]}}