{"title":"Irreversible (Irréversible) (2002) [576p] x264 - Jalucian","uid":8643005,"size":1643653904,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6dd1d036ad24f7ee46d574c386bd8e14ad77df7a&amp;dn=Irreversible+%28Irr%26eacute%3Bversible%29+%282002%29+%5B576p%5D+x264+-+Jalucian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":2,"uploader":"jalucian","files":-1,"time":1372916310,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0290673&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0290673&lt;/a&gt;\n\n\nIMDB RATING: 7.3\n\n\nPlot:\n\nEvents over the course of one traumatic night in Paris unfold in reverse-chronological order as the beautiful Alex is brutally raped and beaten by a stranger in the underpass. \n\n\n\nCONTAINER....................: MP4\nCODEC........................: X264\nGENRE........................: Drama\nFILE SIZE....................: 1.53 GB\nRESOLUTION/ASPECT RATIO......: 576p @ 2.25:1 (696x442)\nBITRATE MODE.................: Variable\nAVG. VIDEO BITRATE...........: 2171kbps\nAVG. AUDIO FORMAT/BITRATE....: AAC/160kbps\nCHANNELS.....................: 2, Dolby Pro Logic II\nSAMPLING RATE................: 48.0 KHz\nFRAME RATE...................: 25.0 fps\nLANGUAGE.....................: French\nSUBTITLES....................: English (soft-coded)\nRUNTIME......................: 1:33:38\n\n\nNotes:\n\nThe first thing that should probably be mentioned about this encode is the odd resolution. The reason the dimensions are so strange is because not only was this filmed in a very unusual aspect ratio, but unlike most widescreens which have visible black areas on the top and bottom, this was actually released with some black areas on the sides, as well. The encoding software trims the black bars away, and what you're left with is the dimensions of the film itself. Why the creators chose to do this is unknown, but the source is indeed 576p. I searched for almost six months looking for 720p or 1080p source to encode from, to no avail, and since it's been one of the most common requests I've received, I decided to go ahead and use the 576p source I had. This is not a re-encode - it's from physical disc, and I've increased the bit rate to the point where it can be full-screened and still retain picture quality (provided your screen size isn't gargantuan.) This was a fairly tricky encode as the source was not only extremely grainy, but there was also quite a bit of camera movement. I tweaked several x264 settings to compensate for this as much as possible, including using a transformative exhaustive motion estimation method and well as slightly increasing the psychovisual trellis setting and disabling DCT-decimate. In addition, this is the highest video bit rate encode of Irreversible that I've seen on any site, so I feel pretty confident in saying this is now the highest quality encode of this movie available on any torrent site. It still has an extremely noisy and grainy appearance, but the object was to reproduce the source as accurately as possible, not to &quot;doctor&quot; the source. My only regret was not being able to get my hands on 720p or 1080p source, but if that ever changes, I'll re-release this in higher resolution. English subtitles have been soft-coded from the retail subs on the physical disc. \n\nBitrates listed are variable, using CRF encoding for maximum quality, which means the numbers you see are average bitrates.\n\nPlease seed as long as possible, preferably until reaching a share ratio of at least 3:1.","torrent":{"xt":"urn:btih:6dd1d036ad24f7ee46d574c386bd8e14ad77df7a","amp;dn":"Irreversible+%28Irr%26eacute%3Bversible%29+%282002%29+%5B576p%5D+x264+-+Jalucian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dd1d036ad24f7ee46d574c386bd8e14ad77df7a","infoHashBuffer":{"type":"Buffer","data":[109,209,208,54,173,36,247,238,70,213,116,195,134,189,142,20,173,119,223,122]},"announce":[],"urlList":[]}}