{"title":"GOOGLE SKETCH UP VIDEO TUTORIAL COMPLETE","uid":5294753,"size":170555166,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6e070bf8afccbfe355d717eff5dbe25e2fda2ff0&amp;dn=GOOGLE+SKETCH+UP+VIDEO+TUTORIAL+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"2010jbs","files":18,"time":1264017810,"description":"THESE ARE SERIES OF GOOGLE SKETCH UP VIDEO TUTORIALS, FOR THOSE WHO ARE INTERESTED IN LEARNING 3D MODELLING USING GOOGLE SKETCH UP. THE TUTORIALS COVERED ALL THE BASIC AND ADVANCE SKILLS AND KNOW HOW OF GOOGLE SKETCH UP.\n\nMANY THANKS TO THE ORIGINAL CREATOR OF THIS VIDEOS, I ONLY DOWNLOADED THEM FOR PERSONAL USE AND I FOUND THEM VERY EDUCATIVE AND USEFUL. SO I FEEL I SHOULD SHARE IT HERE FOR ALL WHO ALSO IS IN NEED OF THIS VIDEO.\n\nTHE VIDEOS ARE IN FLASH FORMAT, YOU CAN CONVERT THEM TO ANY VIDEO OF YOUR CHOICE USING ANY MEDIA CONVERT SOFTWARE YOU HAVE. I WOULD PREFER MINE IN FLASH BECOS I WOULD BE VIEWING IN ONLY ON MY PC.\n\nFOR THOSE WHO DON'T KNOW WHAT GOOGLE SKETCH UP IS ALL ABOUT... \n\nIt is a sketch-based 3D-modeling program which offers a suite of powerful drawing tools that add an intuitiveness many design programs fail to achieve. On first impression, Google SketchUp may look like it sacrificed function for simplicity, but that's not the case. Despite the extremely user-friendly interface, SketchUp offers a suite of powerful 3D-drawing tools that let you experiment and play with new designs.\n\nAND YOU CAN DOWNLOAD A FREE VERSION OF THE SOFTWARE HERE http://sketchup.google.com/download/index2.html\t","torrent":{"xt":"urn:btih:6e070bf8afccbfe355d717eff5dbe25e2fda2ff0","amp;dn":"GOOGLE+SKETCH+UP+VIDEO+TUTORIAL+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e070bf8afccbfe355d717eff5dbe25e2fda2ff0","infoHashBuffer":{"type":"Buffer","data":[110,7,11,248,175,204,191,227,85,215,23,239,245,219,226,94,47,218,47,240]},"announce":[],"urlList":[]}}