{"title":"Dalai Lama - The Wisdom of Forgiveness","uid":11726176,"size":676464193,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6e5aada6243c7aff23658b1bd827e4d7e7fff4d3&amp;dn=Dalai+Lama+-+The+Wisdom+of+Forgiveness&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":5,"uploader":"Big-Papi","files":108,"time":1425061327,"description":"\n\n[quote]By abunaiyo\n\nImagine for a moment that you have a good friend who just happens to be in the Dalai Lama's inner circle of friends. Now imagine that you have the opportunity to spend time with this friend, hearing about his travels and conversations with His Holiness, relishing every minute detail.\n\nThis is the feel that I got while reading Victor Chan's book. He presents a very personal account of his time spent with the Dalai Lama, unlike other books that tend to be more academic or intellectual. As a result, the reader is able to see the Dalai Lama in a different light. It's like viewing Mount Fuji from an angle different from the picture postcard; still the same beautiful mountain but with new angles and lines.\n\nSome of Chan's descriptions border on the unbelievable. Did His Holiness really say that about the gun? And did he really say that about wanting to exact revenge on the Chinese soldier (if a certain situation arose)? And did His Holiness really say that to Oprah? These passages give &quot;The Wisdom of Forgiveness&quot; its uniqueness and color.\n\nSome readers may criticize Chan's personal descriptions, especially his focus on his Chinese ancestry and how ironic that he, of all people, has become a close friend of His Holiness. I was not bothered by it; it seemed consistent with and relevant to his very personal account.\n\nFor those seeking general knowledge of the Dalai Lama, read &quot;Freedom in Exile&quot;. To learn his world view, check out &quot;Ethics For the New Millenium&quot;. But for a personal, sometimes surprising, and enjoyable account of the Dalai Lama, consider reading this book.\n[/quote]\n\n\n\n\n---------------------------------------------------------------------\n Dalai Lama - The Wisdom of Forgiveness\n---------------------------------------------------------------------\n\nArtist...............: Dalai Lama\nAlbum................: The Wisdom of Forgiveness\nGenre................: Speech\nSource...............: CD\nYear.................: 2004\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: CBR 256, (avg. bitrate: 256kbps)\nChannels.............: Joint Stereo / 44100 hz\nPlaying Time.........: 05:51.00\n---------------------------------------------------------------------\n[b]This volume has been ripped at MP3 V0 which is nearly indistinguishable \nfrom \nFLAC using spectral analysis. It provides higher dynamic range than 320kbps \nat a fraction of the file size. If you love FLAC then you'll know MP3 V0 is your \nother buddy for going mobile when space and quality is a concern[/b]\n\nThe AccurateRip data is embedded in the MP3 tags so you can look at any \ntrack to validate the accuracy of the rip.\n\nIf this is an audio book Big Papi recommends you set the &quot;information&quot; to &quot;DO \nNOT SHUFFLE&quot; and &quot;REMEMBER POSITION&quot; for a better listening experience.\n\n- Big Papi","torrent":{"xt":"urn:btih:6e5aada6243c7aff23658b1bd827e4d7e7fff4d3","amp;dn":"Dalai+Lama+-+The+Wisdom+of+Forgiveness","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e5aada6243c7aff23658b1bd827e4d7e7fff4d3","infoHashBuffer":{"type":"Buffer","data":[110,90,173,166,36,60,122,255,35,101,139,27,216,39,228,215,231,255,244,211]},"announce":[],"urlList":[]}}