{"title":"Crime and Punishment by Fyodor Mikhailovich Dostoyevsky [republi","uid":7713068,"size":5735712,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e6c6ebbb7b286cc72e12c9c35721f0f5a5cf09b&amp;dn=Crime+and+Punishment+by+Fyodor+Mikhailovich+Dostoyevsky+%5Brepubli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":5,"uploader":"republicV","files":5,"time":1349857163,"description":"Language: English\nPublished in: 1866\nWord count: 208,756 words\n\nTo call Fyodor Dostoevsky a genius may indeed be an understatement. Decade after decade, his literary brilliance continues to capture the hearts and minds of millions. Because of his legacy and intense, storied commentaries on religion, philosophy, and psychology, Dostoevsky may have been one of the most important and influential writers that ever lived.\nAfter all, it was Einstein that said: &quot;Dostoevsky gives me more than any scientist, more than Gauss.&quot;\nThe whole novel &quot;Crime and Punishment&quot; is actually based on a tale of a murder. At the beginning of the novel we are introduced not only to the murderer and his murder, but also to the inner struggle of the complex protagonist. Although we know all the time who the murderer is, the story never stops to surprise us with its psychological excitement and thrill. At first, Raskolnikov was divided within himself into the simplicity of the horrible thought and the abhorrence to the possibility of having conceived that idea at all. He carefully develops the plan although a part of him does not believe in its execution. Rakolnikov did not only want to rob and kill the aged woman. His motives were based on the idea of eradicating evil.","torrent":{"xt":"urn:btih:6e6c6ebbb7b286cc72e12c9c35721f0f5a5cf09b","amp;dn":"Crime+and+Punishment+by+Fyodor+Mikhailovich+Dostoyevsky+%5Brepubli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e6c6ebbb7b286cc72e12c9c35721f0f5a5cf09b","infoHashBuffer":{"type":"Buffer","data":[110,108,110,187,183,178,134,204,114,225,44,156,53,114,31,15,90,92,240,155]},"announce":[],"urlList":[]}}