{"title":"The Darkness - Permission To Land (2003) 320 vtwin88cube","uid":5901409,"size":92483190,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e7c2434b626f8e10781c9945c5a91d8d4ea6d44&amp;dn=The+Darkness+-+Permission+To+Land+%282003%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1287688170,"description":"The Darkness - Permission To Land (2003)\nMp3\nCBR 320\nFront 500x500 Cover\n\n\nBiography by Eduardo Rivadavia allmusic.com\n\nEngland's the Darkness centered around irrepressible frontman Justin Hawkins (vocals/guitars/keyboards), who, along with his guitar-playing baby brother Dan, bassist Frankie Poullain, and drummer Ed Graham, single-handedly resurrected the rather unfashionable sounds and attitudes of late-'70s hard rock for an unsuspecting generation. Following the demise of an earlier, conspicuously synth pop-based outfit named Empire, the Hawkins brothers sowed the seeds of what would become the Darkness at an impromptu karaoke session on New Year's Eve 1999. Justin's rapturous rendition of Queen's &quot;Bohemian Rhapsody&quot; showed them the way, and the suitably dramatic name of the Darkness was chosen shortly after the arrival of Poullain and Graham.\n\nWith outrageous stage antics that included gaudy leotards stolen from Steven Tyler's wardrobe, leaps and splits borrowed from David Lee Roth, and an ear-piercing falsetto copped from Freddie Mercury himself, the multi-talented elder Hawkins led the quartet as the group spent the next two years slogging it out in London's pub circuit. Though they were immediately singled out as a joke by the notoriously vicious British press, the Darkness' high-energy sets, remarkably catchy material, and unapologetic worship of old-school rock &amp; roll bombast gradually earned them a fanatical following based on simple word of mouth. \n\n\nReview by Heather Phares allmusic.com\n\nUpon its U.K. release in summer 2003, Permission to Land, the debut album from spandex-clad retro metalheads the Darkness, was a surprise success, hitting the British charts at number two (behind only BeyoncÃƒÂ©'s Dangerously in Love). After hearing Permission to Land, it's easier to understand why the British public went crazy for it, and for the Darkness. The album is more or less straightforward pop/rock with some '80s metal window-dressing, and the Darkness themselves live up to traditional notions of what a rock band should be: louche, decadent, and harboring a don't-bore-us-get-to-the-chorus mentality.\n\n\nTrack Listing:\n\n1. Black Shuck \t\n2. Get Your Hands Off My Woman \n3. Growing On Me \t\n4. I Believe In A Thing Called Love \t\n5. Love Is Only A Feeling \t\n6. Givin' Up \t\n7. Stuck In A Rut \t\n8. Friday Night \t\n9. Love On The Rocks With No Ice \t\n10.Holding My Own \n\n\nEnjoy!\t","torrent":{"xt":"urn:btih:6e7c2434b626f8e10781c9945c5a91d8d4ea6d44","amp;dn":"The+Darkness+-+Permission+To+Land+%282003%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e7c2434b626f8e10781c9945c5a91d8d4ea6d44","infoHashBuffer":{"type":"Buffer","data":[110,124,36,52,182,38,248,225,7,129,201,148,92,90,145,216,212,234,109,68]},"announce":[],"urlList":[]}}