{"title":"Might and Magic 8 - Day of the Destroyer GoG","uid":8147608,"size":701079720,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6edae3653dc7496957662db0eb293cf192bc8f79&amp;dn=Might+and+Magic+8+-+Day+of+the+Destroyer+GoG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1360962795,"description":"What's cool about it:\n\n    * Another great installment of the famous Might and Magic series\n    * A vast, magical world full of adventurers, mythical creatures and powerful artifacts\n    * An epic soundtrack composed by the acclaimed artist Rob King\n\nOverview:\n\nThe destroyer is walking the land once again. The legendary Planeswalker Escaton has been seen in Jadame and the very elements themselves have felt his presence. In the four corners of the world, gates to the planes of Fire, Air, Earth and Water have opened and denizens of those realms are sweeping across the lands, devastating all in their path. Lead a band of rugged adventurers on a mission of utmost peril to save the kingdoms from ruin, or watch as the lands are devastated forever.\n\nMinimum system requirements: Windows XP or Windows Vista, 1.8 GHz Processor, 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended), 4GB HDD, Mouse, Keyboard.\n\nMight and Magic VIII: Day of the Destroyer is a computer role-playing game developed for Microsoft Windows by New World Computing and released in 2000 by the 3DO Company.The character development system, spells, sound effects, many of the sprites, and even some gameplay tasks - including an Arcomage quest - were for the most part recycled from earlier games, with little or non-notable tweaking.\nMight and Magic VIII takes place on the fictional world of Enroth, upon the continent of Jadame, and acts as a sequel to Might and Magic VII and Heroes of Might and Magic III: Armageddon's Blade.[4] Over a thousand years ago, the interstellar war between the Ancients and the Kreegan drove both races off of one of the Ancients' many colony worlds.[5] During the millennium since, the original colonists and natives of that world built their own society and culture from the ruin, the stories of the Ancients and the Kreegan having long since passed into legend. Ten years ago, as depicted in Might and Magic VI: The Mandate of Heaven, the Kreegan invaded the world. The heroes of Might and Magic VI destroyed the Kreegan Queen, and the last of the Kreegan were wiped out over the course of Heroes of Might and Magic III: The Restoration of Erathia, Might and Magic VII: For Blood and Honor and Heroes III: Armageddon's Blade.[6] The Ancients, however, anticipating disaster should the Kreegan manage to gain a foothold on the world, had already enacted a scorched earth plan: rather than let the world fall into the hands of their ancient enemies, they would see it destroyed outright.[7]\n\nA servant of the Ancients, the planeswalker Escaton, arrives in the village of Ravenshore on the continent of Jadame. Approaching the center of town, he summons a giant crystal which unleashes an elemental storm across the continent. There is widespread destruction and the boundaries to the four Elemental Planes are breached. Now elementals and monsters from beyond the boundaries are threatening to invade, fulfilling Escaton's plan to draw the powers of the elements toward the crystal and destroy the world, and the player must assemble a party of heroes to prevent this.\n\nThe game features several recurring characters from previous titles in the series, including the Elemental Lords from Might and Magic II, the Ironfists from Heroes of Might and Magic, and the necromancers Sandro and Thant from Heroes of Might and Magic III.\n\nInstall and GO!\n","torrent":{"xt":"urn:btih:6edae3653dc7496957662db0eb293cf192bc8f79","amp;dn":"Might+and+Magic+8+-+Day+of+the+Destroyer+GoG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6edae3653dc7496957662db0eb293cf192bc8f79","infoHashBuffer":{"type":"Buffer","data":[110,218,227,101,61,199,73,105,87,102,45,176,235,41,60,241,146,188,143,121]},"announce":[],"urlList":[]}}