{"title":"Bob Seger - Discography (1969-2011) [FLAC]","uid":8980493,"size":4245555419,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6ef6013078638d6456fccbf7773f88f5b1851781&amp;dn=Bob+Seger+-+Discography+%281969-2011%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":4,"uploader":"politux","files":-1,"time":1380553869,"description":"\n  Bob Seger - Discography (1969-2011) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Album Rock, Hard Rock, Heartland Rock, Singer/Songwriter\n  Source: CD, vinyl\n  Codec: FLAC\n  Bit Rates: ~ 900 kbps, ~ 2,900 kbps\n  Bit Depth: 16, 24\n  Sampling Rate: 44,100 Hz, 96,000 Hz\n\n  CD Rips 16/44\n\n  1969 Ramblin Gamblin Man\n  1976 Night Moves (Remastered 1999)\n  1976 Live Bullet (Remastered 2011)\n  1981 Nine Tonight (Remastered 2011)\n  2011 Ultimate Hits Rock and Roll Never Forgets\n\n  Vinyl Rips 24/96\n\n  1980 Night Moves (MFSL 1-034, Japan)\n  1983 Against the Wind (MFSL 1-127, US)\n  \n\n  Originally a hard-driving rocker in the vein of fellow Michigan garage rockers the Rationals and Mitch Ryder, Bob Seger developed into one of the most popular heartland rockers over the course of the '70s. Combining the driving charge of Ryder's Detroit Wheels with Stonesy garage rock and devotion to hard-edged soul and R&amp;B, he crafted a distinctively American sound. While he never attained the critical respect of his contemporary Bruce Springsteen, Seger did develop a dedicated following through constant touring with his Silver Bullet Band. Following several years of missed chances and lost opportunities, Seger finally achieved a national audience in 1976 with the back-to-back release of Live Bullet and Night Moves. After the platinum success of those albums, Seger retained his popularity for the next two decades, releasing seven Top Ten, platinum-selling albums in a row.\n\n  Seger began playing music in 1961 as the leader of the Detroit-based trio the Decibels; his future manager, Eddie &quot;Punch&quot; Andrews was also a member of the band. Moving to Ann Arbor, he played with the Town Criers before he became the keyboardist and vocalist for Doug Brown &amp; the Omens. Billing themselves as the Beach Bums, the band released &quot;The Ballad of the Yellow Beret,&quot; a parody of the Sgt. Barry Sadler song &quot;The Ballad of the Green Beret.&quot; The single was withdrawn shortly after its release after Sadler threatened a lawsuit. In 1966, Seger released his first solo single, &quot;East Side Story,&quot; which became a regional hit. Several other local hit singles followed on Cameo Records, including &quot;Persecution Smith&quot; and &quot;Heavy Music,&quot; before his label folded. In 1968, he formed the Bob Seger System and signed with Capitol Records, releasing his debut album, Ramblin' Gamblin' Man, in the spring of that year. The title track became a national hit, climbing to number 17, but the group's follow-up, Noah, stiffed and Seger decided to quit the music business at the end of 1969 to attend college.\n\n  By the end of the summer, Seger had returned to rock &amp; roll with a new backing band, releasing Mongrel at the end of the year. For 1971's Brand New Morning, he disbanded his group and recorded a singer/songwriter effort. Following its release, he began performing with the duo Dave Teegarden and Skip &quot;Van Winkle&quot; Knape, and the duo provided support on 1972's Smokin' O.P.'s, which was the first release on Palladium Records, a label he formed with Andrews. The album failed to sell, as did Back in '72 (1973) and Seven (1974), and he moved back to Capitol Records for 1975's Beautiful Loser. For the recording of Beautiful Loser, Seger formed the Silver Bullet Band, which consisted of guitarist Drew Abbott, bassist Chris Campbell, keyboardist Robyn Robbins, saxophonist Alto Reed, and drummer Charlie Allen Martin. Seger supported Beautiful Loser with an extensive tour with the Silver Bullet Band, and while it didn't make the album a hit, it provided a widespread grassroots following across the country. The touring paid off in 1976, when Live Bullet, a double album recorded in Detroit, became a hit, spending over three years on the U.S. charts and going gold; the album would eventually go quadruple platinum.\n\n  The groundswell behind Live Bullet sent Seger's next studio album, Night Moves (1976), into the Top Ten early in 1977. Night Moves became a blockbuster, generating the hit singles &quot;Night Moves,&quot; &quot;Mainstreet,&quot; and &quot;Rock &amp; Roll Never Forgets.&quot; Stranger in Town, released in the summer 1978, was just as successful, featuring the hits &quot;Still the Same,&quot; &quot;Hollywood Nights,&quot; &quot;We've Got Tonite,&quot; and &quot;Old Time Rock &amp; Roll.&quot; Stranger in Town confirming his status as one America's most popular rockers. Seger's next album, 1980's Against the Wind, became his first number one album and all of its big hits -- &quot;Fire Lake,&quot; &quot;Against the Wind,&quot; &quot;You'll Accomp'ny Me&quot; -- were ballads. The live album Nine Tonight continued his multi-platinum success in 1981, selling three million copies and peaking at number three.\n\n  Seger returned with The Distance in 1982. The Distance was the first album since Seven to be recorded with the addition of session musicians, which caused guitarist Abbott to quit the band in frustration. Over the course of the next decade, the membership of the Silver Bullet Band shifted constantly. While The Distance featured &quot;Shame on the Moon,&quot; his biggest hit single to date, its sales plateaued at a million copies, suggesting that his popularity was beginning to level off. Seger also began to drastically reduce his recording and touring schedules -- he only released one other album, 1986's Like a Rock, during the '80s. Like a Rock and its supporting tour were both successes, paving the way for &quot;Shakedown,&quot; a song taken from the soundtrack to Beverly Hills Cop II, to become Seger's lone number one hit in 1987. Four years after its release, he returned with The Fire Inside. Although the album went platinum and reached the Top Ten, it only appealed to Seger's devoted following, as did 1995's It's a Mystery, which became his first album since Live Bullet to fail to go platinum, leveling off at gold status. In 2006, after an 11-year hiatus, Seger released Face the Promise.","torrent":{"xt":"urn:btih:6ef6013078638d6456fccbf7773f88f5b1851781","amp;dn":"Bob+Seger+-+Discography+%281969-2011%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ef6013078638d6456fccbf7773f88f5b1851781","infoHashBuffer":{"type":"Buffer","data":[110,246,1,48,120,99,141,100,86,252,203,247,119,63,136,245,177,133,23,129]},"announce":[],"urlList":[]}}