{"title":"How to Think like Leonardo da Vinci: Seven Steps to Genius Every","uid":6184693,"size":71495465,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6f214dfa935618651aa7240e3500673e531d712e&amp;dn=How+to+Think+like+Leonardo+da+Vinci%3A+Seven+Steps+to+Genius+Every&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"MANTESH","files":6,"time":1298079213,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/61lK4Ph1eWL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/61lK4Ph1eWL._SS500_.jpg&lt;/a&gt;\n\n\n\n\n\nHow to Think Like Leonardo Da Vinci: Seven Steps to Genius Every Day\n\n\n\nRandom House Audio \nMichael J. Gelb\nEnglish\n2003-12-30 \nISBN: 0739310445 \n2 Hours 28 Minutes 55 Second\nMP3 \n64 Kbps\n68.1 MB \n\n\nYou don't have to be a genius to think like one. Each of us uses only a fraction of our brain power, explains Michael J. Gelb, who has helped thousands of men and women learn to put more of their minds to work--and play--than they ever thought possible.\nDrawing on Leonardo Da Vinci's notebooks, inventions, and legendary works of art, Gelb introduces the Seven Da Vincian Principles--seven essential elements of genius, named in Da Vinci's native Italian, that any of us can develop on our own. From the notebooks' celebration of an insatiably curious approach to life (curiositÃƒÂ¡) to the willingness to embrace uncertainty and paradox (sfumato) embodied in Mona Lisa's smile, these principles will seem at once intuitively familiar and surprisingly powerful. Offering an abundance of interactive, entertaining exercises to help you master each principle, Gelb also helps you see how you can use them at work, home, and everywhere else.\nFollowing Leonardo's lead, you'll learn powerful new strategies for tackling challenges both timely and timeless, including problem solving; creative thinking; self-expression; enjoying the world around you; goal setting and life balancing; and harmonizing body and mind.\n&quot;I wish to work miracles,&quot; wrote the young Leonardo. As you apply these principles to liberate your own unique intelligence, you may feel his miraculous tough enriching your life across the centuries, as you let his ageless example guide you toward becoming more of who you truly are...\n\n\n","torrent":{"xt":"urn:btih:6f214dfa935618651aa7240e3500673e531d712e","amp;dn":"How+to+Think+like+Leonardo+da+Vinci%3A+Seven+Steps+to+Genius+Every","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f214dfa935618651aa7240e3500673e531d712e","infoHashBuffer":{"type":"Buffer","data":[111,33,77,250,147,86,24,101,26,167,36,14,53,0,103,62,83,29,113,46]},"announce":[],"urlList":[]}}