{"title":"Thanksgiving Holiday at Heart of American Experience 2016 WWRG","uid":16041846,"size":5098260,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f48847aaa980106943b629453eb28c430d06565&amp;dn=Thanksgiving+Holiday+at+Heart+of+American+Experience+2016+WWRG&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"Lion.King","files":3,"time":1476517825,"description":"\nPublisher: Encounter Books (October 11, 2016)\r\nLanguage: English\r\nISBN-10: 1594038937\r\nISBN-13: 978-1594038938\r\n\r\n\r\nWe all know the story of Thanksgiving. Or do we? This uniquely American holiday has a rich and little known history beyond the famous feast of 1621.\r\n\r\nIn Thanksgiving, award-winning author Melanie Kirkpatrick journeys through four centuries of history, giving us a vivid portrait of our nation's best-loved holiday. Drawing on newspaper accounts, private correspondence, historical documents, and cookbooks, Thanksgiving brings to life the full history of the holiday and what it has meant to generations of Americans.\r\n\r\nMany famous figures walk these pages—Washington, who proclaimed our first Thanksgiving as a nation amid controversy about his Constitutional power to do so; Lincoln, who wanted to heal a divided nation sick of war when he called for all Americans—North and South—to mark a Thanksgiving Day; FDR, who set off a debate on state's rights when he changed the traditional date of Thanksgiving.\r\n\r\nOrdinary Americans also play key roles in the Thanksgiving story—the New England Indians who boycott Thanksgiving as a Day of Mourning; Sarah Josepha Hale, the nineteenth-century editor and feminist who successfully campaigned for Thanksgiving to be a national holiday; the 92nd Street Y in New York City, which founded Giving Tuesday, an online charity established in the long tradition of Thanksgiving generosity. Kirkpatrick also examines the history of Thanksgiving football and, of course, Thanksgiving dinner","torrent":{"xt":"urn:btih:6f48847aaa980106943b629453eb28c430d06565","amp;dn":"Thanksgiving+Holiday+at+Heart+of+American+Experience+2016+WWRG","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f48847aaa980106943b629453eb28c430d06565","infoHashBuffer":{"type":"Buffer","data":[111,72,132,122,170,152,1,6,148,59,98,148,83,235,40,196,48,208,101,101]},"announce":[],"urlList":[]}}