{"title":"Rihanna - Talk That Talk (Explicit) 2011","uid":6813781,"size":71315584,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6ff1bf9c2e11521eaf3c3b1fc7645281f7ca22c5&amp;dn=Rihanna+-+Talk+That+Talk+%28Explicit%29+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":6,"uploader":"GenghisKhan00","files":12,"time":1321123211,"description":"Talk That Talk[2] is the sixth studio album by Barbadian recording artist Rihanna, and is scheduled for release on November 18, 2011 through Def Jam Recordings. The lead single from the album, &quot;We Found Love&quot; featuring Calvin Harris, premiered on Capital FM radio on September 22, 2011, and was released on iTunes U.S. the same day.\n\nSingles\n\t\n&quot;We Found Love&quot;\nA 21-second sample of the song's chorus, which met with a mixed reaction from music critics. Priya Elan of NME praised Rihanna's vocals as &quot;extremely relaxed&quot; and &quot;luxurious&quot;,[19] whilst Amos Barshad of Grantland criticized the singer's vocals, calling them a &quot;complete afterthought&quot; and second to Harris's production.[20]\nProblems listening to this file? See media help.\n\n&quot;We Found Love&quot;, featuring Calvin Harris, was released as the lead single from the album.[21] It premiered in the United Kingdom on Capital FM radio on September 22, 2011, and was released the same day,[22] and was sent for US mainstream radio adds on October 11, 2011.[23] Critics praised Harris's production of the song, but criticized the lack of lyrical content, with many citing the lyrics as second best to the song's production and composition.[24][19] Rihanna filmed the video for the song on September 26, 2011, in a field in Bangor, County Down, Northern Ireland,[25][26] and premiered on Whosay.com on October 19, 2011.[27][28] &quot;We Found Love&quot; debuted at number 16 on the US Billboard Hot 100 chart, and has peaked at number one, giving Rihanna the record for a solo artist to have amassed twenty top-ten singles in the history of the Billboard Hot 100 chart in the shortest amount of time.[29][30] and tying her with Whitney Houston in third place amongst females with the most number one singles on the chart, behind Madonna and Mariah Carey.[31] The song also peaked at number one in Denmark, France, Ireland, Norway, Sweden and the United Kingdom,[32] and attained top-five positions in Australia, Finland and Italy.[33] &quot;You da One&quot; was confirmed by Rap-Up to be the second single from the album, being released on November 13, 2011. The singer appears smoking a cigarette on the single's black and white cover art.[1]\nTrack listing\nNo. \tTitle \tWriter(s) \tProducer(s) \tLength\n1. \t&quot;You Da One&quot;   \tLukasz Gottwald, Ester Dean, John Hill, Robyn Fenty \tDr. Luke, Ester Dean[34] \t3:20\n2. \t&quot;Where Have You Been&quot;   \tGottwald, Dean, Calvin Harris \tDr. Luke, Ester Dean[34] \t4:03\n3. \t&quot;We Found Love&quot; (featuring Calvin Harris) \tHarris \tCalvin Harris[34] \t3:35\n4. \t&quot;Talk That Talk&quot; (featuring Jay-Z) \tDean, Jay-Z, Sean Combs \tStarGate, Ester Dean[34] \t3:30\n5. \t&quot;Cockiness (Love It)&quot;   \tCandice Pillay, D. Abernathy, Shondrae Crawford, Fenty \tBangladesh[34] \t2:58\n6. \t&quot;Birthday Cake&quot;   \tTerius Nash, Marcos Palacios, Ernest Clark, Fenty \tDa Internz, The-Dream[34] \t1:18\n7. \t&quot;We All Want Love&quot;   \tDean, Ernest Wilson, Steve Wyreman, Kevin Randolph \tNo I.D., Ester Dean[34] \t3:57\n8. \t&quot;Drunk on Love&quot;   \tMikkel S. Eriksen, Tor Erik Hermansen, Dean, Traci Hale, Romy Croft, Oliver Sim, Jamie Smith, Baria Qureshi[35] \tStarGate, Ester Dean[34] \t3:32\n9. \t&quot;Roc Me Out&quot;   \tEriksen, Hermansen, Dean, Rob Swire, Gareth McGrillen \tStarGate, Rob Swire[1] \t3:29\n10. \t&quot;Watch n' Learn&quot;   \tPriscilla Renea, Hit-Boy, Alja Jackson, Fenty \tHit-Boy, Priscilla Renea[34] \t3:31\n11. \t&quot;Farewell&quot;   \tDean, Alexander Grant \tAlex da Kid, Ester Dean[34] \t4:16\nTotal length:\n\t37:29\n[hide]iTunes Store bonus track\nNo. \tTitle \tWriter(s) \tProducer(s) \tLength\n12. \t&quot;We Found Love&quot; (Calvin Harris Extended Mix) (featuring Calvin Harris) \tHarris \tCalvin Harris \t5:45\nTotal length:\n\t43:14\n[hide]Deluxe edition bonus tracks[1]\nNo. \tTitle \tWriter(s) \tProducer(s) \tLength\n12. \t&quot;Red Lipstick&quot;   \tNash, James Hetfield, Lars Ulrich, William Kennard, Saul Milton, Fenty \tChase &amp; Status, The-Dream, Rihanna[34] \t3:37\n13. \t&quot;Do Ya Thang&quot;   \tNash, Fenty \tThe-Dream, Rihanna[34] \t3:43\n14. \t&quot;Fool in Love&quot;   \tGottwald, Dean, Dr. Luke, Henry Walter \tDr. Luke, Ester Dean[34] \t5:15\nTotal length:\n\t55:49","torrent":{"xt":"urn:btih:6ff1bf9c2e11521eaf3c3b1fc7645281f7ca22c5","amp;dn":"Rihanna+-+Talk+That+Talk+%28Explicit%29+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ff1bf9c2e11521eaf3c3b1fc7645281f7ca22c5","infoHashBuffer":{"type":"Buffer","data":[111,241,191,156,46,17,82,30,175,60,59,31,199,100,82,129,247,202,34,197]},"announce":[],"urlList":[]}}