{"title":"Madonna - The Immaculate Collection 320cbr (Big Papi) 1990","uid":9380398,"size":177675842,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7009c98ad9b72f843728db69ef10000d75b4d3ee&amp;dn=Madonna+-+The+Immaculate+Collection+320cbr+%28Big+Papi%29+1990&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1387705134,"description":"Source: 1990 CD\n\nThese songs are timeless, and in some cases, infamous! How can you not love these songs? It's impossible. Anyone who listens to this album will be hooked! This album is the reason I am a Madonna fan today, as it was my introduction to her music. And all of these songs were hits! Check out the peak positions of the songs included on this CD on the Billboard Hot 100 Singles Chart:\n1. Holiday #16\n2. Lucky Star #4\n3. Borderline #10\n4. Like A Virgin #1\n5. Material Girl #2\n6. Crazy For You #1\n\n7. Into The Groove (did not chart because it was not released as a single, but was still a massive radio hit!)\n8. Live To Tell #1\n9. Papa Don't Preach #1\n10. Open Your Heart #1\n11. La Isla Bonita #4\n12. Like A Prayer #1\n13. Express Yourself #2\n14. Cherish #2\n15. Vogue #1\n16. Justify My Love #1\n17. Rescue Me #9\n\nAnd those were not even all of her hits up until that point! Those NOT included are: Angel #5, Dress You Up #5, True Blue #3, Who's That Girl #1, Causing A Commotion #2, Oh Father #20, Keep It Together #8, Hanky Panky #10. Madonna knows how to deliver good pop songs. These songs will bring back memories for you..\n\nBy Peter\nHere are just some of Madonna's early classic hits. When this compilation was assembled, Madonna already had too many hits to include them all on a single CD, hence the omission of Angel, Dress you up, Gambler, True blue and all the hits from the soundtrack, Who's that girl? Because of her continuous success in the years that followed the release of this compilation, a comprehensive Madonna hits collection would now require a triple CD. That is a measure of her brilliance, sustained over a very long period of time.\nThe set begins with three hits from her debut album, of which Holiday is the best but Lucky star and Borderline are also wonderful. Then come Like a virgin and Material girl, two of the singles released from her outstanding second album. Crazy for you, an excellent ballad, and Into the groove, a superb dance song, come next. Although the title track is omitted, four other major hits from the True blue album (Live to tell, Papa don't preach, Open your heart, La Isla Bonita) can be found here, each one of them a classic but very different from each other. Three major hits from Like a prayer include Express yourself and Cherish. Vogue (from I'm breathless) and two tracks not available on any previous album (Justify my love, Rescue me) complete the set.\n\nAnybody who does not understand why Madonna has such a huge fan base only has to listen to this compilation to find out why. Catchy pop tunes with interesting lyrics (for those that bother to listen to the words) are Madonna's trademark, yet she manages to avoid becoming formulaic. Madonna has continuously changed her style, so you don't hear the same sound over and over again.\n\nThere is no definitive Madonna compilation yet but we may have to wait a few years for that. Until that time, this is the best introduction to her music that is available.","torrent":{"xt":"urn:btih:7009c98ad9b72f843728db69ef10000d75b4d3ee","amp;dn":"Madonna+-+The+Immaculate+Collection+320cbr+%28Big+Papi%29+1990","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7009c98ad9b72f843728db69ef10000d75b4d3ee","infoHashBuffer":{"type":"Buffer","data":[112,9,201,138,217,183,47,132,55,40,219,105,239,16,0,13,117,180,211,238]},"announce":[],"urlList":[]}}