{"title":"Bob Dylan - Shadows in the Night [2015][24bit FLAC]","uid":11679441,"size":343119616,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:707ac568345e2545fb8909c4d224a45774038286&amp;dn=Bob+Dylan+-+Shadows+in+the+Night+%5B2015%5D%5B24bit+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":0,"uploader":"SmashAndGrab","files":11,"time":1423013837,"description":"Bob Dylan - Shadows in the Night [2015][24bit FLAC]\n\nReleased ................ 2015\nSource .................. WEB\nGenre ................... Pop/Rock\nCodec ................... FLAC\nBit Depth ............... 24 bits\nSampling Rate ........... 44.1 KHz\n\n01 - I'm A Fool To Want You\n02 - The Night We Called It A Day\n03 - Stay With Me\n04 - Autumn Leaves\n05 - Why Try to Change Me Now\n06 - Some Enchanted Evening\n07 - Full Moon And Empty Arms\n08 - Where Are You_\n09 - What'll I Do\n10 - That Lucky Old Sun\n\nOther people's songs have long been a staple for Bob Dylan, who first made his name in Greenwich Village by singing folk songs in the early '60s and often returned to old tunes as the years rolled by. Sometimes, he'd dip into the pre-WWII collection of standards known as the Great American Songbook, peppering set lists with unexpected selections as early as the '80s and even covering Dean Martin's &quot;Return to Me&quot; for The Sopranos in 2001, and he's made no secret of his affection for old-fashioned crooning on the records he's made since 2001's Love and Theft, but even with this long history of overt affection for pre-rock &amp; roll pop, the existence of 2015's Shadows in the Night might come as a surprise. Shadows in the Night finds the songwriter whose work marks the divide where artists were expected to pen their own material finding sustenance in the Great American Songbook, with every one of its songs recorded at some point by Frank Sinatra. Its songs are old and Shadows in the Night is appropriately a defiantly old-fashioned album: a record the way they used to make them, long before Dylan had a recording contract of his own. Archaic though it may be -- it's a mere ten songs lasting no longer than 35 minutes, just like all the long-players of the '50s -- it's hard to call it musty, not when Dylan invested considerable energy in adapting these songs to the confines of his five-piece road band. Occasionally, this roadhouse crew is augmented by horns but the brass coloring bleeds into the sweet, mournful slide of Donnie Herron's pedal steel, accentuating that these renditions aren't nostalgic covers but reflections of Dylan's present. His voice shows gravelly signs of wear but he knows how to use his weathered instrument to its best effect, concentrating on the cadence of the lyrics and digging deep into their emotional undercurrent. In that sense, Shadows in the Night is a truer Sinatra tribute than the stacks of smiling, swinging empty tuxes snapping along to &quot;It Had to Be You,&quot; for Dylan inhabits these songs like an actor, just like Frank did way back when. What Dylan is saluting is not the repertoire, per se -- none of these songs is heavily associated with the Chairmen of the Board -- but rather the mournful intimacy of Sinatra's &quot;saloon&quot; songs, the records he made to be played during the pitch black of the night. Four of the songs here can be found on 1957's Where Are You?, one of the very best of its kind, and that connection accentuates how Dylan has made a saloon song album with a band that could be heard at a saloon: just a guitar quintet, taking a moment to breathe, sigh, and perhaps weep. The fact that the feel is so richly idiosyncratic is a testament to just how well he knows these tunes, and these slow, winding arrangements are why Shadows in the Night feels unexpectedly resonant: it's a testament to how deeply Dylan sees himself in these old songs","torrent":{"xt":"urn:btih:707ac568345e2545fb8909c4d224a45774038286","amp;dn":"Bob+Dylan+-+Shadows+in+the+Night+%5B2015%5D%5B24bit+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"707ac568345e2545fb8909c4d224a45774038286","infoHashBuffer":{"type":"Buffer","data":[112,122,197,104,52,94,37,69,251,137,9,196,210,36,164,87,116,3,130,134]},"announce":[],"urlList":[]}}