{"title":"[PSX] Digimon World 3","uid":4748842,"size":476608153,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:70cb76c93b82a35e387ee80b905508ba019775a5&amp;dn=%5BPSX%5D+Digimon+World+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"Helomaa","files":1,"time":1236078542,"description":"Digimon World 3 (2002)\n\nPublisher: Bandai\n\nStory: Junior, and his friends Ivy and Teddy, log-in to &quot;Digimon Online&quot;, where Ivy renames herself &quot;Kail&quot;. Soon after Junior arrives, the players are trapped in the game by an error in the system. MAGAMI's &quot;Game Master&quot; publicly assures the players that the situation is under control, and blames the incident on the hacker, Lucky Mouse. Junior proceeds with his adventure as normal and travels to the A.o.A. controlled West Sector, and after defeating the real leader, travels to a secret base of Lucky Mouse, who reveals himself to be Kail's long-lost brother and an agent working against the A.o.A., Kurt, who reveals that MAGAMI is working for the A.o.A., but soon the A.o.A. arrive and threaten to turn Kail into Oinkmon, if Kurt doesn't give the Vemmon Digi-Egg to the A.o.A. This results in Kurt being turned into Oinkmon and the Vemmon Digi-Egg stolen. Junior leads an attack on the Admin Center, which results in the Game Master being defeated and interrogated. Junior uses a network break to transport himself to the Amaterasu Server, where he defeats two of the A.o.A.'s chiefs and learns more about their plans. He returns to Asuka, defeats the fourth leader, and uses an emergency teleport system to reach MAGASTA, but is unable to prevent the Juggernaut from being unleashed. The Juggernaut is then used by Vemmon to digivolve to Destromon.\n\nJunior returns to the Amaterasu Server to defeat the final two chiefs, and gains access to Amaterasu City. He leads a fresh attack on the Amaterasu Admin Center, leading to the MAGAMI President being defeated. Junior then uses the central computer to destroy Destromon, before returning to Asuka to ask Airdramon to help him in lifting the virus which is affecting most of the players by transforming them into Oinkmon. Before long, the Oinkmon virus returns and strikes most of the players, with only Junior and Kali surviving untouched. Junior is challenged by an entity calling himself Lord Megadeath. Junior then travels to a military satellite, Gunslinger, to challenge Lord Megadeath. Lord Megadeath is defeated, but succeeds in his project of creating Snatchmon. Snatchmon absorbs Lord Megadeath and merges with the Gunslinger to become Galacticmon. Junior defeats him.\n\nThree months later, Junior returns to the Amaterasu Server, where, as is revealed in the PAL and Japanese versions of the game, four new Server Leaders have been established and Kurt is the new MAGAMI President and World Champion.","torrent":{"xt":"urn:btih:70cb76c93b82a35e387ee80b905508ba019775a5","amp;dn":"%5BPSX%5D+Digimon+World+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70cb76c93b82a35e387ee80b905508ba019775a5","infoHashBuffer":{"type":"Buffer","data":[112,203,118,201,59,130,163,94,56,126,232,11,144,85,8,186,1,151,117,165]},"announce":[],"urlList":[]}}