{"title":"Theodor Mommsen - Nobel Prize in Literature, 1902 (10 books)","uid":15886337,"size":84696221,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:710b36acb7f9c74d4f7d3f98430d3ad32a200000&amp;dn=Theodor+Mommsen+-+Nobel+Prize+in+Literature%2C+1902+%2810+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":6,"uploader":"workerbee","files":18,"time":1474661289,"description":"\nTHEODOR MOMMSEN (1817-1903) was a German classical scholar, historian, jurist, journalist, politician, archaeologist and writer generally regarded as one of the greatest classicists of the 19th century.  He received the 1902 Nobel Prize in Literature for being &quot;the greatest living master of the art of historical writing, with special reference to his monumental work, THE HISTORY OF ROME.&quot;  It is the only time the Nobel Prize has been presented to a historian per se.\r\n\r\nMommsen's masterpiece, THE HISTORY OF ROME (Römische Geschichte, 1854-1856), is a three-volume account of the origin of ancient Rome through the fall of the Republic, ending with the reforms of Julius Caesar.  Mommsen rejected traditional Enlightenment accounts which glorified ancient Rome and instead, guided by a new and rigorous criticism of sources, began the demythologisation of Roman history.  The book won widespread acclaim upon its publication from both the scholarly community and the reading public.\r\n\r\nA planned fourth volume covering Roman history under the Empire was never completed.  In 1885, however, Mommsen had ready another work on ancient Rome, later translated as THE PROVINCES OF THE ROMAN EMPIRE.  In thirteen chapters it describes the different imperial provinces, each as a stand-alone subject, during the early imperial period.  Here there was no running narration of major Roman political events, often dramatic, as was the case in Mommsen's popular chronological telling of his earlier volumes.\r\n\r\nIn 1992, a reconstruction of Mommsen's missing fourth volume on the Empire was issued, based on the handwritten transcript of Mommsen's lectures during 1882-86 made by two of his students.  An edited version appeared in English, translated by Clare Krojzl, as A HISTORY OF ROME UNDER THE EMPERORS (1996).\r\n\r\n\r\nThe following books are in PDF or ePUB format as indicated:\r\n\r\n* History of Rome, The (London: Richard Bentley, 1862-66 / rep. Cambridge UP, 2009).  5 volumes.  Translated by William P. Dickson. -- PDF\r\n\r\n* History of Rome, The (Dover, 2013).  Abridged translation by William P. Dickson, with Introduction, Notes and Glossary by Dero A. Saunders and John H. Collins. -- ePUB\r\n\r\n* History of Rome, The (n.p.).  One-volume edition.  Translated by William P. Dickson. -- ePUB\r\n\r\n* History of Rome Under the Emperors, A (Routledge, 1996).  Based on the lecture notes of Sebastian and Paul Hensel, 1882-86.  Translated by Clare Krojzl; edited, with the addition of a new chapter, by Thomas Wiedemann. -- PDF\r\n\r\n* Provinces of the Roman Empire: From Caesar to Diocletian (Macmillan, 1909).  2 volumes.  Translated by William P. Dickson. -- PDF\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:710b36acb7f9c74d4f7d3f98430d3ad32a200000","amp;dn":"Theodor+Mommsen+-+Nobel+Prize+in+Literature%2C+1902+%2810+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"710b36acb7f9c74d4f7d3f98430d3ad32a200000","infoHashBuffer":{"type":"Buffer","data":[113,11,54,172,183,249,199,77,79,125,63,152,67,13,58,211,42,32,0,0]},"announce":[],"urlList":[]}}