{"title":"Get Inside Her - The Female Perspective - Marni Kinrys","uid":11857583,"size":634174,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7129c99039bf33dc264b792c3881215bd1a5b7ac&amp;dn=Get+Inside+Her+-+The+Female+Perspective+-+Marni+Kinrys&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1430202676,"description":"Guys, Discover Insider Dating Tips From A Woman:\n\nOne night, I sat up late reading email after email from attractive, witty guys who were single and ready to date, and instead of being impressed and enraptured, I began to wonder what on earth was going wrong in the world. You see, these emails were not the typical online dating messages. They weren't asking me out on dates, or vying for desire or attention. They were sent from great guys, who no matter what they tried, always seemed to find that beautiful women ended up dating jerks and never calling them back.\n\nNow, you might be wondering what all these guys are doing emailing me their questions, but as a professional Wing Girl, it's my duty to be the girl who gives it to guys straight of the dating community. I'm always brutally honest and have been told I have a gift for seeing things from both sides of the dating lines, but it took me a few glasses of wine and some seriously deep thinking to try to piece the puzzle together.\n\nWhat was going on ?\n\nI knew all my gorgeous girlfriends were looking for these types of men. Men who were exciting, fun, good, honest and who had their life together...\n\nSo as they were they emailing me, detailing their failed attempts, I tried to find the one common factor that was holding these great guys back. I spoke with them at length about their dating history, trying to figure out if they were doing something wrong, and then it struck me.\n\nIt wasn't them; it was &quot;The Game&quot; they had been told to play.\n\nThey had the best intentions, but they were going about attracting and dating beautiful women in all the wrong ways. They were dating from the male perspective and in a way that seemed right to other guys; but this wasn't communicated clearly to women!\n\nAs I started to reply to each email, instead of telling them what I thought they wanted to hear or what I thought male Pick Up Artists might tell them, I started to lay it all out on the line. Later on, when I asked my girlfriends for their opinion, they couldn't believe what I had written.\n\nI was revealing all secrets women would never tell men. I was putting it out there in a way that would give guys what my girlfriends called the upper hand, but I defended my actions. These were genuinely great guys! I was tired of hearing how women could never find what they were looking for. Now, when I was gave the men a road map to go out and find them, they freaked out!\n\nThat's when I knew I had something worth sharing. Something that would turn the dating world on its head; finally, I thought, &quot;It's time to shake things up!&quot;\n\nIf you have ever wondered why you aren't on the calendars of beautiful women, why they never seem to call back, or always end up with the jerks of the world, then you have to hear what I have to say.\n\nYou need to accept that it's not your fault and face the facts. Men and women are different. We act, think, and date differently. If you want to find success, you have to see things from a different perspective. You have to gain the world's first (and best) awarded female Pick Up Artists perspective!\n\nNow when I go out, meet with clients, call, or email these great guys back, I get something in return. I get to see them finally date the women they have always wanted and deserved. They tell me how easy and simple it has become, and how they cannot believe they didn't think of it first","torrent":{"xt":"urn:btih:7129c99039bf33dc264b792c3881215bd1a5b7ac","amp;dn":"Get+Inside+Her+-+The+Female+Perspective+-+Marni+Kinrys","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7129c99039bf33dc264b792c3881215bd1a5b7ac","infoHashBuffer":{"type":"Buffer","data":[113,41,201,144,57,191,51,220,38,75,121,44,56,129,33,91,209,165,183,172]},"announce":[],"urlList":[]}}