{"title":"Asimov's Future History - Isaac Asimov","uid":11739875,"size":19501362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7141aab642958fb908042754a65a6a576bbe363f&amp;dn=Asimov%27s+Future+History+-+Isaac+Asimov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"Mohammad_AT","files":20,"time":1425743237,"description":"COVER :\n \nIsaac Asimov was a Russian-born, American author, a professor of biochemistry, and a highly successful writer, best known for his works of science fiction and for his popular science books.\n\nProfessor Asimov is generally considered the most prolific writer of all time, having written or edited more than 500 books and an estimated 90,000 letters and postcards. He has works published in nine of the ten major categories of the Dewey Decimal System (lacking only an entry in the 100s category of Philosophy).\n\nAsimov is widely considered a master of the science-fiction genre and, along with Robert A. Heinlein and Arthur C. Clarke, was considered one of the &quot;Big Three&quot; science-fiction writers during his lifetime. Asimov's most famous work is the Foundation Series; his other major series are the Galactic Empire series and the Robot series, both of which he later tied into the same fictional universe as the Foundation Series to create a unified &quot;future history&quot; for his stories much like those pioneered by Robert A. Heinlein and previously produced by Cordwainer Smith and Poul Anderson. He penned numerous short stories, among them &quot;Nightfall&quot;, which in 1964 was voted by the Science Fiction Writers of America the best short science fiction story of all time, a title many still honor. He also wrote mysteries and fantasy, as well as a great amount of nonfiction","torrent":{"xt":"urn:btih:7141aab642958fb908042754a65a6a576bbe363f","amp;dn":"Asimov%27s+Future+History+-+Isaac+Asimov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7141aab642958fb908042754a65a6a576bbe363f","infoHashBuffer":{"type":"Buffer","data":[113,65,170,182,66,149,143,185,8,4,39,84,166,90,106,87,107,190,54,63]},"announce":[],"urlList":[]}}