{"title":"Leonardo and the Last Supper","uid":15885447,"size":8165911,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71612751e99f75a374aae8bf924b016e00cc3a0d&amp;dn=Leonardo+and+the+Last+Supper&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":1,"uploader":"marty14","files":1,"time":1474646461,"description":"Leonardo and the Last Supper - Ross King [epub]\r\n\r\nIn 1495, Leonardo da Vinci began what would become one of history's most influential works of art - The Last Supper. After a decade at the court of Ludovico Sforza, the duke of Milan, Leonardo was at a low point: at forty-three, he had failed, despite a number of prestigious commissions, to complete anything that truly fulfilled his astonishing promise. His latest failure was a giant bronze horse to honor Sforza's father, made with material expropriated by the military. The commission to paint The Last Supper was a small compensation, and his odds of completing it weren't promising: he hadn't worked on such a large painting and had no experience in the standard mural medium of fresco.\r\n\r\nAmid war and the political and religious turmoil around him, and beset by his own insecurities and frustrations, Leonardo created the masterpiece that would forever define him. Ross King unveils dozens of stories that are embedded in the painting, and overturns many of the myths surrounding it. Bringing to life a fascinating period in European history, he presents an original portrait of one of history's greatest geniuses through the lens of his most famous work","torrent":{"xt":"urn:btih:71612751e99f75a374aae8bf924b016e00cc3a0d","amp;dn":"Leonardo+and+the+Last+Supper","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71612751e99f75a374aae8bf924b016e00cc3a0d","infoHashBuffer":{"type":"Buffer","data":[113,97,39,81,233,159,117,163,116,170,232,191,146,75,1,110,0,204,58,13]},"announce":[],"urlList":[]}}