{"title":"Pre-Civilization Egypt","uid":16002966,"size":500063936,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:71c1d95861501de80dadfeb6db6da42ca539fffc&amp;dn=Pre-Civilization+Egypt&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":3,"uploader":"dauphong","files":1,"time":1476147728,"description":"About This Game\r\nSurvive through the 2000 years of true Ancient Egypt history. Build, develop, rule!\r\n\r\nPre-Civilization Egypt is a turn-based strategy built on the history of Ancient Egypt. Starting from 5000 B.C. you will guide the Egyptians through all the hardships to prosperity and power. Get ready to march into faraway lands, fight catastrophes and hardships. The game covers almost 2000 years of Egyptian Pre-Dynastic history, starting from the dawn in 5000 BC till the Early Dynastic Period in 3100 BC. As the right hand of the ruler, you will control the life of Ancient Egypt – manage resources, assign workers, build new districts, temples and palaces.\r\nFEATURES\r\n\r\n    Simulation of the ancient world\r\n    Wars, drought, enemy invasions, epidemics, internal turmoil, migration of the tribes, religious ceremonies, exploration of distant lands, celebrations and more than 100+ others events and trials await you in the game!\r\n\r\n    Technological evolution of mankind\r\n    48 historically accurate technologies and cultural achievements of Pre-Dynastic Egypt with interesting descriptions, will show the technological evolution of mankind on the example of the Egyptian civilization.\r\n\r\n    Mysteries of Egyptian religion and culture\r\n    You will see the birth of the unique religion of the Nile civilization, starting with beliefs in spirits and ending with the gods of Pre-Dynastic Egypt and you will learn the secrets known only to archeologists and Egyptologists!\r\n\r\n    Reconstructed map of Ancient Egypt\r\n    Accurate reconstruction of the geographic map of ancient Egypt 5000-3000 BC, taking into account the climatic changes of that period when the Sahara was a Savannah and not a desert and Wadies were rivers and not roads.\r\n\r\n    Reconstructed city of Hierakonpolis\r\n    Accurate archaeological reconstruction of the Hierakonpolis - the former center of Pre-Dynastic Egypt Egypt. You will build the real houses, temples and tombs, that were excavated by archeologists in XX-XXI century. \r\n\r\n\r\nThe fate of the whole nation is in your hands. Make important decisions in real historical situations, wars, disasters. True story will immerse you into the mysterious atmosphere of the ancient world, you will see through the eyes of the ancient Egyptians","torrent":{"xt":"urn:btih:71c1d95861501de80dadfeb6db6da42ca539fffc","amp;dn":"Pre-Civilization+Egypt","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71c1d95861501de80dadfeb6db6da42ca539fffc","infoHashBuffer":{"type":"Buffer","data":[113,193,217,88,97,80,29,232,13,173,254,182,219,109,164,44,165,57,255,252]},"announce":[],"urlList":[]}}