{"title":"Beethoven All Symphonies","uid":4541630,"size":848023577,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:71f541a5092be32384ce0f80899785a54c57e5d8&amp;dn=Beethoven+All+Symphonies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":3,"uploader":"Welshguy","files":-1,"time":1227967756,"description":"Ludwig van Beethoven \n\nSymphony No. 1 in C major \nSymphony No. 2 in D major op\nSymphony No. 3 in E flat major \nSymphony No. 4 in B flat major \nSymphony No. 5 in C minor \nSymphony No. 6 in F major \nSymphony No. 7 in A major \nSyphony  No. 8 in F major\nSymphony No. 9 in D minor \n\n\nBeethoven's First Symphony was completed at the beginning of 1800 when he was 30. \n\nHe had already made several sketches for a symphony but this was the first completed version. \n\nThe influence of Mozart's wind music in it led to a critic at the first performance claiming \nthat the wind instruments were used too much, especially as they were not played with any energy. \n\nHowever, for this first performance in Vienna, it was placed alongside a Mozart Symphony, an aria \nfrom Haydn's Creation, Beethoven's Septet op.20 and his First Piano Concerto, so it is not surprising \nthat the musicians perhaps appeared to be lacking in energy by the time it came to the Symphony.\n\nBoth Mozart and Haydn's symphonic models are evident in Beethoven's First Symphony but it was \nnevertheless innovative for its time and showed Beethoven as a composer with his own developing ideas. \n\nOne of the most striking features is the strange opening. A dominant seventh on F leads to three \ncadences which 'resolve' to a chord of G major, working through tonal developments until the Allegro con brio in C major. \n\nThis immediately indicates Beethoven's intentions for the rest of the symphony and indeed for all \nhis music - to use keys and tonal development to achieve high drama and intensity in music. \n\nThe second movement has a prevailing dotted rhythm, which links the developments, more motific than melodic. \n\nThe third movement entitled 'Minuet' is much more like a scherzo than a classical minuet in its speed, \nswift key changes and character, another trait of Beethoven. \n\nLike the first movement, the finale opens with a brief slow introduction, where the violins meander \nthrough scale passages which increase in speed to introduce the main subject of the movement - full of energy.\n\n\nAll Symphonies (MP3@320Kbps)  I hope you enjoy this as much I as I do and please seed this at least 3 times what you download so it keeps the torrent alive so others can enjoy!!\n\n","torrent":{"xt":"urn:btih:71f541a5092be32384ce0f80899785a54c57e5d8","amp;dn":"Beethoven+All+Symphonies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71f541a5092be32384ce0f80899785a54c57e5d8","infoHashBuffer":{"type":"Buffer","data":[113,245,65,165,9,43,227,35,132,206,15,128,137,151,133,165,76,87,229,216]},"announce":[],"urlList":[]}}