{"title":"Hitler's Europe Ablaze: Occupation, Resistance and Rebellion","uid":15932309,"size":5313965,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71f59454ef7435798aef9fa95782ddc2c568ba3f&amp;dn=Hitler%27s+Europe+Ablaze%3A+Occupation%2C+Resistance+and+Rebellion&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"marty14","files":1,"time":1475367819,"description":"Hitler's Europe Ablaze: Occupation, Resistance and Rebellion during World War II - Philip Cooke, Ben H. Shepherd (ed.) [epub]\r\n\r\nLocal resistance to German-led Axis occupation occurred throughout the European continent during World War II, taking a wide range of forms—noncooperation and disinformation, sabotage and espionage, and armed opposition and full-scale partisan warfare. It is a key element in the experience and the national memory of those who found themselves under Axis government and control. But for decades there has been no systematic attempt to give readers a panoramic yet detailed view of the make-up, actions, and impact of resistance movements from Scandinavia down to Greece and from France through to Russia.\r\n\r\nThis authoritative and accessible survey, written by a group of the leading experts in the field, provides a reliable, in-depth, up-to-date account of the resistance in each region and country along with an assessment of its effectiveness and of the Axis reaction to it. An extensive introduction by the editors Philip Cooke and Ben H. Shepherd draws the threads of the varied movements and groups together, highlighting the many differences and similarities between them.\r\n\r\nTrue Stories of Resistance in World War II is a significant contribution to the frequently heated debates about the importance of individual resistance movements and thought-provoking reading for everyone who is interested in or studying occupied Europe during the World War II","torrent":{"xt":"urn:btih:71f59454ef7435798aef9fa95782ddc2c568ba3f","amp;dn":"Hitler%27s+Europe+Ablaze%3A+Occupation%2C+Resistance+and+Rebellion","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71f59454ef7435798aef9fa95782ddc2c568ba3f","infoHashBuffer":{"type":"Buffer","data":[113,245,148,84,239,116,53,121,138,239,159,169,87,130,221,194,197,104,186,63]},"announce":[],"urlList":[]}}