{"title":"YTD Video Downloader PRO v4.9.0.1 (2-click run)","uid":11852306,"size":13913677,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:72ce122364ad5d65ed602a41880afcf22e6b8dff&amp;dn=YTD+Video+Downloader+PRO+v4.9.0.1+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"The_Duck1","files":4,"time":1430114761,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a 'Easy Run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\n\nDESCRIPTION:\nYTD Video Downloader is more than a Youtube downloader. It allows you to download HD and HQ videos, from dozens of sites and convert them to other video formats. The program is easy to use. Just specify the URL, similar to a Youtube downloader, for the video you want to download and click the Download button. From there, YTD Video Downloader will download the video from the URL you specified. The program also allows you to convert downloaded videos for iPad, iPod, iPhone, PSP, Cell Phone, Windows Media, and XVid, or play video that you have previously downloaded or converted.\n\nThe YTD Video Downloader interface includes a tabbed format for easy downloading, converting, and playing, and a new Activity tab allows you to keep track of multiple downloads and conversions in real time. The program has the ability to download full playlists as opposed to just one video.\n\nFeatures :\n+Easy to use: just copy video URL from your web browser and paste to YTD Downloader.\n+No need to use scripts or browser plug-ins.\n+Convert downloaded video to various formats.\n+Download Youtube High Definition videos (available on certain videos)\n+Unicode support: Youtube Downloader HD can save movies whose names have non-standard characters (like Chinese, Japanese, Cyrillic, etc.)\n+Support for big video files\n\nInstallation instructions:\n1. Execute the .exe file.\n2. Follow the instructions.\n3. Enjoy the program","torrent":{"xt":"urn:btih:72ce122364ad5d65ed602a41880afcf22e6b8dff","amp;dn":"YTD+Video+Downloader+PRO+v4.9.0.1+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72ce122364ad5d65ed602a41880afcf22e6b8dff","infoHashBuffer":{"type":"Buffer","data":[114,206,18,35,100,173,93,101,237,96,42,65,136,10,252,242,46,107,141,255]},"announce":[],"urlList":[]}}