{"title":"Kingdom Come + Ex (1996|Digital|TheHand-Empire)","uid":9852209,"size":509274677,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:73a7161bc9b15ac169726e49a337c08659953876&amp;dn=Kingdom+Come+%2B+Ex+%281996%7CDigital%7CTheHand-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":3,"uploader":"VikTSlick","files":-1,"time":1396164498,"description":"For more information about this limited series, please see the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Kingdom_Come_(comics)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Kingdom_Come_(comics)&lt;/a&gt;\n\nWhile working on Marvels with Kurt Busiek, Alex Ross submitted a 40-page treatment for a similar project at DC, and with Mark Waid coming aboard as the writer, it developing into the highly-praised Kingdom Come. The story focuses on a universe teetering on the brink of disaster, and a new bread of heroes and villains who have run amok. It's up to the classic &quot;old guard&quot; to come in and save the day. Promotional info - &quot;Written by Mark Waid and illustrated by Ross, this is the unforgettable, best-selling tale of a world spinning inexorably out of control. Waid and Ross weave a tale of youth versus experience, tradition versus change, and what defines a hero. KINGDOM COME is a riveting epic that pits the old guard - Superman, Batman, Wonder Woman and their allies - against a new, uncompromising generation of heroes.&quot;\n\nIn this pack are two items - first, obviously the main story, presented in the digital one-volume edition that has not been previously torrented outside of the hitlists. This is courtesy of TheHand-Empire, and it looks great and really shows off Alex Ross' typically stunning art. Second, I have also included the extremely rare Comicology - Kingdom Come Companion. This was an unauthorized but very well-researched and detailed guide that DC had pulled from the shelves. It is definitely worth a read if you are fan of the series and contains a lot of cool tidbits of DC history. I have NOT included all the various tie-ins and such as they are not yet available in HQ versions and are mostly superfluous to what Waid and Ross serve up here. Hope you enjoy this now-classic tale - please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:73a7161bc9b15ac169726e49a337c08659953876","amp;dn":"Kingdom+Come+%2B+Ex+%281996%7CDigital%7CTheHand-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73a7161bc9b15ac169726e49a337c08659953876","infoHashBuffer":{"type":"Buffer","data":[115,167,22,27,201,177,90,193,105,114,110,73,163,55,192,134,89,149,56,118]},"announce":[],"urlList":[]}}