{"title":"[FS9/FSX] Aerosoft - Mega Airport Paris Charles de Gaulle v1.11","uid":7959890,"size":177125377,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:73b087be592972247fa3ca4a2cdf096ed7c7553d&amp;dn=%5BFS9%2FFSX%5D+Aerosoft+-+Mega+Airport+Paris+Charles+de+Gaulle+v1.11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":2,"uploader":"_SnakEye","files":-1,"time":1356548362,"description":"Aerosoft/Sim-Wings - Mega Airport Paris Charles de Gaulle v1.11\n\n\n\nSim-Wings and Aerosoft present the new Mega Airport Paris Charles de Gaulle X, the largest and busiest airport of France. This is a total rebuild of the previous versions and will make the main French airport finally available for FS2004 and FSX.\n\n\nBased on a up to date high resolution areal images all the buildings and objects were placed just as they are on the real airport at this moment. You will find the airport totally ready to handle the A380 with new Air France terminals and the massive new A380 hangar. The many small details and dynamic vehicle traffic make the airport come to life and you will have to really take care while taxiing around on this airport! Compared to previous releases of CDG you will not only find many new objects but the fact we had better images also make the scenery more detailed and above all more realistic. Of course Sim-Wings took great care to keep framerates as high as possible and everybody in Aerosoft was very surprised how smooth the released version is. ","torrent":{"xt":"urn:btih:73b087be592972247fa3ca4a2cdf096ed7c7553d","amp;dn":"%5BFS9%2FFSX%5D+Aerosoft+-+Mega+Airport+Paris+Charles+de+Gaulle+v1.11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73b087be592972247fa3ca4a2cdf096ed7c7553d","infoHashBuffer":{"type":"Buffer","data":[115,176,135,190,89,41,114,36,127,163,202,74,44,223,9,110,215,199,85,61]},"announce":[],"urlList":[]}}