{"title":"Bad Pharma: How Drug Companies Mislead Doctors and Harm Patients","uid":16044569,"size":2222125,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74f29f535c19936b300e69a017d3f3b4c3791733&amp;dn=Bad+Pharma%3A+How+Drug+Companies+Mislead+Doctors+and+Harm+Patients&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":5,"uploader":"marty14","files":1,"time":1476550322,"description":"Bad Pharma: How Drug Companies Mislead Doctors and Harm Patients - Ben Goldacre [epub]\r\n\r\nWe like to imagine that medicine is based on evidence and the results of fair testing and clinical trials. In reality, those tests and trials are often profoundly flawed. We like to imagine that doctors who write prescriptions for everything from antidepressants to cancer drugs to heart medication are familiar with the research literature about a drug, when in reality much of the research is hidden from them by drug companies. We like to imagine that doctors are impartially educated, when in reality much of their education is funded by the pharmaceutical industry. We like to imagine that regulators have some code of ethics and let only effective drugs onto the market, when in reality they approve useless drugs, with data on side effects casually withheld from doctors and patients.\r\n\r\nAll these problems have been shielded from public scrutiny because they're too complex to capture in a sound bite. But Ben Goldacre shows that the true scale of this murderous disaster fully reveals itself only when the details are untangled. He believes we should all be able to understand precisely how data manipulation works and how research misconduct in the medical industry affects us on a global scale.\r\n\r\nWith Goldacre's characteristic flair and a forensic attention to detail, Bad Pharma reveals a shockingly broken system and calls for regulation. This is the pharmaceutical industry as it has never been seen before","torrent":{"xt":"urn:btih:74f29f535c19936b300e69a017d3f3b4c3791733","amp;dn":"Bad+Pharma%3A+How+Drug+Companies+Mislead+Doctors+and+Harm+Patients","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74f29f535c19936b300e69a017d3f3b4c3791733","infoHashBuffer":{"type":"Buffer","data":[116,242,159,83,92,25,147,107,48,14,105,160,23,211,243,180,195,121,23,51]},"announce":[],"urlList":[]}}