{"title":"Dark Money: The Hidden History of the Billionaires Behind the...","uid":15854525,"size":673648,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:750d9625c0ffd0b94e587ce42688ea41d8a93d82&amp;dn=Dark+Money%3A+The+Hidden+History+of+the+Billionaires+Behind+the...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"marty14","files":1,"time":1474225176,"description":"Dark Money: The Hidden History of the Billionaires Behind the Rise of the Radical Right - Jane Mayer [epub]\r\n\r\nAs Jane Mayer shows in this powerful, meticulously reported history, a network of exceedingly wealthy people with extreme libertarian views bankrolled a systematic, step-by-step plan to fundamentally alter the American political system.\r\n\r\nThis network has brought together some of the richest people on the planet. Their core beliefs—that taxes are a form of tyranny; that government oversight of business is an assault on freedom—are sincerely held. But these beliefs also advance their personal and corporate interests: Many of their companies have run afoul of federal pollution, worker safety, securities, and tax laws.\r\n\r\nThe chief figures in the network are Charles and David Koch, whose father made his fortune in part by building oil refineries in Stalin’s Russia and Hitler’s Germany. The patriarch later was a founding member of the John Birch Society, whose politics were so radical it believed Dwight Eisenhower was a communist. The brothers were schooled in a political philosophy that asserted the only role of government is to provide security and to enforce property rights.\r\n\r\nThe political operatives the network employs are disciplined, smart, and at times ruthless. Mayer documents instances in which people affiliated with these groups hired private detectives to impugn whistle-blowers, journalists, and even government investigators. And their efforts have been remarkably successful. Libertarian views on taxes and regulation, once far outside the mainstream and still rejected by most Americans, are ascendant in the majority of state governments, the Supreme Court, and Congress. Meaningful environmental, labor, finance, and tax reforms have been stymied.\r\n\r\nJane Mayer spent five years conducting hundreds of interviews-including with several sources within the network-and scoured public records, private papers, and court proceedings in reporting this book. In a taut and utterly convincing narrative, she traces the byzantine trail of the billions of dollars spent by the network and provides vivid portraits of the colorful figures behind the new American oligarchy.\r\n\r\nDark Money is a book that must be read by anyone who cares about the future of American democracy","torrent":{"xt":"urn:btih:750d9625c0ffd0b94e587ce42688ea41d8a93d82","amp;dn":"Dark+Money%3A+The+Hidden+History+of+the+Billionaires+Behind+the...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"750d9625c0ffd0b94e587ce42688ea41d8a93d82","infoHashBuffer":{"type":"Buffer","data":[117,13,150,37,192,255,208,185,78,88,124,228,38,136,234,65,216,169,61,130]},"announce":[],"urlList":[]}}