{"title":"Ludwig Wittgenstein - Philosophical Works (13 books)","uid":9768189,"size":137431674,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76ac11dd7ae2f5ebf8b3f37bf987d183807d15ed&amp;dn=Ludwig+Wittgenstein+-+Philosophical+Works+%2813+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":4,"uploader":"workerbee","files":-1,"time":1394913103,"description":"\nLUDWIG WITTGENSTEIN (1889-1951) was an Austrian-British philosopher who worked primarily in logic, the philosophy of mathematics, the philosophy of mind, and the philosophy of language.  Most of his voluminous manuscripts were edited and published posthumously.  Bertrand Russell described Wittgenstein as &quot;the most perfect example I have ever known of genius as traditionally conceived; passionate, profound, intense, and dominating.&quot;\n\nWittgenstein's influence has been felt in nearly every field of the humanities and social sciences, yet there are widely diverging interpretations of his thought.  In the words of his friend and colleague Georg Henrik von Wright: &quot;He was of the opinion . . . that his ideas were generally misunderstood and distorted even by those who professed to be his disciples.  He doubted he would be better understood in the future.  He once said he felt as though he were writing for people who would think in a different way, breathe a different air of life, from that of present-day men.&quot;\n\nThis collection includes his two most famous books.  The TRACTATUS LOGICO-PHILOSOPHICUS (1921) was the only philosophical work that Wittgenstein published during his lifetime.  Written in short, carefully numbered paragraphs of extreme brilliance, it captured the imagination of a generation of philosophers.\n\nPHILOSOPHICAL INVESTIGATIONS (1953) was immediately hailed as a masterpiece upon its posthumous publication.  In the definitive German-English edition included here, Peter Hacker and Joachim Schulte have significantly modified and corrected G. E. M. Anscombe's original English translation.  Detailed editorial endnotes have been added to illuminate difficult translation decisions and to identify references and allusions in the original text.\n\n\nThe following books are in PDF format:\n\n* THE BIG TYPESCRIPT: TS 213 (Blackwell, 2005).  Bilingual Scholar's Edition, edited and translated by Grant Luckhardt and Maximilian Aue.\n\n* LECTURES AND CONVERSATIONS ON AESTHETICS, PSYCHOLOGY AND RELIGIOUS BELIEF (University of California, 1967).  Edited by Cyril Barrett.\n\n* LECTURES, 1932-1935: From the Notes of Alice Ambrose and Margaret Macdonald (1979; rep. Prometheus Books, 2001).  Edited by Alice Ambrose.\n\n* LECTURES ON THE FOUNDATIONS OF MATHEMATICS: Cambridge, 1939 (Harvester, 1976).  Edited by Cora Diamond, from the Notes of R. G. Bosanquet, Norman Malcolm, Rush Rees, and Yorick Smythies.\n\n* NOTEBOOKS, 1914-1916 (Harper &amp; Row, 1969).  Edited by G. H. von Wright and G. E. M. Anscombe; translated by G. E. M. Anscombe.\n\n* ON CERTAINTY (Blackwell, 1969).  Edited by G. E. M. Anscombe and G. H. von Wright; translated by Denis Paul and G. E. M. Anscombe.\n\n* PHILOSOPHICAL GRAMMAR (Blackwell, 1974).  Edited by Rush Rees; translated by Anthony Kenny.\n\n* PHILOSOPHICAL INVESTIGATIONS, 4th edition (Wiley-Blackwell, 2009).  Bilingual edition with English translation by G. E. M. Anscombe, P. M. S. Hacker and Joachim Schulte.\n\n* PUBLIC AND PRIVATE OCCASIONS (Rowman &amp; Littlefield, 2003).  Edited by James C. Klagge and Alfred Nordmann.\n\n* REMARKS ON THE FOUNDATIONS OF MATHEMATICS (MIT, 1967).  Bilingual edition edited by G. H. von Wright and G. E. M. Anscombe; Translated by G. E. M. Anscombe.\n\n* TRACTATUS LOGICO-PHILOSOPHICUS, 2nd edition (Routledge Classics, 2001).  Translated by Brian McGuiness and David Pears, with an Introduction by Bertrand Russell.\n\n* THE VOICES OF WITTGENSTEIN: The Vienna Circle (Routledge, 2003).  Original German texts with English translations by Gordon Baker, Michael Mackert, John Connolly, and Vasilis Politis; Transcribed, Edited and with an Introduction by Gordon Baker.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc., here:\n  &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n\n","torrent":{"xt":"urn:btih:76ac11dd7ae2f5ebf8b3f37bf987d183807d15ed","amp;dn":"Ludwig+Wittgenstein+-+Philosophical+Works+%2813+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76ac11dd7ae2f5ebf8b3f37bf987d183807d15ed","infoHashBuffer":{"type":"Buffer","data":[118,172,17,221,122,226,245,235,248,179,243,123,249,135,209,131,128,125,21,237]},"announce":[],"urlList":[]}}