{"title":"Jal Gangajal (2016) - Desi.SCR - HEVC - x265.AAC - 1CD - [DDR]","uid":13753485,"size":733447082,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:76b29743d29fdb06864309d8a0031796af67da05&amp;dn=Jal+Gangajal+%282016%29+-+Desi.SCR+-+HEVC+-+x265.AAC+-+1CD+-+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":2,"uploader":"SaM","files":1,"time":1457179490,"description":"DDR Presents\r\n\r\n\r\nJai Gangajal(2016)\r\n(A film by Prakash Jha)\r\n\r\nHindi - Desi SCR - 720x304 (2.35:1)- 700MB - x.265.AAC - 2 Hrs:28 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n\r\n Tech Specifications:\r\n \nhttp://extraimago.com/image/aTyg\r\n\r\nScreens\r\n \nhttp://extraimago.com/image/aTyz \nhttp://extraimago.com/image/aTyU \nhttp://extraimago.com/image/aTyM \nhttp://extraimago.com/image/aTy9 \nhttp://extraimago.com/image/aTy3 \nhttp://extraimago.com/image/aTyb \nhttp://extraimago.com/image/aTyh \nhttp://extraimago.com/image/aTyd \nhttp://extraimago.com/image/aTyI \nhttp://extraimago.com/image/aTyl\r\n\r\n\r\nSynopsis:\r\nBankipur is a District Headquarters which is the back of beyond. It is ruled by a Don called Babloo Pandey (Manav Kaul) who is also the local MLA and his brother Dabloo (Ninad Kamat. They rape, loot burn and murder with abandon, aided by a compliant Circle Inspector BN Singh (Prakash Jha). In this milieu arrives Abha Mathur (Priyanka), a SP who has finally been given a posting after being sidelined for years by the CM.\r\n\r\nWhere Abha Mathur arrives, can things remain the same? Within minutes, she banishes the crooked in her organisation and puts BN Singh in his place. She takes on the local MLA and with flashing fists and a whirling lathi beats up the erstwhile murderers and rapists. BN Singh too has a change of heart and betweeen them they clean up the place.\r\n\r\nComments:\r\nIf you have seen Gangajal the 2013 film, also by Prakash Jha, you have seen Jai Gangajal. The only reason for seeing this film would be Priyanka Chopra in place of Ajay Devgan. Its a complete rehash of the same story, with a rapacious corporate being thrown in. With a Prakash Jha movie you expect and get a few socially relevant themes such as the hanging of three girls (badaun), a few farmer suicides, a IIT/PhD Kisan leader etc. That was par for the course.\r\n\r\nAnd of course there is the Heroine. The SP has to fall foul of the Dons. She has to be threatened and of course she must redeem the area by vanquishing them. In the course of all this, the weak village folk will find their collective strength and wreak justice through kangaroo courts. After all the audience must go home happy, llogic and rationality be damned.\r\n\r\nWatching the movie, you get bemused at what an SP has to do! It does seem as the rest of the District Administration has beeb withdrawn in order to let Abha Mathur Rule. She has empathy for the law, expressed by breaking every rule in the book.\r\n\r\nWatch this film for Prakash Jha the actor. In a surprise package, the Director himself becomes the actor who steals most scenes and probably has more scenes than the Heroine. And for sure you would watch the film for the shapely Priyanka Chopra. The scene where she beats up a would be rapist with a lathi is particulalry recommended.\r\n\r\nEverything else in the film is as expected except the length. It goes on for two and a half hours. One less Sarpanch or maybe a few less scenes of loot and rape wuldn't have made a material difference.\r\n\r\nUploader's Notes:\r\nOur thanks for Team DUS for the source. This was an excellent Screener. We have denoised it a bit, adjusted the luma, corrected a few bleeding colours and tints and added a bit of sharpening. The product is of near DVD Quality and we hope, will please you.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt4979082/\r\n\r\n\r\nMake sure it is Genuine DDR release @ ExtraTorrent.com\r\n               \nhttps://extratorrent.cc/               \nhttps://extratorrent.com/               \nhttp://extratorrent.ws/               \nhttps://etproxy.com/               \nhttps://extratorrentlive.com/               \nhttps://extratorrentonline.com/               \nhttps://etmirror.com/               \nhttps://extratorrent.works/               \nhttps://extratorrent.date/\r\n\r\n\r\nShare your Images with:\r\n               \nhttp://extraimago.com/\r\n\r\nHelp us by donating with Bitcoin: 1XeH1kKXWYbzZcFHokGiZ4d3MWW5WyXzU","torrent":{"xt":"urn:btih:76b29743d29fdb06864309d8a0031796af67da05","amp;dn":"Jal+Gangajal+%282016%29+-+Desi.SCR+-+HEVC+-+x265.AAC+-+1CD+-+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76b29743d29fdb06864309d8a0031796af67da05","infoHashBuffer":{"type":"Buffer","data":[118,178,151,67,210,159,219,6,134,67,9,216,160,3,23,150,175,103,218,5]},"announce":[],"urlList":[]}}