{"title":"Excel 2016 All-in-One For Dummies [ePUB + PDF]","uid":12975319,"size":36793484,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76eb981921570064c9bc38b5eb7ae4e1509d3788&amp;dn=Excel+2016+All-in-One+For+Dummies+%5BePUB+%2B+PDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":2,"uploader":"erapid","files":4,"time":1449976521,"description":"Excel 2016 All-in-One For Dummies by Greg Harvey\r\n \nhttp://i.imgur.com/vYtl9En.jpg\r\n\r\nExcel 2016 All-in-One For Dummies, the most comprehensive Excel reference on the market, is completely updated to reflect Microsoft’s changes in the popular spreadsheet tool. It offers you everything you need to grasp basic Excel functions, such as creating and editing worksheets, setting up formulas, importing data, performing statistical functions, editing macros with Visual Basic-and beyond. In no time, your Excel skills will go from ‘meh’ to excellent.\r\n\r\nWritten by expert Greg Harvey, who has sold more than 4.5 million copies of his previous books combined and has taught and trained extensively in Microsoft Excel, this all-encompassing guide offers everything you need to get started with Excel. From generating pivot tables and performing financial functions to performing error trapping and building and running macros-and everything in between-this hands-on, friendly guide makes working with Excel easier than ever before.\r\n\r\nServes as the ideal reference for solving common questions and Excel pain points quickly and easily\r\n\r\nHelps to increase productivity and efficiency when working in Excel\r\nFully updated for the new version of Excel\r\nCovers basic and more advanced Excel topics\r\nIf working in Excel occasionally makes you want to scream, this will be the dog-eared, dust-free reference you’ll turn to again and again","torrent":{"xt":"urn:btih:76eb981921570064c9bc38b5eb7ae4e1509d3788","amp;dn":"Excel+2016+All-in-One+For+Dummies+%5BePUB+%2B+PDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76eb981921570064c9bc38b5eb7ae4e1509d3788","infoHashBuffer":{"type":"Buffer","data":[118,235,152,25,33,87,0,100,201,188,56,181,235,122,228,225,80,157,55,136]},"announce":[],"urlList":[]}}