{"title":"The.Cave-RELOADED","uid":8057664,"size":1242207880,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:77df6ff09f61af053590ad79e229da26f63ea924&amp;dn=The.Cave-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":2,"uploader":"Mr.Stifmeister","files":2,"time":1359003112,"description":"\n                                      nERv\n\n\n                    The Cave (c) Double Fine Productions\n\n         01/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n               1 :.......... DISC(S) .. GAME.TYPE ........: Adventure\n\n\nThe Cave is a new adventure game from Monkey Island and Maniac Mansion\ncreator Ron Gilbert, and Double Fine Productions, the award-winning studio\nbehind Psychonauts and Br tal Legend.\n\nAssemble your team of three from seven unlikely adventurers, each with their\nown unique personalities and stories, then descend into the mysterious\ndepths to explore locations including a subterranean amusement park and a\nmedieval castle, not to mention a fully armed and ready-to-launch nuclear\ntipped ICBM. The Cave awaits.\n\nKey Features:\n\n* Seamlessly Spelunk - Explore a ginormous completely seamless cave-world\n  presented in astounding cross-section that will blow... your... mind.\n* Assemble a team of 3 explorers - From the Hillbilly to the Time Traveller;\n  all 7 characters have their own unique personalities, special talents and\n  a dark and secret reason for descending The Cave.\n* A Cave like no other - If you enjoy spelunking and dark rocky caverns then\n  be prepared to be disappointed. Your first clue The Cave is a place like\n  no other will be when you stumble across the subterranean amusement park\n  or the medieval castle, not to mention the fully armed and ready to launch\n  nuclear tipped missile.\n* Let's work together - Switch between the 3 characters, in cooperation with\n  each other, and solve physical and adventure puzzles as you learn the\n  truth behind why they are here. Share the cave exploring adventure with\n  friends in local co-op.\n* Unlock all the secrets of the cave - Replay the adventure with a new set\n  of characters for a whole different experience including unique story,\n  puzzles and areas of The Cave, plus hidden treasures (not redeemable for\n  cash) and collectables.\n* Watch the Cave come alive - Experience the detailed, stunning art style\n  and humor that only Ron Gilbert and Double Fine can dream up.\n\n\n 1. Unrar.\n 2. Burn or mount the image.\n 3. Install the game.\n 4. Copy the content from /Crack directory on the DVD to the \n directory of the game, overwriting existing files.\n 5. Play the game.\n 6. Support the software developers. If you like this game, BUY IT!\n","torrent":{"xt":"urn:btih:77df6ff09f61af053590ad79e229da26f63ea924","amp;dn":"The.Cave-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77df6ff09f61af053590ad79e229da26f63ea924","infoHashBuffer":{"type":"Buffer","data":[119,223,111,240,159,97,175,5,53,144,173,121,226,41,218,38,246,62,169,36]},"announce":[],"urlList":[]}}