{"title":"French Montana - Coke Boys 4  mixtape","uid":9431163,"size":98403745,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:789cdb67079609493db0d69f0c90dd41d32457f8&amp;dn=French+Montana+-+Coke+Boys+4++mixtape&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"purplefig","files":19,"time":1388806101,"description":"The Coke Boys are back at it again this year with a brand new installment of French Montana's &quot;Coke Boys&quot; mixtape series. After signing Lil Durk in 2013, this will be his first group project with French, Chinx Drugz and the Coke Boyz. Happy New Year everyone. Follow on twitter @FrenchMontana @LilDurk_ @ChinxDrugz\n\n\n1.Intro - French Montana, Chinx Drugz, Meek Mill (Prod by Black Metaphor, Rick Steel, Young Chop) \n2.Millionare Skit \n3.Millionaire Thoughts - French Montana, Chinx Drugz, Cheeze (prod by Davoughn) \n4.Paranoid Remix - French Montana, Diddy, Rick Ross, Chinx Drugz, Lil Durk, Jadakiss (prod by Young C \n5.88 Coupes - French Montana, Jadakiss (Prod. By Harry Fraud) \n6.All For You ft. Lana Del Rey, Wiz Khalifa, Snoop Dogg (prod by Cool Dre) \n7.Ballin \n8.God Body - French Montana, Chinx Drugz (prod by Harry Fraud\n9.Worst Nightmare ft. Diddy (prod by JAHLIL BEATS) \n10.Dont Waste My Time - French Montana, Chinx Drugz, Lil Durk \n11.Money Bags Intro \n12.Money Bag French Montana, Chinx Drugz, Lil Durk (prod by The Renagades) \n13.All We Know - French Montana, Chinx Drigz, Jermiah \n14.Act Like That - Lil Durk (prod by BlickieBlaze FourKings) \n15.Wit It - French Montana, Rick Ross, Mally Mall, Jazz Lazer, Detail (prod by MALLY MALL) \n16.What You Call That - French Montana, Chinx Drugz, Lil Durk (prod by BlickieBlaze Four Kings) \n17.Money And Power - Lil Durk, MeetSims (prod by Pandemik, Lofey) \n18.Soulful - French Montana, Chinx Drugz (prod by Big Byrd)\n","torrent":{"xt":"urn:btih:789cdb67079609493db0d69f0c90dd41d32457f8","amp;dn":"French+Montana+-+Coke+Boys+4++mixtape","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"789cdb67079609493db0d69f0c90dd41d32457f8","infoHashBuffer":{"type":"Buffer","data":[120,156,219,103,7,150,9,73,61,176,214,159,12,144,221,65,211,36,87,248]},"announce":[],"urlList":[]}}