{"title":"Hidden Colors 4: The Religion of White Supremacy","uid":15270572,"size":383751735,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:78b269c29d6fa3b42d37774df7d3378a1a156231&amp;dn=Hidden+Colors+4%3A+The+Religion+of+White+Supremacy+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":36,"leechers":1,"uploader":null,"files":1,"time":1468263344,"description":"http://www.imdb.com/title/tt5377130/ 7/10 rating\r\n10 sound\r\n8 video\r\n\r\nHidden Colors is a documentary about the real and untold history of people of color around the globe. This film discusses some of the reasons the contributions of African and aboriginal people have been left out of the pages of history. Traveling around the country, the film features scholars, historians, and social commentators who uncovered such amazing facts about things such as: The original image of Christ; The true story about the Moors; The original people of Asia; The great west African empires; The presence of Africans in America before Columbus; The real reason slavery was ended And much more.\r\n\r\nA religion, technically speaking, is a cultural system of behaviors and practices. This film will explain in detail exactly why &quot;white supremacy&quot; is considered the most powerful &quot;religion&quot; on the planet &amp; is followed by those who believe in white supremacy; not just in thought, but with action. No, not ALL white people believe in white supremacy. However, those that do believe in it are in fact more powerful than those who do NOT believe in it. This movie will educate black people on how to remain &quot;on code&quot; with their thoughts and behavior patterns as to not fall into the traps that white supremacy has set up for melanoid people around the world. Many melanoid (non-white) people around the world are at times afraid to talk about white supremacy. Mainly because they simply do not know what to do about it. This approach will often leave melanoid in the dark, being unable to stand up and adjust their behaviors accordingly. Knowing more about it will demystify the phenomenon that is white supremacy and bring clarity, resulting in less confusion and frustration.\r\n\r\nBut Egypt had slaves before Europeans came back to Africa as did other tribes. You cant have Masai and Zulu warriors without war","torrent":{"xt":"urn:btih:78b269c29d6fa3b42d37774df7d3378a1a156231","amp;dn":"Hidden+Colors+4%3A+The+Religion+of+White+Supremacy+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78b269c29d6fa3b42d37774df7d3378a1a156231","infoHashBuffer":{"type":"Buffer","data":[120,178,105,194,157,111,163,180,45,55,119,77,247,211,55,138,26,21,98,49]},"announce":[],"urlList":[]}}