{"title":"Glenn Greenwald - No Place to Hide (epub, mobi)","uid":10144759,"size":19501652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7aa9964690d3867c0296c2ca83198f6b5b0a7264&amp;dn=Glenn+Greenwald+-+No+Place+to+Hide+%28epub%2C+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":2,"uploader":"pharmakate","files":-1,"time":1400039449,"description":"Glenn Greenwald - No Place to Hide: Edward Snowden, the NSA and the Surveillance State (Penguin, 2014)\n\nRetail quality epub; calibre-converted mobi\n\n\ndescription:\n\nGlenn Greenwald's No Place to Hide is the story of one of the greatest national security leaks in US history. In June 2013, reporter and political commentator Glenn Greenwald published a series of reports in the Guardian which rocked the world. The reports revealed shocking truths about the extent to which the National Security Agency had been gathering information about US citizens and intercepting communication worldwide, and were based on documents leaked by former National Security Agency employee Edward Snowden to Greenwald. Including new revelations from documents entrusted to Greenwald by Snowden, this essential book tells the story of Snowden and the NSA and examines the far-reaching consequences of the government's surveillance program, both in the US and abroad.\n\n'The first thing I do when I turn on the computer in the morning is go to Glenn Greenwald's blog. He is truly one of our greatest writers right now'\n--Michael Moore\n\n'The most important voice to have entered the political discourse in years'\n--Bill Moyers\n\nGlenn Greenwald is the author of several US bestsellers, including How Would A Patriot Act?, and A Tragic Legacy. Acclaimed as one of the twenty-five most influential political commentators by The Atlantic, Greenwald is a former constitutional law and civil rights attorney. He has been a columnist for the Guardian since August 2012 and his work has appeared in numerous newspapers and political news magazines, including The New York Times and the Los Angeles Times.","torrent":{"xt":"urn:btih:7aa9964690d3867c0296c2ca83198f6b5b0a7264","amp;dn":"Glenn+Greenwald+-+No+Place+to+Hide+%28epub%2C+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aa9964690d3867c0296c2ca83198f6b5b0a7264","infoHashBuffer":{"type":"Buffer","data":[122,169,150,70,144,211,134,124,2,150,194,202,131,25,143,107,91,10,114,100]},"announce":[],"urlList":[]}}