{"title":"Lesbian Sex Bible - The New Guide to Sexual Love for Same-Sex Co","uid":11186922,"size":27641030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ac969cdc387b2a78606fdf395e2f9b66f439e83&amp;dn=Lesbian+Sex+Bible+-+The+New+Guide+to+Sexual+Love+for+Same-Sex+Co&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"Lucian_","files":-1,"time":1412934198,"description":"Lesbian Sex Bible: The New Guide to Sexual Love for Same-Sex Couples\nby Diana Cage\nQuiver | October 2014 | ISBN-10: 1592336140 | ePUB | 148 pages | 26.3 mb\n\nModern techniques and advice for lesbian, bisexual, and queer women.\nThe Lesbian Sex Bible is a fresh, funny, irreverent, and inclusive look at lesbian sexuality. This book encourages women to talk freely about sex, to deepen and expand their sexual knowledge, and it empowers women of all sexual identities to have the hottest sex possible. Lesbian, bisexual, bicurious, trans, butch, femme, androgynous, seasoned dykes, and curious new comers alike will want to keep this book on the nightstand.\nFilled with explicit techniques and tips for the hottest sex imaginable, each chapter focuses on individual elements of lesbian sex while also providing frank advice about lesbian dating and relationships, gender, identity, and sexual culture.\nHighlighting strategies for sexual satisfaction and erotic empowerment, The Lesbian Sex Bible is a comprehensive guide for lesbians and all women interested in expanding their sexual knowledge.\n\nAbout the Author\nDiana Cage has been writing about lesbian sexuality for more than a decade. She is the former editor of On Our Backs, the first lesbian porn magazine made by women for women and the author of seven previous books: The On OurBacks Guide to Lesbian Sex, On Our Backs: The Best Erotic Fiction, Box Lunch: The Layperson's Guide to Cunnilingus, Threeways: Fulfill Your Ultimate Fantasy, Bottoms Up: Writing about Sex, Girl Meets Girl: A Dating Survival Guide, and Mind-Blowing Sex: A Woman's Guide. She has written about sex and sexuality for dozens of publications and was formerly host of The Diana Cage Show on Sirius XM. Diana holds an MFA from San Francisco State University and teaches in the Women and Gender Studies department at Hunter College.\n\nCONTENTS\nIntroduction\n01. Getting in the Mood\n02. Tell Me What You Want\n03. Lesbians and Labels\n04. Lay of the Land\n05. Orgasms\n06. Give Her a Hand\n07. Going Down\n08. Strap-on Sex\n09. Anal Play\n10. The Prop Department\n11. A Little Bit Kinky\n12. Sexual Culture\n13. Caring for Your Sexual Self\nResources\nGlossary\nIndex","torrent":{"xt":"urn:btih:7ac969cdc387b2a78606fdf395e2f9b66f439e83","amp;dn":"Lesbian+Sex+Bible+-+The+New+Guide+to+Sexual+Love+for+Same-Sex+Co","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ac969cdc387b2a78606fdf395e2f9b66f439e83","infoHashBuffer":{"type":"Buffer","data":[122,201,105,205,195,135,178,167,134,6,253,243,149,226,249,182,111,67,158,131]},"announce":[],"urlList":[]}}