{"title":"The Punisher (v1 - v9 + Mini-Series, One-shots + Extras) (1986 -","uid":11390888,"size":14733907573,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7ae088191020e4ab720f941fa8d2a2cfd0206a1c&amp;dn=The+Punisher+%28v1+-+v9+%2B+Mini-Series%2C+One-shots+%2B+Extras%29+%281986+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":23,"uploader":"nemesis43","files":758,"time":1415325396,"description":"The Punisher (v1 - v9 + Mini-Series, One-shots + Extras) (1986 - Ongoing)\n\n\n\nAfter his family was killed by the mob, US Marine veteran Frank Castle became an army of one in the war against organized crime. The symbol of death's head emblazoned on his chest, he is now the violent force of nature known as The Punisher.\n\nA dedicated US Marine excelling as a soldier in every way, Frank Castle was a force to be reckoned with during the Vietnam War but also a dedicated family man - which proved to be his salvation. After a particularly close call in the closing years of the war, he resigned to a Special Forces instructor post in upstate New York so he could be closer to his wife Maria and two children, Lisa and Francis.\n\nThings finally seemed to calm down for them as Frank once more learned to live life in peace. However, disaster struck when Frank and his family went for a pick-nick in Central Park. There they were witnesses to a mob execution. Causing the mob to fire on the family as well, fatally hitting Maria, Lisa and Francis. Frank was also gunned down but survived.\n\nIn the hospital, Frank found that he not only couldn't move on with his life, but the mob didn't want him to either and neither could he find justice within a corrupt system bought off by powerful criminals.\n\nThese events were the trigger for Frank Castle to become the Punisher. He went AWOL from the Corps and began his legendary career as tormented vigilante.\n\nHe donned a black battle suit emblazoned with the image of a white death's head on his chest; first seeking vengeance for his family and next applying his skills to criminals and murderers the world over. In time he would rack up an immeasurable body count as he put his past life behind him and entered the never-ending war against crime","torrent":{"xt":"urn:btih:7ae088191020e4ab720f941fa8d2a2cfd0206a1c","amp;dn":"The+Punisher+%28v1+-+v9+%2B+Mini-Series%2C+One-shots+%2B+Extras%29+%281986+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ae088191020e4ab720f941fa8d2a2cfd0206a1c","infoHashBuffer":{"type":"Buffer","data":[122,224,136,25,16,32,228,171,114,15,148,31,168,210,162,207,208,32,106,28]},"announce":[],"urlList":[]}}