{"title":"Kama Sutra: A Modern Guide to the Ancient Art of Sex","uid":11431976,"size":43697617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7bd546a1aeacd3f8c7981627556d0a3aed2d7cba&amp;dn=Kama+Sutra%3A+A+Modern+Guide+to+the+Ancient+Art+of+Sex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":1,"uploader":"Jallentino","files":-1,"time":1415730669,"description":"Nitya Lacroix, &quot;Kama Sutra: A Modern Guide to the Ancient Art of Sex&quot; \nEnglish | ISBN: 1629142077 | 2014 | 188 pages | EPUB | 41 MB\n\nSex expert Nitya Lacroix brings an energetic new take to ancient sex techniques and positions in &quot;Kama Sutra.&quot; This lively and inspirational text offers new and exciting insights into the Kama Sutra's teachings and explores every aspect of a sexual relationship, including sexual attraction, wooing and wowing, foreplay, and arousal. Supercharged erotic photography, supported by beautiful and explicit Indian artworks, illustrates the unique sequences for sensational sex. However, &quot;Kama Sutra: A Modern Guide to the Ancient Art of Sex&quot; is not just another catalogue of positions: Nitya Lacroix describes seven incredible sexual sequences that demonstrate how the postures described in the Kama Sutra were intended to flow into each other easily and elegantly. This sumptuous yet highly practical guide reinterprets the sexual practices of ancient India for the enjoyment of modern Western lovers, and explains how each sexual position excites and delights men and women in very different ways","torrent":{"xt":"urn:btih:7bd546a1aeacd3f8c7981627556d0a3aed2d7cba","amp;dn":"Kama+Sutra%3A+A+Modern+Guide+to+the+Ancient+Art+of+Sex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bd546a1aeacd3f8c7981627556d0a3aed2d7cba","infoHashBuffer":{"type":"Buffer","data":[123,213,70,161,174,172,211,248,199,152,22,39,85,109,10,58,237,45,124,186]},"announce":[],"urlList":[]}}