{"title":"Lonely Planet Philippines[MyebookShelf]","uid":11814459,"size":66556744,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c2467bfa7d25ccccffbed9b2c0e45d1ea5ee491&amp;dn=Lonely+Planet+Philippines%5BMyebookShelf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":2,"uploader":"MyeBookShelf","files":3,"time":1429024947,"description":"Lonely Planet Philippines[MyebookShelf] &lt;a href=&quot;\nhttp://s17.postimg.org/lnalh57e3/Lonely_Planet_Philippines.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s17.postimg.org/lnalh57e3/Lonely_Planet_Philippines.jpg&lt;/a&gt;\nISBN: 1742207839 | 2015 | EPUB | 480 pages | 63 MB\n\nLonely Planet Philippines is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Swim at secluded beaches in the Bacuit Archipelago, take part in a colourful fiesta, dive remote reefs and magnificent walls at Apo Island or Balicasag; all with your trusted travel companion. Get to the heart of the Philippines and begin your journey now!\n\nInside Lonely Planet Philippines Travel Guide:\n\nColour maps and images throughout\nHighlights and itineraries help you tailor your trip to your personal needs and interests\nInsider tips to save time and money and get around like a local, avoiding crowds and trouble spots\nEssential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\nHonest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\nCultural insights give you a richer, more rewarding travel experience - history, etiquette, people, culture, politics, environmental issues, landscapes, wildlife, cuisine.\nOver 90 maps\nCovers Manila, Corregidor, Luzon, Zambales Coast, Lingayen Gulf, Ilocos, the Cordillera, Batanes, Bicol, Masbate, Catanduanes, Marinduque, Mindoro, Boracay, the Visayas, Negros, Cebu, Bohol, Samar, Mindanao, Palawan and more\n\nThe Perfect Choice: Lonely Planet Philippines, our most comprehensive guide to the Philippines, is perfect for both exploring top sights and taking roads less travelled.\n\nLooking for more extensive coverage? Check out Lonely Planet Southeast Asia on a shoestring guide for a comprehensive look at all the region has to offer.\n\nAuthors: Written and research by Lonely Planet, Michael Grosberg, Greg Bloom, Trent Holden, Anna Kaminski and Paul Stiles","torrent":{"xt":"urn:btih:7c2467bfa7d25ccccffbed9b2c0e45d1ea5ee491","amp;dn":"Lonely+Planet+Philippines%5BMyebookShelf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c2467bfa7d25ccccffbed9b2c0e45d1ea5ee491","infoHashBuffer":{"type":"Buffer","data":[124,36,103,191,167,210,92,204,207,251,237,155,44,14,69,209,234,94,228,145]},"announce":[],"urlList":[]}}