{"title":"RollerCoaster Tycoon 3 Platinum Edition GOG","uid":8199470,"size":658732890,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7e093305536ed0b9c1b0083cb6be51bd4b55999f&amp;dn=RollerCoaster+Tycoon+3+Platinum+Edition+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1361985605,"description":"    genre    simulation / building / managerial\n    download size    526 MB\n    release date    November 7, 2006\n    compatible with    Windows (XP, Vista, 7, 8)\n    languages    English\n    developer / publisher    Frontier Developments / Atari\n    game modes    single-player\n\n    Bonus content included for FREE with purchase:\n    3 manuals\n    soundtrack\n    2 avatars\n\nclick on a thumbnail to enlarge the screenshot\nWhat's cool about it:\n\n    The platinum edition includes two expansion packs: Soaked! and Wild!, each with its own set of scenarios, cool rides, and objects to place around your virtual theme park.\n    Surprisingly deep and complex strategy game, yet very light hearted, colorful, and accessible.\n    Endless construction possibilities. Build the rollercoaster of your dreams: you choose the route, configure the slopes, add loops, barrel rolls, and other thrilling elements. You can even ride your roller coaster along with your guests!\n    Hundreds of types of rides, coasters, food stands, firework shows, decorations, and amenities.\n\nOverview:\n\nRollercoaster Tycoon 3: Platinum! is probably the most deep and complex theme park simulator ever conceived. At the same time it is surprisingly fun and accessible. You will build, manage, and even experience all of the elements that make for a world-class theme park.\n\nEndless possibilities await. You can create your own roller coasters: from gentle flume rides to heart-chilling, gut-busting wild mouse rides that fling you around like dice in a cup. Then add other rides, food stands, and amenities to create the ultimate magical experience for your guests.\n\nBuilding fun stuff is not the only thing you will do in Rollercoaster Tycoon 3: Platinum! Your theme park needs proper management: you will hire people, juggle incomes and expenses and, most importantly, keep your visitors happy.\n\nCustomisation is a big thing in Rollercoaster Tycoon 3: Platinum! Not only you can create your own rollercoasters, you can also set up scenic routes and even make your own firework and laser shows.\n\nAge requirements: ESRB Rating: EVERYONE with Comic Mischief, Mild Violence., PEGI Rating: 3+\n\nMinimum system requirements: Windows XP / Windows Vista / Windows 7, 1.8 GHz Processor, 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended), 2GB HDD, Mouse, Keyboard.\n\nInstall and Play.","torrent":{"xt":"urn:btih:7e093305536ed0b9c1b0083cb6be51bd4b55999f","amp;dn":"RollerCoaster+Tycoon+3+Platinum+Edition+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e093305536ed0b9c1b0083cb6be51bd4b55999f","infoHashBuffer":{"type":"Buffer","data":[126,9,51,5,83,110,208,185,193,176,8,60,182,190,81,189,75,85,153,159]},"announce":[],"urlList":[]}}