{"title":"Refused Discography","uid":4487274,"size":459278063,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7e0fccaf22607fcb77ac390fd07c8b404c299a8c&amp;dn=Refused+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":4,"uploader":"zf1223","files":129,"time":1225823195,"description":"Refused was a hardcore band originating from UmeÃƒÆ’Ã‚Â¥, Sweden. They formed in early 1991 with Dennis LyxzÃƒÆ’Ã‚Â©n, David SandstrÃƒÆ’Ã‚Â¶m, PÃƒÆ’Ã‚Â¤r Hansson and Jonas Lidgren and released their first demo, Refused, the same year. The band went on to release one more demo, five EPs and three albums (not including The Demo Compilation or The EP Compilation) before breaking up in 1998. Refused's final line-up consisted of the members Dennis LyxzÃƒÆ’Ã‚Â©n, David SandstrÃƒÆ’Ã‚Â¶m, Kristofer Steen and Jon BrÃƒÆ’Ã‚Â¤nnstrÃƒÆ’Ã‚Â¶m who released everything from Songs to Fan the Flames of Discontent (1996) to the definitive album The Shape of Punk to Come. In this album, Refused drew heavily on the influence of the Washington, D.C. hardcore band Nation of Ulysses, New York hardcore band Born Against, as well as the writings of Karl Marx, anarchist Errico Malatesta, and the Situationist International. The band were already well known for their vegan and straight edge stances. Refused broke up the same year as a result of expending all their creative energy and wanting different things.\n\nAfter releasing The Shape of Punk To Come, Refused decided to do one final tour in the United States. With tension in the band running high, everything finally collided only a few shows into the tour. The band decided to call it quits after a show in Atlanta, Georgia. Flights were booked back to Sweden, and the band set out towards the Reagan International Airport. Fred Ziomek, guitarist for tourmates Darkest Hour, convinced the band to play one last show in his basement en route to National Airport. They agreed, and even though there were only around twelve hours to promote the show, there were still around four-hundred people in attendance.\nThe line-up was: Union of the Snake (Cornbread's joke glam-metal band), Darkest Hour, Frodus, and Refused.\nThe police kept coming by all night, and Tony Weinbender, who had been put in charge of organizing everything, kept them at bay for a while. The police returned during Frodus' set, and said &quot;If we get another complaint and have to come back here, we're taking you to jail.&quot; Weinbender told the policemen he would shut the show down, but a few songs into Refused's set, police entered the house and plowed through the throng of people to get to the basement. The band began playing what would be their final song, &quot;Rather Be Dead&quot;, as the police forced their way through the crowd. The song reached the crescendo where Dennis would have screamed, &quot;rather be alive&quot;, as the plug was pulled (literally), and the band stopped playing. The audience continued chanting the final verses of the song, &quot;rather be alive!&quot;\n\nREFUSED ARE DEAD - LONG LIVE REFUSED!","torrent":{"xt":"urn:btih:7e0fccaf22607fcb77ac390fd07c8b404c299a8c","amp;dn":"Refused+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e0fccaf22607fcb77ac390fd07c8b404c299a8c","infoHashBuffer":{"type":"Buffer","data":[126,15,204,175,34,96,127,203,119,172,57,15,208,124,139,64,76,41,154,140]},"announce":[],"urlList":[]}}