{"title":"Simpo PDF Merge and Split v2.2.2 WinAll Incl Keygen-FALLEN [TorD","uid":8760219,"size":4096283,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7e811dedb4e5757749bd84c51d3c34889f534f16&amp;dn=Simpo+PDF+Merge+and+Split+v2.2.2+WinAll+Incl+Keygen-FALLEN+%5BTorD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":5,"uploader":"TorDigger","files":13,"time":1375229140,"description":"Simpo PDF Merge Split\n\nMerge and combine multiple PDF files into a single PDF and split one PDF into separated individual PDFs.\n\n-Merge PDF files in two ways - partial and whole\n\n-Extract any pages from a PDF to save as a new PDF\n\n-Delete specific pages from a PDF file\n\n-Merge and split encrypted PDF files on Windows 8\n\nSimpo PDF Merge &amp; Split is designed to merge PDF and split PDF. With this excellent tool, you can not only easily combine a collection of PDF files into a single PDF, either the entire PDF or just several pages of them, but it also lets you split a PDF to separated PDFs, or extract extract a range of pages from a PDF document, remove or delete a page or several pages from a PDF. It supports to merge and split encrypted PDF files.\n\nFeatures:\n\nMerge multiple PDF files\nJust import a batch of PDF files and merge them entirely with all pages to a single PDF; if you want to merge some pages in a PDF, you can specify the page ranges to merge with another PDF. Encrypted PDF files are supported.\n\nMerge encrypted PDF files\nFor PDF files with owner password that restricts printing, copying and editing, you can directly merge them into one PDF ; but for user-password-encrypted PDF files, you have to enter the right password to unlock them first for merging.\n\nSet password to protect merged PDF\nYou can add simple but secure password protection to prevent printing, changing, copying or extracting with owner password, and do not allow opening by setting a user password.\n\nDigital certificates claims\nTo claim rights that you are the owner of those merged PDF files, you can insert the Meta Data information, such as Author, Title, Subject and Keywords.\n\nSupport multi language interface\nUntil now, English, Italian, Portuguese, German, French, Spanish, Traditional Chinese, Simplified Chinese are available for your convenience to use Simpo PDF Creator Pro for creating PDF files.\n\nSupported OS:\n\nWindows 8, Windows 7, Windows Vista and Windows XP\n\nHomepage: http://www.simpopdf.com/pdf-merge-split.html\n\nInstallation Instructions:\n\n- Install program.\n- Rrun keygen to get valid serial to register application.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:7e811dedb4e5757749bd84c51d3c34889f534f16","amp;dn":"Simpo+PDF+Merge+and+Split+v2.2.2+WinAll+Incl+Keygen-FALLEN+%5BTorD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e811dedb4e5757749bd84c51d3c34889f534f16","infoHashBuffer":{"type":"Buffer","data":[126,129,29,237,180,229,117,119,73,189,132,197,29,60,52,136,159,83,79,22]},"announce":[],"urlList":[]}}