{"title":"[DvdRip-Xvid-Ita-Mp3]Harry Potter e l Ordine della Fenice[surviv","uid":5117411,"size":1343959040,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7ea20f951bd2b66b6053950fbae4233ea25f3a67&amp;dn=%5BDvdRip-Xvid-Ita-Mp3%5DHarry+Potter+e+l+Ordine+della+Fenice%5Bsurviv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":36,"leechers":2,"uploader":"mitimex","files":1,"time":1255132668,"description":"\n\n\nE' stata un'estate lunga e solitaria per Harry Potter, trascorsa nell'attesa di tornare alla Scuola di Magia e Stregoneria di Hogwarts per frequentare il quinto anno. Non solo ha dovuto sopportare di vivere ospite degli odiosi Dursley, ma non ha ricevuto neppure un biglietto dai suoi amici e compagni di classe Ron Weasley e Hermione Granger. E nessuno che abbia detto una parola sul suo scontro con il perfido Lord Voldemort. L'unica lettera ad essergli arrivata non ÃƒÂ¨ certo quella che sperava, infatti annuncia la sua espulsione da Hogwarts per aver usato le arti magiche fuori della scuola e soprattutto in presenza di un Babbano, nella persona del disgustoso cugino Dudley. La sentenza non considera minimamente che si ÃƒÂ¨ trattato di un atto di difesa da un inspiegabile e inaspettato attacco di due Dissennatori.\nL'unica speranza di Harry ÃƒÂ¨ difendersi davanti a quello che non ÃƒÂ¨ altro che un tribunale illegale messo in piedi dal Ministro della Magia, Cornelius Caramell, che ha le sue ragioni per volersi sbarazzare del giovane mago. Purtroppo per Caramell, Harry viene completamente scagionato grazie all'intervento del venerabile preside di Hogwarts, Albus Silente, ma per la prima volta il suo ritorno a scuola ÃƒÂ¨ penoso e non piacevole. Scopre infatti che la comunitÃƒÂ  dei maghi ÃƒÂ¨ stata portata a credere che la storia del suo scontro con Voldemort sia una bugia bella e buona, mettendo quindi in dubbio la sua credibilitÃƒÂ .\nHarry si sente solo e ferito e la notte ÃƒÂ¨ tormentato da incubi che sembrano annunciare eventi sinistri. E per di piÃƒÂ¹ l'unica persona da cui vorrebbe ricevere consigli, il professor Silente, appare improvvisamente distante.\nNel frattempo, nel tentativo di tenere sotto controllo Silente e gli studenti di Hogwarts, in particolare Harry, Caramell ha nominato come nuovo insegnante di Difesa contro le Arti Oscure, l'ambigua professoressa Dolores Umbridge. Ma questo nuovo corso-approvato-dal-ministero lascia i giovani maghi completamente inermi e incapaci di difendersi dalle Forze Oscure che li minacciano. CosÃƒÂ¬, sollecitato da Hermione e Ron, Harry viene convinto a occuparsi della faccenda. Incontra segretamente un piccolo gruppo di coraggiosi studenti che si fanno chiamare &quot;Esercito di Silente&quot; e insegna loro come difendersi contro le Arti Oscure, preparandoli alla straordinaria battaglia che li aspetta.\n","torrent":{"xt":"urn:btih:7ea20f951bd2b66b6053950fbae4233ea25f3a67","amp;dn":"%5BDvdRip-Xvid-Ita-Mp3%5DHarry+Potter+e+l+Ordine+della+Fenice%5Bsurviv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ea20f951bd2b66b6053950fbae4233ea25f3a67","infoHashBuffer":{"type":"Buffer","data":[126,162,15,149,27,210,182,107,96,83,149,15,186,228,35,62,162,95,58,103]},"announce":[],"urlList":[]}}