{"title":"Wargame.AirLand.Battle-RELOADED","uid":8521965,"size":7824789181,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7ec92e30c2852ee045b8eb17c26a133a6b4cc2ab&amp;dn=Wargame.AirLand.Battle-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":8,"uploader":"Mr.Stifmeister","files":-1,"time":1369934935,"description":"\nnERv\n\nWargame: AirLand Battle (c) FOCUS\n\n05/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\nReleased in early 2012, Wargame: European Escalation by Eugen Systems\nmanaged to become the new benchmark in real-time strategy games, praised by\ncritics and players alike. Wargame: AirLand Battle is about to bring the\nseries to the next level as a full-fledged sequel\nBetween 1975 and 1985, war between NATO and the Warsaw Pact is still\nraging, reaching Northern Europe, notably Scandinavia, whose architecture\nmagnificent landscapes are faithfully recreated in the game.\nWhile the first Wargame made quite an impression with its powerful engine,\nWargame: AirLand Battle is making a huge leap forward with its visuals,\nbringing a level of detail never before seen in a real-time strategy game.\nFlat relief and lack of variety is now a thing of the past, as the new\nversion of the IRISZOOM Engine displays spectacular graphics, with a huge\nvariety of units, scenery and impressive topography reproduced from\nsatellite maps\nCommand all the military resources of the Cold War era, from tanks to\nplanes which make an outstanding entrance in the series A total of 150\nplanes strengthen the playable arsenal of the game, from fighters to bombers\nto electronic warfare planes. Four new nations and their vehicles join the\noriginal eight from the first game, making a total of over 750 vehicles and\ncombat units rendered in realistic detail with new textures\nIn Wargame: AirLand Battle, realism is also strengthened thanks to a new\nweapons system, better handling of fire and its effects, and a new\nUrban Combat Interface (UCI) allowing for battle inside cities block by\nblock to take them over\nThe solo part of the game is composed of several new dynamic campaigns,\nduring which you will manage all aspects of the battle. Lead each squad of\nthe Theatre of Operation, and make good use of your reinforcements and\nstrategic support. Each decision you make has an impact on the tactical\noutcome of battles, and also impacts the evolution of the global conflict\nWargame: AirLand Battle still allows you to customize your own army in solo\nand multiplayer modes, thanks to the Deck system, which is now being\nenhanced with an integrated viewer\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the Game\n4. Copy the crack from Crack dir to your install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:7ec92e30c2852ee045b8eb17c26a133a6b4cc2ab","amp;dn":"Wargame.AirLand.Battle-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ec92e30c2852ee045b8eb17c26a133a6b4cc2ab","infoHashBuffer":{"type":"Buffer","data":[126,201,46,48,194,133,46,224,69,184,235,23,194,106,19,58,107,76,194,171]},"announce":[],"urlList":[]}}