{"title":"Motion 5.1.1 &amp;ndash; Create and Customize Final Cut Pro titles(M","uid":10468098,"size":1671336239,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:7ecfb61165d1b9867a62b61ae285bd79abb7f5f4&amp;dn=Motion+5.1.1+%26ndash%3B+Create+and+Customize+Final+Cut+Pro+titles%28M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"Inter95","files":-1,"time":1404226544,"description":"Motion is designed for video editors, Motion 5 lets you customize Final Cut Pro titles, transitions, and effects. Or create Motionyour own dazzling animations in 2D or 3D space, with real-time feedback as you work.\n \nBreakthrough Speed and Quality\nNew 64-bit architecture supports deeper, multilayered effects for use in Final Cut Pro.\nColorSync-managed color pipeline produces accurate, consistent color across applications.\nShared Render Engine provides consistent quality with Final Cut Pro and Compressor.\nRendering uses floating-point, linear-light color space for exceptionally realistic results.\nMotion taps the GPU on the graphics card for high-speed rendering and exporting.\n \nEditor-Friendly Design Tools\nWork fast using a single-window interface with a familiar look and feel.\nCustomize Final Cut Pro titles, effects, and transitions by opening them in Motion.\nCreate Smart Motion Templates with simple controls for making changes as you edit.\nBuild stunning 2D and 3D compositions with more than 1900 Apple-designed elements.\nMake adjustments to any parameter during playback and instantly see results.\n \nEasy Animated Text and Titles\nDesign dramatic text effects with complete control over position, opacity, rotation, and more.\nAnimate text instantly by choosing from more than 200 text behaviors such as Type On.\nBuild a credit roll by importing a text file; the Scroll behavior optimizes the speed for you.\nMove, scale, or rotate a single character with the Adjust Glyph tool.\nRipple text one character, word, or line at a time with the Sequence Text behavior.\n \nStunning Effects\nChoose from more than 230 behaviors for natural-looking motion without programming.\nEnhance your 2D or 3D animations with more than 130 filters using the FxPlug 2 standard.\nTrack a moving object in a video clip with the point tracking and match move feature.\nCreate an accurate chroma key in a single step with the new Keying filter.\nApply the Linking behavior to make parameters for one object animate related objects.\nUse SmoothCam to eliminate camera jitters, and image stabilization to smooth bumpy shots.\n \nEffortless 3D\nTransition from 2D to 3D space by adding a camera or cameras to any 2D project.\nSet up realistic shadows that animate dynamically with the movement of cameras and lights.\nTurn any shape, video plane, or paint stroke into a reflective surface.\nHighlight or de-emphasize various objects by defining a range of focus.\nTrack objects or groups of objects with the Camera Framing behavior.\n \nQuick, High-Quality Output\nExport projects to Apple devices and popular websites such as Vimeo and YouTube.\nChoose to output the ProRes 4444 format for uncompressed quality at small file sizes.","torrent":{"xt":"urn:btih:7ecfb61165d1b9867a62b61ae285bd79abb7f5f4","amp;dn":"Motion+5.1.1+%26ndash%3B+Create+and+Customize+Final+Cut+Pro+titles%28M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ecfb61165d1b9867a62b61ae285bd79abb7f5f4","infoHashBuffer":{"type":"Buffer","data":[126,207,182,17,101,209,185,134,122,98,182,26,226,133,189,121,171,183,245,244]},"announce":[],"urlList":[]}}