{"title":"The Politics Book - DK [PDF] [StormRG]","uid":10463769,"size":36076083,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ff92021bf6ed3d8723a09040fbd94e62ac3722f&amp;dn=The+Politics+Book+-+DK+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"krystine","files":-1,"time":1404166736,"description":"The Politics Book\nAuthor: DK Publishing\nPublished: 2013\nPublisher: DK Publishing\nISBN: 9781465413796\nFormat: Retail PDF\nReader Required:Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nThe Politics Book clearly and simply explains more than one hundred groundbreaking ideas in the history of political thought.\n\nUsing easy-to-follow graphics and artworks, succinct quotations, and thoroughly accessible text, The Politics Book elucidates the theoretical foundations-as well as the practical applications-of political thought, making abstract concepts concrete.\n\nThe Politics Book includes innovative ideas from ancient and medieval philosophers ranging from Confucius and Thomas Aquinas to revolutionary thought leaders such as Thomas Jefferson and Leon Trotsky. The voices that have shaped modern politics today, from Mao Zedong to Malcolm X, are also included, giving anyone with an interest in politics an essential resource to political thinking and policy.\n\nThe Politics Book includes:\n\n- Key ideas from more than one hundred of the great politicians and political thinkers from antiquity to present day\n- Biographies and context boxes to give the full historical context of each idea\n- A reference section with a glossary of political terms and a directory of political thinkers\n\nThe clear and concise summaries, graphics, and quotations in The Politics Book will help even the complete novice understand the fascinating world of political thought.\n","torrent":{"xt":"urn:btih:7ff92021bf6ed3d8723a09040fbd94e62ac3722f","amp;dn":"The+Politics+Book+-+DK+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ff92021bf6ed3d8723a09040fbd94e62ac3722f","infoHashBuffer":{"type":"Buffer","data":[127,249,32,33,191,110,211,216,114,58,9,4,15,189,148,230,42,195,114,47]},"announce":[],"urlList":[]}}