{"title":"ArcticMonkeys [2009] Humbug 320K [Cov+CD][Bubanee]","uid":5063684,"size":95297466,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8043826916558af0576b2aa4b878639bf2582664&amp;dn=ArcticMonkeys+%5B2009%5D+Humbug+320K+%5BCov%2BCD%5D%5BBubanee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":0,"uploader":"bubanee","files":12,"time":1250824355,"description":"In this Collection Of CD Rip 320Kbps MP3\nI have provided the open cover and CD Jpegs [Pictures]\nPlease SEED for others to Enjoy!\nCheers, Bubanee\n\nHumbug is the third album by the British band Arctic Monkeys. Like their last release - 2007's Favourite Worst Nightmare - Humbug was released first in Japan, on 19 August 2009, followed by Australia, Brazil and Germany, on 21 August 2009. It will then be released in the UK on 24 August 2009, in the US the following day  and in Greece on 31 August  The release precedes the band's headline performances at the Reading and Leeds Festivals at the end of that week. The album's cover was revealed on the band's website on 22 June 2009.\n\n1. \t&quot;My Propeller&quot;   \t3:28\n2. \t&quot;Crying Lightning&quot;   \t3:42\n3. \t&quot;Dangerous Animals&quot;   \t3:24\n4. \t&quot;Secret Door&quot;   \t3:41\n5. \t&quot;Potion Approaching&quot;   \t3:32\n6. \t&quot;Fire and the Thud&quot;   \t3:50\n7. \t&quot;Cornerstone&quot;   \t3:17\n8. \t&quot;Dance Little Liar&quot;   \t4:43\n9. \t&quot;Pretty Visitors&quot;   \t3:40\n10. \t&quot;The Jeweller's Hands&quot;  \n\nArctic Monkeys are an English alternative rock band from High Green, a suburb of Sheffield. Formed in 2002, the band currently consists of Alex Turner (lead vocals, guitar), Jamie Cook (guitar), Nick O'Malley (bass guitar, backing vocals) and Matt Helders (drums, backing vocals).\n\nArctic Monkeys achieved chart success with their second single, &quot;I Bet You Look Good on the Dancefloor&quot;, which reached number one in the UK Singles Chart. Their debut album Whatever People Say I Am, That's What I'm Not, released in January 2006, became the fastest-selling debut album in British music history, surpassing Oasis's Definitely Maybe and remaining the fastest-selling debut album for a band. It received critical acclaim, winning both the 2006 Mercury Prize and the 2007 BRIT Award for Best British Album. It was also nominated for the Grammy Award for Best Alternative Music Album, but lost to Gnarls Barkley's St. Elsewhere. The band's second album, Favourite Worst Nightmare, was released on 23 April 2007, sold over 225,000 copies in its first week, and was nominated for the 2007 Mercury Prize. The group also picked up the award for Best British Album and Best British Group at the 2008 BRIT Awards.\n\nArctic Monkeys were heralded as one of the first acts to come to the public attention via the Internet (fan-based sites rather than from the band), with commentators suggesting they represented the possibility of a change in the way in which new bands are promoted and marketed. The band eventually signed to the independent record label Domino","torrent":{"xt":"urn:btih:8043826916558af0576b2aa4b878639bf2582664","amp;dn":"ArcticMonkeys+%5B2009%5D+Humbug+320K+%5BCov%2BCD%5D%5BBubanee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8043826916558af0576b2aa4b878639bf2582664","infoHashBuffer":{"type":"Buffer","data":[128,67,130,105,22,85,138,240,87,107,42,164,184,120,99,155,242,88,38,100]},"announce":[],"urlList":[]}}