{"title":"Amy Winehouse  Discografia De Luxe.","uid":4594946,"size":790141498,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:80a0439ba1e2fff98727ee0381a0c0fab8495d70&amp;dn=Amy+Winehouse++Discografia+De+Luxe.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":3,"uploader":"cholo24","files":85,"time":1229971212,"description":"Amy Winehouse\n\nLa cantante y compositora de jazz y soul Amy Winehouse naciÃƒÂ³ el 14 de septiembre de 1983 en Camden (Londres), en el seno de una familia judÃƒÂ­a de gran tradiciÃƒÂ³n musical.\n\nCuando tenÃƒÂ­a 10 aÃƒÂ±os, Amy Winehouse fundÃƒÂ³ una banda de rap, cuyo nombre era Sweet 'n' Sour. Amy tambien estudiÃƒÂ³ cursos de interpretaciÃƒÂ³n en el Sylvia Young Theatre School, pero fue expulsada a los 13 aÃƒÂ±os por sus flojos resultados y su indisciplina.\n\nSu amigo Tyler James ofreciÃƒÂ³ una maqueta suya a un productor y con 16 aÃƒÂ±os firmÃƒÂ³ su primer contrato musical con Island/Universal.\n\nEn 2003 aparece publicado el primer ÃƒÂ¡lbum de Amy Winehouse, que lleva por tÃƒÂ­tulo &quot;Frank&quot; y que fue nominado a los Premios Mercury Music. TambiÃƒÂ©n ganÃƒÂ³ un Ivor Novello award en 2004 gracias al sencillo &quot;Stronger than Me&quot;.\n\nEn 2006 Amy Winehouse publica su segundo trabajo, titulado &quot;Back to Black&quot;. Gracias a este disco, Amy gana en 2007 un Brit award como Mejor Artista BritÃƒÂ¡nica. En junio de 2007, Amy Winehouse vuelve a ser nominadoa a los Mercury Prize y a los MTV Video Music Awards 2007.\n\nEn febrero del 2008 Amy Winehouse resulta ser la gran ganadora de los Grammy de ese aÃƒÂ±o, consiguiendo 5 de los 6 premios a los que optaba, entre ellos el de Mejor nuevo artista, GrabaciÃƒÂ³n del aÃƒÂ±o, CanciÃƒÂ³n del aÃƒÂ±o, Mejor interpretaciÃƒÂ³n femenina de pop por &quot;Rehab&quot;, ademÃƒÂ¡s de Mejor ÃƒÂ¡lbum pop vocal por &quot;Back to Black&quot;. Se da la circunstancia de que Amy no pudo acudir a la gala de entrega de los premios debido a que las autoridades de Estados Unidos le negaron el visado de entrada al paÃƒÂ­s. No obstante, Amy Winehouse actuÃƒÂ³ vÃƒÂ­a satÃƒÂ©lite desde Londres, interpretando dos temas para los invitados a la fiesta.\n\nLa vida privada de Amy Winehouse resulta bastante agitada, ya que se ha visto envuelta en varios episodios de consumo de drogas y alcohol, estando ademÃƒÂ¡s en tratamiento de desintoxicaciÃƒÂ³n.\n","torrent":{"xt":"urn:btih:80a0439ba1e2fff98727ee0381a0c0fab8495d70","amp;dn":"Amy+Winehouse++Discografia+De+Luxe.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80a0439ba1e2fff98727ee0381a0c0fab8495d70","infoHashBuffer":{"type":"Buffer","data":[128,160,67,155,161,226,255,249,135,39,238,3,129,160,192,250,184,73,93,112]},"announce":[],"urlList":[]}}