{"title":"Peter Frampton/Frampton Comes Alive [1976][1987][320KBPS]","uid":7992979,"size":202164776,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:80e254e8a40c54a4fb835a9f1314ef7ade586e9c&amp;dn=Peter+Frampton%2FFrampton+Comes+Alive+%5B1976%5D%5B1987%5D%5B320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":2,"uploader":"LameDuck69","files":20,"time":1357532558,"description":"Peter Frampton - Frampton Comes Alive [1976][1987][2 CD's]\n\n\n\n\n\nDisc One\n\n\n01. Introduction/Something's Happening    \n02. Doobie Wah    \n03. Show Me The Way    \n04. It's A Plain Shame   \n05. All I Want To Be (Is By Your Side)    \n06. Wind Of Change   \n07. Baby, I Love Your Way   \n08. I Wanna Go To The Sun  \n\n\nDisc Two\n\n  \n01. Introduction/Penny For Your Thoughts    \n02. (I'll Give You) Money    \n03. Shine On    \n04. Jumping Jack Flash    \n05. Lines On My Face  \n06. Do You Feel Like We Do\n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\n Peter Kenneth Frampton (born 22 April 1950) is an English musician, singer, songwriter, producer, guitarist and multi-instrumentalist. He was previously associated with the bands Humble Pie and The Herd. Frampton's international breakthrough album was his live release, Frampton Comes Alive!. The album sold more than six million copies in the United States alone and spawned several hits. Since then he has released several major albums. He has also worked with David Bowie and both Matt Cameron and Mike McCready from Pearl Jam, among others. Frampton is best known for such hits as &quot;Breaking All The Rules&quot;, &quot;Show Me the Way&quot;, &quot;Baby, I Love Your Way&quot;, &quot;Do You Feel Like We Do&quot;, and &quot;I'm in You&quot;, which remain staples on classic-rock radio. He has also appeared as himself in television shows such as The Simpsons and Family Guy. Frampton is known for his work as a guitar player and particularly with a Talkbox and his tenor voice.\n\n-----------------------------------------------------------------------------------\n\nFrampton Comes Alive! is a double live album by English rock musician Peter Frampton released in 1976, and one of the best-selling live albums in the United States. Following four solo albums with little commercial success, Frampton Comes Alive! was a breakthrough for the artist.\n\nReleased on January 6, 1976, it debuted on the charts at 191. The album reached number one on the Billboard 200 the week ending April 10, 1976, and was in the top spot for a total of 10 weeks. It was the best-selling album of 1976, selling over 6 million copies in the US and became one of the best-selling live albums to date. Frampton Comes Alive! was voted &quot;Album of the year&quot; in the 1976 Rolling Stone readers poll. It stayed on the chart for 97 weeks and was still #14 on Billboard's 1977 year-end album chart.\n\nThe most recognizable songs from the album are &quot;Show Me the Way&quot;, &quot;Baby, I Love Your Way&quot;, and &quot;Do You Feel Like We Do&quot;, all of which were released as singles, and continue to receive much airplay on classic rock radio stations.\n\nIn January 2001, a 25th Anniversary Deluxe Edition of the album was released, containing four additional tracks that were not included on the original version (although one of these was recorded in a radio studio as part of a broadcast, and does not form part of the main concert programme). The track sequence is also significantly different, to more accurately reflect the set list used in the original concerts. Frampton produced the completely remixed and extended album, and played an impromptu live performance with the original band from the album at Tower Records in Los Angeles to help promote the release.\n\n","torrent":{"xt":"urn:btih:80e254e8a40c54a4fb835a9f1314ef7ade586e9c","amp;dn":"Peter+Frampton%2FFrampton+Comes+Alive+%5B1976%5D%5B1987%5D%5B320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80e254e8a40c54a4fb835a9f1314ef7ade586e9c","infoHashBuffer":{"type":"Buffer","data":[128,226,84,232,164,12,84,164,251,131,90,159,19,20,239,122,222,88,110,156]},"announce":[],"urlList":[]}}