{"title":"Wondershare Data Recovery 3.1.0 [k'd] By LfsCrew.zip","uid":8519949,"size":12100663,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:81b2a9ec19e7baf54e6badf5e9ed244ed9f7881c&amp;dn=Wondershare+Data+Recovery+3.1.0+%5Bk%27d%5D+By+LfsCrew.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"skizzolfs","files":1,"time":1369884730,"description":"Wondershare Data Recovery 3.1.0 [k'd] By LfsCrew\n\n\nWondershare Data Recovery is a comprehensive data recovery suite to recover Mac data lost due to accidental deleting, formatting, virus infection, improper operation, unexpected power failure, and other unknown reasons. \n\nIt can recover Mac data from lost, deleted, logical corrupted and formatted Mac hard drive, iPod, USB drive, SD card, digital camera, mobile phone, MP3, and MP4 player. Compatible with HFS+, FAT16/32, and NTFS file system volumes, this non-destructive Mac file recovery software ensures safe Mac file recovery without modifying the original data saved on your Mac machine or any other storage media. Versatile preview lets you enjoy Mac data recovery in advance. \n\nKey Features:\nSafety First:\nRead-only and risk-free Mac data recovery program. No any writing operation to your original data.\nVersatile Preview Ability:\nFor images, real-time and direct scan results is displayed during the scan process to let users stop scanning once the target images are found.\nFor other Mac files such as videos, audio files, archives and documents, they are displayed as a text in a Hex mode for preview to let users enjoy file recovery on Mac in advance.\nPrecise File Recovery for Mac:\nBefore data recovery on Mac, you can choose the target file types to scan, which saves you much time especially when there are tons of files on your Mac machine.\nRestore deleted files for Mac with original file names, shooting date, and storage paths.\nSupport file names search for scanning results to provide you precise Mac file recovery.\nEasy-to-use &amp;Clean Interface:\nComplete wizard and easy-to-use interface let you perform Mac data recovery in a breeze.\n\nWHAT'S NEW\n\nVersion 3.1.0:\nSupports OS X 10.8 Mountain Lion\nSupports more languages like French, Japanese, and Dutch\nFixed minor bugs\n\nREQUIREMENTS\n\nIntel/PPC, Mac OS X 10.5 or later\n\n[k'd] By LFsCrew ! ;)\n\nBuon Divertimento! ","torrent":{"xt":"urn:btih:81b2a9ec19e7baf54e6badf5e9ed244ed9f7881c","amp;dn":"Wondershare+Data+Recovery+3.1.0+%5Bk%27d%5D+By+LfsCrew.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81b2a9ec19e7baf54e6badf5e9ed244ed9f7881c","infoHashBuffer":{"type":"Buffer","data":[129,178,169,236,25,231,186,245,78,107,173,245,233,237,36,78,217,247,136,28]},"announce":[],"urlList":[]}}