{"title":"The Pursuit of Power: Europe, 1815-1914","uid":16044902,"size":2782539,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82115c5f14cd4a4e3c2e8e479a9996b918f28811&amp;dn=The+Pursuit+of+Power%3A+Europe%2C+1815-1914&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":4,"uploader":"marty14","files":1,"time":1476553150,"description":"The Pursuit of Power: Europe, 1815-1914 - Richard J. Evans [epub]\r\n\r\nRichard J. Evans, bestselling historian of Nazi Germany, returns with a monumental new addition to the acclaimed Penguin History of Europe series, covering the period from the fall of Napoleon to the outbreak of World War I. Evans’s gripping narrative ranges across a century of social and national conflicts, from the revolutions of 1830 and 1848 to the unification of both Germany and Italy, from the Russo-Turkish wars to the Balkan upheavals that brought this era of relative peace and growing prosperity to an end.\r\n\r\nAmong the great themes it discusses are the decline of religious belief and the rise of secular science and medicine, the journey of art, music, and literature from Romanticism to Modernism, the replacement of old-regime punishments by the modern prison, the end of aristocratic domination and the emergence of industrial society, and the dramatic struggle of feminists for women’s equality and emancipation. Uniting the era’s broad-ranging transformations was the pursuit of power in all segments of life, from the banker striving for economic power to the serf seeking to escape the power of his landlord, from the engineer asserting society’s power over the environment to the psychiatrist attempting to exert science’s power over human nature itself","torrent":{"xt":"urn:btih:82115c5f14cd4a4e3c2e8e479a9996b918f28811","amp;dn":"The+Pursuit+of+Power%3A+Europe%2C+1815-1914","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82115c5f14cd4a4e3c2e8e479a9996b918f28811","infoHashBuffer":{"type":"Buffer","data":[130,17,92,95,20,205,74,78,60,46,142,71,154,153,150,185,24,242,136,17]},"announce":[],"urlList":[]}}