{"title":"Nancy Sinatra - The Greatest Hits Of (2002) 320 vtwin88cube","uid":6144552,"size":143535451,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:828860023f876edebf082641825b389144943df0&amp;dn=Nancy+Sinatra+-+The+Greatest+Hits+Of+%282002%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":3,"uploader":"vtwin88cube","files":-1,"time":1296628444,"description":"Nancy Sinatra\nThe Greatest Hits \nOf Nancy Sinatra (2002)\n\nGrowing up as the child of one of the greatest icons in American music can't be easy, but Nancy Sinatra managed to create a sound and style for herself fully separate from that of her (very) famous father, and her sexy but strong-willed persona has endured with nearly the same strength as the image of the Chairman of the Board. Nancy Sinatra was born in the Summer of 1940, while her father, Frank Sinatra, was singing with the Tommy Dorsey Orchestra; as the daughter of show business royalty, Nancy grew up in the spotlight, and made her first appearance on television with her father in 1957. It wasn't long before Nancy developed aspirations of her own as a performer -- she had studied music, dancing, and voice through much of her youth -- and in 1960 she made her debut as a professional performer on a television special hosted by her father and featuring guest star Elvis Presley, then fresh out of the Army. After appearing in a number of movies and guest starring on episodic television, Nancy was eager to break into music, and she signed a deal with her father's record label, Reprise. However, her first hit single, 1966's These Boots Are Made for Walkin', made it clear she had the talent and moxie to make it without her father's help. Sounding both sexy and defiant, and belting out a definitive tough-chick lyric over a brassy arrangement by Bill Strange (and with the cream of L.A.'s session players behind her), These Boots Are Made for Walkin' was an immediate and unstoppable hit, and took the tuff girl posturing of the Shangri-Las and the Ronettes to a whole new level. A number of hits followed, including How Does That Grab You, Sugar Town, and the theme song to the James Bond picture You Only Live Twice. Nancy also teamed up with her father for the single Somethin' Stupid, which raced to the top of the charts in 1967. Most of Nancy's hits were produced by Lee Hazlewood, who went on to become a cult hero on his own and recorded a number of memorable duets with her, including Sand, Summer Wine, and the one-of-a-kind epic Some Velvet Morning.\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tPop\t\t\nM3U Playlist:\t\tYes\n\n01.Somethin' Stupid\n02.You Only Live Twice\n03.Friday's Child\n04.Summer Wine\n05.These Boots Are Made For Walking\n06.Jackson\n07.Tony Rome\n08.Lady Bird\n09.Son Of A Preacher Man\n10.You've Lost That Lovin' Feelin'\n11.Sugar Town\n12.Things\n13.Highway Song\n14.Elusive Dreams\n15.Did You Ever\n16.Storybook Children\n17.How Does That Grab You, Darlin'\n18.Light My Fire\n19.Sand\n20.Some Velvet Morning\n\n\nCheers!","torrent":{"xt":"urn:btih:828860023f876edebf082641825b389144943df0","amp;dn":"Nancy+Sinatra+-+The+Greatest+Hits+Of+%282002%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"828860023f876edebf082641825b389144943df0","infoHashBuffer":{"type":"Buffer","data":[130,136,96,2,63,135,110,222,191,8,38,65,130,91,56,145,68,148,61,240]},"announce":[],"urlList":[]}}