{"title":"Scribblenauts Unlimited 1.0 [MAC] [Intel-Wineskin]","uid":7954573,"size":1802174163,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:83334802febd057c79e91699b97e852bf192f16d&amp;dn=Scribblenauts+Unlimited+1.0+%5BMAC%5D+%5BIntel-Wineskin%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":0,"uploader":"thenoobish","files":1,"time":1356375884,"description":"Name: Scribblenauts - Unlimited\nVersion: - 1.0\n\nMac Platform: Intel-Wineskin\nIncludes: K\n\ntestsystem:\n\nOS version: 10.7.5\nProcessor type(s) &amp; speed: 3,1 GHz Quad intel cor i5\nRAM minimum: 4GB\nVideo RAM: AMD Radeon HD 6970M 1024 MB\n\nLink for more information: http://games.kidswb.com/official-site/scribblenauts/unlimited/\n\nThe core fundamentals of the gameplay in Scribblenauts Unlimited are similar to previous entries in the series - Maxwell returns as the player character and the objective is still to collect Starites by using objects the player creates to complete various tasks. Scribblenauts Unlimited is more adventure-based than Scribblenauts and Super Scribblenauts. One of the primary differences with this game is that it takes place in a large overworld that is open to exploration, as opposed to the first two games in the series, where you had to choose an individual puzzle to earn Starites. Players can traverse different themed areas and accept challenges from NPCs. Sometimes, this will transport you to a self-contained level, much like earlier Scribblenauts titles, where you must solve multiple puzzles before being awarded with a Starite. There are now also smaller challenges within the world that reward you with Starite shards - collecting ten of these shards is another way to earn Starites.There are also male and female versions of all NPCs (including animals) now, as well as new functions for the time and arcade machines.\nThe game was built on an upgraded version of the Objectnaut engine, providing the player with several additional options when creating objects. As well as the adjective system that was introduced in Super Scribblenauts, players can now attach multiple objects to each other; for example, creating a dog with wheels. Furthermore, there are numerous properties that can be assigned to objects, such as movement and offensive capabilities. Players can also customize their objects with scaling and coloring tools, similar to another 5th Cell franchise, Drawn to Life. Customized objects can be named and saved - typing in the name of a saved custom object allows it to be spawned at any time. According to game designer Jeremiah Slaczka, the Wii U version of the game can store more than 900 custom objects. The 3DS version lacks this object editor, due to technological constraints.\nThe Wii U version of Scribblenauts Unlimited contains a co-operative multiplayer mode, as well as online support that allows players to share their saved custom objects with their friends. This version also marks the first time the series is released on a home console. As a result, the game has been given a revamped high-definition visual style. The Wii U version also has exclusive cameos from characters from the Super Mario and Legend of Zelda games. It was confirmed on September 13 that Scribblenauts Unlimited would be a Wii U launch title on November 18.\n\nInfo:\nThis game is multilingual. Choose your language in the launcher.","torrent":{"xt":"urn:btih:83334802febd057c79e91699b97e852bf192f16d","amp;dn":"Scribblenauts+Unlimited+1.0+%5BMAC%5D+%5BIntel-Wineskin%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83334802febd057c79e91699b97e852bf192f16d","infoHashBuffer":{"type":"Buffer","data":[131,51,72,2,254,189,5,124,121,233,22,153,185,126,133,43,241,146,241,109]},"announce":[],"urlList":[]}}