{"title":"Mathematics is About the World - Robert E. Knapp","uid":11680963,"size":3914872,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8368b9a9b38c4ce14fc6ddca28aac7991d335c22&amp;dn=Mathematics+is+About+the+World+-+Robert+E.+Knapp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1423086726,"description":"What is mathematics about? Is there a mathematical universe glimpsed by a mathematical intuition? Or is mathematics an arbitrary game of symbols, with no inherent meaning, that somehow finds application to life on earth? Robert Knapp holds, on the contrary, that mathematics is about the world. His book develops and applies its alternative viewpoint, first, to elementary geometry and the number system and, then, to more advanced topics, such as topology and group representations. Its theme is that mathematics, however abstract, arises from and is shaped by requirements of indirect measurement. Eratosthenes, in 200 BC, demonstrated the power of indirect measurement when he estimated the circumference of the earth by measuring a shadow at noon, in Alexandria, on the day of the summer solstice. Establishing geometric relationships, solving equations, finding approximations, and, generally, discovering quantitative relationships are tools of indirect measurement: They are the core of mathematics, the drivers of its development, and the heart of its power to enhance our lives","torrent":{"xt":"urn:btih:8368b9a9b38c4ce14fc6ddca28aac7991d335c22","amp;dn":"Mathematics+is+About+the+World+-+Robert+E.+Knapp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8368b9a9b38c4ce14fc6ddca28aac7991d335c22","infoHashBuffer":{"type":"Buffer","data":[131,104,185,169,179,140,76,225,79,198,221,202,40,170,199,153,29,51,92,34]},"announce":[],"urlList":[]}}