{"title":"Preston Tucker and His Battle to Build the Car of Tomorrow","uid":15891823,"size":8920714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:849a82049762c36e1547b9d9c432332802cbc807&amp;dn=Preston+Tucker+and+His+Battle+to+Build+the+Car+of+Tomorrow&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":4,"uploader":"marty14","files":1,"time":1474761997,"description":"Preston Tucker and His Battle to Build the Car of Tomorrow - Steve Lehto [epub]\r\n\r\nPreston Tucker, a salesman extraordinaire from Ypsilanti, Michigan, had built race cars before the war, and had designed prototypes for the military during it. Now, gathering a group of brilliant automotive designers, engineers, and promoters, he announced the creation of a revolutionary new car: the Tucker '48, the first car in almost a decade to be built fresh from the ground up. Tucker's car would include ingenious advances in design and engineering that other car companies could not match. With a rear engine, rear-wheel drive, a safety-glass windshield that would pop out in case of an accident, a padded dashboard, independent suspension, and automatic transmission, it would be more attractive and aerodynamic—and safer—than any other car on the road. \r\n \r\nBut as the public eagerly awaited Tucker's car of tomorrow, powerful forces in Washington were trying to bring him down. An SEC commissioner with close ties to Detroit's Big Three automakers deliberately leaked information about an investigation the agency was conducting, suggesting that Tucker was bilking investors with a massive fraud scheme. Headlines accused him a perpetrating a hoax and claimed that his cars weren't real and his factory was a sham. \r\n\r\nIn fact, the Tucker '48 sedan was genuine, and everyone who saw it was impressed by what this upstart carmaker had achieved. But the SEC's investigation had compounded the company's financial problems and management conflicts, and a superior product was not enough to keep Tucker's dream afloat","torrent":{"xt":"urn:btih:849a82049762c36e1547b9d9c432332802cbc807","amp;dn":"Preston+Tucker+and+His+Battle+to+Build+the+Car+of+Tomorrow","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"849a82049762c36e1547b9d9c432332802cbc807","infoHashBuffer":{"type":"Buffer","data":[132,154,130,4,151,98,195,110,21,71,185,217,196,50,51,40,2,203,200,7]},"announce":[],"urlList":[]}}