{"title":"The Memory Code: The Traditional Aboriginal Memory Technique","uid":15854604,"size":13694851,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84c0ea42a903d2aca49c4cd599b14cb28653b3a1&amp;dn=The+Memory+Code%3A+The+Traditional+Aboriginal+Memory+Technique&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":0,"uploader":"marty14","files":1,"time":1474227045,"description":"The Memory Code: The Traditional Aboriginal Memory Technique that Unlocks the Secrets of Stonehenge, Easter Island and Ancient Monuments the World Over - Lynne Kelly [epub]\r\n\r\nIn the past, the elders had encyclopaedic memories. They could name all the animals and plants across the landscape, and the stars in the sky too. Yet most of us struggle to memorise more than a short poem.\r\n\r\nUsing traditional Aboriginal Australian songlines as the key, Lynne Kelly has identified the powerful memory technique used by indigenous people around the world. She has discovered that this ancient memory technique is the secret behind the great stone monuments like Stonehenge, which have for so long puzzled archaeologists.\r\n\r\nThe stone circles across Britain and northern Europe, the elaborate stone houses of New Mexico, the huge animal shapes at Nasca in Peru, and the statues of Easter Island all serve as the most effective memory system ever invented by humans. They allowed people in non-literate cultures to memorise the vast amounts of practical information they needed to survive.\r\n\r\nIn her fascinating book The Memory Code, Lynne Kelly shows us how we can use this ancient technique to train our memories today","torrent":{"xt":"urn:btih:84c0ea42a903d2aca49c4cd599b14cb28653b3a1","amp;dn":"The+Memory+Code%3A+The+Traditional+Aboriginal+Memory+Technique","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84c0ea42a903d2aca49c4cd599b14cb28653b3a1","infoHashBuffer":{"type":"Buffer","data":[132,192,234,66,169,3,210,172,164,156,76,213,153,177,76,178,134,83,179,161]},"announce":[],"urlList":[]}}