{"title":"Save the Cat!® Strikes Back: More Trouble for Screenwriters ","uid":9664228,"size":677603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84dce66406a5792cac8e9913012daa38f8f7808d&amp;dn=Save+the+Cat%21%26reg%3B+Strikes+Back%3A+More+Trouble+for+Screenwriters+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1393345031,"description":"Blake Snyder, author of Save the Cat!Â® and Save the Cat!Â® Goes to the Movies, is back with the book countless readers and students have clamored for. Inspired by questions from his workshops, lectures, and emails, Blake listened and provides new tips, tactics, and techniques to solve your writing problems and create stories that resonate:\nThe 7 warning signs you might have a great idea or not\n2 sure-fire templates for can t-miss loglines\nThe difference between structure and formula\nThe Transformation Machine that allows you to track your hero s growth step-by-step\nThe 5 questions to keep your story s spine straight\nThe 5-Point Finale to finish any story\nThe Save the Cat!Â® Greenlight Checklist that gets to the heart of every development issue\nThe right way to hear notes, deal with problematic producers, and dive into the rewrite with the right attitude\nWhy and when an agent will appear\nHow to discover the potential for greatness in any story\nHow to avoid panic, doubt, and self-recrimination... and what it takes to succeed and dare to achieve your dreams\nGet ready to face trouble like a pro... and strike back!\n\nReview\n&quot;A dazzling expansion on Blake's original insights, this essential screenwriting tool is practical and profound.&quot; --Mark Hentemann, Writer/Executive Producer, Family Guy\n\n&quot;Save the Cat!Â® Strikes Back is Blake's best yet. It expands on his principles of storytelling in a breezy, colloquial style and gives us a deeper personal insight to the relentlessly positive mindset that powered his great success and his generous spirit. Blake's life was far, far too short, but his work and his inspiring legacy will remain timeless.&quot; --Rick Drew, movieScope Magazine\n\n&quot;Written in his signature witty, conversational style, Blake Snyder has given us another gem. As relevant to the novelist as it is to the screenwriter, this is a book no writer should be without. I've read all of Blake's books, and never begin a story without his insanely useful Beat Sheet by my side, but this time, Snyder goes one step further, sharing his own personal transformation from struggling writer to one who's seen great success. From the most generous and genuine writer/teacher of our time, this book will inspire the reader to scale all of those seemingly insurmountable brick walls and keep going to choose getting better over getting bitter. This book is a must read!&quot; --Alyson Noel, #1 New York Times Bestselling Author, Evermore, Blue Moon, Shadowland,Dark Flame\nAbout the Author\nIn his 20-year career as a screenwriter and producer, Blake Snyder sold dozens of scripts, including co-writing Blank Check, which became a hit for Disney, and Nuclear Family for Steven Spielberg. His book, &quot;Save the Cat!Â® The Last Book on Screenwriting You'll Ever Need,&quot; was published in May 2005, and is now in its 23rd printing. The sequel, &quot;Save the Cat!Â® Goes to the Movies: The Screenwriter's Guide to Every Story Ever Told,&quot; and software, &quot;Save the Cat!Â® The Last Story Structure Software You ll Ever Need,&quot; are also bestsellers. Along with guiding screenwriters, novelists, and other creative thinkers, Blake's method has become the secret weapon of many development executives, managers, and producers for its precise, easy, and honest appraisal of what it takes to write and develop stories in any media. Blake was a proud member of the Writers Guild of America, west. He passed away suddenly on August 4, 2009, but he lives on in his films and his books, in the advice that will never grow old, with the spirit that will continue to thrive and inspire. His story resonates with all who loved him, and your stories will resonate thanks to his love for you. Blake's vision continues on his website.","torrent":{"xt":"urn:btih:84dce66406a5792cac8e9913012daa38f8f7808d","amp;dn":"Save+the+Cat%21%26reg%3B+Strikes+Back%3A+More+Trouble+for+Screenwriters+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84dce66406a5792cac8e9913012daa38f8f7808d","infoHashBuffer":{"type":"Buffer","data":[132,220,230,100,6,165,121,44,172,142,153,19,1,45,170,56,248,247,128,141]},"announce":[],"urlList":[]}}