{"title":"The Undercover Economist - Tim Harford - Audiobook MP3","uid":10616041,"size":292060528,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:852c93b236e5f2068f2ca1813b2d778081cf7ae5&amp;dn=The+Undercover+Economist+-+Tim+Harford+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1406113892,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Undercover Economist: Exposing Why the Rich Are Rich, the Poor Are Poor--and Why You Can Never Buy a Decent Used Car!\n\nWritten by: Tim Harford\nNarrated by: Robert Ian Mackenzie\nLength: 10 hrs and 10 mins\nFormat: Unabridged\nRelease Date:04-05-06\n\nAuthor of the extremely popular &quot;Dear Economist&quot; column in Financial Times, Tim Harford reveals the economics behind everyday phenomena in this highly entertaining and informative book. Can a book about economics be fun to read? It can when Harford takes the reins, using his trademark wit to explain why it costs an arm and a leg to buy a cappuccino and why it's nearly impossible to purchase a decent used car. Supermarkets, coffee houses, airlines, insurance companies, and more are sucking money from our wallets. To protect ourselves and our bank accounts, we must better understand why companies do what they do. ","torrent":{"xt":"urn:btih:852c93b236e5f2068f2ca1813b2d778081cf7ae5","amp;dn":"The+Undercover+Economist+-+Tim+Harford+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"852c93b236e5f2068f2ca1813b2d778081cf7ae5","infoHashBuffer":{"type":"Buffer","data":[133,44,147,178,54,229,242,6,143,44,161,129,59,45,119,128,129,207,122,229]},"announce":[],"urlList":[]}}