{"title":"Ann Rosman - Vågspel - Svensk","uid":15807938,"size":513504927,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8560d846f40009af5b40787163becad746b87b8b&amp;dn=Ann+Rosman+-+V%26aring%3Bgspel+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":1,"uploader":"totomas1","files":88,"time":1473590057,"description":"Ann Rosman – Vågspel\r\n\r\nDen 5 juni 1916 förliser det brittiska krigsfartyget HMS Hampshire utanför Orkneyöarna. Med sig till havsbotten tar det 700 man inklusive krigsministern Lord Kitchener. Första världskriget pågår och enligt ryktet var fartyget på väg med dyrbar last till Ryssland när det gick på en tysk mina. Många är dykarna som med livet som insats försökt finna och bärga Hampshires mytomspunna skatt.\r\n\r\nNästan hundra år senare hittas en segelbåt drivande utanför samma kust. På däck finner man blod och andra spår efter slagsmål. Båten tillhör Bo Stenman, pensionerad dykare hemmahörande i Marstrand. När det står klart att det var Bo själv som seglat båten beger sig kriminalinspektör Karin Adler och hennes kollega Folke till Orkney för att bistå polisen i utredningen.\r\nEn kropp hittas och ytterligare en båt, och i jakten efter svar på vad som hänt blir kopplingarna mellan den försvunne Bo och det för länge sedan förlista fartyget allt starkare. En dykexpedition vid vraket på sjuttiotalet höll på att sluta i katastrof och av någon anledning har Bo Stenman gjort sig ovän med många av sina tidigare dykarkollegor.\r\n\r\nAnn Rosmans sjätte bok med Karin Adler från Marstrand i huvudrollen utspelas på de gröna och vindpinade Orkneyöarna, en plats med levande folktro och djupa hemligheter. En plats för död och innerlig kärlek.\r\n\r\n\r\nAntal CD: 15 CD\r\nUppläsare: Mirja Turestedt\r\nSpeltid: Ca 18 timmar","torrent":{"xt":"urn:btih:8560d846f40009af5b40787163becad746b87b8b","amp;dn":"Ann+Rosman+-+V%26aring%3Bgspel+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8560d846f40009af5b40787163becad746b87b8b","infoHashBuffer":{"type":"Buffer","data":[133,96,216,70,244,0,9,175,91,64,120,113,99,190,202,215,70,184,123,139]},"announce":[],"urlList":[]}}