{"title":"The Sims 1 + All Extensions","uid":4324631,"size":2056911059,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:85800c4c425d82bd7f3ee16fce852d764e344912&amp;dn=The+Sims+1+%2B+All+Extensions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":0,"uploader":"08Peechie08","files":3,"time":1217692817,"description":"This is the complete &quot;The Sims&quot; (1) series, and includes:\n\nThe Original &quot;The Sims&quot;. \n\nLivin' Large, released August 2000, adds more home objects, events, Sims, careers, and the ability to establish multiple neighborhoods.\n\nHouse Party, released March 2001, adds party-related content, such as lighted dance floors.\n\nHot Date, released November 2001, allows Sims to meet or pick up other Sims for romantic encounters in a new city environment, dubbed &quot;Downtown.&quot; Downtown also allows Sims to eat, play and purchase items, such as clothing, gifts and magazines. The expansion pack is also the first in the series to establish a playable area outside the neighborhood.\n\nVacation, released March 2002, allows the player to take Sims to various vacation destinations, such as beaches and the woods for camping.\n\nUnleashed, released September 2002, gives Sims the ability to adopt and train a wide variety of pets, allow Sims to grow crops, and expands the neighborhood, including the addition of a New Orleans-themed town, dubbed &quot;Old Town.&quot;\n\nSuperstar, released May 2003, allows Sims to visit a Hollywood-like town called &quot;Studio Town&quot; and become celebrities.\n\nMakin' Magic, released October 2003, allows Sims to use magic and cast spells and introduces a new Magic Town area.\n\nJust burn the ISO to DVD, or mount with Magic Iso and install!\n\nNo CDKey, crack, or keygen needed!\n","torrent":{"xt":"urn:btih:85800c4c425d82bd7f3ee16fce852d764e344912","amp;dn":"The+Sims+1+%2B+All+Extensions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85800c4c425d82bd7f3ee16fce852d764e344912","infoHashBuffer":{"type":"Buffer","data":[133,128,12,76,66,93,130,189,127,62,225,111,206,133,45,118,78,52,73,18]},"announce":[],"urlList":[]}}