{"title":"Civilization V: Brave New World RePack RG Mechanics NASWARI+ZOHA","uid":8681261,"size":4030900881,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:85e5d87e24e80dd3f0df05b1173a4a30c22e17f2&amp;dn=Civilization+V%3A+Brave+New+World+RePack+RG+Mechanics+NASWARI%2BZOHA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":2,"uploader":"NZupload","files":-1,"time":1373706250,"description":"GENERAL INFORMATION:\nReleased: 2010\nGenre: Strategy (Turn-based / Grand Strategy) / 3D\nDeveloper: Firaxis Games\nPublisher: 2K Games  1C-CoftKlab\nPublication Type: RePack\nPlatform: PC\nLanguage: English / Russian\nSound language: Russian / English\nMedicine: Sew\n\nSYSTEM REQUIREMENTS:\nOperating system: Windows XP (SP3) / Windows Vista (SP1) / Windows 7\nProcessor: Intel Core 2 Duo 2.8 GHz or AMD Athlon X2 Dual-Core 5200 +\nMemory: 1.5 GB\nVideo card: compatible with Direct X 9.0 c or a 10/256 MB\nSound Card: DirectX compatible with\nDisk Space: 7.5 GB\n\nDESCRIPTION:\nThe fifth incarnation of the legendary &quot;Civilization&quot; takes on a new level of quality: opportunities and development options greatly increased, the opponents have become smarter, network game - interesting and varied, and graphics - beautiful.\nTo hold his nation through the ages - from primitive society to a high-tech civilization, through the golden age, and stand at the origins of world religions, to reinvent the wheel, and a nuclear reactor, built the Pyramids and the Statue of Liberty, to meet with the greatest political leaders, to show himself as a diplomat or strategist - Sid Meier's Civilization V will realize your dreams!\nSid Meier's Civilization V: Gods and Kings&quot; covers a vast period of time - from the foundation of the first of the pantheon of gods and the beginning of the spread of religion around the world before the era of international espionage. Religion and espionage - two very important additions to the brink of Civilization V. Thanks to these innovations, as well as refined combat system and considerably wiser artificial intelligence, global competition will become much more dynamic and harder than before.\nSupplement &quot;Gods and Kings&quot; brings into play another nine civilizations, including Carthage, the Netherlands, and Maya, nine wonders of the world, a lot of units, buildings and technologies. Furthermore, there are three scenarios scale. You get the opportunity to turn the medieval state into one of the great European powers of the Renaissance. You will be able to go to war with the barbarians on the side of the Western Roman Empire or Byzantium, and if you want - and then lead the barbarians themselves. Well, if you're an avid dreamer, then surely you like have a science fiction scenario of the Victorian era.","torrent":{"xt":"urn:btih:85e5d87e24e80dd3f0df05b1173a4a30c22e17f2","amp;dn":"Civilization+V%3A+Brave+New+World+RePack+RG+Mechanics+NASWARI%2BZOHA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85e5d87e24e80dd3f0df05b1173a4a30c22e17f2","infoHashBuffer":{"type":"Buffer","data":[133,229,216,126,36,232,13,211,240,223,5,177,23,58,74,48,194,46,23,242]},"announce":[],"urlList":[]}}