{"title":"The Phantom of the Opera Special Edition 320cbr Soundtrack 2004","uid":9435227,"size":290330029,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:867cbac48e4fb8af66d4cd9ad50578c57e551120&amp;dn=The+Phantom+of+the+Opera+Special+Edition+320cbr+Soundtrack+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":8,"uploader":"Big-Papi","files":-1,"time":1388891294,"description":"The Phantom of the Opera Special Edition 320cbr (Big Papi) 2004 Original Motion Picture Soundtrack\n \nSource: 2004 2-CD Set\n\n\n\nBy M. Menzer\nMany people will listen to this and immediately compare this to Sarah Brightman and Michael Crawford. People will say that Emmy Rossum is too young, and that Gerard Butler can't sing at all compared to Michael Crawford. Some people will comment that Minnie Driver, rather than being dubbed, should not have been cast as Carlotta. To these I say the following:\n\nChristine is supposed to be a young choir girl. Sarah Brightman is not young, nor a choir girl. Emmy Rossum sang with the Metropolitan Opera when she was seven, and is the perfect age for the part. She has a beautiful, clear voice that doesn't sound (don't get me wrong, I love Sarah Brightman, but...) like her mouth is stuffed with cotton when she sings the high notes.\n\nMichael Crawford is, anyway you look at it, WAY too old to play the sexy, mainstream appealing Phantom that a movie needs. Gerard Butler CAN sing. Don't be fooled by the deeper, fuller tambre his voice has. Deeper isn't bad. In fact, for the mainstream appeal the movie is unarguably shooting for, Gerard Butler's voice is better than Michael Crawford's; none of the tinniness that has a tendency to creep in on high notes (&quot;But that's the Phantom!&quot; the people will say...). Gerard Butler's Music of the Night is great (It's more impressive to be able to reach those notes without having to resort to high falsetto, guys, it gives a fuller, deeper tone.); listen to it and pretend you've never heard Michael Crawford. It's by no means bad, or anything close. I enjoyed it. And his Point of No Return runs circles around Michael Crawford's.\n\nThe one constant in every review of the movie (not the soundtrack, the actual movie) is that Minnie Driver's performance as Carlotta is brilliant. Surely you wouldn't say that this excellent performance should not have occured because of a few dubbed singing parts.\n\nNow that I've gotten that out of the way, I love this. The reorchestration is great with a COUPLE of exceptions. What on earth happened to Phantom of the Opera? What's with the claps? And the wailing guitar solo? Woah. I like that it's much fuller, but it Learn to be Lonely. Now I know it's not on the extended edition, thank god, but I felt it's existence needed to be mentioned. Why? For the love of god, why, did the creators of the wonder that is Phantom, write this tripe? Guitar plucking and bongos. BONGOs! Was it for the oscar nomination? There's no chance of this song winning an Oscar! None! Not in a million years! Minnie Driver has a beautiful voice, but displaying it is not worth the humiliation! Ehem. This CD set really deserves 5 stars, I think, but, (to my discredit I admit) I lowered it a star. Not just because of the Phantom of the Opera rock wackiness (though that was a big reason), or the tragedy that is Learn to be Lonely (although that, while it probably shouldn't have, played a small role), but also to acknowledge to diehard fans of the Original Cast that this isn't your old 1987 CD set with one track per disc. They're different singers. Their voices have different tambres. Gerard Butler is not the tenor that Michael Crawford is (thankfully, at some parts). Deal with it, and learn to be happy with a great soundtrack for the long awaited movie version of one of Broadway's greatest shows. December 22nd can't come quickly enough.","torrent":{"xt":"urn:btih:867cbac48e4fb8af66d4cd9ad50578c57e551120","amp;dn":"The+Phantom+of+the+Opera+Special+Edition+320cbr+Soundtrack+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"867cbac48e4fb8af66d4cd9ad50578c57e551120","infoHashBuffer":{"type":"Buffer","data":[134,124,186,196,142,79,184,175,102,212,205,154,213,5,120,197,126,85,17,32]},"announce":[],"urlList":[]}}