{"title":"Gloria Estefan Greatest Hits 320cbr (Big Papi) 1992","uid":9476805,"size":142637681,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:869ede97ebdf8dc5d29a17b23933b95c0a4fa5c1&amp;dn=Gloria+Estefan+Greatest+Hits+320cbr+%28Big+Papi%29+1992&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":5,"uploader":"Big-Papi","files":-1,"time":1389716388,"description":"Source: 1992 CD\n\nGloria Estefan Greatest Hits 320cbr (Big Papi) 1992 (Size: 136.03 MB)\n\n\n \t\t\n01 Gloria Estefan - Conga.mp3\t9.86 MB\n \t\t\n02 Gloria Estefan - Words Get in the Way.mp3\t8.02 MB\n \t\t\n03 Gloria Estefan - Can't Stay Away from You.mp3\t9.15 MB\n \t\t\n04 Gloria Estefan - 1,2,3.mp3\t8.31 MB\n \t\t\n05 Gloria Estefan - Rhythm Is Gonna Get You.mp3\t9.15 MB\n \t\t\n06 Gloria Estefan - Anything for You.mp3\t9.39 MB\n \t\t\n07 Gloria Estefan - Here We Are.mp3\t11.22 MB\n \t\t\n08 Gloria Estefan - Get on Your Feet.mp3\t8.49 MB\n \t\t\n09 Gloria Estefan - Don't Wanna Lose You.mp3\t9.66 MB\n \t\t\n10 Gloria Estefan - Coming Out of the Dark.mp3\t9.51 MB\n \t\t\n11 Gloria Estefan - Christmas Through Your Eyes.mp3\t11.35 MB\n \t\t\n12 Gloria Estefan - I See Your Smile.mp3\t10.63 MB\n \t\t\n13 Gloria Estefan - Go Away.mp3\t10 MB\n \t\t\n14 Gloria Estefan - Always Tomorrow.mp3\t11.19 MB\n \t\t\n\n\n\n\nBy Bobby Underwood VINE VOICE\n\n\n\n\nGloria's first greatest hits collection flows like the river wild, an incredibly enjoyable mix of emotional and heartfelt pop ballads and Miami club scene dance songs akin to having special access to the best radio station in the world. This collection of pop hits is easy to listen to and hard to turn off, which is exactly what pop music was intended to be. This 14 song compilation truly is the best of Gloria's radio friendly mix of Cuban rhythms and vocal honesty. You'll recognize every song here, which is quite a tribute in and of itself. From infectious dance songs to powerful heartbreak we get it all.\n\nThere was always an emotional honesty in Gloria Estefan's vocals that is missing among the new wave of pop stars. Talent and range are not the same thing as honesty and integrity. There is a reason Gloria Estefan has such a special relationship with her fans and has managed to have such staying power in an industry where a new pop princess comes along every five minutes. You can hear that reason even in some of the earlier radio hits. That honesty reached its zenith on Gloria's final selection here, &quot;Always Tomorrow.&quot;\n\nTHE HAPPY DANCE SONGS\n\nCONGA -- 1, 2, 3 -- RHYTHM IS GONNA GET YOU -- GET ON YOUR FEET -- GO AWAY\n\nThese songs truly capture the feel of Miami at night, their fun mix of Cuban rhythms infectious. No one has ever done this kind of song better than Gloria Estefan. Emilio Estefan's attention to every detail in the production of each song turn these dance club party songs into glittering images of pink flamingos, sandy beaches, and exotic cars. Listening to these songs is like watching the now famous opening salvo of images from Miami Vice. These wonderful songs we all remember are the next best thing to being at an open air Cuban club on a warm Miami night during summer.\n\nTHE HEARTFELT SONGS OF LOVE\n\nWORDS GET IN THE WAY -- CAN'T STAY AWAY FROM YOU -- ANYTHING FOR YOU -- HERE WE ARE -- DON'T WANNA LOSE YOU -- I SEE YOUR SMILE\n\nThese beautiful ballads are no less special simply because they found their way to radio and were big hits. Sometimes there is a reason songs are popular with everyone. No one ever gave a song more emotional honesty than Gloria does. Each selection here, whether it is of love lost, love clinging to survival, or love remembered, has a touching truth in its lyrics and the manner in which Gloria Estefan delivers them.\n\n&quot;Don't Wanna Lose You&quot; and the very sad and wistful &quot;I See Your Smile&quot; are of particular note, lingering in our hearts long after the song has ended. The beautiful &quot;Words Get In the Way&quot; is like an anthem for anyone who has ever loved someone so. Gloria would record a live version of this song in Miami and donate all the proceeds of that beautiful and special mix only available on the single for South Florida victims of Hurricane Andrew.\n\nSPECIAL SONGS\n\nCHRISTMAS THROUGH YOUR EYES -- COMING OUT OF THE DARK -- ALWAYS TOMORROW\n\n&quot;Christmas Through Your Eyes&quot; has a wonderful and nostalgic feel; Gloria sings about the innocence and optimism we had as kids that we would love to feel once again. It is a very pretty song that will have you thinking about how you once felt also, back when everyone seemed kind.\n\n&quot;Coming Out of the Dark&quot; and &quot;Always Tomorrow&quot; are inspirational songs born of a near tragedy when Gloria was injured in an accident and broke her back. She could easily have lost her life, and it would be many months before she would be her old self, both physically and emotionally.\n\n&quot;Always Tomorrow&quot; is especially poignant. No one can listen to this song and not think about the life they have, and wonder if they are spending enough time enjoying it. Gloria's discovery that it could end at any moment and her reaction to it is truly heartrending. It is deeply felt and inspirational, and quite appropriately, concludes this most fantastic collection of music, which covered not only many years of our lives, but the emotions we felt along the journey.\n\nThe liner notes, in addition to containing the lyrics to all the songs, have some wonderful pictures of Gloria. The cover was shot by photographer Alberto Tolot at The Biltmore Hotel in Coral Gables. The photographs inside were taken by Antoine Verglas at The Raleigh Hotel in Miami Beach, Florida.\n\nIN SUMMATION\n\nThe music is great, the production smooth, and Gloria's emotional vocals always perfect. She always made this look so easy that she sometimes didn't get credit for how difficult creating good pop music can be. Husband Emilio, a terrific artist in his own right, always manages to give just the right production to a tune, enhancing the flavor of a song while not overpowering Gloria's emotional delivery.\n\nThese hits are the perfect blend of popularity and artistry. In turns uplifting, exciting, and heartbreaking, &quot;Gloria Estefan: Greatest Hits&quot; reminds us what was good about listening to radio during the 1980's and early 1990's. This was the culmination of Gloria's dream. We can be glad that the dream continued, Gloria taking her music in different directions as radio changed. She found other venues, such as the Olympics and films to augment the occasional dance club favorite. And her Spanish music shows her growth over the years as an artist.\n\nThere would be a second &quot;Greatest Hits&quot; collection, thanks to those different directions Gloria's music would take, but anyone wanting to know just what is so special about her, and why she has lasted so long, must have this first one. It is, for want of a better phrase, the music of our lives.","torrent":{"xt":"urn:btih:869ede97ebdf8dc5d29a17b23933b95c0a4fa5c1","amp;dn":"Gloria+Estefan+Greatest+Hits+320cbr+%28Big+Papi%29+1992","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"869ede97ebdf8dc5d29a17b23933b95c0a4fa5c1","infoHashBuffer":{"type":"Buffer","data":[134,158,222,151,235,223,141,197,210,154,23,178,57,51,185,92,10,79,165,193]},"announce":[],"urlList":[]}}