{"title":"Chicxulub: The Impact and Tsunami (2016) (pdf) [WWRG]","uid":16044319,"size":12097885,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86e4650dce46970d17732c3a557215ba3db698f3&amp;dn=Chicxulub%3A+The+Impact+and+Tsunami+%282016%29+%28pdf%29+%5BWWRG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":7,"uploader":"Lion.King","files":3,"time":1476547713,"description":"Publisher: Springer; 1st ed. 2017 edition (September 10, 2016)\r\nLanguage: English\r\nISBN-10: 3319394851\r\nISBN-13: 978-3319394855\r\n\r\n\r\nThis book tells the story of the catastrophic impact of the giant 10 Km asteroid Chicxulub into the ancient Gulf of Mexico 65.5 million years ago. The book begins with a discussion of the nature of asteroids and the likelihood of future Earth-impacts. The story then turns to the discovery of a global sediment layer attributed to the fallout from the impact and a piecing together of the evidence that revealed a monster crater, buried under the Gulf. Reviewed is the myriad of geological and fossil evidence that suggested the disastrous sequence of events occurring when a &quot;nuclear-like&quot; explosion ripped through the sea, Earth, and atmosphere, thus forming the mega-crater and tsunami. The aftermath of the Chicxulub's event initiated decades and more of major global climate changes including a &quot;Nuclear Winter&quot; of freezing darkness and blistering greenhouse warming. A chapter is dedicated to the science of tsunamis and their model generation, including a portrayal of the globally rampaging Chicxulub waves.\r\n\r\nThe asteroid's global devastation killed off some 70% of animal and plant life including the dinosaurs. The study of an ancient Cambrian fossil bed suggests how &quot;roll of the dice&quot; events can affect the future evolution of life on Earth. We see how Chicxulub's apparent destruction of the dinosaurs, followed by the their replacement with small mammals, altered forever the progress of human evolution. This book presents a fascinating glimpse through the lens of the natural sciences - the geology, climatology, and oceanography, of the effects of an enormous astronomical event","torrent":{"xt":"urn:btih:86e4650dce46970d17732c3a557215ba3db698f3","amp;dn":"Chicxulub%3A+The+Impact+and+Tsunami+%282016%29+%28pdf%29+%5BWWRG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86e4650dce46970d17732c3a557215ba3db698f3","infoHashBuffer":{"type":"Buffer","data":[134,228,101,13,206,70,151,13,23,115,44,58,85,114,21,186,61,182,152,243]},"announce":[],"urlList":[]}}