{"title":"The Wire Seasons 1-5 Complete Collection DVD Box Set + Extras","uid":10824630,"size":27760786324,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:884d37f6794e00a76fd42add6db971e586e74e28&amp;dn=The+Wire+Seasons+1-5+Complete+Collection+DVD+Box+Set+%2B+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":30,"uploader":"NoMoreAVI","files":100,"time":1408570896,"description":"IMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0306414/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0306414/&lt;/a&gt;\n\nAll Episodes for all 5 Seasons in HD DVDrip. Bonus features, interviews, commentaries etc. This is the most complete collection on the web, excellent quality too. Please seed for as long as possible. Let's keep The Wire alive.\n\nThe Wire is an American television drama series set and produced in and around Baltimore, Maryland. Created and primarily written by author and former police reporter David Simon, the series was broadcast by the premium cable network HBO in the United States. The Wire premiered on June 2, 2002 and ended on March 9, 2008, comprising sixty episodes over five seasons.\n\nEach season of The Wire focuses on a different facet of the city of Baltimore. They are, in order: the illegal drug trade, the port system, the city government and bureaucracy, the school system, and the print news media. The large cast consists mainly of character actors who are little known for their other roles. Simon has said that despite its presentation as a crime drama, the show is &quot;really about the American city, and about how we live together. It's about how institutions have an effect on individuals. Whether one is a cop, a longshoreman, a drug dealer, a politician, a judge or a lawyer. All are ultimately compromised and must contend with whatever institution they are committed to.&quot;\n\nDespite never seeing a large commercial success or winning major television awards, The Wire has been described by many critics as the greatest television series ever made. The show is recognized for its realistic portrayal of urban life, its literary ambitions, and its uncommonly deep exploration of sociopolitical themes.\n\nEnjoy The Wire","torrent":{"xt":"urn:btih:884d37f6794e00a76fd42add6db971e586e74e28","amp;dn":"The+Wire+Seasons+1-5+Complete+Collection+DVD+Box+Set+%2B+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"884d37f6794e00a76fd42add6db971e586e74e28","infoHashBuffer":{"type":"Buffer","data":[136,77,55,246,121,78,0,167,111,212,42,221,109,185,113,229,134,231,78,40]},"announce":[],"urlList":[]}}