{"title":"Veils, Nudity, and Tattoos: The New Feminine Aesthetics","uid":15870758,"size":1375028,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8967aef6838cbcd8fe71d771af033128c6d20c9f&amp;dn=Veils%2C+Nudity%2C+and+Tattoos%3A+The+New+Feminine+Aesthetics&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":2,"uploader":"Dr.Soc","files":1,"time":1474423252,"description":"Veils, Nudity, and Tattoos: The New Feminine Aesthetics by Thorsten Botz-Bornstein\r\nEnglish | 2015 | ISBN: 1498500463 | 212 pages | EPUB | 1 MB\r\n\r\nAt first sight, tattoos, nudity, and veils do not seem to have much in common except for the fact that all three have become more frequent, more visible, and more dominant in connection with aesthetic presentations of women over the past thirty years. No longer restricted to biker and sailor culture, tattoos have been sanctioned by the mainstream of liberal societies. Nudity has become more visible than ever on European beaches or on the internet. The increased use of the veil by women in Muslim and non-Muslim countries has developed in parallel with the aforementioned phenomena and is just as striking.\r\n\r\nThrough the means of conceptual analysis, Veils, Nudity, and Tattoos: The New Feminine Aesthetics reveals that these three phenomena can be both private and public, humiliating and empowering, and backward and progressive. This unorthodox approach is traced by the three s similar social and psychological patterns, and by doing so, Veils, Nudity, and Tattoos hopes to sketch the image of a woman who is not only sexually emancipated and confident, but also more and more aware of her cultural heritage.&quot;","torrent":{"xt":"urn:btih:8967aef6838cbcd8fe71d771af033128c6d20c9f","amp;dn":"Veils%2C+Nudity%2C+and+Tattoos%3A+The+New+Feminine+Aesthetics","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8967aef6838cbcd8fe71d771af033128c6d20c9f","infoHashBuffer":{"type":"Buffer","data":[137,103,174,246,131,140,188,216,254,113,215,113,175,3,49,40,198,210,12,159]},"announce":[],"urlList":[]}}