{"title":"Don't Starve v1.90423","uid":9493115,"size":123572066,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:89682d55da30427efb8138fe3647119819857be5&amp;dn=Don%27t+Starve+v1.90423&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":0,"uploader":"ramasbmv","files":1,"time":1390041056,"description":"November 14, 2013 - Bugfix / Performance update\nGameplay fixes\n\nAdd naughtiness to smallish tallbird\nshadow maxwells scare rabbits\nwilson is invincible while sleeping\nfix recipe prototyping to work with new tech level splits\nfix for Winter is generated in spite of the 'Season' preset setting being set to 'Only Summer'. in the 'World Menu'\nfix for Wolfgang saying how mighty he is and totally ruining everything in the intro NIS\nMake telelocator check for water when teleporting randomly\nprevent infinite loot fountain from beaver-gnawed spiky tree\nStumps can now be lit on fire after loading.\nStumps now propagate fire.\nfix for placing structures after eating a glow fruit\nfix maxwell mine visibility\nheatrocks work in backpacks\ninstead of clearing followers from saveindex on load which can result in them being lost, clear followers on any save that is not an ascend/descend\nfix crash when lureplants eat bees\nNow reset the colour cube on load to deal with loading and saving between insane and non insane games.\nmade evergreens and cave entrances non-clickable when they are first worked to stop you from interacting with them by accident\nPlanted pine cone has different name from unplanted\nAbigail is now tagged as a &quot;character&quot;, additionally the tentacle will retaliate against anything in range that is attacking it\nlantern swap bug fix\nlantern can't be turned on in pocket\nkilling a baby beefalo is very naughty\nMade a &quot;SelfStacker&quot; component and added it to the houndstooth, monster meat and spoiledfood to improve base clenliness and performance in very long games\nRubble no longer crashes\nArmour will always return 0 damage if the absorb percent is &gt;= 1.\nThere is now only one &quot;Sinkhole&quot; room per task. This will remove the case of regularly seeing two cave entrances near each other.\nMade &quot;characterspecific.lua&quot; a component for items that are only supposed to be on one character. Added it to all character specific items.\nfix bug where nightmare stuff was getting turned on in second overworlds\nfix for occasional cave gen fail\nFix for wes talking\nWalrus blow dart is no longer targetable/inspectable during flight\nFix for two bugs: Leif not exiting frozen once hit and minotaur being stunlockable.\nMade beefalo poop in the old way, and fixed a problem with their babies never showing up\nCatcher now makes sure the projectile it's tracking is valid before attempting to preform functions with it.\nCombat function now ensures that the entity it's on is still around before calling GetDistSqToInst.\nHam bat no longer loses durability from being used, but does spoil over time\nHam bat and flower hat both display spoilage graphics instead of text percentages in order to reflect that they are spoiling over time\nfixed occasional invisible maxwell intro bug\nproperly report farm plot fertilization success\nmake the build placers opaque so that they show up better\nmake burnt trees more visible when they are highlighted\nDeerclops will knock down anything he collides with that is tagged &quot;tree&quot;, allowing him to pass through.\nDivining rod will not disappear when attacking.\nmade hambat non-edible to avoid interface confusion. Gave it higher damage to compensate.\nflower hat is not edible to reduce interface confusion\nmake dusk announcement more generic, so that it doesn't mention fire.\nInventory items that also have brains will now hibernate while they are held by an owner.\nBees no should no longer buzz while in a container.\nFix for mandrake crash when travelling between cave levels.\nUse consistent language for the settings screen in FE and pause menu\nFix for inventory items getting into a bad state when you try to put them into an already-full chester\nBirds can no longer be killed while flying away.\nShadow Creatures will not trigger tooth traps.\nFix woodie, chester contents, and beard issues when time catches up when leaving / entering caves\nFix for dropping equippable tools under full-container conditions\nMaxwell's Shadows will now die when he does.\nFix bee spawn schedule\nController stuff\n\nAdded a controller debug menu\nImproved attack/interaction picker\nAdded vibration (it can be toggled off)\nadded controller hints to the front end screens and made them more consoleish when a controller is attached\nWhen using dpad to use un-equipped item on the scene, it will now be equipped if required\nFix for item-on-item interactions with controller\nFix &quot;for science!&quot; button controller focus when you beat the game\nInventory hint stays up longer\nAdded trigger tooltips to inventory and crafting bars\nController tips for inventory and container items are at more sensible offsets\nadd louder controller focus change sound\nadded repeat rate for controller page/value changes\nhooked up sounds to page flips\ndon't play scrolling sounds after the ends of the crafting menu\nWhen using a controller pressing the &quot;INVENTORY_USEONSELF&quot; bind will now first toggle deployable mode on (if applicable) a 2nd press will execute any action related to the bind if deployable mode was triggered.\nKeep the crafting menu open as you open and close the map\nmake controller scrolling move a page at a time in the character select screen\nchanged the sense of the rotation buttons to be more logical\ncontroller focus movement in FE has repeat when held\nUse the correct string (based on type, not index) to name the controller you're configuring on the controls screen\nAdded default PS3 controller bindings on OSX\nAdded various missing control bindings across platforms\nSplit ui focus controls from movement\nSplit prev/next controls from prev/next page, bound to spinner\nControls screen listens for pgup/pgdown, scrolls by half-screens so you can see some paired controls better\nDeprecated &quot;custom control&quot; values which are unused inhouse, hopefully unused in mods\nIncrement control mapping version, invalidating users' current mapping settings (sorry!)\nWhen hovering a stackable item over a stack of the same type the hint now says &quot;Put&quot; instead of &quot;Swap&quot; to match the behaviour\nPerformance\n\nRe-enabled mipmapping on pc - the game should look much cleaner at low resolutions now\nSet up better timer code for osx and linux\nLots of GPU / shader optimizations - the game should run better on older cards\nmade killer bee brains cheaper\nmade controller button popup checker cheaper\nFire fighting ) - Perf improvement with burning trees (lights in general). Light buffer is now quarter res (actually it's fixed res)\nLua spike prevention - no deferred userdata cleanup, timeslicing &quot;built-in&quot;\nUI fixes \n\ndisable crafting/inventory opening when you are a beaver\nadjust recipe description text over slightly\nproperly pause game when prompting the player to confirm activation of adventure portal so that controller input isn't picked up by the game\nThe audio settings are automatically changed when starting a new game on a fresh install\nfix scrolling issue with crafting UI\nFix mousewheel zoom on map screen\nclock is now more legible\nDon't stop FE music when a character is selected\nUpdated fonts in inventory bar for legibility\nSpoilable inventory items now also have a highlight outline behind their icon/text\nfix text cut-off in crafting menu\nreplaced big arrow button anims with image buttons\nhide hud and squelch interaction when going through wormhole\nmap screen panning is smooth instead of chunky\nRemove non-functional open/close prompt for equipped containers when using controller\narrow added to hud for backpack\ninventory bg is one solid image\nmove chester open menu up to the top of the screen\nopening chester will close chests and vice-versa (so they don't overlap)\nDisplay deaths recorded as &quot;unknown&quot; as &quot;shenanigans&quot; instead\nMisc\n\nDid full string pass - there should be no more missing strings\nPlayer character Art is high-res for nicer closeups\n\nNovember 19, 2013 - Bugfix\nGameplay fixes Build 89932:\n\nIntegrated better driver and resolution messages.\n- default bindings for 360 wired controller on OSX\n- wired 360 controller is detected by available buttons/sticks on OSX\nallow multiple containers to open when you are using the mouse and keyboard\nfix for KEDS-179 - don't allow controller deployment from within a container\n- [Bug #1292] cave and follower information is cleared when saving with CompleteLevel\nfix for interrupted actions when hit\nfix for entities not falling asleep when teleported\nfix for stale component reference in projectile\nyou can properly deploy or murder captured butterflies\nNew pot file.\n- Fix PS4 triggers always held under OSX\nAdd help text for load widget\nfix for WX78 dying on load if he's upgraded a lot and has a lot of effigies\nFix for putting putting partial stacks in a container.\nAdd help text for buttons (&quot;select&quot;) and popup dialog (&quot;back&quot;) functionality.\ncave entrances shouldn't show up in adventure mode\nFix for flickering walls and such.\n- [Bug #1295] on screen controls don't store controller id between updates to ensure that they are always displaying the correct control tips\nput an upper limit on the number of birds Wickerbottom can spawn at once to avoid out of memory birdameggedon\nhide the crafting menu when using the pause inventory\n- [Bug #1292] world clock is only advanced to the player's age when entering or leaving caves, not after travelling with the teleportato\n- additionally the player's age is reset to 0 when entering a world with an age of 0 when not ascending/descending, otherwise the next ascend/descend will advance the world to the previous age value\nput a cap on map zoom-out\nfix customization screen override loading\nFix for minimap not clearing properly.\n\nJust extract and play! Its latest updated version","torrent":{"xt":"urn:btih:89682d55da30427efb8138fe3647119819857be5","amp;dn":"Don%27t+Starve+v1.90423","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89682d55da30427efb8138fe3647119819857be5","infoHashBuffer":{"type":"Buffer","data":[137,104,45,85,218,48,66,126,251,129,56,254,54,71,17,152,25,133,123,229]},"announce":[],"urlList":[]}}