{"title":"Cloud Atlas - by David Mitchell - Audiobook - Unabridged mp3","uid":15889126,"size":572859245,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:89897a6d41eae0732a252887cc1787a26e58cd51&amp;dn=Cloud+Atlas+-+by+David+Mitchell+-+Audiobook+-+Unabridged+mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":2,"uploader":"OddioVizyule","files":17,"time":1474699678,"description":"From David Mitchell, the Booker Prize nominee, award-winning writer, and one of the featured authors in Granta's Best of Young British Novelists 2003 issue, comes his highly anticipated third novel, a work of mind-bending imagination and scope.\r\n\r\nA reluctant voyager crossing the Pacific in 1850; a disinherited composer blagging a precarious livelihood in between-the-wars Belgium; a high-minded journalist in Governor Reagan's California; a vanity publisher fleeing his gangland creditors; a genetically modified &quot;dinery server&quot; on death-row; and Zachry, a young Pacific Islander witnessing the nightfall of science and civilization: the narrators of Cloud Atlas hear each other's echoes down the corridor of history, and their destinies are changed in ways great and small.\r\n\r\nIn his captivating third novel, shortlisted for the Booker Prize, David Mitchell erases the boundaries of language, genre, and time to offer a meditation on humanity's dangerous will to power, and where it may lead us.\r\n\r\nNote to listeners: The complicated format of this novel makes it seem that the audio may be cutting off before the end of a story, accompanied by a change in narrator. However, this is the author's intention, so please continue to listen, and the stories will conclude themselves as intended","torrent":{"xt":"urn:btih:89897a6d41eae0732a252887cc1787a26e58cd51","amp;dn":"Cloud+Atlas+-+by+David+Mitchell+-+Audiobook+-+Unabridged+mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89897a6d41eae0732a252887cc1787a26e58cd51","infoHashBuffer":{"type":"Buffer","data":[137,137,122,109,65,234,224,115,42,37,40,135,204,23,135,162,110,88,205,81]},"announce":[],"urlList":[]}}