{"title":"America First! - Its History, Culture and Politics (2016) Gooner","uid":15846669,"size":1331473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89de57d7f58c9f4b0d4cf2597732219a0db52453&amp;dn=America+First%21+-+Its+History%2C+Culture+and+Politics+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1474109081,"description":"America First! - Its History, Culture and Politics (2016) (Epub) Gooner\r\n\r\nPublisher: Prometheus Books (20 Sept. 2016)\r\nLanguage: English\r\nISBN-10: 1633883094\r\nISBN-13: 978-1633883093\r\n\r\nThis lively, iconoclastic book, first published in 1995, but enduringly relevant, explores the rich heritage, the turbulent present, and the possible future of the political and cultural tendency known as &quot;America First.&quot; With its isolationist stance against foreign wars and economic globalism, America First has helped to shape, if only in opposition, American policy both at home and abroad. \r\n\r\nBill Kauffman, a columnist for The American Conservative, examines the nineteenth-century underpinnings and twentieth-century eruptions of American isolationism and nationalism, which are the fault lines along which the politics of the 21st century are cleaving. Kauffman recounts a fascinating story of &quot;Little American&quot; political culture, which was distinguished by its opposition to militarism, big government, and the concentration of wealth in the hands of the few, and by its promotion of the common man. The populist-isolationist song continues to be sung by many ordinary Americans who are far from the corridors of power yet who decry passionately, even desperately, what they consider reckless and destructive foreign wars and economic and immigration policies. \r\n\r\nIn a new preface and epilogue written especially for this reissue, Kauffman traces the evolution of America First sentiment over the past twenty years: from its near-eclipse in the war hysteria of the George W. Bush administration to its revival in 2016 with the populist campaigns of Donald Trump and Senator Bernie Sanders.\r\n \r\nAmerica First! is a rarity among political books: it remains more timely, relevant, and even urgent than ever.&quot;","torrent":{"xt":"urn:btih:89de57d7f58c9f4b0d4cf2597732219a0db52453","amp;dn":"America+First%21+-+Its+History%2C+Culture+and+Politics+%282016%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89de57d7f58c9f4b0d4cf2597732219a0db52453","infoHashBuffer":{"type":"Buffer","data":[137,222,87,215,245,140,159,75,13,76,242,89,119,50,33,154,13,181,36,83]},"announce":[],"urlList":[]}}