{"title":"1453: The Holy War for Constantinople","uid":15791538,"size":7567794,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a65672b0b235884db7b12441f07e7759b00c094&amp;dn=1453%3A+The+Holy+War+for+Constantinople&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"marty14","files":1,"time":1473385597,"description":"1453: The Holy War for Constantinople and the Clash of Islam and the West - Roger Crowley [epub]\r\n\r\nOn May 29, 1453, Ottoman forces, under the leadership of Mehmet II, concluded their long and bloody siege of Constantinople by storming the city and overtaking it. According to Crowley, who works in publishing in England; the Ottoman conquest of the city brought to an end centuries of conflict between the Byzantine Empire and Islam. In overwhelming detail and colorless prose, Crowley chronicles the story of an ancient city and its attraction to members of two major religions.\r\n\r\nBefore Mehmet's conquest, Constantinople had faced various unsuccessful sieges, and Crowley faithfully records them. The most destructive events came between 1341 and 1371, when earthquakes and the Black Death devastated the city, turning it into a forlorn series of villages. Although the Byzantine capital recovered enough of its former glory to entice Mehmet to its walls, even he felt tremendous disappointment, finding the city didn't live up to its reputation. Crowley drones through the day-by-day events of Mehmet's siege and the results of the conquest. Perhaps the author's most instructive point, made by others as well, is that Mehmet turned the city into one where religious toleration and multiculturalism flourished","torrent":{"xt":"urn:btih:8a65672b0b235884db7b12441f07e7759b00c094","amp;dn":"1453%3A+The+Holy+War+for+Constantinople","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a65672b0b235884db7b12441f07e7759b00c094","infoHashBuffer":{"type":"Buffer","data":[138,101,103,43,11,35,88,132,219,123,18,68,31,7,231,117,155,0,192,148]},"announce":[],"urlList":[]}}