{"title":"Microsoft Office 2016 VL Select Edition (x64) July 2016","uid":15366345,"size":7560669104,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8aae0232eba9c4e373391300faab292e0c38fa79&amp;dn=Microsoft+Office+2016+VL+Select+Edition+%28x64%29+July+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":3,"uploader":"jovo_bih","files":2,"time":1469081878,"description":"Microsoft Office 2016 VL Select Edition (x64) July 2016\r\n\r\n*** About this release\r\n\r\nMicrosoft Office 2016 VL Select Edition allows a fully customized installation of Office 2016.\r\nYou can choose to install\r\n\r\n- Office 2016 Standard Edition: Word, Excel, PowerPoint, OneNote, Outlook, Publisher, Office Online (Word, Excel, PowerPoint, OneNote)\r\n- Office 2016 Professional Edition: as above + Access, Skype for Business *\r\n- Standalone Office 2016 applications: Access, Excel, Outlook, Powerpoint, Project Standard/Professional, Publisher, Visio Standard/Professional, Word\r\n\r\n** Release Info\r\n\r\n- Language: English (en-US)\r\n- Proofing Tools: English, French, Spanish\r\n- Channel: Volume License\r\n- Version: 16.0.4405.1000\r\n- OS: Windows 10/8.1/8/7 SP1 + Windows 10 Server, Server 2012 R2/2012/2008 R2 (64-bit only)\r\n- Updated July, 2016\r\n\r\n* Customized default setup (slightly modified using OCT - Office Customization Tool)\r\n\r\n- Skip EULA\r\n- Shortcuts - Office 2016 by default decides to put all of the shortcuts on the start menu WITHOUT a subdirectory – splattered all over the start menu. The included setup customization files place all shortcuts for Office 2016 suites and single applications into a subdirectory Microsoft Office 2016, and Office tools into a subdirectory Tools\r\n- Default setup options- all programs and features will be installed by default, except for Skype for Business (Office 2016 ProPlus) and Office Telemetry  (Office 2016 suites / applications) - you can obviously modify all setup options as you wish\r\n\r\n- Skype for Business (why you should not install it, nor accept to install it as an 'optional update' from Microsoft Update)\r\nThe thing is, default setup will install Skype for Business, whether the computer has the Skype for Business client already installed or not.\r\nIf you choose to install Skype for Business from Office setup, it will run through a Skype setup wizard, which prompts you to start Skype when Windows starts, install Skype Click to Call, set Bing as your search engine and MSN as your homepage, and then asks you to sign in.\r\nHere's where the confusion starts. What account do I use? If you select Skype Name and use your existing (personal/home) account it will configure the computer to use two identities - Skype for your personal account and Skype for Business for your work account. If you select Microsoft Account, it will create a new Live ID with your work email address - something you probably don't want to do.\r\n\r\n- Office Telemetry (why you might not want to share your data) \r\nTelemetry Dashboard displays the file names and titles of documents in each user’s Most Recently Used list, which might reveal personal or confidential information about the user or organization. The names of add-ins and other solutions that are used by Office are also displayed.\r\n\r\nThe telemetry agent collects inventory, usage, and other application data and uploads it to a shared folder, where it is processed by a service known as the telemetry processor and inserted into an SQL database. The Telemetry Dashboard connects to this database so that it can show the usage of Office files, add-ins, and solutions.\r\n\r\n*** Bonus folder\r\n\r\n- KMSpico 10.2.0 + Microsoft Toolkit 2.6 BETA 5 (activators)\r\n- UBitMenu Customizer (adds Office 2003 type toolbars and menus to Office 2016) - free for private use\r\n- Previous versions uninstallers (Office 2016, 2013, 365, 2003, 2007, 2010)\r\n- ShellNewHandler (easily remove New Microsoft_xxxx in Windows Explorer context menu)\r\n- Disable/Restore 'Sign In' option in Office applications (reg file)\r\n- Disable/Restore Office 2016 Telemetry (reg file)\r\n\r\n*** Compatibility with previous versions\r\n\r\nMicrosoft has removed the ability to run parallel versions of Office with the 2016 release.\r\nPart of the installer will search and remove any previous version and not permit the operation of older components. e.g. an older version of Outlook 2013/2010 with Publisher 2016.\r\n\r\nIn other words, don't mix Office versions\r\n\r\nYou can use Microsoft FixIt Tools to manually uninstall / remove / delete previous Office versions (included in Bonus folder).\r\nThis should remove all traces of Office from the system.\r\n\r\n*** Updating Microsfot Office 2016 Volume Edition\r\n\r\nUnlike the Click2Run editions, the Volume Edition does not offer updating the application through the Account page (File --&gt; Accounts --&gt; Updates).\r\nTo get updates for the Office 2016 VL version, you must enable &quot;Get updates for other products from Microsoft update&quot; in Windows Update.\r\n\r\n*** Installation\r\n\r\n- Delete any previously installed version using the provided uninstallers (bonus folder) and reboot if required\r\n- Mount / burn / extract ISO file\r\n- Install ALL desired Office components before running activator\r\nNote: you can install single application(s) first, and a suite later on. From the suite setup, you do not need to select any of the applications already installed (this will not remove them)\r\n- Activate using KMSpico 10.2.0 (recommended) / Microsoft Toolkit 2.6 BETA 5 \r\n\r\n** Optional\r\n\r\n- Disable / Restore Office 2016 Telemetry - merge reg file 'Disable/Restore Office 2016 Telemetry' (takes effect after rebooting your machine)\r\n- Disable / Restore 'Sign In' option in Office applications - merge reg file 'Disable / Restore Sign In' (takes effect after rebooting your machine)\r\n- Install UBitMenu Customizer (optional)\r\n- Run ShellNewHandler (easily remove New Microsoft_xxxx in Windows Explorer context menu)","torrent":{"xt":"urn:btih:8aae0232eba9c4e373391300faab292e0c38fa79","amp;dn":"Microsoft+Office+2016+VL+Select+Edition+%28x64%29+July+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aae0232eba9c4e373391300faab292e0c38fa79","infoHashBuffer":{"type":"Buffer","data":[138,174,2,50,235,169,196,227,115,57,19,0,250,171,41,46,12,56,250,121]},"announce":[],"urlList":[]}}