{"title":"Helvetica.A.Documentary.Film.by.Gary.Hustwit","uid":3942788,"size":692571465,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8b51a48266c9e58bd5e42b82a94f5bc71cec8aa8&amp;dn=Helvetica.A.Documentary.Film.by.Gary.Hustwit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":"csnlestat","files":1,"time":1198263207,"description":"Helvetica is a feature-length independent film about typography, graphic design and global visual culture. It looks at the proliferation of one typeface (which will celebrate its 50th birthday in 2007) as part of a larger conversation about the way type affects our lives. The film is an exploration of urban spaces in major cities and the type that inhabits them, and a fluid discussion with renowned designers about their work, the creative process, and the choices and aesthetics behind their use of type.\n\nHelvetica encompasses the worlds of design, advertising, psychology, and communication, and invites us to take a second look at the thousands of words we see every day.\n\nThe film was shot in high-definition on location in the United States, England, the Netherlands, Germany, Switzerland, France and Belgium. It is currently screening at film festivals and special events worldwide.\n\nInterviewees in Helvetica include some of the most illustrious and innovative names in the design world, including Erik Spiekermann, Matthew Carter, Massimo Vignelli, Wim Crouwel, Hermann Zapf, Neville Brody, Stefan Sagmeister, Michael Bierut, David Carson, Paula Scher, Jonathan Hoefler, Tobias Frere-Jones, Experimental Jetset, Michael C. Place, Norm, Alfred Hoffmann, Mike Parker, Bruno Steinert, Otmar Hoefer, Leslie Savan, Rick Poynor, Lars MÃƒÂ¼ller, and many more.","torrent":{"xt":"urn:btih:8b51a48266c9e58bd5e42b82a94f5bc71cec8aa8","amp;dn":"Helvetica.A.Documentary.Film.by.Gary.Hustwit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b51a48266c9e58bd5e42b82a94f5bc71cec8aa8","infoHashBuffer":{"type":"Buffer","data":[139,81,164,130,102,201,229,139,213,228,43,130,169,79,91,199,28,236,138,168]},"announce":[],"urlList":[]}}