{"title":"The Fortress: A Love Story (2016) by Danielle Trussoni","uid":15892871,"size":641653,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b81912ae98005864794dd1b8095ff48e8adbfb6&amp;dn=The+Fortress%3A+A+Love+Story+%282016%29+by+Danielle+Trussoni&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":4,"uploader":"Dr.Soc","files":1,"time":1474769852,"description":"The Fortress: A Love Story by Danielle Trussoni\r\nEnglish | 2016 | ISBN: 0062459007 | 336 pages | EPUB | 0.6 MB\r\n\r\nThe critically acclaimed, bestselling author of Falling Through the Earth and Angelology returns with this much-anticipated memoir of love and transformation in France. The Fortress is Peter Mayle meets Eat, Pray, Love, a gorgeously written account of one woman’s journey to the other side of the romantic fairytale.\r\n\r\n&quot;If I had been another woman, I might have been skeptical. But I wasn’t another woman. I was a woman ready to be swept away. I was a woman ready for her story to begin. As a writer, story was all that mattered. Rising action, dramatic complication, heroes and villains and dark plots. I believed I was the author of my life, that I controlled the narration.&quot;\r\n\r\nFrom their first kiss, twenty-seven-year-old writer Danielle Trussoni is spellbound by a novelist from Bulgaria. The two share a love of jazz and books and travel, passions that intensify their whirlwind romance.\r\n\r\nEight years later, hopeful to renew their marriage, Danielle and her husband move to the south of France, to a picturesque medieval village in the Languedoc. It is here, in a haunted stone fortress built by the Knights Templar, that she comes to understand the dark, subterranean forces that have been following her all along.\r\n\r\nWhile Danielle and her husband eventually part, Danielle's time in the fortress brings precious wisdom about life and love that she could not have learned otherwise. Ultimately, she finds the strength to overcome her illusions, and start again.\r\n\r\nAn incisive look at romantic love, The Fortress is one woman’s fight to understand the complexities of her own heart, told by one of the best writers of her generation","torrent":{"xt":"urn:btih:8b81912ae98005864794dd1b8095ff48e8adbfb6","amp;dn":"The+Fortress%3A+A+Love+Story+%282016%29+by+Danielle+Trussoni","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b81912ae98005864794dd1b8095ff48e8adbfb6","infoHashBuffer":{"type":"Buffer","data":[139,129,145,42,233,128,5,134,71,148,221,27,128,149,255,72,232,173,191,182]},"announce":[],"urlList":[]}}