{"title":"Halo 2 ISO + Games for Windows Marketplace client","uid":7644602,"size":3785915795,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8cb062df95e10f0843e71761ba77d9654702dbbb&amp;dn=Halo+2+ISO+%2B+Games+for+Windows+Marketplace+client&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":4,"uploader":"Presidium","files":1,"time":1347870370,"description":"Before you read, listen up. SEED DAMMIT!!! Its starting out with just me, and I can't leave my laptop seeding most of the time, so I need people who can consistently seed to help me out. That is all.\n___________________________________________________________________________________\n\n\nThis is the ISO image of Halo 2 Vista (but works for Win7 just fine). This is for the person who either:\n\nA. Lost their disc of the game but still has their CD Key and wants to install/play the game without buying another damned copy,\n\nor\n\nB. Plans on finding a cracked CD Key elsewhere to install/play Halo 2 PC.\n\n\nI am only including the ISO image of the disc (no illegal content included, as it is useless without a key) and a copy of the &quot;Games for Windows Marketplace&quot; client from Microsoft. I strongly discourage illegal use of this ISO.\n\n\nREADME:\n\n&lt;&lt;&lt;&lt;&lt; THINGS TO KNOW TO MAKE THE INSTALL A CAKE WALK &gt;&gt;&gt;&gt;&gt;\n\n1.) Install the &quot;Games for Windows Marketplace&quot; client before installing Halo 2. The game will not be able to run without the client installed.\n\n2.) This game (to my knowledge) will NOT work for Windows XP without some fancywork. For Win7 users: ignore the error messages, the game will run fine.\n \n3.) Don't think this copy is messed up if you don't see anybody online. It's been like that for a while, and I hope someone starts hosting servers again.\n\n4.) Make sure you keep this ISO file even after you install it. Halo 2 needs to always run off the disc to play even when installed, so just mount it every time you want to play. And since you're keeping it... why not seed?\n\n\n___________________________________________________________________________________\n\nThat's it. Instructions on how to use this ISO file (if you don't know how) included in the READ_ME.txt file. Enjoy.\n\n\n~Presidium\n\nP.S. This is my first torrent. Let me know what you think. ","torrent":{"xt":"urn:btih:8cb062df95e10f0843e71761ba77d9654702dbbb","amp;dn":"Halo+2+ISO+%2B+Games+for+Windows+Marketplace+client","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cb062df95e10f0843e71761ba77d9654702dbbb","infoHashBuffer":{"type":"Buffer","data":[140,176,98,223,149,225,15,8,67,231,23,97,186,119,217,101,71,2,219,187]},"announce":[],"urlList":[]}}