{"title":"Cyberspies: The Secret History of Surveillance, Hacking, and Dig","uid":15258090,"size":575462548,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8ce16d9defe832253e65c92c0670b9c066191227&amp;dn=Cyberspies%3A+The+Secret+History+of+Surveillance%2C+Hacking%2C+and+Dig&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":null,"files":23,"time":1468151926,"description":"Cyberspies: The Secret History of Surveillance, Hacking, and Digital-Espionage [Audiobook] by Gordon Corera \r\n\r\n \nhttp://www.audiobooks.com/audiobook/cyberspies-the-secret-history-of-surveillance-hacking-and-digital-espionage/268594\r\n\r\nThe previously untold-and previously highly classified-story of the conflux of espionage and technology, a compelling narrative rich with astonishing revelations taking readers from World War II to the Internet age\r\n\r\nAs the digital era becomes increasingly pervasive, the intertwining forces of computers and espionage are reshaping the entire world; what was once the preserve of a few intelligence agencies now affects us all.\r\n\r\nCorera's compelling narrative takes us from the Second World War through the Cold War and the birth of the Internet to the present era of hackers and surveillance. The book is rich with historical detail and characters, as well as astonishing revelations about espionage carried out in recent times by the United Kingdom, the United States, and China. Using unique access to the NSA, GCHQ, Chinese officials, and senior executives from some of the most powerful global technology companies, Gordon Corera has gathered compelling stories from heads of state, hackers, and spies of all stripes.\r\n\r\nCyberspies is a groundbreaking exploration of the new space in which the worlds of espionage, diplomacy, international business, science, and technology collide","torrent":{"xt":"urn:btih:8ce16d9defe832253e65c92c0670b9c066191227","amp;dn":"Cyberspies%3A+The+Secret+History+of+Surveillance%2C+Hacking%2C+and+Dig","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ce16d9defe832253e65c92c0670b9c066191227","infoHashBuffer":{"type":"Buffer","data":[140,225,109,157,239,232,50,37,62,101,201,44,6,112,185,192,102,25,18,39]},"announce":[],"urlList":[]}}