{"title":"RollerCoaster Tycoon World (Update 10)","uid":15171010,"size":3621485092,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8cf0c4489434586bfe1536a0f95282bc9b5693f1&amp;dn=RollerCoaster+Tycoon+World+%28Update+10%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":3,"uploader":"dauphong","files":1,"time":1467392731,"description":"\nAbout This Game\r\nRollerCoaster Tycoon World™ is the newest installment in the legendary RCT franchise. This next-generation theme park simulation and building game includes fan-favorite features and incredible new advancements such as stunning 3D environments full of roller coaster thrills, exciting flat rides, eager guests, user-generated content, robust social features, and more – all in one massively fun game!\r\nFEATURES\r\nPowerful Building Tools:\r\n\r\n    Freeform Object Placement: Control and place every single in-game object anywhere on the map at any angle. For our more casual users we are also providing ‘snap-to’ and ‘brush’ placement functionality to make this enhancement easy to use.\r\n    Curved Paths: Select your unique type of path from a variety of widths, styles, and shapes. You can make them straight or, for the first time in the franchise, curve them at almost any angle!\r\n    Innovative 3D Track Editor: Create the coolest and wildest coasters imaginable with our best track editor ever! For the first time, using our spline based editor, tracks can be fully manipulated in 3D allowing you to create any shape you can dream up.\r\n    Fully Deformable Terrain with Water: Build amazing rides and change your park’s landscape in full 3D with completely deformable terrain and water.\r\n    Expansive Selection of In-Game Objects: Entertain your park guests with many different types of coasters and rides, all in eye-popping next generation resolution. Choose from premade rides and coasters to scenery and shops.\r\n\r\n\r\nExpansive Customization Support:\r\n\r\n    UGC Tools: For the first time, you will be able to create items like your own scenery and peeps, in any 3D editing program that works with Unity, and import it into the game for everyone to use!\r\n    Multiple Maps and Themes: Choose from different environments and theme options to make each map unique.\r\n\r\n\r\nFully Realized Next-Generation Simulation:\r\n\r\n    Detailed Park Management Tools: Run a successful theme park with the beautifully crafted User Interface that provides easy access to all of your park management tools. From park finances to the thoughts of your guests, everything is at your fingertips including new features, like heat maps and tips!\r\n    Multiple Game Modes: Play the way you want in Sandbox mode, or complete varying challenges and quests in Scenario and Campaign modes.\r\n    Responsive Environments + Guests: Create themed zones in your park! Placing different themed rides and objects will affect not only ratings but increase its attractiveness to certain peeps, changing the game play dynamically.\r\n    Advanced Physics Calculations: The coasters in RCTW use a more complex physics simulation than any previous game in the franchise. This simulation allows for amazing designs and a lifelike riding experience. Build a coaster that stays perfectly on its tracks or teeters on the brink of disaster; just be careful or your coaster may jump the rails!\r\n    Ride Every Coaster: Hop into the front seat of a coaster and ride what you made yourself!\r\n    Innovative Services: Manage your park’s medical, janitorial, entertainment and mechanical needs with the re-designed, simple-yet-powerful services system.\r\n\r\n\r\nNative Sharing and Social Features:\r\n\r\n    Social Media Integration: Share all your cool creations and designs with your friends straight from within the game!\r\n    Freeform Cameras: Take a video at any angle; edit your park above, below, or next to a ride. Prefer an isometric view? We have that too!\r\n    Friend’s Lists and Stat Comparisons: See what your Steam and Social friends are up to in their games from within yours! It’s easy to see someone’s latest coaster or when they last edited their park.\r\n    Visit a Friend: Check out a friend’s park with a simple click! Chat with them and give them suggestions on what to do next while you’re there.\r\n    Native Steam Workshop Support: Native Steam Workshop support is built right in the game! The interface has been simplified and centralized to make it easy for anyone from casual to hardcore to use. Custom scenery, blueprinted coasters, parks and more can be easily and seamlessly shared from within the game. UGC has been designed to be accessible and easy to use for everyone","torrent":{"xt":"urn:btih:8cf0c4489434586bfe1536a0f95282bc9b5693f1","amp;dn":"RollerCoaster+Tycoon+World+%28Update+10%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cf0c4489434586bfe1536a0f95282bc9b5693f1","infoHashBuffer":{"type":"Buffer","data":[140,240,196,72,148,52,88,107,254,21,54,160,249,82,130,188,155,86,147,241]},"announce":[],"urlList":[]}}