{"title":"Glow Kids - How Screen Addiction Is Hijacking Our Kids (2016)","uid":16009094,"size":1433180,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8deeb4a38b5f04f2328ceb6ff8e0a4fc333b4974&amp;dn=Glow+Kids+-+How+Screen+Addiction+Is+Hijacking+Our+Kids+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1476213084,"description":"Glow Kids - How Screen Addiction Is Hijacking Our Kids-and How to Break the Trance (2016) (Epub) Gooner\r\n\r\nPublisher: St. Martin's Press (13 Nov. 2016)\r\nLanguage: English\r\nISBN-10: 1250097991\r\nISBN-13: 978-1250097996\r\n\r\nWe've all seen them: kids hypnotically staring at glowing screens in restaurants, in playgrounds and in friends' houses and the numbers are growing. Like a virtual scourge, the illuminated glowing faces - the Glow Kids - are multiplying. But at what cost? Is this just a harmless indulgence or fad like some sort of digital hula-hoop? Some say that glowing screens might even be good for kids - a form of interactive educational tool. Don't believe it. \r\n\r\nIn Glow Kids, Dr. Nicholas Kardaras will examine how technology - more specifically, age inappropriate screen tech, with all of its glowing ubiquity has profoundly affected the brains of an entire generation. Brain imaging research is showing that stimulating glowing screens are as dopaminergic (dopamine activating) to the brain's pleasure centre as sex. And a growing mountain of clinical research correlates screen tech with disorders like ADHD, addiction, anxiety, depression, increased aggression, and even psychosis. \r\n\r\nMost shocking of all, recent brain imaging studies conclusively show that excessive screen exposure can neurologically damage a young person's developing brain in the same way that cocaine addiction can. Kardaras will dive into the sociological, psychological, cultural, and economic factors involved in the global tech epidemic with one major goal: to explore the effect all of our wonderful shiny new technology is having on kids","torrent":{"xt":"urn:btih:8deeb4a38b5f04f2328ceb6ff8e0a4fc333b4974","amp;dn":"Glow+Kids+-+How+Screen+Addiction+Is+Hijacking+Our+Kids+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8deeb4a38b5f04f2328ceb6ff8e0a4fc333b4974","infoHashBuffer":{"type":"Buffer","data":[141,238,180,163,139,95,4,242,50,140,235,111,248,224,164,252,51,59,73,116]},"announce":[],"urlList":[]}}