{"title":"Utopia Is Creepy And Other Provocations (2016) (Epub) Gooner","uid":15956509,"size":1289021,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e5f6ea9df0087b13554291cef0ec140b82afe07&amp;dn=Utopia+Is+Creepy+And+Other+Provocations+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":5,"uploader":"GoonerTPB","files":2,"time":1475625166,"description":"Utopia Is Creepy And Other Provocations (2016) (Epub) Gooner\r\n\r\nPublisher: W. W. Norton &amp; Company (9 Sept. 2016)\r\nLanguage: English\r\nISBN-10: 0393254542\r\nISBN-13: 978-0393254549\r\n\r\nWith a razor wit, Nicholas Carr cuts through Silicon Valley's unsettlingly cheery vision of the technological future to ask a hard question: Have we been seduced by a lie? Gathering a decade's worth of posts from his blog, Rough Type, as well as his seminal essays, Utopia Is Creepy offers an alternative history of the digital age, chronicling its roller-coaster crazes and crashes, its blind triumphs, and its unintended consequences.\r\n\r\nCarr's favorite targets are those zealots who believe so fervently in computers and data that they abandon common sense. Cheap digital tools do not make us all the next Fellini or Dylan. Social networks, diverting as they may be, are not vehicles for self-enlightenment. And likes and re-tweets are not going to elevate political discourse. When we expect technologies designed for profit to deliver a paradise of prosperity and convenience, we have forgotten ourselves. In response, Carr offers searching assessments of the future of work, the fate of reading, and the rise of artificial intelligence, challenging us to see our world anew.\r\n\r\nIn famous essays including Is Google Making Us Stupid? and Life, Liberty, and the Pursuit of Privacy, Carr dissects the logic behind Silicon Valley s liberation mythology, showing how technology has both enriched and imprisoned us often at the same time. Drawing on artists ranging from Walt Whitman to the Clash, while weaving in the latest findings from science and sociology, Utopia Is Creepy compels us to question the technological momentum that has trapped us in its flow. Resistance is never futile, argues Carr, and this book delivers the proof","torrent":{"xt":"urn:btih:8e5f6ea9df0087b13554291cef0ec140b82afe07","amp;dn":"Utopia+Is+Creepy+And+Other+Provocations+%282016%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e5f6ea9df0087b13554291cef0ec140b82afe07","infoHashBuffer":{"type":"Buffer","data":[142,95,110,169,223,0,135,177,53,84,41,28,239,14,193,64,184,42,254,7]},"announce":[],"urlList":[]}}