{"title":"Maximum The Hormone Discography","uid":4217326,"size":435516899,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8eea029d4023c12337c9bf33503ea2c4f3e8afec&amp;dn=Maximum+The+Hormone+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"EvilOrochi","files":59,"time":1212415750,"description":"The missing songs: http://thepiratebay.se/torrent/4250961/\n\nMaximum the Hormone was created in 1998 with Daisuke Tsuda and Nao Kawakita, along with no longer present Sugi and Key. Their first release, A.S.A. Crew was the only full length album released with this lineup. In 2001, the band released an EP, H?, followed by the departure of Sugi and Key, leaving an opening on guitar and bass guitar.\n\nIn late 2001, the band recruited Uehara Futoshi (Ue-chan) to fill the empty bass guitar position, while Ryo Kawakita (Maximum the Ryo), Nao's brother, took the position of guitar, and also contributing melodic vocals.\n\nIn 2002, the band released a new more single, &quot;Niku Cup&quot;, followed by a full length album, Mimi Kajiru.\n\nAfter their first full album as a band, the band took a more traditional approach to recording, releasing two singles, followed by an album. Their next album, Kusoban in 2004, was close yet to contrasting heavy music mixed with light pop that has gained them mainstream attention.\n\nAfter recording another pair of singles, the band released another album, Rokkinpo Goroshi. The release caused a surge in their fanbase, as they began to sell out more shows, playing many rock festivals, and eventually releasing a live DVD, Debu Vs Debu. In addition, &quot;Rolling1000toon&quot; was featured as an ending theme for the anime series Air Master.\n\n2006 saw the band's breakout into popular culture with the song Koi no Megalover, reaching number nine on the Oricon charts during the summer of 2006; their first top-ten hit in Japan. The band had three of their songs featured in anime series; What's up, people?! and Zetsubou Billy, are featured as the opening and ending tracks, respectively, in the late episodes of the Death Note anime series[2], and Akagi is featured as the ending theme for the Akagi anime series.[3]\n\nAfter the promotion from two singles, and the songs featured on television, Maximum the Hormone released their next album, Buiikikaesu. The album was a record for the band, debuting at number five on the Oricon charts; their first full album to rank.\n\n","torrent":{"xt":"urn:btih:8eea029d4023c12337c9bf33503ea2c4f3e8afec","amp;dn":"Maximum+The+Hormone+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8eea029d4023c12337c9bf33503ea2c4f3e8afec","infoHashBuffer":{"type":"Buffer","data":[142,234,2,157,64,35,193,35,55,201,191,51,80,62,162,196,243,232,175,236]},"announce":[],"urlList":[]}}