{"title":"Manowar - Warriors Of The World (2002), [MP3 320 kbps] Heavy met","uid":4840943,"size":113667484,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8eff30e518d6b712adf7abf2bee069e79e691a2c&amp;dn=Manowar+-+Warriors+Of+The+World+%282002%29%2C+%5BMP3+320+kbps%5D+Heavy+met&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":0,"uploader":"year2012","files":11,"time":1239496123,"description":"Manowar - Warriors Of The World (2002), [LOSSY MP3 320 kbps] Heavy metal [Tntvillage.Scambioetico]\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Manowar%20-%20Warriors%20Of%20The%20World%20(2002)&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=anno2036&amp;sb=1&amp;sd=0&amp;cat=0\n\nManowar - Warriors Of The World\nby anno2036\n\nCover\n Visit this link: http://upload.wikimedia.org/wikipedia/en/8/8d/Warriors_of_the_World.jpg\n\nAlbum\nTitle: Warriors Of The World\nYear:  2002                                    \nGenre: Heavy metal\nLabel: Nuclear Blast\n\nTracklist\n1. Call to Arms\n2. The Fight for Freedom\n3. Nessun Dorma\n4. Valhalla\n5. Swords in the Wind\n6. An American Trilogy\n7. The March\n8. Warriors of the World United\n9. Hand of Doom\n10. House of Death\n11. Fight Until We Die\n\nReview\nfonte:  Visit this link: http://www.debaser.it/recensionidb/ID_13615/Manowar_Warriors_Of_The_World.htm\nL'album si apre nel migliore dei modi con la a mio avviso splendida e sottovalutatissima &quot;Call To Arms&quot;, vera summa del Manowar- pensiero, con il ritorno a casa dei Kings Of Metal che chiamano a raccolta tutti i loro adepti, i quali approvano rumorosamente con i soliti, magistrali cori mentre ÃƒÂ¨ incessante il martellare del basso di DeMaio.\nLa track successiva, &quot;Fight For Freedom&quot;, ÃƒÂ¨ la giusta continuazione di chi l'ha preceduta, ma senza lo stesso coinvolgimento emotivo, mentre &quot;Nessun Dorma&quot; ÃƒÂ¨ un divertente e tutto sommato dovuto esperimento dei Manowar con una discreta prestazione vocale in italiano del grande Eric Adams. Dopo la discreta &quot;An American Trilogy&quot;, altro tributo, stavolta al padrino del rock Elvis Presley, che si rivela &quot;soltanto&quot; godibile, arrivano in fila due capolavori assoluti anche se antitetici nella forma: &quot;Swords In The Wind&quot;, oserei dire batte perfino la sua fonte ispiratrice, la tanto celebrata &quot;Master of the wind&quot; di &quot;Triumph of steel&quot;, ed ÃƒÂ¨ una delle migliori ballad su tema di guerra mai prodotte dal gruppo di New York.\nLa title track ÃƒÂ¨ invece monumentale, una delle migliori canzoni in assoluto dei Manowar con mostri sacri come &quot;Hail and kill&quot; o &quot;Brothers of metal&quot;, con un lavoro incredibile di Adams, di De maio e del coro, con un'intro scandita dal basso e dalla batteria a dir poco epico, ed una parte verso la fine quasi sussurrata in cui il cantante implora i suoi compagni di dire alla sua famiglia come venne ucciso in battaglia e giura che finchÃƒÂ¨ ne avrÃƒÂ  la forza, combatterÃƒÂ  fino alla fine, e poi riattacca di nuovo con l'incredibile ritornello. Ovviamente frasi del genere possono essere prese come pagliacciate o tamarrate fini a se stesse a un primo sguardo, ma se le si riesce a collocare nella quotidianitÃƒÂ  di oggi, si scopre che hanno una certa attualitÃƒÂ  ; esiste comunque gente che avendo letto due testi a caso bollerÃƒÂ  per sempre i Manowar come dei falliti o nel migliore dei casi, dei montati. Il disco si conclude comunque con una tripletta anch'essa di alto livello, &quot;Hand of doom&quot;, &quot;House of death&quot; e l'altro capolavoro del cd &quot;Fight until we die&quot;, tutte e 3 contraddistinte da un basso schiacciasassi e la chitarra al fulmicotone di Karl Logan che bada poco a tecnicismi e molto al sodo.\nConcludendo la rece che in effetti dopo averla riletta un po' lunghina lo ÃƒÂ¨, vorrei semplicemente consigliare questo album, magari non tutto ma solo qualche canzone, a quelle persone che dei manowar non li conoscono o li hanno sempre bollati negativamente per colpa di pregiudizi (i loro fan ovviamente lo conosceranno a memoria e avranno su di esso opinioni discordanti); se c'ÃƒÂ¨ un album leggermente piÃƒÂ¹ easy-listening eppure contemporaneamente di ottimo livello globale, ÃƒÂ¨ questo. 4, 5 sarebbe il voto, non vado sul 5 perchÃƒÂ¨ rappresenta la perfezione, e questo ÃƒÂ¨ un gran album, non un album perfetto\naltre due recensioni:  Visit this link: http://www.metalitalia.com/cds/view.php?cd_pk=515,  Visit this link: http://www.loudvision.it/musica-recensioni-manowar-warriors-of-the-world--787.html\n\nBiography\nfonte:  Visit this link: http://it.wikipedia.org/wiki/Manowar\nI Manowar sono una band heavy metal nata ad Auburn, New York, nel 1980 dall'incontro tra il bassista del gruppo Joey DeMaio e il chitarrista Ross the Boss.\nIl nome del gruppo deriva da un termine usato nell'inglese arcaico, per l'appunto man o' war o man-o-war, che indicava una tipologia di antica nave da guerra a vela. Un'altra possibile traduzione ÃƒÂ¨ quella che intende man-o'-war una contrazione di man of war letteralmente uomo di guerra. I temi ricorrenti delle loro canzoni sono la mitologia, la guerra, la lealtÃƒÂ  e l'onore. I testi delle loro canzoni presentano quasi sempre elogi sulla musica heavy metal, che ÃƒÂ¨ visto non solo come un semplice genere musicale, ma come un vero e proprio stile di vita, di cui i Manowar si vantano di essere gli unici seguaci e portatori della parola.\nI Manowar sono tra i gruppi antesignani e fondatori del sottogenere epic metal; pionieristico in tal senso ÃƒÂ¨ soprattutto l'album Into Glory Ride, pubblicato nel 1983. Il gruppo detiene anche un vasto numero di record. In particolare rivendicano il titolo di &quot;band piÃƒÂ¹ rumorosa del mondo&quot; (precedentemente appartenuto ai MotÃƒÂ¶rhead) grazie al Guinness dei primati che ha registrato questo fatto. La band ÃƒÂ¨ infatti giunta a quota 129.5 decibel attraverso uno speciale equipaggiamento costruito da John &quot;Dawk&quot; Stillwell. Inoltre sono stati la prima band metal a includere argomenti di guerra, spade e metallo sia nelle loro canzoni che nelle loro copertine, a costruirsi un set di amplificatori e chitarre da sÃƒÂ© e su propria misura, ad aver registrato un album in Dolby 5.1 e detengono il record per il concerto metal piÃƒÂ¹ lungo della storia, con una prestazione di 5 ore ed 1 minuto in cui hanno eseguito oltre 50 brani.\n\nFormat\nMP3 - 320 Kbps - 44 kHz\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:8eff30e518d6b712adf7abf2bee069e79e691a2c","amp;dn":"Manowar+-+Warriors+Of+The+World+%282002%29%2C+%5BMP3+320+kbps%5D+Heavy+met","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8eff30e518d6b712adf7abf2bee069e79e691a2c","infoHashBuffer":{"type":"Buffer","data":[142,255,48,229,24,214,183,18,173,247,171,242,190,224,105,231,158,105,26,44]},"announce":[],"urlList":[]}}