{"title":"Company Confessions - Secrets, Memoirs and the CIA (2016) Gooner","uid":15847117,"size":840077,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f1e094e2a43ce0623d7d7700b0f351470d2169a&amp;dn=Company+Confessions+-+Secrets%2C+Memoirs+and+the+CIA+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":1,"uploader":"GoonerTPB","files":2,"time":1474113618,"description":"Company Confessions - Secrets, Memoirs and the CIA (2016) (Epub) Gooner\r\n\r\nPublisher: Thomas Dunne Books (23 Aug. 2016)\r\nLanguage: English\r\nISBN-10: 1250047137\r\nISBN-13: 978-1250047137\r\n\r\nFor fans of Argo and Fair Game, &quot;a lively, absorbing investigation.&quot; Library Journal\r\n\r\nSpies are supposed to keep quiet, never betraying their agents or discussing their operations. Somehow, this doesn t apply to the CIA, whose former officers have written memoirs commanding huge advances and attracting enormous publicity. As an intelligence service dependent on its ability to protect sensitive information, however, it s no surprise that the CIA has fought back.\r\n\r\nIn Company Confessions, award-winning author Christopher Moran digs deep into this tumultuous relationship between the CIA and former agents who try to go public about their careers. He delves into the motivations of spies like CIA officer Valerie Plame, whose identity was leaked by the Bush White House and who reportedly received $2.5 million for her book Fair Game, and exposes the politics and practices of the CIA and its Publications Review Board, including breaking into publishing houses and secretly authorizing pro-agency memoirs.\r\n\r\nDrawing on interviews; the private correspondence of such legendary spies as Allen Dulles, William Colby, and Richard Helms; and declassified CIA files, Company Confessions examines why America s spies are so willing to share their stories, the damage inflicted when they leak the nation s secrets, and the fine line between censorship on the grounds of security and censorship for the sake of reputation","torrent":{"xt":"urn:btih:8f1e094e2a43ce0623d7d7700b0f351470d2169a","amp;dn":"Company+Confessions+-+Secrets%2C+Memoirs+and+the+CIA+%282016%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f1e094e2a43ce0623d7d7700b0f351470d2169a","infoHashBuffer":{"type":"Buffer","data":[143,30,9,78,42,67,206,6,35,215,215,112,11,15,53,20,112,210,22,154]},"announce":[],"urlList":[]}}