{"title":"Mac DeMarco - Salad Days (2014) [FLAC]","uid":9843178,"size":232512649,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8f6fa0c775135a7e9fd4729b97a61cde26948229&amp;dn=Mac+DeMarco+-+Salad+Days+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":1,"uploader":"politux","files":-1,"time":1396026732,"description":"\n  Mac DeMarco - Salad Days (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Lo-Fi, Shoegaze\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Salad Days \n  02 Blue Boy \n  03 Brother \n  04 Let Her Go \n  05 Goodbye Weekend \n  06 Let My Baby Stay\n  07 Passing Out Pieces\n  08 Treat Her Better \n  09 Chamber of Reflection \n  10 Go Easy \n  11 Jonny's Odyssey \n\n  With his 2012 debut, 2, Canadian songwriter Mac DeMarco offered the world a look into his dazed but brilliant mind's eye, his songs landing somewhere between a hallucinogenic re-imagination of '70s soft rock, oddball outsider jams, and laid-back indie fare. The tunes were somehow both tuneful and antagonistic in the subtlest of ways, and DeMarco easily shifted between characters of the stoned joker and sincere balladeer, playing each remarkably convincingly. Salad Days picks up where the strange vibes of 2 left off, brightening the production and shying away from Mac's more insane impulses for a clearer picture of his immensely cracked idea of what pop music is. By this point, DeMarco's guitar sound is becoming one of his signatures. Mellow, snaking, busy lines of chorus-drenched leads intertwine and chime over the top of thoughtful, sometimes restrained chords. \n\n  This guitar work shows up at its most melodic on tracks like &quot;Let Her Go&quot; and the standout &quot;Blue Boy,&quot; and appears in a more jagged form on mellow rockers like &quot;Goodbye Weekend.&quot; DeMarco has his feet in a bevy of styles on Salad Days without coming off scattered, including the brittle '80s R&amp;B synths of &quot;Chamber of Reflection&quot; and the channeling of songwriting greats like John Lennon and Ray Davies elsewhere. The title track goes so far as to sport some &quot;la la la&quot;s that could have been lifted directly off The Kinks Are the Village Green Preservation Society. Absent from this album are both the highly contrasting moments of dreamy-eyed indie rock and wobbly, Ween-indebted weirdness that came through more sharply on 2. With songs touching on themes of maturation, life in the public eye, and good old-fashioned romance, DeMarco has trimmed the fat both musically and conceptually on Salad Days, turning in a streamlined picture of his musical development. With more memorable tracks and a slightly more accessible feel, the album is less distracted and more tuneful than before without losing any of the freewheeling spirit that made his songs and persona so attractive in the first place.","torrent":{"xt":"urn:btih:8f6fa0c775135a7e9fd4729b97a61cde26948229","amp;dn":"Mac+DeMarco+-+Salad+Days+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f6fa0c775135a7e9fd4729b97a61cde26948229","infoHashBuffer":{"type":"Buffer","data":[143,111,160,199,117,19,90,126,159,212,114,155,151,166,28,222,38,148,130,41]},"announce":[],"urlList":[]}}