{"title":"[DvdRip-Xvid-Ita-Mp3]Harry Potter e la pietra filosofale[surviva","uid":5110371,"size":1450574080,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f78c380a47ebb78428fad2d77d37e755b3afdbc&amp;dn=%5BDvdRip-Xvid-Ita-Mp3%5DHarry+Potter+e+la+pietra+filosofale%5Bsurviva&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"mitimex","files":1,"time":1254693965,"description":"\n\nHarry Potter, orfano dei genitori viene lasciato davanti alla dimora degli zii Vernon e Petunia che vivono col figlio Dudley a Privet Drive. Il bambino cresce in un clima ostile e viene trattato dai parenti come uno schiavo ma riesce a fare delle cose incredibili involontariamente, come far scomparire un vetro allo zoo che divide il cugino da un serpente. Ben presto Harry riceve una misteriosa lettera che perÃƒÂ² non riesce a leggere per colpa degli zii che glielo impediscono. Dopo essersi allontanati dalla loro casa per non ricevere piÃƒÂ¹ posta, Harry viene raggiunto da un uomo gigante, Rubeus Hagrid che finalmente gli consegna la lettera e il ragazzo viene finalmente a conoscenza del suo contenuto. Scopre cosÃƒÂ¬ di essere un mago, che anche i suoi genitori lo erano, che furono uccisi da un mago oscuro di nome Lord Voldemort e che lui ÃƒÂ¨ sopravvissuto per miracolo grazie alla piÃƒÂ¹ grande delle magie, l'amore di sua madre. Inoltre, ÃƒÂ¨ stato ammesso alla scuola di magia e stregoneria di Hogwarts. Hagrid porta il ragazzo a Diagon Alley, un quartiere magico, per comprargli ciÃƒÂ² che gli serve per la scuola. Il ragazzo suscita subito l'interesse degli altri maghi poichÃƒÂ© ÃƒÂ¨ l'unico sopravvissuto all'Anatema che Uccide e a testimone di ciÃƒÂ², Harry presenta sulla fronte una piccola cicatrice a forma di saetta. Poco dopo viene accompagnato da Hagrid alla stazione per prendere un treno al binario magico 9 Ã‚Â¾ dove si imbatte per la prima volta nella famiglia Weasley. Anche per uno dei membri della famiglia, Ron Weasley ÃƒÂ¨ il primo anno. I due approfondiscono l'amicizia durante il viaggio per arrivare ad Hogwarts. Giunto a scuola Harry fa  amicizia con Hermione Granger una ragazzina con l'atteggiamento da secchiona, giÃƒÂ  incontrata sul treno; inoltre incontra Draco Malfoy e tra i due scatta subito l'antipatia reciproca. I ragazzi entrano nella Sala Grande dove verranno smistati dal Cappello Parlante e tutti e tre gli amici vengono collocati nella casa dei Grifondoro mentre invece Malfoy viene smistato nella casa dei Serpeverde. Harry partecipa cosÃƒÂ¬ ad alcune lezioni di magia tra le quali le lezioni di volo nella quale si distingue per la sua capacitÃƒÂ  di volare sulla scopa, capacitÃƒÂ  che lo farÃƒÂ  diventare il nuovo cercatore della squadra di Quidditch del Grifondoro. Durante il trascorrere dell'anno scolastico, i tre amici vengono a conoscenza del fatto che nel castello di Hogwarts ÃƒÂ¨ custodita la Pietra Filosofale, un oggetto magico che assicura la vita eterna, e si convincono che il professore di Pozioni Severus Piton voglia rubarla per scopi malvagi. In realtÃƒÂ  ÃƒÂ¨ il professore di Difesa contro le Arti Oscure Raptor ad essere interessato a rubare la pietra per conto di Lord Voldemort, il Signore Oscuro responsabile della morte dei genitori di Harry. Il Signore Oscuro infatti, non ÃƒÂ¨ morto come tutti credono ma vive in simbiosi con il Professor Raptor e lo obbliga ad azioni per conto suo. Dopo varie vicissitudini, i tre ragazzi riescono a raggiungere il luogo in cui la pietra ÃƒÂ¨ custodita ma solamente Harry riesce ad avere un incontro diretto con Raptor, sconfiggendolo. Il preside della scuola Albus Silente spiega ad Harry il motivo della sua vittoria svelandogli anche che la pietra filosofale verrÃƒÂ  infine distrutta per evitare che altri maghi cadano nella tentazione di possederla.\n","torrent":{"xt":"urn:btih:8f78c380a47ebb78428fad2d77d37e755b3afdbc","amp;dn":"%5BDvdRip-Xvid-Ita-Mp3%5DHarry+Potter+e+la+pietra+filosofale%5Bsurviva","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f78c380a47ebb78428fad2d77d37e755b3afdbc","infoHashBuffer":{"type":"Buffer","data":[143,120,195,128,164,126,187,120,66,143,173,45,119,211,126,117,91,58,253,188]},"announce":[],"urlList":[]}}