{"title":"Microsoft Office 2011 for Mac (cbmc)","uid":7756884,"size":955088986,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:8f84b41e3e47d6de29ac98833de728d79835ca4c&amp;dn=Microsoft+Office+2011+for+Mac+%28cbmc%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":3,"uploader":"Cubarican92","files":1,"time":1351124309,"description":"\n\nCreate professional-quality documents, spreadsheets, and presentations with the most-trusted and most-used productivity suite. Familiar applications like Outlook, Word, ExcelÂ® and PowerPointÂ® for Mac 2011 help you take your ideas further. And since Office for Mac is compatible with Office for WindowsÂ®, you can work on documents with virtually anyone on a Mac or PC. Store your files in a secure online SkyDriveÂ® folder to access, edit, or share your work from virtually anywhere with the free Office Web Apps.\nOutlook for Mac 2011\n\nManage your email and calendars with features that simplify staying connected and up to date.\n\n    Clean up your inbox by collapsing long email threads into a single conversation.\n    View your calendar within your e-mail and see your schedule displayed within a meeting invitation.\n    Easily import your Outlook .pst files when you set up your new Mac.\n    Consolidate e-mail from multiple accounts into a single folder.\n    Manage your schedule and contacts without opening Outlook.\n    Review your attachments with Quick Look, archive your files with Time Machine and use Spotlight to search your e-mail.\n\nWord for Mac 2011\n\nPowerful writing tools help you create outstanding documents, then store, edit and share your work easily on the web.\n\n    Create visually rich newsletters, brochures and documents in Publishing Layout view.\n    Instantly see styles applied in your document with Visual Styles.\n    Work in Full Screen view to maximize space for reading and writing documents.\n    Rearrange layers of text, photos and graphics quickly with Dynamic Reordering.\n    View, edit, store and share documents online with the Word Web App on Windows LiveÂ® SkyDriveÂ®.*\n    Share and co-author Word documents with virtually anyone, whether they're using Office on a Mac or PC.\n\nExcel for Mac 2011\n\nClarify your financial picture with easy-to-analyze spreadsheets you can post online to view, edit, share or co-author with your team from virtually anywhere.\n\n    Clarify your data using Conditional Formatting with icons, data bars and color scales.\n    Spot trends with new Sparklines, small charts that fit in a single cell.\n    Spend more time analyzing data and less time sifting through it with PivotTables.\n    Organize, filter and format related data with Excel tables.\n    Increase efficiency and save time by automating repetitive tasks using Visual Basic.\n    View, edit, store and share spreadsheets online with the Excel Web App on Windows LiveÂ® SkyDriveÂ®.*\n    Share and co-author Excel spreadsheets with virtually anyone, whether they're using Office on a Mac or PC.\n\nPowerPoint for Mac 2011\n\nCreate powerful, professional presentations that engage and inspire your audience, and present online as effectively as in person.\n\n    Remove backgrounds or add color filters to your photos right within PowerPoint.\n    Move beyond the conference room and broadcast your presentations online.\n    Rearrange layers of text, photos and graphics quickly with Dynamic Reordering.\n    Rehearse, check your timing and take notes in Presenter View.\n    View, edit, store and share Office documents online with the PowerPoint Web App on Windows LiveÂ® SkyDriveÂ®.*\n    Share and co-author PowerPoint presentations with virtually anyone, whether they're using Office on a Mac or PC.\n","torrent":{"xt":"urn:btih:8f84b41e3e47d6de29ac98833de728d79835ca4c","amp;dn":"Microsoft+Office+2011+for+Mac+%28cbmc%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f84b41e3e47d6de29ac98833de728d79835ca4c","infoHashBuffer":{"type":"Buffer","data":[143,132,180,30,62,71,214,222,41,172,152,131,61,231,40,215,152,53,202,76]},"announce":[],"urlList":[]}}