{"title":"Pavel Tsatsouline -- Kettlebell - Simple &amp; Sinister.pdf","uid":10451212,"size":4536159,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fed7399c6fc7780dcf12e14ec2b7c2367c5315d&amp;dn=Pavel+Tsatsouline+--+Kettlebell+-+Simple+%26amp%3B+Sinister.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":0,"uploader":"tpb_mtzgr","files":-1,"time":1404022727,"description":"Learn how to use the extreme hand-held gym from the source - the man who started the kettlebell revolution. \n\n- Simple &amp; Sinister will prepare you for almost anything life could throw at you, from carrying a piano upstairs to holding your own in a street fight. \n- Simple &amp; Sinister will forge a fighter's physique - because the form must follow the function. \n- Simple &amp; Sinister will give you the strength, the stamina, and the suppleness to play any sport recreationally - and play it well. \n- If you are a serious athlete, Simple &amp; Sinister will serve as a perfect foundation for your sport-specific training. \n- If you are a serious lifter, Simple &amp; Sinister will build your strength, rather than interfere with it. \n\nSimple &amp; Sinister will achieve all of the above while leaving you plenty of time and energy to do your duty, your job, practice your sport, and have a life. \n\nRussian kettlebell power to you! \n\n\nAbout the author: \n\nPavel Tsatsouline is a former Soviet Special Forces physical training instructor, currently a Subject Matter Expert to elite US military and law enforcement special operations units. \n\nPavel introduced the Russian kettlebell to the West in 1998 and started the kettlebell revolution. Dr. Randall Strossen, one of the most respected names in the strength world, stated, &quot;Pavel Tsatsouline will always reign as the modern king of kettlebells since it was he who popularized them to the point where you could almost found a country filled with his converts.&quot; \n\nPavel is the Chairman of StrongFirst, Inc. In addition to the gold-standard kettlebell instructor certification StrongFirst.com offers user courses internationally in kettlebell, barbell and bodyweight training.","torrent":{"xt":"urn:btih:8fed7399c6fc7780dcf12e14ec2b7c2367c5315d","amp;dn":"Pavel+Tsatsouline+--+Kettlebell+-+Simple+%26amp%3B+Sinister.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fed7399c6fc7780dcf12e14ec2b7c2367c5315d","infoHashBuffer":{"type":"Buffer","data":[143,237,115,153,198,252,119,128,220,241,46,20,236,43,124,35,103,197,49,93]},"announce":[],"urlList":[]}}