{"title":"SpyBot - Search &amp; Destroy 1.6.0.30 Final","uid":4366461,"size":15321918,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:904a2537d4f89f060b6e61252f24357d936b29b6&amp;dn=SpyBot+-+Search+%26+Destroy+1.6.0.30+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"romelanda","files":4,"time":1219916904,"description":"sccanned with Bullguard..\n\nSpybot - Search &amp; Destroy detects and removes spyware, a relatively new kind of threat not yet covered by common anti-virus applications. Spyware silently tracks your surfing behaviour to create a marketing profile for you that is transmitted without your knowledge to the compilers and sold to advertising companies. If you see new toolbars in your Internet Explorer that you haven&amp;#039;t intentionally installed, if your browser crashes inexplicably, or if your home page has been &quot;hijacked&quot; (or changed without your knowledge), your computer is most probably infected with spyware. Even if you don&amp;#039;t see the symptoms, your computer may be infected, because more and more spyware is emerging. Spybot-S&amp;D is free, so there&amp;#039;s no harm giving it a try to see if something has invaded your computer.\n\nTo see a list of threats Spybot-S&amp;D can remove, in the navigation bar at the left click on Support --&gt; Threats. For an introduction to Spybot-S&amp;D, please read the tutorial. If you fear incompatibility with other software you are now using, although we can assure you that there is no danger you can review our compatibility overview which lists some software whose compatibility has been analyzed.\n\nSpybot-S&amp;D can also clean usage tracks, an interesting function if you share your computer with other users and don&amp;#039;t want them to see what you have been working on. And for professional users, Spybot-S&amp;D allows you to fix some registry inconsistencies and extended reports. A list of all the application&amp;#039;s features is also available","torrent":{"xt":"urn:btih:904a2537d4f89f060b6e61252f24357d936b29b6","amp;dn":"SpyBot+-+Search+%26+Destroy+1.6.0.30+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"904a2537d4f89f060b6e61252f24357d936b29b6","infoHashBuffer":{"type":"Buffer","data":[144,74,37,55,212,248,159,6,11,110,97,37,47,36,53,125,147,107,41,182]},"announce":[],"urlList":[]}}