{"title":"Strike Back - Season 2","uid":9539229,"size":7271644183,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:90f1cf7c009d89bc18720d592a794ed0ab5e9732&amp;dn=Strike+Back+-+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":23,"uploader":"POtHS11","files":-1,"time":1391005926,"description":"\n\nProject Dawn (2011)\nMain article: Strike Back: Project Dawn\n\nThe second series consists of ten episodes. Porter is captured by a Pakistani terrorist called Latif (Jimi Mistry) while investigating a planned operation of Latif, Project Dawn. Sergeant Michael Stonebridge (Philip Winchester) finds disgraced ex-Delta Force operative Damian Scott (Sullivan Stapleton), who would not be hired by even private military contractors, who previously worked with Porter to track Latif. After Porter is executed, Section 20 discover Porter left the team clues to a hotel in New Delhi, India, where a group of terrorists attempt to capture a weapons scientist with knowledge of hidden weapons of mass destruction originally used to plant in Iraq, which serves as a part of Project Dawn. The weapon, namely VX nerve gas was kept in storage, and Latif has known about its existence.\n\nSection 20's worldwide search for Latif ends in Budapest, Hungary, where they learn he is using suicide bombers by implanting them with explosive devices inside their bodies, which in turn will release the VX. The attempted attacks against a World Summit were actually a diversion to capture former Pakistani general Akmal Ramiz (Silas Carson), who Latif fears will make Pakistan more accessible to the west. He also captures Section 20 head Colonel Eleanor Grant (Amanda Mealing) in an attempt to confess to &quot;Operation Trojan Horse&quot;, which planned to plant VX in Iraq, while also exposing Porter and framing Scott; Grant attempted to cover up the operation in shame. In the end, Grant forces Latif to shoot an empty VX canister, with the explosives still intact, killing them both. Although Scott gains the file that would clear his name, he decides to burn the file and remain in Section 20. Meanwhile, Stonebridge decides to leave to be with his pregnant wife.","torrent":{"xt":"urn:btih:90f1cf7c009d89bc18720d592a794ed0ab5e9732","amp;dn":"Strike+Back+-+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90f1cf7c009d89bc18720d592a794ed0ab5e9732","infoHashBuffer":{"type":"Buffer","data":[144,241,207,124,0,157,137,188,24,114,13,89,42,121,78,208,171,94,151,50]},"announce":[],"urlList":[]}}