{"title":"The Big Three in Economics Adam Smith, Karl Marx, and John Mayna","uid":9235248,"size":2723245,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9123d2be1e77d7887ae0bb23202853269ccd0713&amp;dn=The+Big+Three+in+Economics+Adam+Smith%2C+Karl+Marx%2C+and+John+Mayna&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":1,"uploader":"420weedman","files":4,"time":1385159474,"description":"Overview: Debunking Economics - Revised and Expanded Edition, now including a downloadable supplement for courses, exposes what many non-economists may have suspected and a minority of economists have long known: that economic theory is not only unpalatable, but also plain wrong. When the original Debunking Economics was published back in 2001, the market economy seemed invincible, and conventional &quot;neoclassical&quot; economic theory basked in the limelight. Steve Keen argued that economists deserved none of the credit for the economy's performance, and &quot;The false confidence it has engendered in the stability of the market economy has encouraged policy-makers to dismantle some of the institutions which initially evolved to try to keep its instability within limits.&quot; That instability exploded with the devastating financial crisis of 2007, and now haunts the global economy with the prospect of another Depression. In this expanded and updated new edition, Keen builds on his scathing critique of conventional economic theory while explaining what mainstream economists cannot: why the crisis occurred, why it is proving to be intractable, and what needs to be done to end it. Essential for anyone who has ever doubted the advice or reasoning of economists, Debunking Economics - Revised and Expanded Edition provides a signpost to a better future.\n","torrent":{"xt":"urn:btih:9123d2be1e77d7887ae0bb23202853269ccd0713","amp;dn":"The+Big+Three+in+Economics+Adam+Smith%2C+Karl+Marx%2C+and+John+Mayna","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9123d2be1e77d7887ae0bb23202853269ccd0713","infoHashBuffer":{"type":"Buffer","data":[145,35,210,190,30,119,215,136,122,224,187,35,32,40,83,38,156,205,7,19]},"announce":[],"urlList":[]}}