{"title":"Jo Nesbo-The Son [Epub]","uid":15861185,"size":2507786,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91a1fdf867abca0b8438fcd5320d5be94483351a&amp;dn=Jo+Nesbo-The+Son+%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"twocows","files":4,"time":1474298401,"description":"Jo Nesbo-The Son\r\n\r\n\r\n\r\nThe author of the best-selling Harry Hole series now gives us an electrifying stand-alone novel set inside Oslo's maze of especially venal, high-level corruption.\r\n\r\nSonny Lofthus is a strangely charismatic and complacent young man. Sonny's been in prison for a dozen years, nearly half his life. The inmates who seek out his uncanny abilities to soothe leave his cell feeling absolved. They don't know or care that Sonny has a serious heroin habit--or where or how he gets his uninterrupted supply of the drug. Or that he's serving time for other peoples' crimes.\r\n\r\nSonny took the first steps toward addiction when his father took his own life rather than face exposure as a corrupt cop. Now Sonny is the seemingly malleable center of a whole infrastructure of corruption: prison staff, police, lawyers, a desperate priest--all of them focused on keeping him high and in jail. And all of them under the thumb of the Twin, Oslo's crime overlord. As long as Sonny gets his dope, he's happy to play the criminal and the prison's in-house savior.\r\n\r\nBut when he learns a stunning, long-hidden secret concerning his father, he makes a brilliantly executed escape from prison--and from the person he'd let himself become--and begins hunting down those responsible for the crimes against him . . . The darkly looming question is: Who will get to him first--the criminals or the cops?","torrent":{"xt":"urn:btih:91a1fdf867abca0b8438fcd5320d5be94483351a","amp;dn":"Jo+Nesbo-The+Son+%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91a1fdf867abca0b8438fcd5320d5be94483351a","infoHashBuffer":{"type":"Buffer","data":[145,161,253,248,103,171,202,11,132,56,252,213,50,13,91,233,68,131,53,26]},"announce":[],"urlList":[]}}