{"title":"EarMaster Pro 6 [Ear Master] Portable","uid":8758450,"size":142144937,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:91fd946c17b5ddceb10cdcc68b92f82ab98932b5&amp;dn=EarMaster+Pro+6+%5BEar+Master%5D+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"nic25magg","files":-1,"time":1375193810,"description":"Ear Master 6 Pro Portable Version:\n\nEarMaster Pro 6 is the ultimate training tool for all musicians. It will take your musical skills to the next level and help you become a better musician. EarMaster Pro 6 has been designed to match the needs of both beginners and very advanced musicians. The current version is the outcome of years of collaboration with leading music schools, conservatories and universities such as Berklee College of Music from Boston, among many others. Therefore, no matter how experienced you are, you will always find lessons, drills and tests that will challenge your sight-singing, aural and rhythmic skills.\n\nHighlights\n - Over 2000 lessons divided into 2 courses: Standard Course and Jazz Course\n - 14 activities for ear training, sight-singing and rhythm\n - Plug-in a microphone to sing, clap or Play your answers in real-time!\n - Play your answers on a MIDI Keyboard (optional)\n - Train to sing and play from sheet music\n - Learn to sing back a melody you just heard\n - 2 types of notation: standard and jazz (Real Book style)\n - Learn to sing with Solfege syllables (Sol-Fa)\n - Advanced pitch detection algorithm to recognize the tones you sing or play in real-time\n - User-defined interfaces (staff, piano, guitar, bass, violin, cello, etc.)\n - Customized training mode to train according to your needs\n - Detailed statistics to monitor your progress\n - And much, much more!\n\nLanguages included\nEnglish, German, French, Spanish, Italian, Dutch, Danish, Swedish and Russian.","torrent":{"xt":"urn:btih:91fd946c17b5ddceb10cdcc68b92f82ab98932b5","amp;dn":"EarMaster+Pro+6+%5BEar+Master%5D+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91fd946c17b5ddceb10cdcc68b92f82ab98932b5","infoHashBuffer":{"type":"Buffer","data":[145,253,148,108,23,181,221,206,177,12,220,198,139,146,248,42,185,137,50,181]},"announce":[],"urlList":[]}}