{"title":"Virtual DJ Pro 8.00.1897 (Patch-MPT) [ChingLiu]","uid":10715406,"size":36722429,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9215bba036f69ab7aa00a34c1a168d31c10509da&amp;dn=Virtual+DJ+Pro+8.00.1897+%28Patch-MPT%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":0,"uploader":"Ching_Liu","files":-1,"time":1407402933,"description":"This version is a significant milestone in the history of VirtualDJ. Unlike the transition to v7 from v6, or to v6 from v5 etc, where we just added new significant features (like video support, 99 decks, ContentUnlimited, etc), for the v8 transition, we rewrote our software from the ground up. VirtualDJ was first started in 1996, and in the following 15 years, we kept adding more and more features, to keep pushing the limit of how technology can help you mix better. But, 15 years of layers upon layers of new code, can get quite messy, and our development speed was slowing down. That's why we spent the last 3 years to rewriting everything clean and fresh, so that for the next 20 years, new breakthrough features will keep coming at lightning speed, update after update. \n\nBut of course, version 8 is not just a clone of version 7 with a fresh engine. It also brings its share of new features and novelty. Here is a quick guide to the main new features, intended for people who are already experienced with version 7: \n\nSANDBOX\n\nOne new exclusive feature of VirtualDJ 8, is the new &quot;sandbox&quot; concept. Sandbox is a feature that helps you prepare your next mix while the audience is still listening to the previous song. When sandbox is engaged, you can jump to the end of the current track, and try to mix into the next track, hearing it only in your headphones, until you find the perfect exit-point and entry-point where you'll want to mix. You can then disengage sandbox, and calmly wait for your current track to reach the point where you're now confident you should start your mix. \n\nSAMPLER\n\nThe new sampler in v8 has shed all the limitations of the old v7 sampler. It can now play an unlimited number of samples simultaneously. Samples can be audio, video, or still images. Video samples can have alpha transparency. Samples can be organized by group and triggered like an instrument bank. Slots can be arranged on a grid, and have colors and icons. \n\nThe sampler is now accessed through the sideView, where you can select any bank and drag'n'drop samples directly onto the slots. The sample files themselves are found in the sampler folder in the browser. Note that you can also play any sample directly from the sampler folder, meaning that you could play as many samples as you want simultaneously, and you don't &quot;have&quot; to use the grid if you're more comfortable triggering samples from the list. The sampler also has a special bank called &quot;remix mode&quot;, which transforms your sampler into smart cue-pads. VirtualDJ will automatically detect and fill the remix points with the breaks in your song, but you can edit your own remix points of course. \n\nWhen you record a new sample, using either the rec button on the advanced loop panel, or the mic or master rec button on the master mixer panel, VirtualDJ will store the newly created sample in the &quot;Recordings&quot; folder, and highlight it, so you can choose whether you want to drop it on a deck and start scratching it (if you just recorded your voice through the mic for example), or drop it on a sampler pad. And of course you can edit any sample with the sample editor. \n\nSOUND ENGINE\n\nIn VirtualDJ 8, all the internal audio components, like pitch-stretching, limiter, equalizers, filters, etc, have been rewritten to harness all the power of modern computers and give you a crystal-clear sound.\n\nThe internal sound engine processes everything in high-quality 32-bit audio, but the internal sampleRate can be adjusted in the options. Note that we recommend using 44100 if you play mostly audio files that have been recorded at 44100 (like mp3 files), or 48000 if you play mostly high-def videos that have their audio track at 48000. Setting a higher samplerRate than the files you play will result in a lower quality of sound, not a higher one. \n\nBROWSER\n\nThe browser in VirtualDJ 8 as many improvments in comparison to v7 version.\n\nSIDE VIEW: The browser now has three zones: the folders, the file view, and the &quot;side view&quot;. The side view can display and easily switch between various useful folders or special lists. Among the special lists are the automix list, the karaoke list, a scratch-pad called &quot;side list&quot; (you can still also have the old horizontal side-list if you're nostalgic, it's in the advanced options), and the sampler trigger-pad. But you can also drag and drop any folder to the sideview to stick it there. You can even create shortcut buttons for various folders, so you can easily navigate between them with one click. \n\nVIRTUAL FOLDERS: Virtual/favorite/filter folders in version 8 can now be children of any other folder. For example, you could have your folder D:MusicRock, and inside, create a virtual folder &quot;Top&quot; where you put links to the top songs. You can also make filter folders children of other folders, and the filter will be applied to the content of the parent folder. \n\nFILTER GROUPS: The filter folders can now have a filter such as &quot;group by genre&quot; for example. This would create a filter folder that has as children folders all the available genres (from the database if this folder is at the root, or from the parent folder otherwise). \n\nEFFECTS\n\nThe effect page is now no longer a &quot;replacement&quot; of the browser, but is instead a panel, same as the playlist. effects config window will open small windows inside this panel. These effect config can also be undocked and become floating windows that can be moved around. Effect selection is now done through the effect button on the skin on each deck. The effect list window can also be unpinned, in order to become a floating window that can allow easy instant access to several effects. To access the config window of an effect, hover your mouse on the effect in the list, and click on the small gear icon. \n\nAlso, note that in version 8, effects can now be applied either to a specific deck, or to the master output. Go to the &quot;master&quot; panel in the center window to select master effects. \n\nEDITORS\n\nAnother big novelty in VirtualDJ 8, is the plethora of built-in editors. \n\nAUTOMIX EDITOR: The AutoMix editor allows you to pre-edit your automix sequence, in order to fine-tune the mix-in and mix-out points, the type of transition, and if you're mixing videos, select the video transition to be used for each mix. When you manually tune the mix between two songs, VirtualDJ will remember and use your preferred settings the next time the automix engine mixes these exact two songs together. \n\nTRACK CLEANER: This editor lets you easily create &quot;edits&quot; of your tracks. You can remove any offensive lyrics by &quot;inverting&quot; them, you can cut out long intros or irrelevant speech, or loop a section to extend your track. \n\nVIDEO EDITOR: The video editor has 2 main uses: It can be used to edit an existing video, by adding some text effects on the parts that you usually scratch, or on relevant lyrics. Or, it can be used to add a full new video track to an existing audio-only song, using video parts from other video files. It can also be used to create a video track for a remixed version by using parts from the video track of the original version. \n\nSAMPLE EDITOR: To harness the power of the new sampler in version 8, the sample editor lets you adjust most of the options on your audio, video, or still-image samples. Your samples can now be audio, video or both (or still images), and you can easily adjust the transparency of video samples, crop the audio clips, and create sample groups with specific trigger modes. \n\nPOI EDITOR: All the cue points, saved loops, automix points, beatgrid anchors, macro points, etc..., are now called POI (for Point Of Interest) in VirtualDJ 8. The POI editor lets you organize and manage all these points for each of your tracks. \n\nBPM EDITOR: The new BPM editor let you easily and conveniently adjust the beatgrid of your songs. It can even let you specify a different bpm for different parts inside the same song. \n\nTAG EDITOR: The tag editor has been much improved in version 8 compared to the one from version 7. It can batch edit a lot of tracks together, can save the tags back to the files, and is compatible with a broad range of file formats and tags. \n\nOTHER\n\nOPTIONS: Most common options are easily accessible from the option page in the config window, but if you check &quot;show advanced&quot; you will see the full list of all possible options. (no need for Registry Tweaks anymore). \n\nAUDIO CONFIG: The new audio config panel is now an a hybrid between the &quot;simple&quot; and &quot;advanced&quot; panels from VirtualDJ 7. The big buttons let you quickly access most common configurations, while the list below let you see how the configuration is actually implemented, and tweak it if need be. \n\nCONTROLLERS: Controllers can now have multiple mappers created, and you can easily switch between one or the other. By default, all controllers have the &quot;factory default&quot; mapper. As soon as you try to edit this factory default mapping, VirtualDJ 8 will create a &quot;custom mapper&quot; for this controller, fill it with a copy of the factory default, and save it in the Mapper/ folder like usual. You will then be editing the custom mapper. \n\nCUSTOM BUTTONS: The default skin has on each deck a set of empty &quot;custom buttons&quot;, and &quot;custom knobs&quot;. These empty buttons are intended to be filled up by each user according to what they find missing in the default skin. \n\nSKIN RESIZE: In VirtualDJ 8, the skins are automatically stretched, without any performance hit, so there is no reason to keep making many resolutions of the same skin. The stretch is done in such a way that the aspect ratio is kept (so that round turntables will stay round). To achieve that, the browser part is automatically made bigger/smaller. \n\nCURRENT CUE: There is a special POI, the current CUE, that is not editable from the editor. This special CUE is the position used by the STOP and CUE buttons, and will be remembered from one session to the next. But it's overwritten automatically each time you select a new hotcue or POI. \n\nCOLOR WAVEFORMS: VirtualDJ 8 has two modes for the color waveforms (accessible in the options). Either a full-color with red for bass, green for mediums and blue for high, or a 2-color mode which makes it easier to differentiate each deck, but still easily see the bass, medium and high. \n\nBROADCAST: VirtualDJ 8 direct broadcasting now requires that you are logged in to our website, but rather than providing an IP address for others to connect to, it automatically generates a webpage on virtualdj.com where your friend can listen to your broadcast. This page will have an embedded html5 player and links for itunes/winamp/wmp etc streaming. VirtualDJ 8 also offers to create and maintain podcasts for you, with tools on website to help you publish your mix to itunes etc. \n\nMINIMUM REQUIREMENTS: Windows XP \nRECOMMENDED: Windows 7 or Window 8.1\n\nLanguages : English, Chinese, Arabic, Italian, German, Dutch, French, Greek, Japanese, Russian, Portuguese.\n\nHomepage :  &lt;a href=&quot;\nhttp://www.virtualdj.com/products/virtualdj/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virtualdj.com/products/virtualdj/index.html&lt;/a&gt;","torrent":{"xt":"urn:btih:9215bba036f69ab7aa00a34c1a168d31c10509da","amp;dn":"Virtual+DJ+Pro+8.00.1897+%28Patch-MPT%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9215bba036f69ab7aa00a34c1a168d31c10509da","infoHashBuffer":{"type":"Buffer","data":[146,21,187,160,54,246,154,183,170,0,163,76,26,22,141,49,193,5,9,218]},"announce":[],"urlList":[]}}