{"title":"History of Catholic Church: From Apostolic Age to 3rd Millennium","uid":15617634,"size":4350869,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:921eb5176f84bd43e8471b0b89ced5bae7ea898d&amp;dn=History+of+Catholic+Church%3A+From+Apostolic+Age+to+3rd+Millennium&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"catholicstuff","files":4,"time":1471845673,"description":"James Hitchcock - History of the Catholic Church: From the Apostolic Age to the Third Millennium (EPUB, MOBI, PDF)\r\n\r\nThe Catholic Church is the longest-enduring institution in the world. Beginning with the first Christians and continuing in our present day, the Church has been planted in every nation on earth.\r\n\r\nThe Catholic Church claims Jesus Christ himself as her founder, and in spite of heresy from within and hostility from without, she remains in the twenty-first century the steadfast guardian of belief in his life, death, and resurrection. The teachings and redemptive works of Jesus as told in the Gospels are expressed by the Church in a coherent and consistent body of doctrine, the likes of which cannot be found in any other Christian body.\r\n\r\nThe history of the Catholic Church is long, complicated, and fascinating, and in this book it is expertly and ably told by historian James Hitchcock. As in the parable of Christ about the weeds that were sown in a field of wheat, evil and good have grown together in the Church from the start, as Hitchcock honestly records. He brings before us the many characters--some noble, some notorious--who have left an indelible mark on the Church, while never losing sight of the saints, who have given living testimony to the salvific power of Christ in every age.\r\n\r\nThis ambitious work is comprehensive in its scope and in incisive in its understanding, a valuable addition to any school or home library.\r\n\r\n&quot;The gap in knowledge of history and current events sadly extends to us Catholics in our grasp of the Faith and the rich history of the Church. In his ambitious new work, History of the Catholic Church from the Apostolic Age to the Third Millennium, James Hitchcock has given us an accessible tool to better our understanding...and love for the history of the Church. To love the Church, we must understand her history. As Blessed Pope John XXIII remarked, 'History is our best teacher.' Thank you, Dr. Hitchcock, for this timeless gift to the Church for the Year of Faith.&quot; -- Cardinal Timothy Dolan, Archbishop of New York\r\n\r\n&quot;James Hitchcock is one of the few historians alive today with the background and ability to present the two-millenium history of the Catholic Church. In this remarkable volume Hitchcock brings a lifetime of insights and research to this important subject. It is a work of erudition in which the reader will discover not only the importance of the Catholic Church in past centuries, but in our own time.&quot; -- Thomas F. Madden, Ph.D. Director of the Center for Medieval and Renaissance Studies, Saint Louis University\r\n\r\n&quot;For years, James Hitchcock has been our premier historian - a dissident from conventional wisdom, well-armed and solid. Here he pioneers a new method for presenting a long sweep of history: an orderly and altogether fascinating series of vignettes - of arguments, movements, distinctive persons, and concrete events. There is just enough narrative in these sequences to carry the reader along, but without involving her in excessive interpretation. This book provides both a great resource for easy reference, and a stimulating definition of a Christian humanism that holds in tension the transcendent and the down to earth, the holy and the sinful. This is a tension which Hitchcock maintains throughout.&quot; --Michael Novak\r\n\r\n&quot;A remarkable achievement that synthesizes a lifetime of learning, James Hitchcock's History of the Catholic Church is also a signal service to twenty-first century Catholicism, a religious community in which controversy and contention are often the by-products of severe amnesia. The Church of the New Evangelization has to know its own story, and that story is told here in full.&quot; --George Weigel, Distinguished Senior Fellow, Ethics and Public Policy Center, Washington, D.C\r\n\r\n&quot;James Hitchcock has a well-earned reputation as an outstanding scholar, insightful commentator and lucid, accessible writer. All of these skills come together and shine in his History of the Catholic Church. It's a masterwork: exhilarating in scope and a joy to read. If you want an unforgettable account of the fullness and drama of the Christian story, read this book.&quot; --+Charles J. Chaput, O.F.M. Cap., Archbishop of Philadelphia\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:921eb5176f84bd43e8471b0b89ced5bae7ea898d","amp;dn":"History+of+Catholic+Church%3A+From+Apostolic+Age+to+3rd+Millennium","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"921eb5176f84bd43e8471b0b89ced5bae7ea898d","infoHashBuffer":{"type":"Buffer","data":[146,30,181,23,111,132,189,67,232,71,27,11,137,206,213,186,231,234,137,141]},"announce":[],"urlList":[]}}