{"title":"[2001] Greatest Hits - Mariah Carey - 289mb @ 320kbs [only1joe]","uid":5229305,"size":303714088,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:929d604b48f6ede74258b277ed9151e4c0a7617a&amp;dn=%5B2001%5D+Greatest+Hits+-+Mariah+Carey+-+289mb+%40+320kbs+%5Bonly1joe%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":5,"uploader":"only1joe","files":-1,"time":1261259689,"description":"Greatest Hits - Mariah Carey [2001] &lt;a href=&quot;\nhttp://bayimg.com/IakaIaacm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/IakaIaacm&lt;/a&gt;\n\t\nWikipedia - Greatest Hits is the eleventh album by American singer Mariah Carey, released in the United States on December 4, 2001 by Columbia Records. It is a greatest hits double album: CD 1 is primarily a collection of Carey's hits from 1990 to 1995, while CD 2 is primarily a collection of hits from 1996 to 2000. Carey had previously released the compilation album #1's (1998), but the release of her Greatest Hits album was a contractual agreement beyond her control, since she had left Columbia Records and had moved on to Virgin Records. \n\nStephen Thomas Erlewine, All Music Guide - Mariah protested loud and often when her first hits collection, #1's, was released that the album was not a hits collection: &quot;I haven't been recording long enough for that!&quot; Nothing will age your catalog like leaving your record label, however, so when she flew the Columbia coop for Virgin in 2000, her old label assembled Greatest Hits for release a couple months after the monumental disaster of Glitter, her Virgin debut. Now, this move was surely designed to further wound the ailing Mariah, but this kind of collection was essentially inevitable, and it's about as good as it could be, containing all of her big hits (including songs that did not make it to the top of the charts) over the course of 28 tracks. This is certainly helpful, since it rounds up everything, but its double-disc running time is a bit of a detriment, since it simply is too much. By the end of the second disc, the collection feels a little padded, and her music simply sounds better in the more concentrated collection of #1's, since it runs smoother and has all the really big hits (with the notable exception of the original version of her best single, &quot;Fantasy&quot;). But if you want more simply for archival reasons, this will suit the bill (even though the packaging is unbearably skimpy: no notes, just publishing information and thumbnails of the single covers, which is like having no packaging at all). [Sony's 2001 Japanese edition included four bonus tracks.]\n\nTracy E. Hopkins, Barnes &amp; Noble - With a physical and emotional breakdown and a lamentable movie debut in the musical bio-pic, Glitter, Mariah Carey's star may have faded a bit in the new millennium, but let us remember who still holds the title of best-selling female performer of the 1990s. Carey rose to superstardom on the strength of her stunning five-octave voice, a gift that she applied to both syrupy ballads and hip-hop-inspired dance-pop. During her early career, she evoked frequent comparisons to rivals Whitney Houston and Celine Dion, but showed them both up by composing all of her own material. So it's not hubrist that this is her second greatest hits package. In addtion to all of the chart-topping singles included on her 1998 #1's collection (&quot;Vision of Love,&quot; &quot;Hero,&quot; and &quot;One Sweet Day&quot; just to name a few), this two-disc set also features hits from her last two discs for Sony - 1997's Butterfly and 1999's Rainbow. Highlights from those discs include the club thumpers &quot;Honey&quot; and &quot;Heartbreaker,&quot; and the moving ballad &quot;Thank God I Found You,&quot; featuring Joe and 98 Degrees. Personal problems aside, Carey is still a pop-music making force, and these are the songs that make the whole world sing. \n\nDisc 01\n\n[01] Vision Of Love\t\n[02] Love Takes Time\t\n[03] Someday\t\n[04] I Don't Wanna Cry\t\n[05] Emotions\t\n[06] Can't Let Go\t\n[07] Make It Happen\t\n[08] I'll Be There          \t&gt; Mariah Carey Featuring Trey Lorenz\n[09] Dreamlover\t\n[10] Hero\t\n[11] Without You\t\n[12] Anytime You Need A Friend\t\n[13] Endless Love           \t&gt; Luther Vandross &amp; Mariah Carey\n[14] Fantasy\t\n\nDisc 01 - Play Time - 00h:59m:13s\n\nDisc 02\n\n[01] One Sweet Day\t&gt; Mariah Carey &amp; Boyz II Men\n[02] Always Be My Baby\t\t\t\t\n[03] Forever\t\t\t\t\t\n[04] Underneath The Stars\t\t\t\n[05] Honey\t\t\t\t\t\n[06] Butterfly\t\t\t\t\t\n[07] My All\t\t\t\t\t\n[08] Sweetheart\t\t\t\t\t\n[09] When You Believe       \t&gt; Mariah Carey &amp; Whitney Houston\n[10] I Still Believe\t\t\t\t\n[11] Heartbreaker           \t&gt; Mariah Carey Featuring Jay-Z\n[12] Thank God I Found You   \t&gt; Mariah Carey Featuring Joe &amp; 98 Degrees\n[13] Can't Take That Away \n[14] Against All Odds       \t&gt; Westlife Featuring Mariah Carey\n[15] All I Want For Christmas Is You\t&gt; Mariah Carey Featuring Jermaine Dupri &amp; Lil' Bow Wow\n\nDisc 02 - Play Time - 01h:03m:48s\n\n\n\n\n\n\n\nTotal Mp3 Play Time\t&gt; 02h:03m:05s\n\nTotal File Size    \t&gt; 289mb (Including Mp3s, Art Covers &amp; WorDoc)\n\nTotal Bit Size     \t&gt; 320kbps\n\nMusic File Type    \t&gt; I-Tunes v8.2.1.6 Mp3 Format\n\nMusic Video Format  \t&gt; N / A\n\nScanned Artwork    \t&gt; Yes @ 300dpi\n\nOriginal CD Rip    \t&gt; Yes - only1joe\n\nOriginal Uploader   \t&gt; Yes - only1joe \n\nUpload Speed       \t&gt; 33-35KB/s\n\nMusic Genre        \t&gt; Pop R&amp;B Rap\n\nOriginally Released\t&gt; 04 December 2001\n\nRecord Company     \t&gt; Columbia Records\n\nArtists Website    \t&gt; http://www.mariahcarey.com \n\n\n\n\n\n\n* * * Please Seed To A Ratio Of 1:1 Or Greater * * *\n* * * I Will Only Re-Seed If There Is More Than 10 Peers Waiting * * *\n* * * Any Problems - Leave Comments On My Most Recent Torrents * * *\n* * * This Is A Multi-Tracker Torrent Check Your Bit Torrent Client For A True Number Of Seeds * * *\n\n","torrent":{"xt":"urn:btih:929d604b48f6ede74258b277ed9151e4c0a7617a","amp;dn":"%5B2001%5D+Greatest+Hits+-+Mariah+Carey+-+289mb+%40+320kbs+%5Bonly1joe%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"929d604b48f6ede74258b277ed9151e4c0a7617a","infoHashBuffer":{"type":"Buffer","data":[146,157,96,75,72,246,237,231,66,88,178,119,237,145,81,228,192,167,97,122]},"announce":[],"urlList":[]}}