{"title":"Mindfulness For Dummies, 2E [PDF] [StormRG]","uid":11674479,"size":4714872,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:930692ed02babddbfaabe1062d5b3f7cede4bb9f&amp;dn=Mindfulness+For+Dummies%2C+2E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"krystine","files":2,"time":1422798248,"description":"[b]Mindfulness For Dummies, 2nd Edition[/b]\n[b]Author:[/b] Shamash Alidina\n[b]Published:[/b] 2014\n[b]Publisher:[/b] For Dummies\n[b]ISBN:[/b] 9781118868188\n[b]Format:[/b] Retail PDF\n\nUse mindfulness to relax and control anxiety, depression, stress and pain. Whether you're looking to control your depression and anxiety levels, improve concentration and reduce stress, or just want to restore balance in your life, Mindfulness For Dummies, 2nd Edition shows you how to slow down, become aware of what is going on around you and react effectively. Focusing on breathing and other self-control techniques, the practice of mindfulness is scientifically proven to calm jittery nerves and free the mind of distracting thoughts, mental clutter and unrealistic expectations. With this easy-to-follow guide, you'll discover how to pay attention to the present in order to change the way you think, feel and act. Covering the latest research on the effect of mindfulness on the brain, Mindfulness For Dummies, 2nd Edition shows you how to break free from a downward spiral of negative thought and action, and empowers you to make positive choices that support your well-being. You can: use mindfulness to reduce stress and anxiety, combat pain and more; receive guidance on incorporating mindfulness into everyday life; establish your own mindfulness routine; and, access audio downloads of guided meditations. Written by a professional mindfulness trainer, and packed with tips to incorporate this practice into your daily life, Mindfulness For Dummies, 2nd Edition shows you how to reap the benefits of a more attentive life","torrent":{"xt":"urn:btih:930692ed02babddbfaabe1062d5b3f7cede4bb9f","amp;dn":"Mindfulness+For+Dummies%2C+2E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"930692ed02babddbfaabe1062d5b3f7cede4bb9f","infoHashBuffer":{"type":"Buffer","data":[147,6,146,237,2,186,189,219,250,171,225,6,45,91,63,124,237,228,187,159]},"announce":[],"urlList":[]}}