{"title":"Batman Arkham Asylum [Mac]","uid":6801313,"size":9377547154,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:931a403270db91cb810b762e733e9e15680103dd&amp;dn=Batman+Arkham+Asylum+%5BMac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":17,"uploader":"Gustafo111","files":-1,"time":1320691413,"description":"Batman Arkham Asylum\n\nVersion 1.0.1 downloaded from the Mac App Store.\n\nArkhemskaya psychiatric hospital - an eerie place. There dumped all the criminals, whose brutality and sophistication defies common sense and human nature itself. Many inhabitants of the place stopped and called to account himself Batman. And, finally, he managed to keep his worst enemy - the Joker, whom the place in the nuthouse. The hero, personally delivered the villain on the island of Arkham and thereby made a huge mistake ...\nIt turned out that only a Joker, and sought to lure Batman into a sinister hospital. There, for the Dark Knight has already prepared his own personal hell. Ingenious traps, dangerous criminals, and many fierce enemies block the way to salvation. This time, Batman is fighting for his life! You will be involved in violent fights, sneaking quietly into the dark and solve intricate puzzles, using non-lethal arsenal of the hero. And all of this - in a psychiatric hospital, which brought together the most dangerous madmen Gotham City ...\nIn the GOTY version will include 6 additional cards for testing and the game will support 3D options with standard and HD television sets. Technology will be used TriOviz 3D on the PS3\nAll 6 cards for testing, which until then could only download will be present on the disc, including the Crime Alley and Scarecrow Nightmare.\n\nMinimum Requirements\nOS: Mac OS X 10.6.8 \nProcessor: Intel 1.8Ghz \nRAM: 2.0GB \nHard Disk: 10.0GB \nGraphics: 128MB \nDrive: DVD \nInput: Keyboard\n\nRecommended Requirements\nProcessor: Intel 2.8Ghz \nRAM: 4.0GB \nGraphics: 512MB \nInput: Game Pad\n\nRockSteady Studios","torrent":{"xt":"urn:btih:931a403270db91cb810b762e733e9e15680103dd","amp;dn":"Batman+Arkham+Asylum+%5BMac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"931a403270db91cb810b762e733e9e15680103dd","infoHashBuffer":{"type":"Buffer","data":[147,26,64,50,112,219,145,203,129,11,118,46,115,62,158,21,104,1,3,221]},"announce":[],"urlList":[]}}