{"title":"311 - Greatest Hits '93-'03 320cbr (Big Papi) 2004","uid":9438302,"size":142799796,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:93b0a9eb790bfd82594757f04b079203c30160db&amp;dn=311+-+Greatest+Hits+%2793-%2703+320cbr+%28Big+Papi%29+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1388948181,"description":"Source: 2004 CD\n\n\nBy A. Estes\n311 have had quite a career so far. When they came out in the 90's, they definitely clashed with the more gloomy grunge scene: positive lyrics and catchy, upbeat music with a reggae and hip-hop twist. They still found success while simultaneously paving the way for a variety of popular bands like No Doubt and Incubus. They are one of the few bands from that era to have survived and continue touring and putting out new music -- the band are in the studio working on their eighth album as we speak. Their first best-of, &quot;Greatest Hits: 93-03&quot; is a celebration of some of 311's best known work, along with some newer, previously unreleased material. True, not all of 311 &quot;Greatest&quot; songs are here, such is the flaw with any best-of collection, but as far as hits and singles, this has got them all. Along with predictable entries like &quot;Down,&quot; &quot;All Mixed Up&quot; and &quot;Amber,&quot; there are a few surprises thrown in. &quot;Beyond The Grey Sky&quot; (from 2003's &quot;Evolver&quot;) is a song I didn't expect to be here, and other songs that didn't quite break-out like they should have like &quot;Flowing&quot; and &quot;Transistor&quot; are good to hear again (even though I own all of their other stuff). While there is an abundance of newer material, including their cover of The Cure's &quot;Love Song&quot; (from the &quot;50 First Dates&quot; soundtrack) and two new songs, &quot;How Do You Feel?&quot; and &quot;First Straw,&quot; the lack of older material is rather disappointing. &quot;Homebrew&quot; and &quot;Do You Right&quot; are included, but their older albums had other great moments too (they should have, at least, put &quot;Feels So Good&quot; on). But complaints aside, it's a great collection, seventeen excellent songs. You definitely get your money's worth, and if you're a hardcore 311 fan, the two new studio tracks are incentive enough. And if you are new to the band, what better way to start?","torrent":{"xt":"urn:btih:93b0a9eb790bfd82594757f04b079203c30160db","amp;dn":"311+-+Greatest+Hits+%2793-%2703+320cbr+%28Big+Papi%29+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93b0a9eb790bfd82594757f04b079203c30160db","infoHashBuffer":{"type":"Buffer","data":[147,176,169,235,121,11,253,130,89,71,87,240,75,7,146,3,195,1,96,219]},"announce":[],"urlList":[]}}