{"title":"The.Book.of.Unwritten.Tales.2-FLT","uid":11711008,"size":4899755175,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:94624bede232ae15504d70b26dd732c1016e1241&amp;dn=The.Book.of.Unwritten.Tales.2-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"Tenguken","files":3,"time":1424342230,"description":"In Their 28th Year Of Glory, FairLight Released #1078\n\nThe Book of Unwritten Tales 2 (c) KING Art Games\n\nSupplied by: FAIRLIGHT            : : Release Date: 18/02/2015\nCracked by:  FAIRLIGHT                Game Type:    Adventure\nPackaged by: FAIRLIGHT                Image Format: ISO\n\nDISCS: 1                              Protection: -\n\nSystem Requirements : Nobody knows!\n\nGame information:\n\nLegend foretold it. Prophecies predicted it. Chosen ones chose to  believe\nin it. Now the adventure saga continues. A sequel is coming. Join  Wilbur,\nIvo, Nate and Critter in another classic point-and-click adventure in  the\nwicked world of Avent sia. Help them fulfill their destiny. A  destiny  as\nyet unwritten.\nA  few  years  have  passed  since  our  heroes  heroically  defeated  the\narch-witch Mortroga. And their lives, like the lives  of  most  people  in\nAvent sia, are still in turmoil. The War of the Two Towers  is  over,  but\nthe wounds it left upon the land are still bleeding.\nThe gnome Wilbur Weathervane is struggling with his new job as  a  teacher\nat the reopened School for Wizardry and  Witchcraft.  His  magic  wand  is\nhaving a mind of its own and an assassination plot against  the  arch-mage\novershadows the first democratic elections in Seastone.\nFaced with political intrigues  that  threaten  the  delicate  balance  of\npeace, Wilbur is in dire need of his old friends. But the elf princess Ivo\nand the adventurer Nate have, after a brief romantic interlude, gone their\nseparate ways.\nIvo has returned to her gilded cage in the elf kingdom,  overprotected  by\nher controlling mother.\nNate along with his trusty companion Critter has been  taken  prisoner  on\nthe flying island of his arch-enemy the Red Pirate.\nBut fate does not rest. A darkness has fallen upon the land, or rather,  a\npinkness. A magic force is turning mighty beasts into fluffy plush puppies\nand towering castles into oversized  dollhouses.  Every  world  needs  its\nheroes. However unlikely they may seem.\n\nFeatures:\n\n* A new adventure from KING Art, the creators of\nThe Book of Unwritten Tales, The Critter Chronicles\nand The Raven - Legacy of a Master Thief\n* A fantasy story with over 20 hours of pointing and clicking\n* The trademark BoUT-humor, lovingly spoofing LotR, Game of\nThrones, Harry Potter, Discworld, The Hobbit, WoW and more\n* Hundreds of weird, yet oddly logical puzzles\n* The well-proven &quot;Multi-Character-Gameplay&quot;\n* The established four playable characters Wilbur,\nNate, Ivo and Critter\n* An ensemble of quirky characters, both\nwell-established and brand-new\n* Projection Mapping technology unites the merits\nof 2D and 3D styles and technique\n* An epic soundtrack with all the classics\nand many new compositions\n\nInstallation Information:\n\n* Burn or mount\n* Install\n* Play the game\n\nNOTE: As usual, block the game exe in your firewall.\n/TEAM FAiRLIGHT","torrent":{"xt":"urn:btih:94624bede232ae15504d70b26dd732c1016e1241","amp;dn":"The.Book.of.Unwritten.Tales.2-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94624bede232ae15504d70b26dd732c1016e1241","infoHashBuffer":{"type":"Buffer","data":[148,98,75,237,226,50,174,21,80,77,112,178,109,215,50,193,1,110,18,65]},"announce":[],"urlList":[]}}