{"title":"VideoPad Video Editor Professional 2.40 Final","uid":6459669,"size":4008253,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:94ef4a4f95ec3d34074398b8c42748ec2b748262&amp;dn=VideoPad+Video+Editor+Professional+2.40+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1307713947,"description":"VideoPad Video Editor Professional 2.40 Final\n\nVideoPad makes editing videos easy. This full featured video editor lets you create professional looking videos with transitions, music and narration in minutes. VideoPad is one of the fastest video stream processors on the market. Discover the power of drag and drop. Drop files into your editing project and drag videos onto your timeline and adjust the in and out points of a video clip. Edit video from any camcorder. VideoPad lets you capture video directly from a DV Camcorder, VHS player or Webcam. You can also import video files directly. VideoPad supports just about any video file format including .avi, .wmv, .3gp, .wmv and .divx.\n\nStunning Transition Effects\nChoose from a range of fade transitions to give your movie that professional touch. Preview the effects in real time. Customize the duration of the effect.\n\nAmazing Audio Tools\nImport and mix music tracks like a pro. Make your own custom movie soundtrack. Record your own narrations with the click of a button. Import pre-recorded narrations, sound effects or music.\n\nComplete Video Optimization\nFine tune brightness, saturation and color for your video. Add photos and digital images with a click of a button. Apply effects like black &amp; white, sepia tone and negative. Add text captions to your movie.\n\nShare With Your Family and Friends\nBurn to DVD and watch in your living room on your TV. Save for Youtube and share online with friends.\nSave to PSP, iPod, iPhone or 3GP mobile phone. Save to your PC as a high-quality digital movie.\n\nTechnical InformationSupported Input Formats\nVideo - avi, mpeg, wmv, divX, Xvid, mpeg1, mpeg2, mpeg4, mp4, mov, asf, vob, ogm, .3gp, H.264, RM and many more.\nImage - bmp, gif, jpg, jif, jiff, jpeg, exif, png, tif, tiff, psd, tga, pcx, jp2, wmf, ico\nAudio - wav, mp3, mp2, mpga, m4a, ogg, avi, mid, flac, aac, wma, dct, au, aiff, ogg, raw, dvf, vox, cda, atrac, gsm, sri, shn, dss, msv, wmv and many more.\n\nSupported Output Formats\nDisc export - DVD, CD, Blu-ray Discs, HD-DVD\nVideo export - avi, wmv, asf, mpg, 3gp, mp4, mov, YouTube, iPod, iPhone, PSP, Mobile Phone\n\nSupported Devices\nVideoPad supports just about any type of video input device including DV based or HDD camcorders.\n\nSystem Requirements\nWorks on Windows 7 2000/XP/2003/Vista/2008\n\nHome Page - http://www.nchsoftware.com/videopad/index.html\n\n","torrent":{"xt":"urn:btih:94ef4a4f95ec3d34074398b8c42748ec2b748262","amp;dn":"VideoPad+Video+Editor+Professional+2.40+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94ef4a4f95ec3d34074398b8c42748ec2b748262","infoHashBuffer":{"type":"Buffer","data":[148,239,74,79,149,236,61,52,7,67,152,184,196,39,72,236,43,116,130,98]},"announce":[],"urlList":[]}}