{"title":"Warren Buffetts Ground Rules - Words of Wisdom from the Partners","uid":15690200,"size":876903,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:958d8c4bb90ab77590f51cd1308214611f24af74&amp;dn=Warren+Buffetts+Ground+Rules+-+Words+of+Wisdom+from+the+Partners&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":0,"uploader":"shtihl22","files":1,"time":1472395161,"description":"**********Description***********\r\n\r\n\r\n2016 | ISBN: 0062415565 | English | 352 Pages | EPUB | 0.8 MB\r\nBy Jeremy Miller\r\n\r\nUsing the letters Warren Buffett wrote to his partners between 1956 and 1970, a veteran financial advisor presents the renowned guru's &quot;ground rules&quot; for investing-guidelines that remain startlingly relevant today.\r\n\r\nIn the fourteen years between his time in New York with value-investing guru Benjamin Graham and his start as chairman of Berkshire Hathaway, Warren Buffett managed Buffett Partnership Limited, his first professional investing partnership. Over the course of that time-a period in which he experienced an unprecedented record of success-Buffett wrote semiannual letters to his small but growing group of partners, sharing his thoughts, approaches, and reflections.\r\n\r\nCompiled for the first time and with Buffett's permission, the letters spotlight his contrarian diversification strategy, his almost religious celebration of compounding interest, his preference for conservative rather than conventional decision making, and his goal and tactics for bettering market results by at least 10% annually. Demonstrating Buffett's intellectual rigor, they provide a framework to the craft of investing that had not existed before: Buffett built upon the quantitative contributions made by his famous teacher, Benjamin Graham, demonstrating how they could be applied and improved.\r\n\r\nJeremy Miller reveals how these letters offer us a rare look into Buffett's mind and offer accessible lessons in control and discipline-effective in bull and bear markets alike, and in all types of investing climates-that are the bedrock of his success. Warren Buffett's Ground Rules paints a portrait of the sage as a young investor during a time when he developed the long-term value-oriented strategy that helped him build the foundation of his wealth-rules for success every investor needs today.\r\n\r\nJeremy Miller is an investment analyst for a leading New York based Mutual Fund Company. He has over 15 years of financial industry experience, having served in various capacities across Equity Sales and Research at several of the worldâ™s largest investment banks.\r\n\r\n=======================================\r\n \nhttps://thepiratebay.org/user/shtihl22\r\n\r\n=======================================","torrent":{"xt":"urn:btih:958d8c4bb90ab77590f51cd1308214611f24af74","amp;dn":"Warren+Buffetts+Ground+Rules+-+Words+of+Wisdom+from+the+Partners","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"958d8c4bb90ab77590f51cd1308214611f24af74","infoHashBuffer":{"type":"Buffer","data":[149,141,140,75,185,10,183,117,144,245,28,209,48,130,20,97,31,36,175,116]},"announce":[],"urlList":[]}}