{"title":"Guns,Germs and Steel by Jared Diamond","uid":7310525,"size":427315,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95934abad67baf34aa2f1aba26ab765c66322c52&amp;dn=Guns%2CGerms+and+Steel+by+Jared+Diamond&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":0,"uploader":"Macscroge","files":-1,"time":1338329550,"description":"Guns, Germs, and Steel: The Fates of Human Societies is a 1997 book by Jared Diamond, professor of geography and physiology at the University of California, Los Angeles (UCLA). In 1998, it won the Pulitzer Prize for general non-fiction and the Aventis Prize for Best Science Book. A documentary based on the book, and produced by the National Geographic Society, was broadcast on PBS in July 2005.[1]\n\nIt was also published under the title Guns, Germs and Steel: A short history of everybody for the last 13,000 years.[2] The book attempts to explain why Eurasian civilizations (in which he includes North Africa) have survived and conquered others, while refuting the assumption that Eurasian hegemony is due to any form of Eurasian intellectual, moral or inherent genetic superiority. Diamond argues that the gaps in power and technology between human societies originate in environmental differences, which are amplified by various positive feedback loops. When cultural or genetic differences have favored Eurasians (for example, written language or the development among Eurasians of resistance to endemic diseases), he asserts that these advantages occurred because of the influence of geography on societies and cultures, and were not inherent in the Eurasian genomes.","torrent":{"xt":"urn:btih:95934abad67baf34aa2f1aba26ab765c66322c52","amp;dn":"Guns%2CGerms+and+Steel+by+Jared+Diamond","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95934abad67baf34aa2f1aba26ab765c66322c52","infoHashBuffer":{"type":"Buffer","data":[149,147,74,186,214,123,175,52,170,47,26,186,38,171,118,92,102,50,44,82]},"announce":[],"urlList":[]}}