{"title":"ChaLEAN Extreme Deluxe","uid":6862732,"size":13279542349,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:962f09f65e17b0f1e1ac3d53b34f5da3ddc6ba7a&amp;dn=ChaLEAN+Extreme+Deluxe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":3,"uploader":"supbon817","files":31,"time":1322962266,"description":"ChaLean Extreme Workout Set\n\nPhase 1--Burn: In phase one of the training, you start lifting weights to jump-start your metabolism and break down extra reserves of fat. In these moderate training workouts, you'll work your upper and then lower body, and learn how &quot;Lean Phasing&quot; will help you see major results every 30 days.\n\nPhase 2--Push: In phase two, ChaLean shows you how to lift heavier weights--going beyond your comfort zone--so that you will build the muscle you need to burn fat. This phase is made easier than it sounds with plenty of guidance and incredibly fast results.\n\nPhase 3--Lean: In phase three, new routines and dynamic moves literally melt the fat off your body. You will be blown away by the results and rewarded with a brand-new body.\n\nExtreme Cardio: During each phase of the training, ChaLean ignites your metabolism with super-intense cardio and strength-training routines, and then rejuvenates and lengthens your hard-working muscles with an invigorating flexibility workout.\n\nCore Power: Core Power helps you to shrink, tighten, and tone your tummy with two targeted abs routines for a rock-hard midsection.","torrent":{"xt":"urn:btih:962f09f65e17b0f1e1ac3d53b34f5da3ddc6ba7a","amp;dn":"ChaLEAN+Extreme+Deluxe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"962f09f65e17b0f1e1ac3d53b34f5da3ddc6ba7a","infoHashBuffer":{"type":"Buffer","data":[150,47,9,246,94,23,176,241,225,172,61,83,179,79,93,163,221,198,186,122]},"announce":[],"urlList":[]}}