{"title":"Trevor Morris - Dragon Age Inquisition OST (2014) [mp3 320]","uid":11473159,"size":233313785,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9635dbfd9f0fb7168a2f601c6140e59b188d06f5&amp;dn=Trevor+Morris+-+Dragon+Age+Inquisition+OST+%282014%29+%5Bmp3+320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"shambu69","files":-1,"time":1416116808,"description":"Soundtrack / Score / Game\n\nTracklist:\n01 Dragon Age Inquisition Theme\n02 Escape from the Fade\n03 The Wrath of Heaven\n04 Calling the Inquisition\n05 Champions of the Just\n06 Lord Seeker\n07 In Hushed Whispers\n08 Sacrifice\n09 Alexius\n10 In Your Heart Shall Burn\n11 The Dawn Will Come\n12 Journey to Skyhold\n13 The Western Approach\n14 Siege of Adamant\n15 Adamant Fortress\n16 The Fall\n17 The Place of All Fears\n18 Nightmare's End\n19 Val Royeaux\n20 Wicked Eyes and Wicked Hearts\n21 The Inquisition Marches\n22 The Lost Temple\n23 Death on the Bridge\n24 Guardians of the Past\n25 The Well of Sorrows\n26 Call His Wrath\n27 The Lie in Which You Linger\n28 Battle in the Sky\n29 Tooth and Scale\n30 Let the Skies Boil\n31 Doom Upon All the World\n32 Orb of Destruction\n33 The Scar\n34 Return to Skyhold\n35 Epilogue\n36 The Elder One Theme\n37 Orlais Theme\n38 Thedas Love Theme\n39 A World Torn Asunder (Gameplay Trailer)\n\nAbout:\nGenre: Score\nComposer: Trevor Morris\nRelease Date: November 17, 2014\nPublisher: Electronic Arts\nAudio codec: MP3\nAudio Bitrate: 320 kbps\nDuration: 1:36:50\n\nTrevor was born in London ON, Canada, a few hours outside Toronto. He was accepted to St. Mary's school for the arts as a child, where he studied violin and choir daily. At age 13, Trevor was commissioned by his school to compose a piece for his graduating class to perform in honor of the Pope John Paul's visit to Canada. His fee, $50. &quot;Beloved Young People&quot;, a book authored by the Pope aimed at the youth of the generation became the source for adapted lyrics, and Trevor's senior class performed his composition for Piano and 4-part Choir at St. Mary's cathedral at graduation. It was a defining moment that would shape Trevor's future.\n\nCollege saw Trevor attend Canada's most prestigious school for recording and production, Fanshawe's &quot;Music Industry Arts&quot; program. Trevor graduated top of his class and upon graduation immediately moved to Toronto to start working. Trevor spent his 20's in the music production circles of Toronto, where there wasn't a top studio or production company he didn't work with. He eventually turned his attention back to music and over to composing full time, music for Television &amp; Radio commercials. Another choice that would change his future direction.\n\nWanting a longer format for his music ideas, scoring Films and Television series were next up in Trevor's ambitions. A notion that in 1999 would lead him to make the most dramatic and impactful choice of his career, the move to Los Angeles.\n\nTrevor made the move to Los Angeles in 2000, and started his early years working with top Film Score composers such as James Newton Howard and Hans Zimmer. Amassing over 25 major screen credits on some of Hollywood's top block busters in various capacities along that path.\n\nAs Trevor's own composition career developed, so did the opportunity to directly collaborate with some of the industry's top names such as Jerry Bruckheimer, Neil Jordan and Tony and Ridley Scott. 2010 marks the 4th Television series Trevor has collaborated with and scored for Jerry Bruckheimer. He also recently completed the Epic mini-series &quot;The Pillars of the Earth&quot; with Tony and Ridley Scott producing.\n\nIn 2011 Trevor composed his largest feature film to date, &quot;Immortals&quot; passed the $200Million dollar mark worldwide. The same year he built himself a brand new State of the Art creative facility in the heart of Santa Monica, complete with a world class mixing stage.\n\nTrevor Has won Two EMMY awards and Two GEMINI awards for his compositions on the Television productions &quot;The Tudors&quot;, &quot;The Borgias&quot; and &quot;The Pillars of the Earth&quot;.\n\nHe maintains a production company in Toronto complete with a duplicate writing suite to allow him to spend time and work there and need or muse dictates.\n\nTrevor currently lives and works in Santa Monica with his family.\n\nSupport the artists you like by buying their music!","torrent":{"xt":"urn:btih:9635dbfd9f0fb7168a2f601c6140e59b188d06f5","amp;dn":"Trevor+Morris+-+Dragon+Age+Inquisition+OST+%282014%29+%5Bmp3+320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9635dbfd9f0fb7168a2f601c6140e59b188d06f5","infoHashBuffer":{"type":"Buffer","data":[150,53,219,253,159,15,183,22,138,47,96,28,97,64,229,155,24,141,6,245]},"announce":[],"urlList":[]}}