{"title":"Accumulation in Post-Colonial Capitalism 2017","uid":15821746,"size":1201182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:968fb86a7ef603ed4a12ba30bfddaac229dfeec1&amp;dn=+Accumulation+in+Post-Colonial+Capitalism+2017&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"Horisarte","files":1,"time":1473777371,"description":"https://www.springer.com/gp/book/9789811010361\r\n\r\nThis volume looks at how accumulation in postcolonial capitalism blurs the boundaries of space, institutions, forms, financial regimes, labour processes, and economic segments on one hand, and creates zones and corridors on the other. It draws our attention to the peculiar but structurally necessary coexistence of both primitive and virtual modes of accumulation in the postcolony. From these two major inquiries it develops a new understanding of postcolonial capitalism. The case studies in this volume discuss the production of urban spaces of capital extraction, institutionalization of postcolonial finance capital, gendering of work forms, establishment of new forms of labour, formation of and changes in caste and racial identities and networks, and securitization—and thereby confirm that no study of contemporary capitalism is complete without thoroughly addressing the postcolonial condition.\r\n  \r\nBy challenging the established dualities between citizenship-based civil society and welfare-based political society, exploring critically the question of colonial and postcolonial difference, and foregrounding the material processes of accumulation against the culturalism of postcolonial studies, this volume redefines postcolonial studies in South Asia and beyond. It is invaluable reading for students and scholars of South Asian studies, sociology, cultural and critical anthropology, critical and praxis studies, and political science","torrent":{"xt":"urn:btih:968fb86a7ef603ed4a12ba30bfddaac229dfeec1","amp;dn":"+Accumulation+in+Post-Colonial+Capitalism+2017","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"968fb86a7ef603ed4a12ba30bfddaac229dfeec1","infoHashBuffer":{"type":"Buffer","data":[150,143,184,106,126,246,3,237,74,18,186,48,191,221,170,194,41,223,238,193]},"announce":[],"urlList":[]}}