{"title":"TMPGEnc Video Mastering Works 5.0.6.38 (Repacked) [ChingLiu]","uid":10613073,"size":51126558,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9769b20ddd7cf609a5b83eafe7f491cc6ee86e05&amp;dn=TMPGEnc+Video+Mastering+Works+5.0.6.38+%28Repacked%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"Ching_Liu","files":-1,"time":1406063977,"description":"Encoding Evolved.\n\nImport, edit, enhance, and encode your videos with the easy-to-use interface preferred by users the world over. Add video clips in practically any format, cut-out unwanted scenes, correct and enhance your video and audio, then encode to the format of your choice using custom settings or templates for popular formats. Be sure to check out the new features as well.\n\nEncoding Made Simple. \n\nThe Start-up Lancher window gives you the first option for your project. If you just need to convert one video, or link together several videos, choose the &quot;Normal Mode&quot;. If you want to create a more sophisticated output with layered videos, or mix video with different audio sources, choose the &quot;Timeline mode&quot;. Next, use the Format selector to choose the output format and continue to the Encode process.\n\nTons of Input and Output Formats.\n\nNatively supporting a wide variety of the most recent formats such as FLV (H.264), WebM, and the MKV container, you practically don't need to install external CODECs. You can edit and output without needing any knowledge of these formats. Furthermore, it also includes AVCHD, Blu-ray disc importation and even HDV capture functions. It even includes the Editing Proxy function, allowing you to quickly edit Full HD content.\n\n\nCut-Edit Your Video.\n\nThe Cut-editor window, while keeping its user interface simple for quick comprehension,has been enhanced with functions to support high-definition editing.\nAccelerated preview/fast navigation thanks to the Intuitive Draw Technology 3.0 ï¼ˆIDT3.0ï¼‰. The decoding stage can use CUDA or Intel Media SDK (for compatible formats only), making it easier for high definition video editing.\nYou can use the mouse to move within an image when the preview image is larger than the display area, making it possible to edit regardless of the image resolution.\n*Image with a resolution higher than 2048 pixels is resized.\nClip Start/End points can now be set through sliders, allowing simplier cut-editing.\nAudio meter displays the channel number and peak level in real time. You can prevent audio distortion by using the audio filters.\n\nEnhance Your Video with Filters.\n\nFrom filters aimed at improving the image quality of the source (like the Video denoise and Smart sharpness) to the newly added and creative Vintage picture and Speed filters, many types of filters are now available to you.\n\nLanguage : English\n\nHomepage : http://tmpgenc.pegasys-inc.com/en/product/tvmw5_feature.html","torrent":{"xt":"urn:btih:9769b20ddd7cf609a5b83eafe7f491cc6ee86e05","amp;dn":"TMPGEnc+Video+Mastering+Works+5.0.6.38+%28Repacked%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9769b20ddd7cf609a5b83eafe7f491cc6ee86e05","infoHashBuffer":{"type":"Buffer","data":[151,105,178,13,221,124,246,9,165,184,62,175,231,244,145,204,110,232,110,5]},"announce":[],"urlList":[]}}