{"title":"The Art of Fermentation - Sandor Ellix Katz - Audiobook MP3","uid":10466927,"size":586494751,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:977aed090a67467f37c03473a3243753a8d3f609&amp;dn=The+Art+of+Fermentation+-+Sandor+Ellix+Katz+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1404211627,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Art of Fermentation: An In-Depth Exploration of Essential Concepts and Processes from Around the World\n\nWritten by: Sandor Ellix Katz\nNarrated by: Sean Crisden\nLength: 20 hrs and 16 mins\nFormat: Unabridged\nRelease Date:04-29-13\nProgram Type: Audiobook\n\nThe Art of Fermentation is the most comprehensive guide to do-it-yourself home fermentation ever published. Sandor Ellix Katz presents the concepts and processes behind fermentation in ways that are simple enough to guide listeners through their first experience making sauerkraut or yogurt, and in-depth enough to provide greater understanding and insight for experienced practitioners. While Katz expertly contextualizes fermentation in terms of biological and cultural evolution, health and nutrition, and even economics, this is primarily a compendium of practical information - how the processes work; parameters for safety; techniques for effective preservation; troubleshooting; and more.\n\nFeaturing a foreword by Michael Pollan, The Art of Fermentation provides essential wisdom for cooks, homesteaders, farmers, gleaners, foragers, and food lovers of any kind who want to develop a deeper understanding and appreciation for arguably the oldest form of food preservation, and part of the roots of culture itself. Listeners will find detailed information on fermenting vegetables; sugars into alcohol (meads, wines, and ciders); sour tonic beverages; milk; grains and starchy tubers; beers (and other grain-based alcoholic beverages); beans; seeds; nuts; fish; meat; and eggs, as well as growing mold cultures, using fermentation in agriculture, art, and energy production, and considerations for commercial enterprises. Sandor Katz has introduced what will undoubtedly remain a classic in food literature, and is the first - and only - of its kind.","torrent":{"xt":"urn:btih:977aed090a67467f37c03473a3243753a8d3f609","amp;dn":"The+Art+of+Fermentation+-+Sandor+Ellix+Katz+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"977aed090a67467f37c03473a3243753a8d3f609","infoHashBuffer":{"type":"Buffer","data":[151,122,237,9,10,103,70,127,55,192,52,115,163,36,55,83,168,211,246,9]},"announce":[],"urlList":[]}}