{"title":"The Artist's Way: A Spiritual Path to Higher Creativity","uid":6580164,"size":4866554,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97baa871c8f5de8136ed842a36128ad50dc8602e&amp;dn=The+Artist%5C%27s+Way%3A+A+Spiritual+Path+to+Higher+Creativity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":0,"uploader":"_F1_","files":-1,"time":1312368799,"description":"BY REQUEST: 'jingala'\n\njingala at 2011-08-02 21:04 CET:\nThank you for the upload.I would like to request the following books \n\n1.international financial reporting standards a practical guide 6 th edition world bank publications \n\n2.all about music theory\n\n3.a creative approach to music fundamentals\n\n4.an artists way\n----------------\n5.fighting techniques of the colonial era\n\nThank you for your efforts.\n==================================================================================\n\nThe Artist's Way: A Spiritual Path to Higher Creativity by Julia Cameron\nPublisher: Tarcher; Tenth Anniversary Edition (1st edition : July 1992) | 222 pages | ISBN: 0874776945 | PDF | 4.64 MB\n\nWith the basic principle that creative expression is the natural direction of life, Julia Cameron and Mark Bryan lead you through a comprehensive twelve-week program to recover your creativity from a variety of blocks, including limiting beliefs, fear, self-sabotage, jealousy, guilt, addictions, and other inhibiting forces, replacing them with artistic confidence and productivity.\n\nThis book links creativity to spirituality by showing how to connect with the creative energies of the universe, and has, in the four years since its publication, spawned a remarkable number of support groups for artists dedicated to practicing the exercises it contains. --This text refers to an out of print or unavailable edition of this title.\n\nFrom Library Journal\nThis program consists of segments from the author's book of the same name (Tarcher, 1992). She recommends two ongoing activities that will conquer blocks and self-destructive tendencies: morning pages and artist's dates. Morning pages are three pages of writing, performed daily, about anything at all. This exercise overcomes the writer's internal censor and makes writing habitual, she claims. The artist's date is a weekly block of two hours spent observing, experiencing, and sensing. The balance of the recording describes how the artist can overcome human tendencies such as jealousy, fear, and addiction. This abridgment leaves much to be desired. In her introduction, Cameron states that the audio is an interactive abridgment of her 12-week program. There is nothing interactive about it, however. The sound quality is poor, and the content is similar to the many available 12-step programs. In that sense, it is redundant and will appeal to a very small audience. Not recommended.?Joanna M. Burkhardt, Univ. of Rhode Island Coll. of Continuing Ed. Lib.\nCopyright 1997 Reed Business Information, Inc. --This text refers to the Audio Cassette edition.","torrent":{"xt":"urn:btih:97baa871c8f5de8136ed842a36128ad50dc8602e","amp;dn":"The+Artist%5C%27s+Way%3A+A+Spiritual+Path+to+Higher+Creativity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97baa871c8f5de8136ed842a36128ad50dc8602e","infoHashBuffer":{"type":"Buffer","data":[151,186,168,113,200,245,222,129,54,237,132,42,54,18,138,213,13,200,96,46]},"announce":[],"urlList":[]}}