{"title":"FSpassengers X TESTED AND WORKING!!","uid":4820719,"size":90238093,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:982091b804a5192d3f3a1448ddcb0a2a90fc7a4f&amp;dn=FSpassengers+X+TESTED+AND+WORKING%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"jenstt","files":3,"time":1238756850,"description":"FsPassengersX is an add-on for Flight Simulator X that will completely revolutionize the way you fly in FsX.\n\nHere are just some of the features of FsPassengersX:\n\n    * Add passengers to your flights! Finally, you're not alone in the sky.\n    * Passengers react to how you fly your plane. Hear them scream if you make drastic mistakes, and get their opinion of your flight in real time.\n    * Provide in-flight passenger services such as movies, music, and drinks.\n    * Make money for successful flights; be fined if you do something wrong.\n    * Manage an airline (make money, manage aircraft fleets, etc).\n    * Maintain your aircraft in good condition, otherwise you may experience unique and surprising failures.\n    * Create and maintain pilot careers.\n    * Keep detailed logs and statistics for every flight you make (great for virtual airlines).\n    * Fly through dangerous parts of the world, and risk the safety of your plane, crew, or passengers! (Actual , 1944 or 1968 war situation)\n    * Attendants, passengers, effect; listen to ATC chatter, music, GPWS, and more. This add-on includes more than 1200 in-flight sounds to immerse you in the ambiance of flight.\n    * 7 new complete voice pack (one German , one in French)\n    * Three flight mode: normal, aerobatic, flight tour\n    * 40 unique failures with visual effect (smoke, fire) and sounds.\n    *  Export your flight to your Virtual Airline.\n    *  Doc and help in English, French, German\n    *  All screens and reports work in full screen. No need to quit FSX.\n    * NO impact on frame rate and still simple to use ! no complicated learning curve.\n    * Flight database compatible with FsPassengers 2004, you can continue your career\n\n\nHere it is: FSPassengers fully working. Just install it and run the patch in the crack directory. It will make 2 new files and you just need to copy those 2 files in the BIN section of fspassengers.\n\nMany many many thanx to cracker KOMU (who normally asks money for his cracks)\n","torrent":{"xt":"urn:btih:982091b804a5192d3f3a1448ddcb0a2a90fc7a4f","amp;dn":"FSpassengers+X+TESTED+AND+WORKING%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"982091b804a5192d3f3a1448ddcb0a2a90fc7a4f","infoHashBuffer":{"type":"Buffer","data":[152,32,145,184,4,165,25,45,63,58,20,72,221,203,10,42,144,252,122,79]},"announce":[],"urlList":[]}}