{"title":"Dollhouse - Season 2 720p BRRip","uid":9513293,"size":12316861724,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:98fbe5c83b2789720b3e58f123b2e04302300877&amp;dn=Dollhouse+-+Season+2+720p+BRRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":8,"uploader":"rachelstoolbox","files":13,"time":1390459937,"description":"All 13 episodes of Dollhouse, Season 2 in 720p BRRips. I made these for myself and decided to share them due to the lack of sources.\n\nA futuristic laboratory assigns different tasks to its various residents, who then have their memories erased upon the completion of their assignments.\n\n02x01 - Vows\nEcho enters an assignment as a newlywed who is undercover trying to bring down an arms dealer. The Rossum corporation becomes a target of a senator. Dr. Saunders and Boyd discuss Dr. Saunders' personal conflict while she takes out her frustrations on Topher. Ballard gets in deeper with the Dollhouse.\n\n02x02 - Instinct\nEcho is imprinted with the memory of a mother with a newborn baby for Dollhouse's latest business client. Complications arise when, thanks to Topher's programming, Echo takes too strongly to motherhood due to her maternal instincts. Meanwhile, Senator Perrin escalates his investigation into Rossum Corporation over the imprint technology. Also, DeWitt pays a visit to the former active November (now in her real personality of Madeline Costley) where she has a dark agenda of her own.\n\n02x03 - Belle Chose\nA backer of the Dollhouse needs to talk to his nephew who was injured in a car accident. He wants to find some people who may have been abducted by his nephew.\n\n02x04 - Belonging\nThe story of how Sierra came to the Dollhouse is revealed. And leads to a shocking outcome.\n\n02x05 - The Public Eye\nSenator Daniel Perrin breaks new ground in his attempt to expose the Dollhouse's secrets - by recruiting Madeline/November to testify before a Senate subcommittee. Rossum states that they will handle the situation, leading Ballard and DeWitt to fear for Madeline's safety, so Echo is sent to stop him, in hopes that that will keep Rossum from harming her. But all is not as it appears - Rossum has a hidden agenda, and the tension between the LA Dollhouse and its parent company increases. Meanwhile, in the Washington DC Dollhouse, we meet genius programmer, Bennett ...\n\n02x06 - The Left Hand\nEcho and Bennett have a shocking confrontation in which she reveals the reason for her grudge against Echo, while Adelle goes head-to-head with Stuart Lipman, the ruthless head of the Washington, D.C. Dollhouse, to lobby for Echo's safe return. Meanwhile, Topher sees double when he involves Victor in his espionage plans to hack into the D.C. Dollhouse computer to locate both Echo and Senator Perrin as they try to run from Perrin's wife Cindy.\n\n02x07 - Meet Jane Doe\nAfter her entanglements with Senator Perrin and the DC Dollhouse, Echo finds herself out in the world-at-large as she struggles to control her multiple memory downloads, as well as those of her original memory of Caroline. Unsure who she is, Echo/Caroline calls upon the only person she can remember; Ballard, when she lands in a jam in a small town in Texas involving an illegal Mexican immigrant woman whom gets jailed by the local sheriff. Meanwhile, Topher discovers the dangers of science that will have devastating effects on the future over abusing the Active's ...\n\n02x08 - A Love Supreme\nWhen all of Echo's past romantic engagements are found murdered, Adelle and the rest of the staff of the Dollhouse fear that Alpha has returned to seek his revenge. Adelle begins to grow suspicious of Ballard who hopes to find allies in Boyd and Topher in his continuing secret plan to bring down the Dollhouse from the inside.\n\n02x09 - Stop-Loss\nVictor's five-year contract with the Dollhouse elapses and he goes back out into the real world under his old personality of Anthony Ceccoli. But his past as a soldier fighting in Afghanistan (whom he was running from the first place) threatens his present with Sierra who remains behind at Dollhouse and is conflicted over Victor's absence. Meanwhile, Echo continues to keep an eye on the comatose Ballard, while Adelle slips into hopelessness over recent events. When Victor/Anthony is captured by a rouge military unit with ties to Rossum Corp. Echo is forced to recruit ...\n\n02x10 - The Attic\nWe finally enter the mysterious Attic - the secret vault where the Dollhouse keeps damaged actives and problematic employees unconscious and in a perpetual state of terror. Adelle has had Echo sent there, along with Victor and Sierra, on the grounds that her multiple imprints and their growing self-awareness are making the three a danger to Rossum. In the dream-world of the Attic, Echo and her friends forced to face their worst nightmares repeatedly, and their only ally is former Dollhouse security head Laurence Dominic, sent there earlier when he was discovered to be...\n\n02x11 - Getting Closer\nWith the Rossum conspiracy now fully revealed, Echo and her allies must now make their stand to stop the Rossum Corporation from enslaving the free world with their newest remote mind-wipe technology to take over the world. Topher meets up with Bennett Halverson when she is forcibly taken from the DC Dollhouse and brought to Los Angeles to help restore Caroline's past memory whom is the only one who can identify the two Rossum corporate heads. Echo will finally face herself as Caroline, even as Ballard struggles with the facts of his new existence as an Active, while ...\n\n02x12 - The Hollow Men\nStill unaware of a traitor in their midst, the dollhouse survivors flee Los Angeles for Rossum's headquarters in Tucson, where they hope to prevent the apocalyptic future.\n\n02x13 - Epitaph Two: Return\nIn the year 2020, events finally come full-circle as Echo and the few surviving Dollhouse staff struggle to restore mankind after the devastating events seen in the first season episode, &quot;Epitaph&quot; that has turned 90% of Earth's population into mindless, kill-crazy zombies out to kill those not infected (called 'actuals') by the Rossum's remote mind-wipe system. In the meantime, fellow actuals, Mag, Zone, and the mind-restored Caroline set out to find the save haven that can save man-kind from total extinction. ","torrent":{"xt":"urn:btih:98fbe5c83b2789720b3e58f123b2e04302300877","amp;dn":"Dollhouse+-+Season+2+720p+BRRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98fbe5c83b2789720b3e58f123b2e04302300877","infoHashBuffer":{"type":"Buffer","data":[152,251,229,200,59,39,137,114,11,62,88,241,35,178,224,67,2,48,8,119]},"announce":[],"urlList":[]}}