{"title":"The Religions Book (Big Ideas Simply Explained)","uid":10785809,"size":42302332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9935bd7525327b06ed21674b5ba106e1a4c8388f&amp;dn=The+Religions+Book+%28Big+Ideas+Simply+Explained%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":2,"uploader":"svdinesh","files":2,"time":1408208917,"description":"An innovative and accessible guide to the world's religions\n\nThe Religions Book clearly explains the key concepts behind the earliest religious beliefs right up to the world's newest faiths, getting to the heart of what it means to believe. Principles of the five main world religions - Hinduism, Buddhism, Judaism, Christianity, and Islam - as well as ancient and primal belief systems are explored in this informative tome.\n\nAll the big ideas are simply explained with jargon-free descriptions, step-by-step diagrams, and witty illustrations that encapsulate every aspect of religious thinking. Examine major historical developments and ideas with a universal timeline, providing a global perspective on the origins and major events that have contributed to the growth and spread of religion and spirituality. Along with the teaching highlights of pre-eminent figures such as Mahatma Gandhi, Saint Paul, and Al-Ghazali, you'll also find a handy reference section featuring a glossary of religious terms and a roadmap to all the branches of the major faiths and the points of doctrine or tradition on which they differ. Modern alternative religions and spiritual beliefs from around the world are also explored, putting into context the political and social climates from which they emerged.\n\nThe Religions Book provides compelling, accessible information perfect for students of religious study or anyone interested in the ideas of ancient and present day faiths and religious philosophies.\n\n\nThe Religions Book (Big Ideas Simply Explained)\nBook Language: English \nPages: 352\nFile Type: Pdf\nFile Size: 40.1 MB\n\n[IMG]http://i.imgur.com/7ytVQ0u.jpg[/IMG]\n &lt;a href=&quot;\nhttp://i.imgur.com/7ytVQ0u.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/7ytVQ0u.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:9935bd7525327b06ed21674b5ba106e1a4c8388f","amp;dn":"The+Religions+Book+%28Big+Ideas+Simply+Explained%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9935bd7525327b06ed21674b5ba106e1a4c8388f","infoHashBuffer":{"type":"Buffer","data":[153,53,189,117,37,50,123,6,237,33,103,75,91,161,6,225,164,200,56,143]},"announce":[],"urlList":[]}}