{"title":"Nefertiti, Egypt's Sun Queen: Unlocking the Mystery","uid":15816234,"size":3375644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a578186ee4a23052c080b62cf06675a6622bb58&amp;dn=Nefertiti%2C+Egypt%27s+Sun+Queen%3A+Unlocking+the+Mystery&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":1,"uploader":"marty14","files":1,"time":1473687596,"description":"Nefertiti, Egypt's Sun Queen: Unlocking the Mystery Surrounding Egypt's Most Famous and Beautiful Queen - Joyce Tyldesley [epub]\r\n\r\nShe was the beloved wife of &quot;heretic king&quot; Akhenaten, who defied ancient custom by practicing monotheism and by elevating Nefertiti far above the role of subservient consort previously played by Egyptian queens. Her image has ravished Western viewers ever since a magnificent limestone bust unearthed at the royal retreat of Amarna went on display in Berlin in 1924. But frustratingly few facts are known about this woman who lived more than three millennia ago.\r\n\r\nAs she did in Hatchepsut: The Female Pharaoh, British archeologist Joyce Tyldesley makes a virtue of necessity by writing a book that is as much a cultural history as a biography. As Akhenaten swept away the plethora of old gods, dismaying many of his subjects, he needed a strong female figure to soften the abstract austerity of Aten, the sun deity; his beautiful queen was celebrated in official art and inscriptions that focused on the domestic life of the royal family.\r\n\r\nTyldesley meticulously analyzes this iconography to evaluate Nefertiti's position in Egypt and her importance to her husband, who clearly cherished her beyond the demands of propriety or political necessity. The author cannot give readers a strong sense of Nefertiti's personality--the evidence simply isn't there--but she paints a wonderfully evocative picture of life at the civilized heart of the ancient world","torrent":{"xt":"urn:btih:9a578186ee4a23052c080b62cf06675a6622bb58","amp;dn":"Nefertiti%2C+Egypt%27s+Sun+Queen%3A+Unlocking+the+Mystery","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a578186ee4a23052c080b62cf06675a6622bb58","infoHashBuffer":{"type":"Buffer","data":[154,87,129,134,238,74,35,5,44,8,11,98,207,6,103,90,102,34,187,88]},"announce":[],"urlList":[]}}