{"title":"Medical Pharmacology at a Glance, 7E [PDF] [StormRG]","uid":10939254,"size":32930948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a594dcfd260aed803a98b74669929dc97a21f80&amp;dn=Medical+Pharmacology+at+a+Glance%2C+7E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"0xmovva","files":2,"time":1409483745,"description":"Author: Michael J. Neal \nPaperback: 120 pages\nPublisher: Wiley-Blackwell; 7 edition (April 23, 2012)\nLanguage: English\nISBN-10: 0470657898\nISBN-13: 978-0470657898\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nWidely recognised as the best starting point for pharmacology study, the internationally best-selling Medical Pharmacology at a Glance is an ideal companion for all students of the health sciences. \nKey principles are supported by coloured schematic diagrams - invaluable as both an introduction to medical pharmacology, and revision in the run-up to pharmacology exams.\n\nRevised and thoroughly updated throughout, and reflecting changes to the content and assessment methods used by medical schools, Medical Pharmacology at a Glance:\n\nIntroduces the basic principles of drug action, interaction, absorption and excretion\nBases chapters on diseases and syndromes, for clinically-focused learning\nIncludes references to the pathophysiology of disease, to aid understanding of drug choice and action\nIndicates the therapeutics of choice for specific disorders and conditions\nFeatures cross references between discussion of drug classes and diseases\nIncludes self-assessment cases studies with full answers, for revision and review\nFeatures a new chapter on immunosuppressants and antirheumatoid drugs","torrent":{"xt":"urn:btih:9a594dcfd260aed803a98b74669929dc97a21f80","amp;dn":"Medical+Pharmacology+at+a+Glance%2C+7E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a594dcfd260aed803a98b74669929dc97a21f80","infoHashBuffer":{"type":"Buffer","data":[154,89,77,207,210,96,174,216,3,169,139,116,102,153,41,220,151,162,31,128]},"announce":[],"urlList":[]}}