{"title":"Direct X 11 FULL~[Offline]~{AryaN_L33T}[LittleFairyRG]","uid":9796268,"size":602950567,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9b457d36868bc668a00ddf7d186b5267d7613f6b&amp;dn=Direct+X+11+FULL%7E%5BOffline%5D%7E%7BAryaN_L33T%7D%5BLittleFairyRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":10,"uploader":"SirHates","files":14,"time":1395323996,"description":"Direct X 11 Offline\n\nimage\n\nDirectX makes it possible for you to your computer to experience graphics and videos from websites and other applications. Graphics, 3D animation, videos and audio all benefit from having this program installed in your computer. With this, you can see every detail and color. This program features support for sophisticated shading and textures when it comes to games to give it a lifelike approach feel to the characters, settings and movements in your games and more. It also enables support for multi core processors. \n\nDirectX 11 for Windows Vista/DirectX 11 for Windows XP is an update to Microsoft's graphics acceleration for Windows and providers updates to Pixel Shaders, Direct3D, DirectSound, DirectX Media and DirectSetup. The 11 update also providers for a smoothing gaming experience for a number of titles and is required by many modern 3D games. DirectX 11 also introduces support for tessellation, improving multithreading support and can take advantage of multi-core processors and better computing of shaders.\n\n\nNote: DirectX is a suite of multimedia technologies required by many Windows games. If your computer doesn't have the right version of DirectX installed (the product box should tell you which one you need), your game might not work properly\n\nNot Working On Windows 8 or 8.1\n\nimage\n\nimage\n\nimage\n\n\n[color=blue]Visit us at - www.lfrg.co.vu feel free to visit, and make sure you leave feedback for us \n\n\nIf you download our uploads, please make sure you seed them till atleast 1:1 ratio. We all work very hard to get this stuff. We'll all greatly appreciate some help.\n\n\n\n\nimage","torrent":{"xt":"urn:btih:9b457d36868bc668a00ddf7d186b5267d7613f6b","amp;dn":"Direct+X+11+FULL%7E%5BOffline%5D%7E%7BAryaN_L33T%7D%5BLittleFairyRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b457d36868bc668a00ddf7d186b5267d7613f6b","infoHashBuffer":{"type":"Buffer","data":[155,69,125,54,134,139,198,104,160,13,223,125,24,107,82,103,215,97,63,107]},"announce":[],"urlList":[]}}