{"title":"Fredrik Sjoberg - IgNobel Prize in Literature, 2016 (1 book)","uid":15885644,"size":274506,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b6f3bac51df37a70279f7ec06733b50e2737141&amp;dn=Fredrik+Sjoberg+-+IgNobel+Prize+in+Literature%2C+2016+%281+book%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":2,"uploader":"workerbee","files":2,"time":1474649605,"description":"\nFREDRIK SJÖBERG is a Swedish entomologist, literary critic, translator, and cultural columnist.  On 22 September 2016, he was awarded the 2016 IgNobel Prize in Literature for THE FLY TRAP, the first volume of his autobiographical trilogy about the pleasures of collecting flies that are dead, and flies that are not yet dead.\r\n\r\nTHE FLY TRAP chronicles Sjöberg’s life collecting hoverflies on a remote island in Sweden.  Warm and humorous, self-deprecating and contemplative, and a major best seller in its native country, the book is a meditation on the unexpected beauty of small things and an exploration of the history of entomology itself.\r\n \r\nWhat drives the obsessive curiosity of collectors to catalog their finds?  What is the importance of the hoverfly?  (And what the fuck *is* a hoverfly?)  As confounded by his unusual vocation as anyone, Sjöberg reflects on a range of ideas -- the passage of time, art, lost loves -- drawing on sources as disparate as D. H. Lawrence and the fascinating and nearly forgotten naturalist René Edmond Malaise.  From the wilderness of Kamchatka to the loneliness of the Swedish isle he calls home, Sjöberg revels in the wonder of the natural world and leaves behind a trail of memorable images and stories.\r\n\r\n\r\nThe following book is in ePUB format:\r\n\r\n* The Fly Trap (Pantheon, 2015).  Translated by Thomas Teal.\r\n\r\n \nhttp://www.improbable.com/ig/winners/\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n \nhttps://pirates-forum.org/User-workerbee\r\n\r\nPLEASE HELP TO SEED! If you like these books and want others to have access to them, please help to seed for as long as you can. The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content. Thank you!","torrent":{"xt":"urn:btih:9b6f3bac51df37a70279f7ec06733b50e2737141","amp;dn":"Fredrik+Sjoberg+-+IgNobel+Prize+in+Literature%2C+2016+%281+book%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b6f3bac51df37a70279f7ec06733b50e2737141","infoHashBuffer":{"type":"Buffer","data":[155,111,59,172,81,223,55,167,2,121,247,236,6,115,59,80,226,115,113,65]},"announce":[],"urlList":[]}}