{"title":"The Tao of Pooh by Benjamin Hoff (1982|Dutton Books) [EPUB]","uid":10016061,"size":5386285,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c0b2747c6e856f4616d465c54e880f453654b74&amp;dn=The+Tao+of+Pooh+by+Benjamin+Hoff+%281982%7CDutton+Books%29+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1398146980,"description":"Title: The Tao Of Pooh\nAuthor: Benjamin Hoff\nCategory: Non-Fiction\nPaperback: 176 pages\nPublisher: Penguin Books; 1 edition (July 28, 1983)\nLanguage: English\nISBN-10: 0140067477\nISBN-13: 978-0140067477\n\nFor more information on this book, please see the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Tao_of_Pooh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Tao_of_Pooh&lt;/a&gt;\n\nIn this clear, concise and wonderful take on Eastern Philosophy, author Benjamin Hoff uses the simple and elegant principles from A.A. Milne's Winnie The Pooh stories to illustrate the basic principles of Taoism. It is an easy read and not at all difficult to follow and is one of the best introductions to Eastern Philosophy available to the western world. The book was a runaway best-seller and was followed by a companion book, The Te of Piglet.\n\nPromotional info/Publisher's summary - &quot;The how of Pooh? The Tao of who? The Tao of Pooh!?! In which it is revealed that one of the world's great Taoist masters isn't Chinese--or a venerable philosopher--but is in fact none other than that effortlessly calm, still, reflective bear. A. A. Milne's Winnie-the-Pooh! While Eeyore frets, and Piglet hesitates, and Rabbit calculates, and Owl pontificates, Pooh just is.\n\nAnd that's a clue to the secret wisdom of the Taoists.&quot;\n\nReview:\n&quot;Is there such thing as a Western Taoist? Benjamin Hoff says there is, and this Taoist's favorite food is honey. Through brilliant and witty dialogue with the beloved Pooh-bear and his companions, the author of this smash bestseller explains with ease and aplomb that rather than being a distant and mysterious concept, Taoism is as near and practical to us as our morning breakfast bowl. Romp through the enchanting world of Winnie-the-Pooh while soaking up invaluable lessons on simplicity and natural living.&quot;\n\nFrom Library Journal:\n&quot;Author/narrator Hoff calls Winnie the Pooh a &quot;Western Taoist&quot; and uses the unassuming bear to introduce Eastern philosophical principles. Pooh epitomizes the &quot;uncarved block,&quot; as he is well in tune with his natural inner self. Pooh enjoys simple pleasures and the daily progress of life. Hoff contrasts this unpretentiousness to other characters created by Winnie - the - Pooh author A.A. Milne, including Owl, whom he describes as a &quot;mind that tries too hard,&quot; and Eeyore, the eternal pessimist. In a clear and crisp voice, Hoff explains the central tenets of Taoism and further illustrates them with familiar excerpts from The House at Pooh Corner stories (1923), Chinese proverbs, maxims, and tales from Lao Tzu and others. The result is at once thought-provoking and charming. This is a small literary event that will leave all who experience it a little more serene. For most collections.&quot;\n- Jeanne P. Leader, Western Nebraska Community Coll. Lib., Scotts bluff\n\nThe torrent contains the PDF and EPUB versions of the book, as well as both published covers. \n*NOTE- the PDF version used here is a from-scratch, searchable and browseable version created by The Pirate Bay uploader pharmakate. Full credit to that user for their excellent work; you can find their uploads here. The EPUB is not from the same source material but is the revised and updated edition. Please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:9c0b2747c6e856f4616d465c54e880f453654b74","amp;dn":"The+Tao+of+Pooh+by+Benjamin+Hoff+%281982%7CDutton+Books%29+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c0b2747c6e856f4616d465c54e880f453654b74","infoHashBuffer":{"type":"Buffer","data":[156,11,39,71,198,232,86,244,97,109,70,92,84,232,128,244,83,101,75,116]},"announce":[],"urlList":[]}}