{"title":"Avira Antivirus Pro 15.0.19.164 + Key [4REALTORRENTZ]","uid":15688391,"size":225069074,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9ec9b821dd30e0406dca0d720b46eff1decd7e8d&amp;dn=Avira+Antivirus+Pro+15.0.19.164+%2B+Key+%5B4REALTORRENTZ%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":1,"uploader":"menin1","files":1,"time":1472369169,"description":"Avira Antivirus for PC is an industry-leading antivirus software, which secures your data, protects your privacy, and keeps your PC malware-free. Just download, install, and sit back and relax, you're protected for life! Avira Antivirus for PC gives you security in numbers with Protection Cloud Technology. This early-warning system analyzes unknown files in the cloud, anonymously, from millions of users, to protect you from threats as they emerge in real-time.\r\nAvira Antivirus for PC also gives you protection that runs silently in the background. It delivers swift and smooth system scans at the push of a button, and as all the advanced analysis takes place on on Avira's servers, it is fast and it doesn't consume too much of your systemâ™s resources or slow down your browsing experience.\r\n\r\nKey Features:\r\n\r\n• Staying safe online isn't merely about shielding your PC. It's about being in control of your security and privacy, no matter how, when and where you connect. That's why the new version of Avira is designed to revolve around you, protecting your PC, your smartphone and your web privacy. Extend security to every facet of your online life.\r\n• Browser Tracking Blocker – new. Stops over 600 companies from recording your web activities\r\n• Protection Cloud – new. Real-time malware classification and extremely fast system scanning\r\n• Website Safety Advisor – new. Security ratings in your search results—know before you go!\r\n• Advanced AntiPhishing – new. Proactive protection from the craftiest email scams\r\n• Security for Android – new. Lost phone recovery, privacy protection and call/SMS blocking\r\n• Social Network Protection – new. Intelligent parental controls forand other social sites\r\n\r\nRequirements:\r\n\r\n• Windows 2000 / XP / Vista / Windows 7 / XP 64-bit / Vista 64-bit / Windows 7 64-bit / Windows 10 / Windows 10 64-bit\r\n• Languages: Multiple languages\r\n\r\nInstructions:\r\n\r\n1. Unpack and install\r\n2. Run host.cmd as administrator\r\n3. Use given license key to register\r\n4. Done","torrent":{"xt":"urn:btih:9ec9b821dd30e0406dca0d720b46eff1decd7e8d","amp;dn":"Avira+Antivirus+Pro+15.0.19.164+%2B+Key+%5B4REALTORRENTZ%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ec9b821dd30e0406dca0d720b46eff1decd7e8d","infoHashBuffer":{"type":"Buffer","data":[158,201,184,33,221,48,224,64,109,202,13,114,11,70,239,241,222,205,126,141]},"announce":[],"urlList":[]}}