{"title":"East West Quantum Leap RA","uid":4798523,"size":14214032473,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9fb4722a847c7a3f225968abccca687f0bf36c43&amp;dn=East+West+Quantum+Leap+RA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":5,"uploader":"ouyangsheng","files":10,"time":1237965241,"description":"This took me forever to get off eMule, so now I want to pass it on to you guys. Big thanks to DELiRiUM!\n\nInstallation of the EASTWEST/QUANTUM LEAP RA \n \nThis Virtual Instrument RA consists of a special version of Native Instruments KOMPAKT Sample Player and the RA Virtual Sound Module \nfrom EastWest. \n \nThe software will be installed by the included installer on the \nfirst DVD &quot;RA Disc 1&quot;.  \nThe sample files have to be copied manually from each DVD to the specified Library folder on your hard disk. \n \nPlease make sure that you have at least 100 MB of free disk space for the software and at least 13.2 Gigabytes of free disk space for the sample library ! \n \n \nInstallation procedure: \n \n1. Double click the installer application on the first DVD and \n   follow the instructions. Please have the serial number ready \n   (found on the disc folder). \n \n2. During installation you will be asked to specify a location for the software and later for the sample library. You can install both on the same hard disk, but you can also choose to install the sample library to a different location than the software in case you want to store all your samples on a separate hard disk for better performance. \n(We recommend to use a hard disk with 7200 rpm and 8 MB cache \nor higher for the samples) \n \n3. After the installer has finished the installation of the software, please copy all 7 sample library files named &quot; Ra_Lib_part1.nks&quot; to &quot; Ra_Lib_part7.nks&quot; directly into the library folder &quot;Ra Library&quot; which location you have specified during the installation of the software. \n \n4. You can use the RA virtual sound module for 14 days without the need for registration, however, we advise you to register as soon as possible as there is a &quot;performance enhancement&quot; extension that you must download and install to enable streaming from hard disk that is only available after registration. After 14 days, you must register and authorize the application with the included registration tool. \n \n5. Enjoy the power of RA and KOMPAKT Sample Player. \n \n \nYour EASTWEST and NATIVE INSTRUMENTS team.\n\nMore information here: http://www.soundsonline.com/product.php?productid=EW-181","torrent":{"xt":"urn:btih:9fb4722a847c7a3f225968abccca687f0bf36c43","amp;dn":"East+West+Quantum+Leap+RA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fb4722a847c7a3f225968abccca687f0bf36c43","infoHashBuffer":{"type":"Buffer","data":[159,180,114,42,132,124,122,63,34,89,104,171,204,202,104,127,11,243,108,67]},"announce":[],"urlList":[]}}