{"title":"Rambo DVD Boxset - Rambo 1, 2, 3 &amp; 4 DVDRip","uid":6197760,"size":2947931560,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a0732aa1043db38cc1e6217c842140068f43fc2e&amp;dn=Rambo+DVD+Boxset+-+Rambo+1%2C+2%2C+3+%26+4+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":16,"uploader":"TSV","files":-1,"time":1298498671,"description":"Rambo (also known as Rambo IV or John Rambo) is a 2008 American action/war film starring Sylvester Stallone returning and reprising his famous role as legendary Cold War/Vietnam veteran John Rambo. Stallone also co-wrote and directed the film. It is the fourth installment in the Rambo franchise, twenty years since the last film Rambo III. This film is dedicated to the memory of Richard Crenna, who played Col. Sam Trautman in the first three films, who died in 2003.\n\nThe film is about a former U.S. soldier, John Rambo, who is hired by a church pastor to help rescue a group of missionaries who were kidnapped by men from a brutal Burmese military regime. Rambo holds the record with the most kills out of the entire Rambo series, with 236 kills. In the film, Rambo kills a group of pirates, an entire squad of Burmese soldiers, and then, at the climax of the film, a huge number of Burmese army soldiers whom he shoots with a jeep-mounted .50-caliber machine gun. Stallone justified this in a press conference by saying the violence in the film was to draw attention to the ongoing problems in Burma.\n\nIncluding the intake of $41,368,619 in DVD sales, the film\\'s total gross revenue is $154,611,774. The film had its cable television premiere on Spike TV on July 11, 2010. However, it was the extended cut that was broadcast not the theatrical version. The extended cut was later released on Blu-ray two weeks after its cable TV premiere.","torrent":{"xt":"urn:btih:a0732aa1043db38cc1e6217c842140068f43fc2e","amp;dn":"Rambo+DVD+Boxset+-+Rambo+1%2C+2%2C+3+%26+4+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0732aa1043db38cc1e6217c842140068f43fc2e","infoHashBuffer":{"type":"Buffer","data":[160,115,42,161,4,61,179,140,193,230,33,124,132,33,64,6,143,67,252,46]},"announce":[],"urlList":[]}}