{"title":"Mastering Sublime Text - Packt (2013) PDF - GOLU","uid":10396490,"size":5310884,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0be891a4348f2cc991a5258740decb9029dd3ed&amp;dn=Mastering+Sublime+Text+-+Packt+%282013%29+PDF+-+GOLU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"GOLU","files":-1,"time":1403272840,"description":"Title: Mastering Sublime Text\nAuthor(s) : Dan Peleg\nLanguage : English\nISBN : 1849698422\nISBN 13 : 9781849698429\nFormat: PDF\n\nDescription:\nSublime is the leading platform for developing websites, applications, and software. Sublime Text is a sophisticated, cross-platform text and source code editor. It supports a number of different programming languages and is extremely efficient and feature rich. With Sublime Text, programmers can develop their web applications faster and with more efficiency.\nThis book will put you at the frontier of modern software development. It will teach you how to leverage Sublime for anything from mobile games to missile protection. Above all, this book will help you harness the power of other Sublime users and always stay on top.\nThis book will show you how to get started, from basic installation through lightning fast code navigation and up to the development of your own plugins. It takes you from the early stages of navigating through the platform and moves on by teaching you how to fully customize your platform, test, debug, and eventually create and share your own plugins to help and lead this community forward.\nThe book will then teach you how to efficiently edit text, primarily by using the keyboard. You will learn how to interact with the Sublime Text community using the mailing lists and IRC.\n\n\n*Keep Learning and help us to share the knowledge across the World.\n tweet us @teamGOLU","torrent":{"xt":"urn:btih:a0be891a4348f2cc991a5258740decb9029dd3ed","amp;dn":"Mastering+Sublime+Text+-+Packt+%282013%29+PDF+-+GOLU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0be891a4348f2cc991a5258740decb9029dd3ed","infoHashBuffer":{"type":"Buffer","data":[160,190,137,26,67,72,242,204,153,26,82,88,116,13,236,185,2,157,211,237]},"announce":[],"urlList":[]}}