{"title":"Akira Kurosawa - Dersu Uzala (1975)","uid":3570702,"size":1454022310,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a2249dd1a0185668cc2ddfc99a93ab3efbc2c1a4&amp;dn=Akira+Kurosawa+-+Dersu+Uzala+%281975%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"kegir","files":4,"time":1165269525,"description":"Soviet Union Title: Dersu Uzala\nDirector: Akira Kurosawa\nYear: 1975 \nLanguage: Russian\nSubtitles: English (softsubs)\n\nSource: DVD\n\nPlot Synopsis from AMG\n\nA few months after his notorious suicide attempt, Japanese filmmaker Akira Kurosawa was regenerated by the notion of helming the first Russian/Japanese co-production. Co-scripted and directed by Kurosawa, Dersu Uzala is the story of an elderly guide and Goldi hunter (Maxim Munzuk), who, at the turn of the century, agrees to shepherd a Russian explorer (Yuri Solomin) and a troop of soldiers through the most treacherous passages of the Far East. The guide has been &quot;one&quot; with the land almost from birth, and is thus able to save his party from perishing. Four years in the making, Dersu Uzala won the 1976 Best Foreign Film Oscar and restored the flagging Akira Kurosawa to the top ranks of the Japanese film industry.\nHal Erickson\n\nReview from AMG \n\nDirector Akira Kurosawa is known for his epics, and this Russian-Japanese co-production was one of the most sweeping of his long and brilliant career. Metaphorically, the story of the crafty, stodgy Mongolian hunter who teaches a Russian about the land and its animals evokes the bankruptcy of colonialism. Physically, it is one of the most impressive filmed testaments to the majesty of nature. Breathtaking cinematography makes the Siberia-Mongolian frontier the real star of this slow-moving, proud, and unconventional buddy film. Kurosawa has made more accessible films in plot and structure, but the rugged beauty of this work is unsurpassed in his canon.\nMichael Betzold \n\nA voice from IMDB \n\nDersu Uzala is slow, serene, beautiful, but nevertheless gripping. It tells of the friendship between a nomadic Siberian native and a Russian army explorer, and how the former is able to help the latter and his team to negotiate the many obstacles presented by the Siberian wilderness. We see how traditional survival methods and intrinsic common sense can help the more urbanised army men to cope with the extremes of climate and geography. Eventually the nomad is persuaded to join the general on his trip back to a town. His ignorance of urban life is apparent, but interesting nevertheless, as we do not imagine such people nor meet them in everyday life today. Kurosawa is on top form here, letting the camera take in the vastness of Siberia, and still allowing the viewers to observe the characters closely. The story is interesting too, with a sadly ironic ending (won&amp;#039;t say any more!). I think everybody should watch this film, because everybody will have something to learn from it.\n\nFile Name .............: Dersu Uzala (kurosawa 1975) cd1.avi\nFile Size (in bytes) ..: 724,267,008 bytes\nRuntime (# of frames) .: 1:12:35 (4189656 frames)\n\nVideo Codec ...........: DivX 3 Low-Motion\nFrame Size ............: 640x272[=2.353]\nFPS ...................: 23.976\nVideo Bitrate .........: 1219 kb/s\nBits per Pixel ........: 0.292 bpp\nB-VOP, N-VOP, QPel, GMC ......: []...[]...[]...[]\n\nAudio Codec ...........: 0x0055 MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 128 kb/s [2 channel(s)] VBR audio\nInterleave ............: 42 ms\nNo. of audio streams ..: 1\n\nFile Name .............: Dersu Uzala (kurosawa 1975) cd2.avi\nFile Size (in bytes) ..: 729,722,880 bytes\nRuntime (# of frames) .: 1:11:13 (4193880 frames)\n\nVideo Codec ...........: DivX 3 Low-Motion\nFrame Size ............: 640x272[=2.353]\nFPS ...................: 23.976\nVideo Bitrate .........: 1219 kb/s\nBits per Pixel ........: 0.292 bpp\nB-VOP, N-VOP, QPel, GMC ......: []...[]...[]...[]\n\nAudio Codec ...........: 0x0055 MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 128 kb/s [2 channel(s)] VBR audio\nInterleave ............: 42 ms\nNo. of audio streams ..: 1\n\nNOT MY RIP \n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art\nto the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\t\t &lt;a href=&quot;\thttp://www.freakyflicks.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.freakyflicks.tk&lt;/a&gt;\n\n\t\t &lt;a href=&quot;\thttp://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://freakyflicks.proboards54.com/&lt;/a&gt;\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;\t\t","torrent":{"xt":"urn:btih:a2249dd1a0185668cc2ddfc99a93ab3efbc2c1a4","amp;dn":"Akira+Kurosawa+-+Dersu+Uzala+%281975%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2249dd1a0185668cc2ddfc99a93ab3efbc2c1a4","infoHashBuffer":{"type":"Buffer","data":[162,36,157,209,160,24,86,104,204,45,223,201,154,147,171,62,251,194,193,164]},"announce":[],"urlList":[]}}