{"title":"Aesop Rock - discography (6 studio albums + 4 EP's)","uid":4475600,"size":846691391,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a2ae1ad4f51c442d59ef149db197f015b3e1dd08&amp;dn=Aesop+Rock+-+discography+%286+studio+albums+%2B+4+EP%5C%27s%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":12,"uploader":"phrozin1","files":-1,"time":1225325512,"description":"A Huntington, Long Island, New York-born MC, Aesop initially recorded and released two self-financed efforts, Music for Earthworms (1997), a full length featuring underground legend Percee P on two tracks, and the Appleseed EP (1999), while also working as a waiter. These two independent releases are widely sought after in the underground scene.[citation needed]\n\nAfter moving to the Mush label, Aesop released his first major album, Float (2000), with guest appearances from Vast Aire, Slug, and Dose One. Production was split between Blockhead and Aesop himself, with one track by Omega One.\n\nShortly after releasing Float, Aesop Rock signed to Manhattan-based label Definitive Jux (commonly shortened to Def Jux), where he released Labor Days, an album dedicated to the discussion of labor in American society and the concept of &quot;wage slaves&quot;. This album was most well known for its single &quot;Daylight.&quot; Because of its popularity, Daylight was re-released in 2002 as a 7-track EP, including an &quot;alternative&quot; new version of the song, &quot;Night Light,&quot; whose paraphrased lyrics simultaneously refer back to, and stand in stark opposition to, the original&amp;#039;s.\n\nLabor Days was followed by Bazooka Tooth in 2003. For the first time, production was mostly handled by Aesop himself, with three tracks from longtime collaborator Blockhead and one from close friend and Definitive Jux label CEO El-P. Guest appearances include Party Fun Action Committee, El-P, and Mr. Lif (all Definitive Jux labelmates) and Camp Lo. With this release Aesop hit a higher level of recognition, releasing &quot;No Jumper Cables&quot; as a single and music video, then another single, &quot;Freeze&quot;, shortly after.\n\nIn the summer of 2004, Aesop Rock appeared on the Evil Nine Single &quot;Crooked&quot; from the Album You Can Be Special Too, on Marine Parade records.\n\nIn February 2005, Aesop Rock released a new EP, Fast Cars, Danger, Fire and Knives. The first pressing of the EP included an 88 page booklet with lyrics from every release from Float until this EP (the lyric booklet is titled The Living Human Curiosity Sideshow); later pressings of the album come without the booklet, but with an additional bonus track, &quot;Facemelter&quot;. In addition, a limited number of albums were available direct from Def Jux with Aesop Rock&amp;#039;s graffiti tag on them. In response to demands from his fans, Aesop did less production on the EP: three songs are produced by Blockhead, three produced by Aesop, and one by Rob Sonic.\n\nAesop Rock was commissioned to create a 45-minute instrumental track for the Nike+iPod running system, entitled All Day. It was released in February 2007. Distributed via the iTunes Music Store and featuring Allyson Baker on guitar and scratches from DJ Big Wiz, Aesop has described the release as &quot;something that evolved enough that the sound was constantly fresh and attractive, as though the runner were moving through a set of differing cities or landscapes.&quot; [1]\n\nAll Day was followed in August of the same year by Bavitz&amp;#039;s fifth full-length album, None Shall Pass (2007). The album also contained original artwork by Jeremy Fish.\n\n\n=================================================================\nArtist    -  Aesop Rock        \nAlbum     -  Various                                          \nGenre     -  hip hop                                             \nLabel     -  Definitive Jux\nYear      -  1997 - present                                            \nTracks    -  n/a                                               \nPlaytime  -  n/a\nFile Type -  .mp3\nSize      -  \nkbps      -  VBR / 256 avg.\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/phrozin1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/phrozin1&lt;/a&gt; \n\nEnjoy. Please seed for others. Thanks.        \n=================================================================                                    \nAesop Rock Discography:\n\nMusic for Earthworms (1998) \nAppleseed EP (1999)\nFloat (2000) \nLabor Days (2001)\nDaylight EP (2002) \nBazooka Tooth (2003)\nFast Cars, Danger, Fire and Knives EP (2005) \nAll Day: Nike+ Original Run (2007)\nNone Shall Pass (2007)\nCoffee EP (2007) ","torrent":{"xt":"urn:btih:a2ae1ad4f51c442d59ef149db197f015b3e1dd08","amp;dn":"Aesop+Rock+-+discography+%286+studio+albums+%2B+4+EP%5C%27s%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2ae1ad4f51c442d59ef149db197f015b3e1dd08","infoHashBuffer":{"type":"Buffer","data":[162,174,26,212,245,28,68,45,89,239,20,157,177,151,240,21,179,225,221,8]},"announce":[],"urlList":[]}}