{"title":"Anthony Robbins - Mastering Influence","uid":16041215,"size":1627504924,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a2cae4fd445d2e51ac316d4ff3f8c277ddb2a350&amp;dn=Anthony+Robbins+-+Mastering+Influence&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":14,"uploader":"8anatos","files":61,"time":1476507510,"description":"LEARN THE SECRETS OF INFLUENCE, PERSUASION, AND LEADERSHIP\r\nPersuasion is one of the most effective tools Tony Robbins uses to create and increase his own personal and professional success.\r\n\r\nAnyone who masters the skill of influence is a person who moves faster and more effectively through this world. Influencers are the doers, achievers and people of action who can change the future for the better. People like you.\r\n\r\nMastering Influence is the single most important skill you can learn to shape your destiny.\r\n\r\nAnd that’s why Tony designed this dynamic and advanced system, rich with specific techniques, strategies and secrets from the world’s top salespeople and leaders — principles Tony uses to-day. This 10-day audio program can help you immediately to start developing your power of influence. The complete program also includes; an accompanying workbook and portable integration cards designed to help you trigger your distinctions and key lessons learned. This is your opportunity to be more, give more and contribute great, positive change to the world around you.\r\n\r\nMastering Influence is your first step on a fulfilling journey that will pay you back immensely.\r\n\r\nLearn how to:\r\n\r\nEnjoy and inspire greater confidence, passion and drive to succeed.\r\nAchieve crystal-clear focus and direction.\r\nFine-tune your personal-development and success-conditioning skills.\r\nMaster strategies employed by the world’s most successful sales people.\r\nCreate enduring relationships with both colleagues and clients","torrent":{"xt":"urn:btih:a2cae4fd445d2e51ac316d4ff3f8c277ddb2a350","amp;dn":"Anthony+Robbins+-+Mastering+Influence","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2cae4fd445d2e51ac316d4ff3f8c277ddb2a350","infoHashBuffer":{"type":"Buffer","data":[162,202,228,253,68,93,46,81,172,49,109,79,243,248,194,119,221,178,163,80]},"announce":[],"urlList":[]}}