{"title":"Mortadelo Y Filemon -Coleccion completa [pdf]","uid":6442094,"size":2618583971,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a342ac2ae4aaf0ef4e2dca3c7a6ed0e96af7835f&amp;dn=Mortadelo+Y+Filemon+-Coleccion+completa+%5Bpdf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":1,"uploader":"furtaperas","files":-1,"time":1307008644,"description":"Mortadelo y FilemÃƒÂ³n es una serie de historieta humorÃƒÂ­stica creada y desarrollada por el autor espaÃƒÂ±ol Francisco IbÃƒÂ¡ÃƒÂ±ez a partir de 1958, la mÃƒÂ¡s popular de las suyas, y probablemente de todo el medio en EspaÃƒÂ±a. Adscrita habitualmente a la escuela Bruguera, ha gozado ademÃƒÂ¡s de multitud de adaptaciones a otros medios.\n\nSituaciones recurrentes:\n\n* A Mortadelo y FilemÃƒÂ³n siempre se les asignan las misiones mÃƒÂ¡s peligrosas, por lo que tratan de evadirse de las formas mÃƒÂ¡s singulares, aunque siempre son atrapados por otros agentes (muchas veces son capturados en otros paÃƒÂ­ses o incluso en otros planetas).\n* Mortadelo siempre suele meter la pata y por su culpa FilemÃƒÂ³n se lleva todos los golpes (en ocasiones reciben los dos).\n* FilemÃƒÂ³n suele montar en cÃƒÂ³lera con Mortadelo y lo persigue con algÃƒÂºn tipo de arma u objeto arrojadizo mientras Mortadelo escapa disfrazado, normalmente de animal (insecto, reptil, ave, gato, etc.).\n* Mortadelo siempre estÃƒÂ¡ a la gresca con Bacterio, pues aÃƒÂºn le guarda rencor por su Ã‚Â«remedio a la calvicieÃ‚Â», causa de la calvicie de Mortadelo.\n* El SÃƒÂºper normalmente suele recibir golpes por culpa de las desastrosas actuaciones de Mortadelo y FilemÃƒÂ³n.\n* El SÃƒÂºper trata de un modo despÃƒÂ³tico a sus agentes.\n* Ofelia se intenta poner guapa y coqueta, pero Mortadelo y FilemÃƒÂ³n acaban estropeÃƒÂ¡ndole el dÃƒÂ­a.\n* Ofelia anda detrÃƒÂ¡s de Mortadelo, tirÃƒÂ¡ndole los tejos y soÃƒÂ±ando en ser correspondida.\n* Bacterio suele fracasar en sus inventos, obteniendo como resultado cosas inesperadas (en ocasiones justo lo contrario para lo que fue creado el invento). A veces, el invento funciona exactamente como se esperaba pero lo hace en situaciones delicadas para Mortadelo y FilemÃƒÂ³n, los cuales acaban sufriendo la inoportunidad.\n* El SÃƒÂºper suele perseguir a Mortadelo y FilemÃƒÂ³n cuando ÃƒÂ©stos fracasan en una misiÃƒÂ³n, cuando se mofan de ÃƒÂ©l o cuando le ignoran al explicarles los detalles de una misiÃƒÂ³n.\n* Mortadelo y FilemÃƒÂ³n siempre huyen cuando El SÃƒÂºper les quiere hacer probar un invento del profesor Bacterio.\n* A FilemÃƒÂ³n no le gusta que Mortadelo se estÃƒÂ© probando disfraces a todas horas.\n* Bacterio suele probar cada uno de sus nuevos inventos para la salud e ÃƒÂ­ndole personal entre alguno de los miembros de la empresa, como trabajadoras, secretarias (Ofelia en mayor medida) y otros agentes, con funestos resultados.\n* Mortadelo y FilemÃƒÂ³n intentan ligar con Irma sin mucho ÃƒÂ©xito.\n* En las primeras historietas cortas, FilemÃƒÂ³n estÃƒÂ¡ siempre gritando y dando ÃƒÂ³rdenes a Mortadelo.\n* FilemÃƒÂ³n aparenta en principio ser mÃƒÂ¡s inteligente, serio y responsable que Mortadelo, cosa que suele sacar de quicio a este ÃƒÂºltimo.\n* Las siglas de las agencias criminales siempre forman palabras como A.B.U.E.L.A. o S.O.B.R.I.N.A.\n* La T.I.A. tiene entradas secretas en los mÃƒÂ¡s recÃƒÂ³nditos lugares, como pueda ser una simple seÃƒÂ±al de trÃƒÂ¡fico o un cartel publicitario de un circo, hasta el cÃƒÂ­rculo del sol que se ve desde la Tierra, pero sÃƒÂ³lo los agentes saben cÃƒÂ³mo entrar, siendo trampas para el resto de viandantes.\n* Como la mayorÃƒÂ­a de las aventuras termina en desastre, cuando no hay persecuciÃƒÂ³n suele verse a Mortadelo y FilemÃƒÂ³n huyendo por los lugares mÃƒÂ¡s inhÃƒÂ³spitos y remotos del planeta (el desierto de Gobi, el del Sahara, los altos del GolÃƒÂ¡n, las islas Columbretes, la isla de Pascua, la AntÃƒÂ¡rtida, etc.) mientras a su lado, un diario da cuenta del desaguisado de turno, al tiempo que advierte que el SÃƒÂºper estÃƒÂ¡ buscando a la pareja por un lugar completamente distinto. Variantes de este final puede verse con Mortadelo leyendo el periÃƒÂ³dico o escuchando un parte radiofÃƒÂ³nico.\n* Mortadelo y FilemÃƒÂ³n suelen atrapar a los malos porque ellos creyendo que es gente normal le dan un golpe sin querer (a veces se llevan el mÃƒÂ©rito otros agentes).\n* Cuando Bacterio prueba un invento con alguien acaba habiendo huida, persecucciÃƒÂ³n, pelea o muerte (esta ÃƒÂºltima de quien lo ha probado).","torrent":{"xt":"urn:btih:a342ac2ae4aaf0ef4e2dca3c7a6ed0e96af7835f","amp;dn":"Mortadelo+Y+Filemon+-Coleccion+completa+%5Bpdf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a342ac2ae4aaf0ef4e2dca3c7a6ed0e96af7835f","infoHashBuffer":{"type":"Buffer","data":[163,66,172,42,228,170,240,239,78,45,202,60,122,110,208,233,106,247,131,95]},"announce":[],"urlList":[]}}