{"title":"NMAP Network Scanning - Gordon Fyodor Lyon (Clearn OCR)","uid":8742019,"size":57630335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a35a91091d55a9ab2c9e37dd10f472e91cf5ca32&amp;dn=NMAP+Network+Scanning+-+Gordon+Fyodor+Lyon+%28Clearn+OCR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"burashka","files":1,"time":1374813957,"description":"Nmap Network Scanning is the official guide to the Nmap Security Scanner, a free and open source utility used by millions of people for network discovery, administration, and security auditing. From explaining port scanning basics for novices to detailing low-level packet crafting methods used by advanced hackers, this book suits all levels of security and networking professionals. A 42-page reference guide documents every Nmap feature and option, while the rest of the book demonstrates how to apply those features to quickly solve real-world tasks. Examples and diagrams show actual communication on the wire.\nTopics include subverting firewalls and intrusion detection systems, optimizing Nmap performance, and automating common networking tasks with the Nmap Scripting Engine. Hints and instructions are provided for common uses such as taking network inventory, penetration testing, detecting rogue wireless access points, and quashing network worm outbreaks. Nmap runs on Windows, Linux, and Mac OS X.\n\nNmap's original author, Gordon &quot;Fyodor&quot; Lyon, wrote this book to share everything he has learned about network scanning during more than 11 years of Nmap development. Visit http://nmap.org/book for more information and sample chapters.","torrent":{"xt":"urn:btih:a35a91091d55a9ab2c9e37dd10f472e91cf5ca32","amp;dn":"NMAP+Network+Scanning+-+Gordon+Fyodor+Lyon+%28Clearn+OCR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a35a91091d55a9ab2c9e37dd10f472e91cf5ca32","infoHashBuffer":{"type":"Buffer","data":[163,90,145,9,29,85,169,171,44,158,55,221,16,244,114,233,28,245,202,50]},"announce":[],"urlList":[]}}