{"title":"Ico [Multi] [Pal/Ntsc] [PS2 DVD]","uid":4389747,"size":701768852,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:a3b8d99410a3fa6c90be0de96132f736232ade53&amp;dn=Ico+%5BMulti%5D+%5BPal%2FNtsc%5D+%5BPS2+DVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"Big_dude","files":-1,"time":1221105171,"description":"-------------Ico For the Sony PS2               Released Sept. 24, 2001------------\n\n\nFormat: DVD Pal 50hz &amp; Ntsc 60hz selector (Game will flicker select language then pal(50hz)or ntsc(60hz) and flickering will stop.)\n\nFor english just press x on the first startup screen, then choose pal-left or \nntsc-right for your pal or ntsc ps2 console. You'll know when you choose the right\none cause the screen will stop rolling.\n\nLang.:         Multi - English included\nDiscs:         1        \nImage:         ISO\nRequirements:  Modded/Chipped ps2, or Swap Magic disc method.\n\n(You could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.)\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n     &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n     &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n    &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n    &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nYou will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Try Verbatim DVD+R (Booktype to DVD-ROM), or Tayio Yuden, burn at 8x if its a 16x max. You really can't use Maxell DVD+R for example or some other brand as it more than likely will not work.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Try Swap Magic to load the game.\n\n\nCompressed with Winrar.\n\n\nNote -- There are several working versions of this game already on the pirate bay, but I wanted to upload mine. \n\nThis game is the dvd version not cd (not usa version), But has pal/ntsc selector and english language too so you can still play it. Game was Tested &amp; works, Burn as you would with any other ps2 game, Use DVD Decrypter.\n\n\n\nGame Description:\n\nIco....Within a world of enchantment and wonder, evil resides in an ancient castle. Ico, a young boy born with horns, has been expelled from his village and left within this isolated fortress. Embarking on a perilous quest to save himself as well as a beautiful princess, Ico must find a way to escape. However, escaping will be no easy task. Every towering staircase and stone block is a piece of a puzzle. Every open window, dangling chain and razor thin escape illuminates another mystery.  \n\n\nThis Game is also listed in ps2's top rated best games list by many website's on the internet.\n\n\ngame pics included.\n\n\nany problems with it post a comment.\n\n\n\nDon't forget to seed this.\n\n\n\nEnjoy!\n\n\nYou guys and anyone else downloading this need to seed don't just leech, I can't seed all the time.","torrent":{"xt":"urn:btih:a3b8d99410a3fa6c90be0de96132f736232ade53","amp;dn":"Ico+%5BMulti%5D+%5BPal%2FNtsc%5D+%5BPS2+DVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3b8d99410a3fa6c90be0de96132f736232ade53","infoHashBuffer":{"type":"Buffer","data":[163,184,217,148,16,163,250,108,144,190,13,233,97,50,247,54,35,42,222,83]},"announce":[],"urlList":[]}}