{"title":"[FSX] Aerosim 787","uid":7807058,"size":140189495,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a4afe004dce02150e1f413c9e57a4f70df699d4b&amp;dn=%5BFSX%5D+Aerosim+787&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"aarque","files":-1,"time":1352429783,"description":"\nThe Boeing 787, aka, Dreamliner is a mid-sized, wide-body, twin-engines jetliner\ndeveloped by the Boeing. About half of the primary structure including the fuselage\nand wing are constructed with the composite materials. The composite materials\nmade it possible for the Boeing to bring the most advanced jetliner in terms of\necology to the world'a major airlines. Included in this FSX add-on package is\n2 variants of Boeing 787-8, the one with RR ENG and another GE ENG.\nEach variant has two liveries, Boeing and AeroSim. In the cockpit, you'll find the\nHUD (Head Up Display) in front of you. You'll see the terrain map on the ND,\nwhen you press the TERR button on EFIS. FMS of B787 for FSX works with the\nflight plan generated by the FSX flightplanner. LNAV commands the aircraft to\nfollow the flight plan route, and VNAV is capable of displaying the location of\nT/C and T/D on the ND.\n\nAnother unique feature that comes with the B787 for FSX is the Electrochromic\nWindow System in the virtual cabin. The windows do not have conventional shade.\nInstead, the passenger can regulate the intensity of light coming through the\nwindow by using the mouse on the windows. In the cabin of real life, the passenger\nuses the button at below the window. \n\nAnother share from flightboy, I don't know where he gets this awesome stuff but let's just be grateful and keep these shares going! You can always click on my name for more great add ons, almost all of my stuff still has seeders.","torrent":{"xt":"urn:btih:a4afe004dce02150e1f413c9e57a4f70df699d4b","amp;dn":"%5BFSX%5D+Aerosim+787","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4afe004dce02150e1f413c9e57a4f70df699d4b","infoHashBuffer":{"type":"Buffer","data":[164,175,224,4,220,224,33,80,225,244,19,201,229,122,79,112,223,105,157,75]},"announce":[],"urlList":[]}}