{"title":"Ben Howard...Every Kingdom(Deluxe)(2011)[FLAC]","uid":6848226,"size":501082324,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a9895d82a2070ee32446caeee6a4e3fdfaefe24c&amp;dn=Ben+Howard...Every+Kingdom%28Deluxe%29%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":0,"uploader":"dickspic","files":22,"time":1322424379,"description":"[img]http://image.allmusic.com/00/amg/cov200/drq300/q365/q36538ad0q8.jpg[/img]\n\n[color=Green]Every Kingdom [2011] Island Records / Deluxe Edition[/color] \n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n01. Old Pine \n02. Diamonds \n03. The Wolves \n04. Everything \n05. Only Love \n06. The Fear \n07. Keep Your Head Up \n08. Black Flies \n09. Gracious \n10. Promise \n\nDeluxe Edition Bonus CD\n01. These Waters \n02. Empty Corridors (Live) \n03. Under The Same Sun \n04. Bones \n05. I Will Be Blessed \n06. Move Like You Want (Live)\n\nRisking arriving a little too late to the party, Devon-born 23-year-old Ben Howard is yet another young troubadour whose sound appears indebted to the '70s pastoral folk of John Martyn and Nick Drake. His debut album, Every Kingdom, therefore, has its work cut out for it from the offset if it's to make itself heard above similar recent efforts by the likes of Marcus Foster and Benjamin Francis Leftwich. But it's clear from the opening track, &quot;Old Pine,&quot; a slow-burning epic that begins with some hushed choral harmonies before building into a strident slice of nu-folk, that this is a more intriguing affair. Indeed, considering that much of the album features nothing more than Howard's intricate fingerpicking guitar skills with the occasional flourishes of cello and percussion, it's remarkable that it's only toward the closing minimal acoustic balladry of &quot;Gracious&quot; and &quot;Promise&quot; that the evocative autumnal vibes begin to lose their appeal. That's partly down to Howard's versatile and intense vocals, which manage to capture the understatement of JosÃƒÂ© GonzÃƒÂ¡lez, the gruffness of Ray LaMontagne, and the soulfulness of James Morrison, without ever sounding like a tribute act, and partly down to the inventiveness displayed throughout its ten tracks, whether it's the military beats, sea shanty melodies, and howling wolf calls on &quot;The Wolves,&quot; the burst of grandiose post-rock that interrupts the somber breakup song &quot;Black Flies,&quot; or the buoyant campfire singalong of &quot;The Fear.&quot; It's not clear whether Howard's stripped-back approach will cross over to the mainstream, as other than &quot;Keep Your Head Up,&quot; a slightly more energetic rebel-rousing slice of folk-pop that found its way onto the Radio 1 playlist, its charms are more slow-burning than immediate. But it's an impressively timeless debut that suggests Howard should have no problem standing out from the overpopulated nu-folk crowd.\n\ncd ripped by someone who received his cd before me,actually i'm still waiting for mine.\n\nplease seed\n\n[url]http://dickthespic.org/about/[/url]","torrent":{"xt":"urn:btih:a9895d82a2070ee32446caeee6a4e3fdfaefe24c","amp;dn":"Ben+Howard...Every+Kingdom%28Deluxe%29%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9895d82a2070ee32446caeee6a4e3fdfaefe24c","infoHashBuffer":{"type":"Buffer","data":[169,137,93,130,162,7,14,227,36,70,202,238,230,164,227,253,250,239,226,76]},"announce":[],"urlList":[]}}