{"title":"ASTM Standards (2004)","uid":4621704,"size":1791524672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a99f293b48c1593fc11e0f7cfdae7bb36c832a9d&amp;dn=ASTM+Standards+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":36,"leechers":2,"uploader":"wmzz","files":2,"time":1231063778,"description":"ASTM International is one of the largest voluntary standards development organizations in the world-a trusted source for technical standards for materials, products, systems, and services. Known for their high technical quality and market relevancy, ASTM International standards have an important role in the information infrastructure that guides design, manufacturing and trade in the global economy.\nASTM International, originally known as the American Society for Testing and Materials (ASTM), was formed over a century ago, when a forward-thinking group of engineers and scientists got together to address frequent rail breaks in the burgeoning railroad industry. Their work led to standardization on the steel used in rail construction, ultimately improving railroad safety for the public. As the century progressed and new industrial, governmental and environmental developments created new standardization requirements, ASTM answered the call with consensus standards that have made products and services safer, better and more cost-effective. The proud tradition and forward vision that started in 1898 is still the hallmark of ASTM International.\nToday, ASTM continues to play a leadership role in addressing the standardization needs of the global marketplace. Known for its best in class practices for standards development and delivery, ASTM is at the forefront in the use of innovative technology to help its members do standards development work, while also increasing the accessibility of ASTM International standards to the world.\nASTM continues to be the standards forum of choice of a diverse range of industries that come together under the ASTM umbrella to solve standardization challenges. In recent years, stakeholders involved in issues ranging from safety in recreational aviation, to fiber optic cable installations in underground utilities, to homeland security, have come together under ASTM to set consensus standards for their industries.\nStandards developed at ASTM are the work of over 30,000 ASTM members. These technical experts represent producers, users, consumers, government and academia from over 120 countries. Participation in ASTM International is open to all with a material interest, anywhere in the world\n\n    Section 01 - Iron and Steel Products\n   \n    Section 02 - Nonferrous Metal Products\n   \n    Section 03 - Metals Test Methods and Analytical Procedures\n   \n    Section 04 - Construction\n   \n    Section 05 - Petroleum Products, Lubricants, and Fossil Fuels\n   \n    Section 06 - Paints, Related Coatings, and Aromatics\n   \n    Section 07 - Textiles\n\n    Section 08 - Plastics\n   \n    Section 09 - Rubber\n   \n    Section 10 - Electrical Insulation and Electronics\n   \n    Section 11 - Water and Environmental Technology\n   \n    Section 12 - Nuclear, Solar, and Geothermal Energy\n   \n    Section 13 - Medical Devices and Services\n   \n    Section 14 - General Methods and Instrumentation\n   \n    Section 15 - General Products, Chemical Specialties, and End Use Products","torrent":{"xt":"urn:btih:a99f293b48c1593fc11e0f7cfdae7bb36c832a9d","amp;dn":"ASTM+Standards+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a99f293b48c1593fc11e0f7cfdae7bb36c832a9d","infoHashBuffer":{"type":"Buffer","data":[169,159,41,59,72,193,89,63,193,30,15,124,253,174,123,179,108,131,42,157]},"announce":[],"urlList":[]}}