{"title":"Plato - Philosophical Works (36 books)","uid":10152770,"size":336426448,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9b734a5f3de4dfdf8e64c57a51ed73d53bfbd3d&amp;dn=Plato+-+Philosophical+Works+%2836+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":2,"uploader":"workerbee","files":-1,"time":1400115598,"description":"\nPLATO (ca. 424 - 347 BCE) was a philosopher, as well as mathematician, in ancient Greece.  He was a student of Socrates and founded the Academy in Athens, the first institution of higher learning in the Western world.  Along with Socrates and his most-famous student, Aristotle, Plato was one of the shapers of the whole intellectual tradition of the West.  Alfred North Whitehead once noted that &quot;the safest general characterization of the European philosophical tradition is that it consists of a series of footnotes to Plato.&quot;\n\n\nThe following books are in PDF format unless otherwise noted:\n\n* THE BEING OF THE BEAUTIFUL: Plato's Theaetetus, Sophist, and Statesman (University of Chicago Press, 1984).  Translated with Commentary by Seth Benardete.\n\n* CLITOPHON (Cambridge University Press, 1999).  Edited with Introduction, Translation and Commentary by S. R. Slings.\n\n* FIVE DIALOGUES: Euthyphro, Apology, Crito, Meno, Phaedo (Hackett, 2002).  Second edition.  Translated by G.M.A. Grube, revised by John M. Cooper.\n\n* GORGIAS (Penguin Classics, 2004).  Revised edition.  Translated by Walter Hamilton and Chris Emlyn-Jones, with an Introduction, Commentary and Notes by Chris Emlyn-Jones.\n\n* ION, HIPPIAS MINOR, LACHES &amp; PROTAGORAS [The Dialogues of Plato, Vol. 3] (Yale University Press, 1996).  Translated with Comment by R. E. Allen.\n\n* THE LAST DAYS OF SOCRATES: Euthyphro, Apology, Crito, Phaedo (Penguin Classics, 2010).  Translated with Introduction and Notes by Christopher Rowe. -- ePUB + MOBI\n\n* THE LAWS (Penguin Classics, 2004).  Translated with an Introduction and Notes by Trevor J. Saunders. -- ePUB + MOBI\n\n* THE LAWS OF PLATO (University of Chicago Press, 1988).  Translated with Notes and an Interpretive Essay by Thomas L. Pangle.\n\n* MENO &amp; OTHER DIALOGUES (Oxford World's Classics, 2005).  Translated with an Introduction and Notes by Robin Waterfield.\n\n* PARMENIDES [The Dialogues of Plato, Vol. 4] (Yale University Press, 1997).  Revised edition.  Translated with Comment by R. E. Allen.\n\n* PARMENIDES (University of California Press, 2003).  Translated with Introduction and Commentary by Samuel Scolnicov.\n\n* PHAEDO (Oxford University Press, 1975).  Translated with Notes by David Gallop.\n\n* PHAEDRUS (Cambridge University Press, 1952).  Translated with an Introduction and Commentary by R. Hackforth.\n\n* PHAEDRUS (Oxford World's Classics, 2002).  Translated with an Introduction and Notes by Robin Waterfield.\n\n* PHILEBUS (Oxford University Press, 1975).  Translated with Notes and Commentary by J. C. B. Gosling.\n\n* PLATO &amp; PARMENIDES: Parmenides &quot;Way of Truth&quot; and Plato's &quot;Parmenides&quot; (Kegan Paul, 1939).  Translated with an Introduction and a running Commentary by Francis M. Cornford.\n\n* PLATO'S COSMOLOGY: The Timaeus of Plato (Hackett, 1997).  Translated with running Commentary by Francis M. Cornford.\n\n* PLATO'S EXAMINATION OF PLEASURE: A Translation of the Philebus (Cambridge University Press, 1945).  Translated with Introduction and Commentary by R. Hackforth.\n\n* PLATO'S THEORY OF KNOWLEDGE: The Theaetetus and The Sophist of Plato (Kegan Paul, 1935).  Translated with running Commentary by Francis M. Cornford.\n\n* THE PORTABLE PLATO (Penguin, 1977).  Edited with an Introduction by Scott Buchanan. -- ePUB + MOBI\n\n* PROTAGORAS: Translation, Commentary, and Appendices (Rowman &amp; Littlefield, 2010).  Translated and edited by James A. Arieti and Roger M. Barrus.\n\n* PROTAGORAS (Oxford University Press, 1991).  Revised edition.  Translated with Notes by C. C. W. Taylor.\n\n* READINGS IN ANCIENT GREEK PHILOSOPHY: From Thales to Aristotle (Hackett, 2011).  Fourth edition.  Edited by S. Marc Cohen, Patricia Curd, and C. D. C. Reeve.\n\n* THE REPUBLIC (Barnes &amp; Noble Classics, 2005).  Translated by Benjamin Jowett, with an Introduction and Notes by Elizabeth Watson Scharffenberger. -- ePUB + MOBI\n \n* THE REPUBLIC OF PLATO (Basic Books, 1991).  Second edition.  Translated with Notes, Interpretive Essay, and a new Introduction by Allan Bloom. -- PDF + ePUB + MOBI\n\n* THE REPUBLIC (Cambridge University Press, 2000).  Edited by G. R. F. Ferrari and translated by Tom Griffith.\n\n* THE REPUBLIC: The Complete and Unabridged Jowett Translation (Vintage Classics, 1991).  Translated by Benjamin Jowett. -- ePUB + MOBI\n\n* THE REPUBLIC (Hackett, 2004).  Translated from the New Standard Greek Text, with Introduction, by C. D. C. Reeve.\n\n* SELECTED MYTHS (Oxford World's Classics, 2004).  Edited by Catalin Partenie.\n\n* THE SYMPOSIUM (Cambridge University Press, 2008).  Edited by M. C. Howatson and Frisbee C. C. Sheffield; translated by M. C. Howatson.\n\n* THE SYMPOSIUM (Oxford World's Classics, 1994).  Translated with an Introduction and Notes by Robin Waterfield. -- ePUB + MOBI\n\n* THEAETETUS (Oxford University Press, 1973).  Translated with Notes by John McDowell. -- ePUB + MOBI\n\n* THEAETETUS (Penguin Classics, 2004).  Translated with an Essay by Robin Waterfield. -- ePUB + MOBI\n\n* TIMAEUS &amp; CRITIAS (Oxford World's Classics, 2008).  Translated by Robin Waterfield, with an Introduction and Notes by Andrew Gregory.\n\n* THE TRIAL AND DEATH OF SOCRATES: Euthyphro, Apology, Crito, and Death scene from Phaedo (Hackett, 2000).  Third edition.  Translated by G.M.A. Grube, revised by John M. Cooper. -- ePUB + MOBI\n\n* THE TRIALS OF SOCRATES: Six Classic Texts (Hackett, 2002).  Edited and Translated by C. D. C. Reeve.\n\n\nPlease note: John M. Cooper's edition of Plato's &quot;Complete Works&quot; (Hackett, 1997) can be found here:\nPDF - &lt;a href=&quot; http://thepiratebay.se/torrent/8224241/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/8224241/&lt;/a&gt; \nePUB + MOBI - &lt;a href=&quot; http://thepiratebay.se/torrent/8666621/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/8666621/&lt;/a&gt; \n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                   &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:a9b734a5f3de4dfdf8e64c57a51ed73d53bfbd3d","amp;dn":"Plato+-+Philosophical+Works+%2836+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9b734a5f3de4dfdf8e64c57a51ed73d53bfbd3d","infoHashBuffer":{"type":"Buffer","data":[169,183,52,165,243,222,77,253,248,230,76,87,165,30,215,61,83,191,189,61]},"announce":[],"urlList":[]}}