{"title":"Louis: The French Prince Who Invaded England","uid":15890717,"size":3967050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9ff27e1f1ca7384959c8e238ed31f952103352e&amp;dn=Louis%3A+The+French+Prince+Who+Invaded+England&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":3,"uploader":"marty14","files":1,"time":1474737241,"description":"Louis: The French Prince Who Invaded England - Catherine Hanley [epub]\r\n\r\nIn 1215 a group of English barons, dissatisfied with the weak and despicable King John, decided that they needed a new monarch. They wanted a strong, experienced man, of royal blood, and they found him on the other side of the Channel: astonishingly, the most attractive candidate for the crown of England was Louis, eldest son and heir of the king of France.\r\n\r\nIn this fascinating biography of England's least-known &quot;king&quot; - and the first to be written in English - Catherine Hanley explores the life and times of &quot;Louis the Lion&quot; before, during, and beyond his quest for the English throne. She illuminates the national and international context of his 1216 invasion, and explains why and how after sixteen fruitless months he failed to make himself King Louis I of England. Hanley also explores Louis's subsequent reign over France until his untimely death on the Albigensian Crusade.\r\n\r\nPublished eight centuries after the creation of Magna Carta and on the 800th anniversary of Louis's proclamation as king, this fascinating story is a colorful tale of national culture, power, and politics that brings a long-forgotten life out of the shadows of history","torrent":{"xt":"urn:btih:a9ff27e1f1ca7384959c8e238ed31f952103352e","amp;dn":"Louis%3A+The+French+Prince+Who+Invaded+England","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9ff27e1f1ca7384959c8e238ed31f952103352e","infoHashBuffer":{"type":"Buffer","data":[169,255,39,225,241,202,115,132,149,156,142,35,142,211,31,149,33,3,53,46]},"announce":[],"urlList":[]}}