{"title":"Finding Atlantis: A True Story of Genius, Madness, and ...","uid":15836733,"size":1564336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa15bfdf9a51fb5ce77b8a51c673ec61acc8da7c&amp;dn=Finding+Atlantis%3A+A+True+Story+of+Genius%2C+Madness%2C+and+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"marty14","files":1,"time":1473983012,"description":"Finding Atlantis: A True Story of Genius, Madness, and an Extraordinary Quest for a Lost World - David King [epub]\r\n\r\nFew lives are as sadly instructive as that of the dreamer who, by reaching for the stars, falls crashing to earth. Such is the tale of a 17th-century Swedish polymath and gifted eccentric, Olof Rudbeck. Univeristy of Kentucky historian King relates how Rudbeck, trained in his youth as physician (he discovered the lymphatic glands), mastered fields as diverse as architecture, botany, shipbuilding, etymology, musical composition and mythology, among others. It was an ancient Norse saga that set him on the path to what he believed would lead to his greatest triumph.\r\n\r\nEnchanted by circumstantial evidence and supported by his own breathtakingly inventive archeological and etymological research, Rudbeck in 1679 astonished his Uppsala University colleagues with the announcement that he had discovered Atlantis—in Old Uppsala. Fiercely disputatious and uncompromising when it came to his own genius, Rudbeck had previously poisonously offended many influential colleagues; his work was ridiculed and he died in obscurity. King is marvelous at elaborating Rudbeck's theories and his heroic defense against charges of forgery and &quot;foul-ugly fraud.&quot; One wishes, however, that King had dealt definitely with the forgery charges. His trust in his own subject despite the evidence is honorable but perhaps misplaced. Still, King tells his tale with the pace and appeal of a classic whodunit","torrent":{"xt":"urn:btih:aa15bfdf9a51fb5ce77b8a51c673ec61acc8da7c","amp;dn":"Finding+Atlantis%3A+A+True+Story+of+Genius%2C+Madness%2C+and+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa15bfdf9a51fb5ce77b8a51c673ec61acc8da7c","infoHashBuffer":{"type":"Buffer","data":[170,21,191,223,154,81,251,92,231,123,138,81,198,115,236,97,172,200,218,124]},"announce":[],"urlList":[]}}