{"title":"Topgrl--Pain Guinea Pig  Paintoy Emma  London River High","uid":16005253,"size":3115301844,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:aa3fcdfbdd642dcb5383b7e8b80bd69f584fc83e&amp;dn=Topgrl--Pain+Guinea+Pig++Paintoy+Emma++London+River+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":11,"uploader":"merzedes","files":1,"time":1476172287,"description":"Pain Guinea Pig | Paintoy Emma | London River\r\n\r\nOctober 4, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nClothespin Covered Cow Gets Lashes \r\n \r\nThere's always been a lot of conflict between generations. Usually older women complain about younger women wearing too little or not having proper manners. Tonight, however, those rolls are reversed as London River teaches Paintoy Emma a lesson on manners. She has her in her dungeon, tied up and helpless in a skimpy tight dress. London cuts away the dress and frees Emma's body so that she can have easier access to it.\r\n\r\nShe ties Emma down to a box so she is bent backwards. London thinks it would be fun to use the zipper on her so she clips a line of clothespins all down her stomach and onto her pussy and connects them with a string. Then she adds a clamp on Emma's tongue just to add insult to injury and rips the chord and all the little clips off. Emma's body is bright red with the marks, but not as red as it turns after London turns her over and starts beating her ass. First she just uses the flogger, but then the cane comes out, and if Emma thinks that this is hard on her, she has no idea what awaits.\r\n\r\nLondon decides she wants to play a game with Emma, or rather that she wants to turn Emma into her game board. She stands her up and clips clothespins all over the front and sides of her body. Then it's time for some target practice. London takes out her whip and sends lashes flying at each and every one of the clothespins, trying to hit them hard enough to knock them off one by one. The clips on Emma's nipples seem to lake the longest and hurt the worst, since the area is so soft and sensitive. But pain is all this little slut wants anyway, so London is going to teach her a sense of decency. \r\n \r\nScreens \nhttp://www.topgrl.com/female/bondage/trailer.php?y=2016&amp;p=10_04pemma3&amp;u=TopGrl-Paintoy-Emma-London-River-Pain-Guinea-Pig\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:aa3fcdfbdd642dcb5383b7e8b80bd69f584fc83e","amp;dn":"Topgrl--Pain+Guinea+Pig++Paintoy+Emma++London+River+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa3fcdfbdd642dcb5383b7e8b80bd69f584fc83e","infoHashBuffer":{"type":"Buffer","data":[170,63,205,251,221,100,45,203,83,131,183,232,184,11,214,159,88,79,200,62]},"announce":[],"urlList":[]}}