{"title":"God's Bankers: A History of Money and Power at the Vatican","uid":15848042,"size":5674838,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aadeab6d524a31d57b509ad5a268fb611792a51e&amp;dn=God%27s+Bankers%3A+A+History+of+Money+and+Power+at+the+Vatican&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":0,"uploader":"marty14","files":1,"time":1474129389,"description":"God's Bankers: A History of Money and Power at the Vatican - Gerald Posner [epub]\r\n\r\nFrom a master chronicler of legal and financial misconduct, a magnificent investigation nine years in the making, this book traces the political intrigue and inner workings of the Catholic Church. Decidedly not about faith, belief in God, or religious doctrine, this book is about the church’s accumulation of wealth and its byzantine entanglements with financial markets across the world. Told through 200 years of prelates, bishops, cardinals, and the Popes who oversee it all, Gerald Posner uncovers an eyebrow-raising account of money and power in perhaps the most influential organization in the history of the world.\r\n\r\nGod’s Bankers has it all: a rare exposé and an astounding saga marked by poisoned business titans, murdered prosecutors, mysterious deaths of private investigators, and questionable suicides; a carnival of characters from Popes and cardinals, financiers and mobsters, kings and prime ministers; and a set of moral and political circumstances that clarify not only the church’s aims and ambitions, but reflect the larger dilemmas of the world’s more recent history.\r\n\r\nAnd Posner even looks to the future to surmise if Pope Francis can succeed where all his predecessors failed: to overcome the resistance to change in the Vatican’s Machiavellian inner court and to rein in the excesses of its seemingly uncontrollable financial quagmire. Part thriller, part financial tell-all, this book shows with extraordinary precision how the Vatican has evolved from a foundation of faith to a corporation of extreme wealth and power","torrent":{"xt":"urn:btih:aadeab6d524a31d57b509ad5a268fb611792a51e","amp;dn":"God%27s+Bankers%3A+A+History+of+Money+and+Power+at+the+Vatican","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aadeab6d524a31d57b509ad5a268fb611792a51e","infoHashBuffer":{"type":"Buffer","data":[170,222,171,109,82,74,49,213,123,80,154,213,162,104,251,97,23,146,165,30]},"announce":[],"urlList":[]}}