{"title":"Money: The Unauthorized Biography","uid":15854551,"size":4055545,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aafd35fd25a97d827f33a22593042dab2edcf191&amp;dn=Money%3A+The+Unauthorized+Biography&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"marty14","files":1,"time":1474225798,"description":"Money: The Unauthorized Biography - Felix Martin [epub]\r\n\r\nDoes money really need to be explained? Apparently it does, as economist Martin challenges the conventional theory that money emerged from the barter system. Offering a broad historical perspective, Martin begins with the pre-money society of The Iliad and The Odyssey. When the numeracy, literacy, and accounting concepts of ancient Mesopotamia met with the Greek concept of universal social value, the components of money took shape. He traces uncanny similarities in ancient and modern history of monetary maneuvers and crises and how citizens have created quasi currency — IOUs, checks, vouchers — in reaction to government stumbles in Ireland, Argentina, and Russia.\r\n\r\nMartin details how the great merchant houses of Europe developed the banking system we currently know. Tapping philosophers and economists, including Plato, Locke, Marx, Bagehot, Keynes, and Greenspan, Martin clearly explains why, even though it seems arcane, it’s important to understand the theory behind money, its origins, and how it has operated through the ages. This is economics written with sharp pacing and often amusing perspectives, raising mundane considerations of supply and demand to philosophical discussions of the meaning of value","torrent":{"xt":"urn:btih:aafd35fd25a97d827f33a22593042dab2edcf191","amp;dn":"Money%3A+The+Unauthorized+Biography","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aafd35fd25a97d827f33a22593042dab2edcf191","infoHashBuffer":{"type":"Buffer","data":[170,253,53,253,37,169,125,130,127,51,162,37,147,4,45,171,46,220,241,145]},"announce":[],"urlList":[]}}