{"title":"The War on Cops (2016) (Pdf) Gooner","uid":15927448,"size":2813913,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab0e0026b9fd2375123ad1a84a461ae1407b4f7a&amp;dn=The+War+on+Cops+%282016%29+%28Pdf%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":2,"uploader":"GoonerTPB","files":2,"time":1475323222,"description":"The War on Cops - How the New Attack on Law and Order Makes Everyone Less Safe (2016) (Pdf) Gooner\r\n\r\nPublisher: Encounter Books,USA (5 July 2016)\r\nLanguage: English\r\nISBN-10: 1594038759\r\nISBN-13: 978-1594038754\r\n\r\nViolent crime has been rising sharply in many American cities after two decades of decline. Homicides jumped nearly 17 percent in 2015 in the largest 50 cities, the biggest one-year increase since 1993. The reason is what Heather Mac Donald first identified nationally as the Ferguson effect: Since the 2014 police shooting death of Michael Brown in Ferguson, Missouri, officers have been backing off of proactive policing, and criminals are becoming emboldened. \r\n\r\nThis book expands on Mac Donald's groundbreaking and controversial reporting on the Ferguson effect and the criminal-justice system. It deconstructs the central narrative of the Black Lives Matter movement: that racist cops are the greatest threat to young black males. On the contrary, it is criminals and gangbangers who are responsible for the high black homicide death rate. \r\n\r\nThe War on Cops exposes the truth about officer use of force and explodes the conceit of mass incarceration. A rigorous analysis of data shows that crime, not race, drives police actions and prison rates. The growth of proactive policing in the 1990s, along with lengthened sentences for violent crime, saved thousands of minority lives. In fact, Mac Donald argues, no government agency is more dedicated to the proposition that black lives matter than today s data-driven, accountable police department. \r\n\r\nMac Donald gives voice to the many residents of high-crime neighborhoods who want proactive policing. She warns that race-based attacks on the criminal-justice system, from the White House on down, are eroding the authority of law and putting lives at risk. This book is a call for a more honest and informed debate about policing, crime, and race","torrent":{"xt":"urn:btih:ab0e0026b9fd2375123ad1a84a461ae1407b4f7a","amp;dn":"The+War+on+Cops+%282016%29+%28Pdf%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab0e0026b9fd2375123ad1a84a461ae1407b4f7a","infoHashBuffer":{"type":"Buffer","data":[171,14,0,38,185,253,35,117,18,58,209,168,74,70,26,225,64,123,79,122]},"announce":[],"urlList":[]}}