{"title":"Miyamoto Musashi - The Book of Five Rings - Audio Book","uid":11808326,"size":153233867,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ab17c8e2e814e9c858c52a9707ed5311c101f6eb&amp;dn=Miyamoto+Musashi+-+The+Book+of+Five+Rings+-+Audio+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":1,"uploader":"Big-Papi","files":61,"time":1428686150,"description":"[quote]By A. L. Boyle \n\nThe book appears at first to be written simply; it stated the obvious. Written at a time when perhaps things were simpler.\n\nThis is NOT a book to read in one sitting, though you easily could.\n\nRead just a bit, then put it down and walk away. Allow what you have read to be mulled over in your mind.\n\nThe book is really complex. It contains secrets to living every day, for dealing with everyone you encounter no matter what their state of mind is. It contains secrets about how to do business.\n\nThe title is a translation. Like English, words can have multiple meanings. What is translated into the word &quot;ring&quot; can also be translated into &quot;spheres&quot; which I think is a more appropriate translation. The sphere is the most perfect thing in the universe. Beginning at a point and drawing the ring/sphere/circle you will get to a point where the line begins again upon itself. This is a key to understanding the book.\n\nCleverly written, it holds the knowledge to live at peace with the universe.\n\nAn excellent read and mental workout.[/quote]\n\n[i]The Book of Five Rings is one of the most insightful texts on the subtle arts of confrontation and victory to emerge from Asian culture. Written not only for martial artists but for anyone who wants to apply the timeless principles of this text to their life, the book analyzes the process of struggle and mastery over conflict that underlies every level of human interaction.\n\nThe Book of Five Rings was composed in 1643 by the famed duelist and undefeated samurai Miyamoto Musashi. Thomas Cleary's translation is immediately accessible, with an introduction that presents the spiritual background of the warrior tradition. Along with Musashi's text, Cleary translates here another important Japanese classic on leadership and strategy, The Book of Family Traditions on the Art of War by Yagyu Munenori, which highlights the ethical and spiritual insights of Taoism and Zen as they apply to the way of the warrior.[/i]","torrent":{"xt":"urn:btih:ab17c8e2e814e9c858c52a9707ed5311c101f6eb","amp;dn":"Miyamoto+Musashi+-+The+Book+of+Five+Rings+-+Audio+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab17c8e2e814e9c858c52a9707ed5311c101f6eb","infoHashBuffer":{"type":"Buffer","data":[171,23,200,226,232,20,233,200,88,197,42,151,7,237,83,17,193,1,246,235]},"announce":[],"urlList":[]}}