{"title":"sygic 13.2.S Navigation for Android (World Wide) Cracked!!","uid":9210304,"size":133120676,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:ab279f554c81119ab46a4072d7b2c4a7d2749e46&amp;dn=sygic+13.2.S+Navigation+for+Android+%28World+Wide%29+Cracked%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":1,"uploader":"cloudsss","files":-1,"time":1384772844,"description":"sygic 13.2.2 GPS Navigation for Android (World Wide) Cracked!!\n\nSecurity Type: Condom\n\nFirst, make sure you do not have any sygic files on your phone by uninstalling \nany versions of sygic and deleting any sygic files from your phone and sd card.\n\nNow, unrar the file on your computer, you will get 5 Files inside the rar.\n\n\n1 Sygic folder\n1 sgcmapdownloader.txt\n1 sgcmapdownloader12.exe\n1 Sygic_13.2.2.apk\n1 Instructions\n\nNow run the map downloader which is sgcmapdownloader12.exe, a window will pop up allowing\nyou to choose maps from Europe, Africa, Asia, North America, Middle East etc...\n\n\nOf course, if you live in Europe for example, you don't need to download all Europe,\njust double click on Europe, and choose your country!!\n\n\nNow, in Sygic folder, you have by default American and UK English voice guidance\n(male and female), but if you are from Norway for example or Egypt, and you want \nthe voice of your language, double click on voices and choose the language you want.\n\n\nSave the maps downloaded and the voices on the desktop for now!\n\n\nNow double click the Sygic folder on your computer and open it, go to maps, open it\nand past the maps you have downloaded earlier.\n\n\nNow make sure that you rename the maps you have downloaded before you past them in\nthe maps folder in Sygic.\n\n\nfor example, if you downloaded maps of Oman, the name will look like this: omn.ta.2013.03\nYou need to delete all the numbers and the dot, so the name will be omn.ta\n\n\nThen you can transfer it to your Sygic folder maps.\n\n\nNow to put the voices you have downloaded, go to Sygic folder on your desktop, then \nRes folder, then find voices folder and past your folder there.\n\nYou are almost Done!\n\nConnect your Android device to the computer, copy the Sygic_13.2.2.apk from your \ncomputer and past it in your device or the SD card on your device.\n\n\nLocate the apk file in your android by using ES File Explorer or any other file manager.\n\n\nInstall the apk file, when finished click DONE! Don't open Sygic yet!!\n\nNow go to your computer and copy the folder Sygic and past it in your Android or SD card.\n\n\nDisconnect your device. Finished!!\n\n\nNow when you go to mySygic inside the application, you will find Buy Sygic!!\n\n\nIt doesn't work actually meaning, if the 7ay trial is finished, it will not ask\nyou to buy or delete your app or anything.\n\n\nIt's 100% working and tested! VIRUS FREE!!\n\n\nPlease keep seeding as long as possible to keep this torrent a live!!\n\nSharing is caring !!\n\n\nVisit: www.arab-torrents.net\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:ab279f554c81119ab46a4072d7b2c4a7d2749e46","amp;dn":"sygic+13.2.S+Navigation+for+Android+%28World+Wide%29+Cracked%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab279f554c81119ab46a4072d7b2c4a7d2749e46","infoHashBuffer":{"type":"Buffer","data":[171,39,159,85,76,129,17,154,180,106,64,114,215,178,196,167,210,116,158,70]},"announce":[],"urlList":[]}}