{"title":"Empire of Mud: The Secret History of Washington DC","uid":15836718,"size":13554731,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab6ec1fd345715842d13fced5b519b76aa0af5ea&amp;dn=Empire+of+Mud%3A+The+Secret+History+of+Washington+DC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"marty14","files":1,"time":1473982495,"description":"Empire of Mud: The Secret History of Washington, DC - J.D. Dickey [epub]\r\n\r\nWashington, DC, gleams with stately columns and neoclassical temples, a pulsing hub of political power and prowess. But for decades it was one of the worst excuses for a capital city the world had ever seen. Before America became a world power in the twentieth century, Washington City was an eyesore at best and a disgrace at worst. Unfilled swamps, filthy canals, and rutted horse trails littered its landscape. Political bosses hired hooligans and thugs to conduct the nation's affairs. Legendary madams entertained clients from all stations of society and politicians of every party. The police served and protected with the aid of bribes and protection money.\r\n\r\nBeneath pestilential air, the city’s muddy roads led to a stumpy, half-finished obelisk to Washington here, a domeless Capitol Building there. Lining the streets stood boarding houses, tanneries, and slums. Deadly horse races gouged dusty streets, and opposing factions of volunteer firefighters battled one another like violent gangs rather than life-saving heroes.\r\n\r\nThe city’s turbulent history set a precedent for the dishonesty, corruption, and mismanagement that have led generations to look suspiciously on the various sin--both real and imagined--of Washington politicians. Empire of Mud unearths and untangles the roots of our capital’s story and explores how the city was tainted from the outset, nearly stifled from becoming the proud citadel of the republic that George Washington and Pierre L'Enfant envisioned more than two centuries ago","torrent":{"xt":"urn:btih:ab6ec1fd345715842d13fced5b519b76aa0af5ea","amp;dn":"Empire+of+Mud%3A+The+Secret+History+of+Washington+DC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab6ec1fd345715842d13fced5b519b76aa0af5ea","infoHashBuffer":{"type":"Buffer","data":[171,110,193,253,52,87,21,132,45,19,252,237,91,81,155,118,170,10,245,234]},"announce":[],"urlList":[]}}