{"title":"Building Construction Illustrated, 5E- Ching [PDF] [StormRG]","uid":11258807,"size":41154216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aba179dd6c98c9cff245466ba074c258fc4e043e&amp;dn=Building+Construction+Illustrated%2C+5E-+Ching+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":1,"uploader":"steelballz","files":-1,"time":1413935438,"description":"Description\nBuilding Construction Illustrated\nAuthor: Ching, Francis D. K.\nPublished:Feb. 17 2014\nPublisher: Wiley; 5 edition\nISBN: 1118458346\nFormat: Retail PDF\n\nPM IF YOU NEED HELP WITH THE TORRENT :)\n\nimage\n\n\nDESCRIPTION\nThe classic visual guide to the basics of building construction, now with a 3D digital building model for interactive learning\n\nFor over three decades, Building Construction Illustrated has offered an outstanding introduction to the principles of building construction. This new edition of the revered classic remains as relevant as ever, providing the latest information in Francis D.K. Ching's signature style. Its rich and comprehensive approach clearly presents all of the basic concepts underlying building construction.\n\nNew to this edition are digital enhancements delivered as an online companion to the print edition and also embedded in e-book editions. Features include a 3D model showing how building components come together in a final project.\n\nllustrated throughout with clear and accurate drawings that present the state of the art in construction processes and materials\nUpdated and revised to include the latest knowledge on sustainability, incorporation of building systems, and use of new materials\nContains archetypal drawings that offer clear inspiration for designers and drafters\nReflects the 2012 International Building Codes and 2012 LEED system\n\nThis new edition of Building Construction Illustrated remains as relevant as ever, with the most current knowledge presented in a rich and comprehensive manner that does not disappoint","torrent":{"xt":"urn:btih:aba179dd6c98c9cff245466ba074c258fc4e043e","amp;dn":"Building+Construction+Illustrated%2C+5E-+Ching+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aba179dd6c98c9cff245466ba074c258fc4e043e","infoHashBuffer":{"type":"Buffer","data":[171,161,121,221,108,152,201,207,242,69,70,107,160,116,194,88,252,78,4,62]},"announce":[],"urlList":[]}}