{"title":"Pines - Blake Crouch","uid":7825740,"size":1083607,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac1fa7216945253e51fe75a09ca06cadd62e8d9b&amp;dn=Pines+-+Blake+Crouch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":3,"uploader":"acidr0p","files":4,"time":1352922826,"description":"Epub and Mobi format\n\nSecret service agent Ethan Burke arrives in Wayward Pines, Idaho, with a clear mission: locate and recover two federal agents who went missing in the bucolic town one month earlier. But within minutes of his arrival, Ethan is involved in a violent accident. He comes to in a hospital, with no ID, no cell phone, and no briefcase. The medical staff seems friendly enough, but something feels?off. As the days pass, Ethan's investigation into the disappearance of his colleagues turns up more questions than answers. \n\nWhy can't he get any phone calls through to his wife and son in the outside world? Why doesn't anyone believe he is who he says he is? And what is the purpose of the electrified fences surrounding the town? Are they meant to keep the residents in? Or something else out? Each step closer to the truth takes Ethan further from the world he thought he knew, from the man he thought he was, until he must face a horrifying fact ? he may never get out of Wayward Pines alive. Intense and gripping, Pines is another masterful thriller from the mind of bestselling novelist Blake Crouch.","torrent":{"xt":"urn:btih:ac1fa7216945253e51fe75a09ca06cadd62e8d9b","amp;dn":"Pines+-+Blake+Crouch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac1fa7216945253e51fe75a09ca06cadd62e8d9b","infoHashBuffer":{"type":"Buffer","data":[172,31,167,33,105,69,37,62,81,254,117,160,156,160,108,173,214,46,141,155]},"announce":[],"urlList":[]}}