{"title":"7 Days To Die -  Alpha - 32 bit","uid":8823048,"size":314550453,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ac4f21781a80254eadc2193aae31ae695da2b9e5&amp;dn=7+Days+To+Die+-++Alpha+-+32+bit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":2,"uploader":"AN0NYMOUS142857","files":-1,"time":1376753055,"description":"This is an early release of the game which is still in Alpha testing that means it didn't go into Beta testing yet.Expect to find bugs.But still the game is playable and you can get an idea about it. It had 32 bit on the title. As far as i know 32 bit programs are compatible with 64 bit.\n\nInstructions:\n\n1. Extract\n2. Install using the setup\n3. Move the file in the crack folder to 7DaysToDie_DataManaged folder\n4. Play\n\n--------------\n\n7 Days to Die is an open world, voxel-based, sandbox game that is a unique mash up of First Person Shooter, Survival Horror, Tower Defense and Role Playing Games combining combat, crafting, looting, mining, exploration, and character growth.\n\nIn the near future where the a third world war leaves the Earth in ruins but the worst was yet to come. Nobody knows for sure if it was the radiation, the biochemical weapons or an act of god but an unknown virus soon transforms the surviving humans into an army of the animated dead, acting as a single-minded being.\n\nYou play a survivor trapped in the savage zombie infested world of Navezgane County Arizona one of the last true Eden's on Earth. Ironically Navezgane means Killer of Monsters to the Apache who have inhabited the land for centuries, and that's pretty much what you'll do as you fight to survive and search for the truth behind what really happened.\n\n\n","torrent":{"xt":"urn:btih:ac4f21781a80254eadc2193aae31ae695da2b9e5","amp;dn":"7+Days+To+Die+-++Alpha+-+32+bit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac4f21781a80254eadc2193aae31ae695da2b9e5","infoHashBuffer":{"type":"Buffer","data":[172,79,33,120,26,128,37,78,173,194,25,58,174,49,174,105,93,162,185,229]},"announce":[],"urlList":[]}}