{"title":"Star Wars Jedi Knight Jedi Academy (GOG)","uid":11860733,"size":1340240543,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:acaa23acdc5f886c20be2d3f89fb17551d36b17f&amp;dn=Star+Wars+Jedi+Knight+Jedi+Academy+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":36,"leechers":4,"uploader":"pacolovac","files":2,"time":1430260114,"description":"== About the game:\nAs a new student of Luke Skywalker's Jedi Academy, follow an ancient tradition and learn the powers - and dangers - of the Forceâ„¢.\nAs a Dark Jedi Cult knows as the Disciples of Ragnos threaten the galaxy, Jaden Korr, a student of Luke Skywalker's Jedi Academy must learn the ways of the jedi in order to defend it. On the path to becoming a Jedi Master Jaden must fight through various missions taking place accross the galaxy, from Hoth to Tattoine. Upon each victory, Jaden's powers grow until eventually becoming an apprentive to Kyle Katarn, and must fight the temptation of turning to the dark side.\nInteract with famous classic Star Warsâ„¢ locations and characters while facing the ultimate choice: fight for good and freedom in the light side or follow the path of power and evil to the dark side. Create your own characters by defining various characteristics, such as species, gender, clothing and physical attributes allowing for a more personal experience before entering the academy to learn the powers - and dangers - of the Forceâ„¢. Construct your own lightsaberâ„¢ from handle to blade color. Unique tiered level selection allows you to choose you adventure and the missions you take based on the skills you need to become the ultimate Jedi Knight.\n\n\n== Features:\nConstruct custom lightsabresâ„¢\nCustomize characters before enrolling in the academy\nSix multiplayer modes including team based siege mode and two-on-one power duel\n23 multiplayer arenas\n\n\n== Version:\nFirst GOG release, or GOG setup 2.0.0.4, from Apr 28 2015. \n\n\n== Instructions:\nIt's a GOG version, just launch setup\nClick options to chose location and accept EULA, install \nPlay - Enjoy - Seed - give me what I need\nSpeed! Yeah!\n\n\n== System Requirements:\nMinimum:\nProcessor: Intel Pentium 4 1.8 Ghz or AMD Athlon 1.8 GHz\nGraphics:128 MB with Hardware T&amp;L DirectXÂ®: Directx 9.0b or better \nMemory: 1 GB RAM\nWindows XP / Vista / 7 / 8 \n3.5 GB hard disk space\n\n \n If you enjoyed the game then share with others by seeding!\nSupport game development and buy the game!\n\nGame developed by \nRaven Software and published by Lucas Arts","torrent":{"xt":"urn:btih:acaa23acdc5f886c20be2d3f89fb17551d36b17f","amp;dn":"Star+Wars+Jedi+Knight+Jedi+Academy+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acaa23acdc5f886c20be2d3f89fb17551d36b17f","infoHashBuffer":{"type":"Buffer","data":[172,170,35,172,220,95,136,108,32,190,45,63,137,251,23,85,29,54,177,127]},"announce":[],"urlList":[]}}