{"title":"ES File Explorer PRO v1.0.7 Apk-XpoZ","uid":15381069,"size":7423383,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:acd8affdf880307118bbc7d866c31f4ae735d2f3&amp;dn=ES+File+Explorer+PRO+v1.0.7+Apk-XpoZ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":3,"uploader":"meXpoZ","files":5,"time":1469228751,"description":"ES File Explorer PRO v1.0.7+Material Theme Apk-XpoZ\r\n     \r\n\r\n  | Category: Productivity |   | Requires :Android 2.2 and up |\r\n\r\n\r\nWith ES, you can access your FTP server, Wi-Fi file transfer, Bluetooth file transfer and connect your chromecast device easily.\r\n\r\n\r\n\r\nWhat is in this version :    \r\n       \r\n- Fixed unsafe implementation\r\n\r\n\r\n\r\nApp Review:\r\n\r\nES File Explorer (File Manager) PRO version will continue to provide you high quality and good service as always\r\nWith ES File Explorer (File Manager) PRO version you can:\r\n&gt;Remove Ad an Ad free version\r\n&gt;More to customize updated color panel and more start page options\r\n&gt;More to expect ES File Explorer (File Manager) team will keep improving the app and strive to keep it the #1 most powerful file manager for android.\r\n&gt;more theme options Following Google material design and more theme options coming soon\r\nWith ES, you can access your FTP server, Wi-Fi file transfer, Bluetooth file transfer and connect your chromecast device easily.\r\n\r\nHighlights of ES File Explorer (File Manager) PRO:\r\n&gt; File Manager: Easily list any kind of file, libraries for all Music, Picture, and Video files. Connect file on PC, Mac, Linux Server, Phone, Tablet, Clouds\r\n&gt; File Transfer: Transfer file from PC to Mobile, Mobile to Mobile, Mobile to PC\r\n&gt; Cloud Management: ES supports Dropbox, Box.net, Sugarsync, Google Drive, OneDrive-SkyDrive, Amazon S3, Yandex and many other clouds platforms.\r\n&gt; SD card analyst: with ES you can analyze your SD card usage and manage files as needed according to the results\r\n\r\n\r\nFeatures and Benefits of ES File Explorer (File Manager):\r\n&gt;File Manager: Access to your Phone SD card, External SD card and Phone Internal Storage, Manage your files just like you do on your desktop or laptop using Multiple Select, Cut/Copy/Paste, Move, Create, Delete, Rename, Search, Share, Send, Hide, Create Shortcut, and Bookmark\r\n&gt;App Manager: Categorize, uninstall, back up, create shortcuts to your apps and delete APK files\r\n&gt;Remote File Manager: When this feature is enabled, you can manage files on your phone from your PC, tablet, Mac, Linux Server\r\n&gt;Archive manager: Allows you to compress and decompress ZIP files, unpack RAR files, 7z files, and create encrypted (AES 256 bit) ZIP files\r\n&gt;Built-in viewers and players for various file types: Including photos, music, and videos; supports third-party applications such as Quick Office for efficient and better productivity\r\n&gt;Shows thumbnails: For APKs and images\r\n&gt;Text viewers and editors\r\n&gt;Access your home PC: Through your smartphone via WiFi with SMB\r\n&gt;Functions as an FTP and WebDAV client: Manage files on FTP, FTPS, SFTP, and WebDAV servers just like you manage files on your SD card\r\n&gt;Bluetooth file browser: You can copy and paste files between Bluetooth-\r\n\r\nES Material Theme for Pro v2.0.3\r\n\r\nIf you like the function of ES File Explorer Pro but the default theme of ES File Explorer V4.0, this theme is for you.\r\nMaterial Design Theme provides Android 5.0 user interface style, and don't worry it is available for all users whose Android version is above 2.2.\r\n\r\n\r\nES File Explorer Pro users can install it and activate it from &quot;Theme&quot;.\r\n\r\n\r\nHigh Quality Movies in Ultra compressed size\r\n\r\n\r\nwithout loss in Quality.\r\n\r\n&amp;&amp;&amp;\r\n\r\nFull Android Games &amp; App.\r\n\r\n\r\nXpoZ.Torrent\r\n\r\n\r\n\r\nPlz seed Back &amp; keep alive this torrent.\r\n\r\nIf You Need Seeder any of My torrent, Let me Know.\r\n\r\nI'm always there for Seeding.\r\n\r\nAnd Also If You Liked My Torrent, Plsz Don't Forget to Left FeedBack and Comment.\r\n\r\nMore Uploads &amp; For FeedBack Me","torrent":{"xt":"urn:btih:acd8affdf880307118bbc7d866c31f4ae735d2f3","amp;dn":"ES+File+Explorer+PRO+v1.0.7+Apk-XpoZ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acd8affdf880307118bbc7d866c31f4ae735d2f3","infoHashBuffer":{"type":"Buffer","data":[172,216,175,253,248,128,48,113,24,187,199,216,102,195,31,74,231,53,210,243]},"announce":[],"urlList":[]}}