{"title":"Gerhart Hauptmann - Nobel Prize in Literature, 1912 (21 books)","uid":15945350,"size":85612868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad0d14362fd082e8e61fd1cdf59f0a3a8fd76717&amp;dn=Gerhart+Hauptmann+-+Nobel+Prize+in+Literature%2C+1912+%2821+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":4,"uploader":"workerbee","files":27,"time":1475502675,"description":"GERHART HAUPTMANN (1862-1946) was a German dramatist and novelist who is counted among the most important promoters of literary naturalism, though he integrated other styles into his work as well.  He received the 1912 Nobel Prize in Literature &quot;primarily in recognition of his fruitful, varied and outstanding production in the realm of dramatic art.&quot;\n\nHauptmann was the most prominent German dramatist of the early 20th century.  His first play, BEFORE DAYBREAK (1889) made him famous overnight.  This starkly realistic tragedy, dealing with contemporary social problems, shocked the theatregoing public and inaugurated the naturalistic movement in modern German literature.  Encouraged by the controversy, Hauptmann wrote in rapid succession a number of dramas on naturalistic themes such as heredity, the plight of the poor, and the clash of personal needs with societal restrictions.  Most gripping, as well as most objectionable to the political authorities at the time of its publication, was THE WEAVERS (1892), a compassionate dramatization of the Silesian weavers' revolt of 1844.\n\nTHE COMING OF PEACE (1890) offered an analysis of the troubled relations within a neurotic family, while LONELY LIVES (1891) described the tragic end of an unhappy intellectual torn between his wife and a young woman (patterned after Lou Andreas-Salomé) with whom he can share his thoughts.  THE BEAVER COAT (1893) was a successful comedy, written in a Berlin dialect, that centres on a cunning female thief and her successful confrontation with pompous, stupid Prussian officials.  Hauptmann returned to his treatment of proletarian tragedy with DRAYMAN HENSCHEL (1898), a claustrophobic study of a workman's personal deterioration from the stresses of his domestic life.\n\nHauptmann's stories, novels, and epic poems were as varied as his dramatic works and were often thematically interwoven with them.  The novel THE FOOL IN CHRIST, EMANUEL QUINT (1910) depicts, in a modern parallel to the life of Christ, the passion of a Silesian carpenter's son, possessed by pietistic ecstasy.  A contrasted figure is the apostate priest in his most famous story, THE HERETIC OF SOANA (1918), who surrenders himself to a pagan cult of Eros.\n\nThe unifying element of his vast and varied literary output was his sympathetic concern for human suffering, as expressed through characters who are generally passive victims of social and other elementary forces.  Fun fact: Thomas Mann adapted some of Hauptmann's personal traits for the character Mynheer Peeperkorn in his novel &quot;The Magic Mountain&quot;. \n\n\nThe following books are in PDF format:\n\n\n                                   == PLAYS ==\n\n* And Pippa Dances (Poet Lore, Autumn 1907).  Translated by Mary Harned.\n\n* Before Daybreak (North Carolina UP, 1978).  Translated by Peter Bauland.\n\n* Coming of Peace, The (Sergel, 1900).  Translated by Janet Achurch and C. E. Wheeler.\n\n* Dramatic Works of Gerhart Hauptmann (Huebsch, 1912-17).  7 volumes.  Edited by Ludwig Lewisohn.\n\n* Five Plays [The Weavers / Rose Bernd / Drayman Henschel / The Beaver Coat / Hannele] (Bantam Classics, 1961).  Translated by Theodore H. Lustig, with an Introduction by John Gassner.\n\n* Lonely Lives (Heinemann, 1912).  Translated by Mary Morison.\n\n* Sunken Bell, The (Doubleday, 1908).  Translated by Charles Henry Meltzer.\n\n* Three Plays [The Weavers / Hannele / The Beaver Coat] (Waveland, 1991).    Translated by Horst Frenz and Miles Waggoner.\n\n* Weavers, The (Chandler, 1965).  Translated by Carl Richard Mueller, with an Introduction by William Melnitz.\n\n\n                                   == NOVELS ==\n\n* Atlantis (Huebsch, 1912).  Translated by Adele and Thomas Seltzer.\n\n* Fool in Christ, Emanuel Quint (Huebsch, 1911).  Translated by Thomas Seltzer.\n\n* Heretic of Soana, The (Calder, 1960).  Translated by Bayard Quincy Morgan.\n\n* Parsival (Macmillan, 1915).  Translated by Oakley Williams.\n\n* Phantom (Huebsch, 1922).  Translated by Bayard Quincy Morgan.\n\n\n                                    == OTHER ==\n\n* Nobel Prize Library: Gerhart Hauptmann (Nobel Foundation, 1971).  Various translators.  Includes Hauptmann's Nobel Acceptance Speech and translations of &quot;The Weavers&quot; and &quot;The Heretic of Soana&quot;.\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n \nhttps://pirates-forum.org/User-workerbee  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:ad0d14362fd082e8e61fd1cdf59f0a3a8fd76717","amp;dn":"Gerhart+Hauptmann+-+Nobel+Prize+in+Literature%2C+1912+%2821+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad0d14362fd082e8e61fd1cdf59f0a3a8fd76717","infoHashBuffer":{"type":"Buffer","data":[173,13,20,54,47,208,130,232,230,31,209,205,245,159,10,58,143,215,103,23]},"announce":[],"urlList":[]}}