{"title":"The Memoirs of Hitler’s Bodyguard by Rochus Misch","uid":16033403,"size":8194054,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad1d25ccf60445b66e3665ce096f0083bbcc5207&amp;dn=The+Memoirs+of+Hitler%26rsquo%3Bs+Bodyguard+by+Rochus+Misch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":2,"uploader":"marty14","files":1,"time":1476451623,"description":"Hitler’s Last Witness: The Memoirs of Hitler’s Bodyguard - Rochus Misch [epub]\r\n\r\nAfter being seriously wounded in the 1939 Polish campaign, Rochus Misch was invited to join Hitler's SS-bodyguard. There he served until the war’s end as Hitler’s bodyguard, courier, orderly and finally as Chief of Communications. \r\n\r\nOn the Berghof terrace he watched Eva Braun organize parties; observed Heinrich Himmler and Albert Speer; and monitored telephone conversations from Berlin to the East Prussian FHQ on 20 July 1944 after the attempt on Hitler's life. Towards the end Misch was drawn into the Führerbunker with the last of the faithful. As defeat approached, he remained in charge of the bunker switchboard as his duty required, even after Hitler committed suicide.\r\n\r\nMisch knew Hitler as the private man and his position was one of unconditional loyalty. His memoirs offer an intimate view of life in close attendance to Hitler and of the endless hours deep inside the bunker; and provide new insights into military events such as Hitler’s initial feelings that the 6th Army should pull out of Stalingrad","torrent":{"xt":"urn:btih:ad1d25ccf60445b66e3665ce096f0083bbcc5207","amp;dn":"The+Memoirs+of+Hitler%26rsquo%3Bs+Bodyguard+by+Rochus+Misch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad1d25ccf60445b66e3665ce096f0083bbcc5207","infoHashBuffer":{"type":"Buffer","data":[173,29,37,204,246,4,69,182,110,54,101,206,9,111,0,131,187,204,82,7]},"announce":[],"urlList":[]}}