{"title":"THE COMEBACK 2005 FULL SEASON LISA KUDROW","uid":6559796,"size":3179398712,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ad4506c7564c58b27f704b673de78555a4aec4ae&amp;dn=THE+COMEBACK+2005+FULL+SEASON+LISA+KUDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":6,"uploader":"mdprosser","files":13,"time":1311379382,"description":"The Comeback is a television series produced by HBO that stars actress Lisa Kudrow as sitcom actress Valerie Cherish in modern-day Los Angeles, California. It was created by Kudrow and Michael Patrick King, a former executive producer of Sex and the City. Kudrow and King were also screenwriters and executive producers of the series, with King also serving as the director of some episodes. The series premiered on HBO on June 5, 2005 and aired for a single season.\n\nThe show, a comedy, was shot by a two-camera crew, in the style of reality television. Viewers of The Comeback are actually watching raw footage shot for the fictional reality show within The Comeback, also called The Comeback.\n\nThe series' episode titles (excluding the pilot) begin with the main character's first name Valerie... followed the theme of the episode as the main character would have named them, e.g. Valerie Triumphs at the Upfronts.\n\nDespite a coveted time slot after the hit series Entourage, The Comeback debuted to low ratings and a mixed critical response; despite this, it was nominated for three Primetime Emmy Awards including Outstanding Lead Actress in a Comedy Series for Kudrow. HBO confirmed on September 21, 2005 that the series was officially canceled after only being on the air for thirteen weeks.\n\nThe show placed #79 on Entertainment Weekly's &quot;New TV Classics&quot; list. In 2009, the publication named The Comeback one of the ten best shows of the decade, calling it &quot;the most brilliantly brutal satire of reality TV ever captured on screen.&quot; [1]","torrent":{"xt":"urn:btih:ad4506c7564c58b27f704b673de78555a4aec4ae","amp;dn":"THE+COMEBACK+2005+FULL+SEASON+LISA+KUDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad4506c7564c58b27f704b673de78555a4aec4ae","infoHashBuffer":{"type":"Buffer","data":[173,69,6,199,86,76,88,178,127,112,75,103,61,231,133,85,164,174,196,174]},"announce":[],"urlList":[]}}