{"title":"Maxprog eMail Verifier v3.6.2 Multilingual with Key [TorDigger]","uid":8040908,"size":2935019,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:adb9987c7299866d5b873a28d6661c05807947bc&amp;dn=Maxprog+eMail+Verifier+v3.6.2+Multilingual+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":"TorDigger","files":10,"time":1358626605,"description":"Maxprog eMail Verifier\n\nSave time and money maintaining clean mailing lists and checking the validity of recipient's e-mails addresses...\n\neMail Verifier can save time and money for businesses who send newsletters to their clients, nonprofit organizations who send bulletins to their members, or any person or business that needs to maintain a clean e-mail contact list.\n\neMail Verifier works on the same algorithm as ISP mail systems do. Addresses for email are extracted from a Domain Naming Server (DNS) and eMail Verifier tries to connect with SMTP-servers and simulates the sending of a message. It does not send the message though - eMail Verifier disconnects as soon as the mail server informs the program whether the address exists or not.\n\neMail Verifier is your powerful solution for the standard &quot;message delivery error.&quot; Email Verifier verifies every e-mail address from a given mailing list, allowing you to determine 70-80% of &quot;dead&quot; email addresses.\n\neMail Verifier is a very effective piece of software that can verify over 10 e-mails per second . It can verify single e-mails or huge lists. eMail Verifier is multithreaded, providing high speed verifying.\n\nKey Features\n\nDetects and use your language if available:\t\nPossibility to verify both single email addresses and lists.\nValidates each email address simulating a direct message delivery.\nPossibility to balance domain lookup load between 2 DNS servers.\nEmail addresses are verified individually using a set of 80 built-in rules.\nSupport for Enhanced Mail System Status Codes.\nReports detailed information about each test including DNS lookup.\nFast multi-threaded engine.\nCustomizable export function - you can save original data or test results.\nComplete connection log, overall information and statistics.\n\nSupported OS:\n\nWindows vista/xp/7\n\nHomepage: http://www.maxprog.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register program with given Key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:adb9987c7299866d5b873a28d6661c05807947bc","amp;dn":"Maxprog+eMail+Verifier+v3.6.2+Multilingual+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adb9987c7299866d5b873a28d6661c05807947bc","infoHashBuffer":{"type":"Buffer","data":[173,185,152,124,114,153,134,109,91,135,58,40,214,102,28,5,128,121,71,188]},"announce":[],"urlList":[]}}