{"title":"Top Gear   (BBC - Seasons 1 to 17 - Complete)","uid":6739923,"size":76532343799,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:adbcfaa5f080b14130b0c3c0c6186520d57b7f63&amp;dn=Top+Gear+++%28BBC+-+Seasons+1+to+17+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":46,"uploader":"neil1966hardy","files":141,"time":1318458653,"description":"Top Gear - Seasons 1 - 17 \n\nTop Gear is a British television series about motor vehicles, primarily cars. It began in 1977 as a conventional motoring magazine show. Over time, and especially since a relaunch in 2002, it has developed a quirky, humorous style. The show is currently presented by Jeremy Clarkson, Richard Hammond and James May, and has featured at least three different test drivers known as The Stig. The programme is estimated to have around 350 million viewers per week in 170 different countries and is heavily downloaded from peer-to-peer file-sharing services, with roughly 300,000 downloads per episode via torrent programs. First run episodes are broadcast in the United Kingdom on BBC Two, and since Series 14, also on BBC HD. Seventeen series have been broadcast, and the seventeenth series started on 26 June 2011.\n\nThe show has received acclaim for its visual style and presentation, as well as criticism for its content and comments made by presenters. Columnist A. A. Gill, close friend of Clarkson and fellow Sunday Times columnist, described the show as &quot;a triumph of the craft of programme making, of the minute, obsessive, musical masonry of editing, the French polishing of colourwashing and grading&quot;. British comedian and guest of the show Steve Coogan has criticised the show, accusing it of lazy, adolescent humour and &quot;casual racism&quot;.\n\nList of all episodes is here: http://en.wikipedia.org/wiki/List_of_Top_Gear_episodes\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:adbcfaa5f080b14130b0c3c0c6186520d57b7f63","amp;dn":"Top+Gear+++%28BBC+-+Seasons+1+to+17+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adbcfaa5f080b14130b0c3c0c6186520d57b7f63","infoHashBuffer":{"type":"Buffer","data":[173,188,250,165,240,128,177,65,48,176,195,192,198,24,101,32,213,123,127,99]},"announce":[],"urlList":[]}}