{"title":"Google SketchUp Pro 2014 v14.0.4900 (2-click run)(Registered)","uid":9684929,"size":69797812,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ae134177b727ad9d1bb7aa88f8410a65e0e9d8c9&amp;dn=Google+SketchUp+Pro+2014+v14.0.4900+%282-click+run%29%28Registered%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1393746091,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a 'Easy Run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDESCRIPTION:\nSketchUp is an impressive tool for 3D design developed by Google. You may use the application to redecorate your house, create new furniture or even better create a project of the perfect house of your dreams. The best of all is that you can learn how to use this great tool in no time, all thanks to the variety of included video tutorials.\n\nSketchUp provides you with a simple and intuitive interface to start designing your first three-dimensional shapes. It brings a diversity of tools you can use to build different 3D models such as great buildings, monuments, offices, houses, vehicles and about anything you can imagine.\n\nSome of the features in this version lets you access the power of Google geolocation resources. Geopositioning with Google Maps is integrated and precise 3D images and colours, also from space, are obtained. The function to adapt one or more photographs to design a model is also improved, as well as modelling 3D buildings.\n\nThe application lets you export your buildings and designs to formats such as TIFF, JPG, PNG and BMP. Once you have created something use the Google Warehouse to upload your designs so that everyone can see them on the web.\n\nInstallation instructions:\n1. Execute the .exe file.\n2. Follow the instructions.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:ae134177b727ad9d1bb7aa88f8410a65e0e9d8c9","amp;dn":"Google+SketchUp+Pro+2014+v14.0.4900+%282-click+run%29%28Registered%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae134177b727ad9d1bb7aa88f8410a65e0e9d8c9","infoHashBuffer":{"type":"Buffer","data":[174,19,65,119,183,39,173,157,27,183,170,136,248,65,10,101,224,233,216,201]},"announce":[],"urlList":[]}}