{"title":"Frightlopedia (2016) (Pdf) Gooner","uid":15947769,"size":30802925,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aed2835a912197cbcaabea8514328f98e023cb3c&amp;dn=Frightlopedia+%282016%29+%28Pdf%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":6,"uploader":"GoonerTPB","files":2,"time":1475532210,"description":"Frightlopedia - An Encyclopedia of Everything Scary, Creepy and Spine-Chilling, from Arachnids to Zombies (2016) (Pdf) Gooner\r\n\r\nPublisher: Workman Publishing (13 Sept. 2016)\r\nLanguage: English\r\nISBN-10: 0761183795\r\nISBN-13: 978-0761183792\r\n\r\nIt's one-stop shopping for everything scary: a survey of over 50 of the world's most gruesome places, creatures, and scary stories, organised like an encyclopedia - from &quot;arachnids&quot; to &quot;Zombies&quot; and written just for kids. It blends nonfiction (How do you say &quot;boo&quot; in other languages? Can a person actually be scared to death?) with fiction (stories of creepy monsters from around the world), and hands-on activities (from applying zombie makeup to creating your own ghost stories). Take a tour of Borneo's Gomantong Cave where bats, cockroaches, spiders, and rats live together in the millions among the pitch black. Or enter into the Beauregard-Keyes House in New Orleans where Civil War soldiers still do battle in the front hall. Discover the origins of mythical horrors straight out of your nightmares like the Mongolian Death Worm and The Bell Witch, as well as creatures we only wish were fiction like killer bees, the deadly insects created by scientists in a failed lab experiment in 1950. Identify plants like the Machineel of Southern Florida and Central America, a tropical tree covered in succulent looking fruit full of deadly, mouth burning, throat swelling poison. Read and share ghost stories from around the globe that will make you and your friends jump. Plus DIY activities: Create your own haunting; brew up a batch of fake blood; hold you own seance","torrent":{"xt":"urn:btih:aed2835a912197cbcaabea8514328f98e023cb3c","amp;dn":"Frightlopedia+%282016%29+%28Pdf%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aed2835a912197cbcaabea8514328f98e023cb3c","infoHashBuffer":{"type":"Buffer","data":[174,210,131,90,145,33,151,203,202,171,234,133,20,50,143,152,224,35,203,60]},"announce":[],"urlList":[]}}