{"title":"Marvel Comics -  Infinity Sagas (Guantlet, War, Crusade, Abyss &amp;","uid":3729183,"size":480492968,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:af9450050bbae108a983640ec06ab1c32c71ddc5&amp;dn=Marvel+Comics+-++Infinity+Sagas+%28Guantlet%2C+War%2C+Crusade%2C+Abyss+%26&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":2,"uploader":"sbm_from_la","files":33,"time":1183250455,"description":"The Infinity Sagas (Complete)\n \n * The Thanos Quest (1990)\n * The Infinity Guantlet (1991)\n * The Infinity War (1992)\n * The Infinity Crusade (1993)\n * Infinity Abyss (2002)\n * Marvel: The End (2003)\n\n\nPublisher:  Marvel Comics\nFile Type:  .CBR\n\n\n\n\n1.  The Thanos Quest  &lt;a href=&quot;\nhttp://upload.wikimedia.org/wikipedia/en/2/2a/Tq1.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://upload.wikimedia.org/wikipedia/en/2/2a/Tq1.gif&lt;/a&gt;\n\nThe Thanos Quest is a two-issue comic book limited series in the Marvel universe, \nwritten by Jim Starlin. In it, Thanos schemes to steal the Infinity Gems from the \nElders of the Universe and other cosmic entities in order to be able to carry out \nDeath&amp;#039;s command that half the population in the universe is to be killed.  The Thanos \nQuest is continued in The Infinity Gauntlet limited series.\n\n\n\n2.  The Infinity Guantlet  &lt;a href=&quot;\nhttp://upload.wikimedia.org/wikipedia/en/thumb/a/af/Infinity_Gauntlet_1.jpg/390px-Infinity_Gauntlet_1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://upload.wikimedia.org/wikipedia/en/thumb/a/af/Infinity_Gauntlet_1.jpg/390px-Infinity_Gauntlet_1.jpg&lt;/a&gt;\n\nThe Infinity Gauntlet is among the most powerful artifacts in the Marvel Universe. The \nGauntlet consists of the six Infinity Gems mounted on a gold glove. Each Infinity Gem \ngrants its bearer complete mastery over one aspect of the Universe:\n\n    * Time\n    * Space\n    * Power\n    * Soul\n    * Mind\n    * Reality\n\nWith possession of all six Infinity Gems, the bearer would have complete omnipotence \nover the Universe, though not necessarily the omniscience required to effectively wield \nthat power. Later comics added the existence of a seventh gem called the Ego Gem. Only \none being, the omnipotent Living Tribunal, have ever been shown as more than a match \nfor the Gauntlet&amp;#039;s power having twice stopped the gems from working in unison and even \nreversing an action that Adam Warlock performed as &quot;God.&quot; However, Adam Warlock once \nspeculated that if Eternity had ever managed to gain the Infinity Gauntlet, then &quot;...his \nattitude towards the Living Tribunal might change.&quot;\n\n\n\n3.  The Infinity War &lt;a href=&quot;\nhttp://upload.wikimedia.org/wikipedia/en/2/2a/Infinitywarpromo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://upload.wikimedia.org/wikipedia/en/2/2a/Infinitywarpromo.jpg&lt;/a&gt;\n\nInfinity War was a comic book crossover that ran through numerous comics published \nby Marvel Comics in 1992. The main plot of the series occurred in the six-issue Infinity \nWar miniseries, which was written by Jim Starlin and illustrated by Ron Lim. Infinity War \nwas a sequel to the Infinity Gauntlet miniseries, and was followed a year later by the \nInfinity Crusade crossover miniseries.\n\nThe primary villain of the crossover was the Magus, who was created when Adam Warlock \nexpelled good and evil from his soul after attaining omnipotence in the conclusion of \nthe Infinity Gauntlet miniseries. The evil portion of his soul became the Magus, while \nthe good portion of his soul became the Goddess, who is eventually seen at the end of \nInfinity War and is the main villain of Infinity Crusade. To battle the Magus and his \narmy of evil doppelgangers, Adam Warlock and Earth&amp;#039;s heroes teamed up with Thanos, the \nvillain of the Infinity Gauntlet.\n\n\n\n4.  The Infinity Crusade &lt;a href=&quot;\nhttp://upload.wikimedia.org/wikipedia/en/e/e1/Ic6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://upload.wikimedia.org/wikipedia/en/e/e1/Ic6.jpg&lt;/a&gt;\n\nThe Infinity Crusade was a fictional conflict over cosmic cubes in the Marvel Comics Universe. \nIt was depicted in a 1993 six-issue limited series written by Jim Starlin, although major \nevents also took place in the two books featuring Adam Warlock that Marvel was publishing \nat the time. The primary antagonist is the Goddess. It wraps up a loose end from the events \nof Infinity War, and was Jim Starlin&amp;#039;s last work on Thanos until Infinity Abyss.\n\n\n\n5.  Infinity Abyss &lt;a href=&quot;\nhttp://upload.wikimedia.org/wikipedia/en/9/9a/InfinityAbyss1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://upload.wikimedia.org/wikipedia/en/9/9a/InfinityAbyss1.jpg&lt;/a&gt;\n\nInfinity Abyss (collected as Thanos: Infinity Abyss) is a six issue 2002 comic book \nminiseries written and drawn by Jim Starlin and published by Marvel Comics.  It involvs six \nThanos clones, hybridised with other prominent Marvel Universe figures including Doctor Strange, \nProfessor X and Galactus acting on their template&amp;#039;s nihilistic desire to end the universe, \nwhile they were opposed by a group including Adam Warlock, Spider-Man, Doctor Strange and \nThanos himself.  A sequel was produced that continued the focus on Thanos, in \nMarvel Universe: The End.\n\n\n6.  Marvel: The End &lt;a href=&quot;\nhttp://upload.wikimedia.org/wikipedia/en/3/31/Marvel_The-End.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://upload.wikimedia.org/wikipedia/en/3/31/Marvel_The-End.jpg&lt;/a&gt;\n\nMarvel: The End is a 6-issue comic-book series published in 2003 by Marvel Comics, written \nand penciled by Jim Starlin and inked by Al Milgrom. It is a Thanos storyline featuring the \ndeath (and eventual resurrection) of nearly all of Marvel Comics superheroes. It is a part \nof the &quot;The End&quot; set of limited series that show the last few days of many Marvel characters, \nbut unlike the others, has a connection to regular chronology. It is the last part of the \nInfinity Saga and it takes place on Earth-4321.\n\n\n\nNote:  This NFO was prepared by SBMfromLA\n","torrent":{"xt":"urn:btih:af9450050bbae108a983640ec06ab1c32c71ddc5","amp;dn":"Marvel+Comics+-++Infinity+Sagas+%28Guantlet%2C+War%2C+Crusade%2C+Abyss+%26","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af9450050bbae108a983640ec06ab1c32c71ddc5","infoHashBuffer":{"type":"Buffer","data":[175,148,80,5,11,186,225,8,169,131,100,14,192,106,177,195,44,113,221,197]},"announce":[],"urlList":[]}}