{"title":"AVS Video Editor 7.1.2.262 + Patch (menin)","uid":11865104,"size":155063529,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b0044481f7103caaf0ace19cc6cacaf4c7bea89c&amp;dn=AVS+Video+Editor+7.1.2.262+%2B+Patch+%28menin%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":5,"uploader":"menin1","files":1,"time":1430328588,"description":"\nAVS Video Editor - A full-featured editor for creating professional video processing. With the help of AVS Video Editor you can make video capture, to impose a variety of effects, create and burn DVD, export movies to various video formats, convert video to iPod, PSP, mobile phones and other portable devices. \n\nManage Various Video Formats\nAVS Video Editor supports all key video formats. Edit &amp; save video files in AVI, VOB, MP4, DVD, WMV, 3GP, MOV, MKV, H.263/H.264 codecs, etc.\n\nEdit Your Video with Fantasy\nTrim, cut, split, merge, rotate and mix videos with AVS Video Editor . Select between 300 innovative video effects and transitions. Insert menus, audio, text comments and subtitles. Stabilize video camera shaky recordings.\n\nSpeed Up HD-Videos Editing\nManage AVI HD, WMV HD, TOD, AVCHD, MOD, MTS/M2TS, etc. with AVS Video Editor . Due to the integrated video cache technology, HD-video editing becomes faster.\n\nProcess Blu-Ray Videos\nOpen and edit your Blu-ray videos with AVS Video Editor . Apply effects and add specially designed menus. Add audio, video and images to your videos. Save files in any key video format. Or burn videos on to Blu-ray discs.\n\nCapture Your Video\nTransfer video from DV-, web- or VHS-cameras and save video on hard drive or burn DVD discs. Or record media files from your PC screen and create video guides, training videos or demos.\n\nShare Your Video\nUpload newly made video files to all popular video hostings such as Facebook, Flickr, MySpace, etc., directly from AVS Video Editor interface.\n\nMultilingual Support\nAVS Video Editor interface and tech-support are available in English, French, German, Spanish, Italian, Japanese and Dutch. \n\nAll key formats are supported:\n\nRead: HD Video (inc. Blu-ray video, AVCHD, MPEG-2 HD and WMV HD), AVI (DivX, Xvid, etc.), DV AVI, MP4 (inc. Sony PSP, Apple iPod and Archos), WMV, 3GP, 3G2, QuickTime (MOV, QT), DVD, VOB, VRO, MPEG-1, 2, 4, TOD, MOD, MPG, DAT, VCD, SVCD, Real Video (RM, RMVB), ASF, ASX, MJPEG, H.263, H.264, DVR-MS, MKV, OGM, FLV, AMV, MTV, TS, M2TS, M2T, MTS, DPG, NSV, FLI, FLC, CDG, GVI, SVI, PPT, PPTX, WTV. \n\nWrite: HD Video (inc. Blu-ray video, AVCHD, MPEG-2 HD and WMV HD), AVI (DivX, Xvid, etc.), MP4 (inc. Sony PSP, Apple iPod and Archos), WMV, 3GP, 3G2, QuickTime (MOV, QT), SWF, FLV, DVD, MPEG-1, 2, 4, MPG, MJPEG, H.263, H.264, Real Video (RM, RMVB).\n\n\nInstructions:\n\n1.Unpack and install\n2.Run avs patcher as administrator\n3.Patch to avsvideoEditor.exe\n4.Done","torrent":{"xt":"urn:btih:b0044481f7103caaf0ace19cc6cacaf4c7bea89c","amp;dn":"AVS+Video+Editor+7.1.2.262+%2B+Patch+%28menin%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0044481f7103caaf0ace19cc6cacaf4c7bea89c","infoHashBuffer":{"type":"Buffer","data":[176,4,68,129,247,16,60,170,240,172,225,156,198,202,202,244,199,190,168,156]},"announce":[],"urlList":[]}}