{"title":"Audacity win 2.0.3 [bellatrix]","uid":8125659,"size":21281052,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b0cc8065e94c38c2f966cfe8118db7bb20ed5d70&amp;dn=Audacity+win+2.0.3+%5Bbellatrix%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":0,"uploader":"Bellatrix231","files":1,"time":1360497415,"description":"[size=5][color=red][u][b]Audacity win 2.0.3 [bellatrix][/b][/u][/color][/size]\n\n[img]http://audacity.sourceforge.net/about/images/audacity-windows.png[/img]\n\n[size=4][color=orangered][b]Audacity is a free, easy-to-use and multilingual audio editor and recorder for Windows, Mac OS X, GNU/Linux and other operating systems. You can use Audacity to:[/b][/color][/size]\n\n\n[size=4][color=deepskyblue]Record live audio.\nConvert tapes and records into digital recordings or CDs.\nEdit Ogg Vorbis, MP3, WAV or AIFF sound files.\nCut, copy, splice or mix sounds together.\nChange the speed or pitch of a recording.\n[/color][/size]\n[size=5][color=violet][u][b]Features[/b][/u][/color][/size]\n\n[size=4][color=lightskyblue]This is a list of features in Audacity, the free, open source, cross-platform audio editor. For full information on how to use these features, go to the help pages.\n[/color][/size]\n\n[size=4][color=orangered][u][b]Recording[/b][/u][/color][/size]\n\n[size=4]Audacity can record live audio through a microphone or mixer, or digitize recordings from cassette tapes, records, or minidiscs. With some sound cards, Audacity can also capture streaming audio.\n\nRecord from microphone, line input, USB/Firewire devices and others.\nDevice Toolbar manages multiple input and output devices.\nTimer Record and Sound Activated Recording features.\nDub over existing tracks to create multi-track recordings.\nRecord at sample rates up to 192,000 Hz (subject to appropriate hardware). Up to 384,000 Hz is supported for appropriate high-resolution devices, except when using Windows DirectSound host.\nRecord multiple channels at once (subject to appropriate hardware).\nLevel meters can monitor volume levels before, during and after recording. Clipping can be displayed in the waveform or in a label track.[/size]\n\n[size=4][color=orangered][u][b]Import and Export[/b][/u][/color][/size]\n\n[size=4][color=pink]Import sound files, edit them, and combine them with other files or new recordings. Export your recordings in many different file formats, including multiple files at once.\n\nImport and export WAV, AIFF, AU, FLAC and Ogg Vorbis files.\nFast &quot;On-Demand&quot; import of WAV or AIFF files (letting you start work with the files almost immediately) if read directly from source.\nImport and export all formats supported by libsndfile such as GSM 6.10, 32-bit and 64-bit float WAV and U/A-Law.\nImport MPEG audio (including MP2 and MP3 files) using libmad.\nImport raw (headerless) audio files using the &quot;Import Raw&quot; command.\nCreate WAV or AIFF files suitable for burning to audio CD.\nExport MP3 files with the optional LAME encoder library.\nImport and export AC3, M4A/M4R (AAC) and WMA with the optional FFmpeg library (this also supports import of audio from video files).[/color][/size]\n\n[size=4][color=orangered][u][b]Sound Quality[/b][/u][/color][/size]\n\n[size=4][color=red]Supports 16-bit, 24-bit and 32-bit (floating point) samples (the latter preserves samples in excess of full scale).\nSample rates and formats are converted using high-quality resampling and dithering.\nTracks with different sample rates or formats are converted automatically in real time.[/color][/size]\n\n[size=4][color=orangered][u][b]Editing[/b][/u][/color][/size]\n\n[size=4][color=silver]Easy editing with Cut, Copy, Paste and Delete.\nUnlimited sequential Undo (and Redo) to go back any number of steps.\nEdit and mix large numbers of tracks.\nMultiple clips are allowed per track.\nLabel tracks with selectable Sync-Lock Tracks feature for keeping tracks and labels synchronized.\nDraw Tool to alter individual sample points.\nEnvelope Tool to fade the volume up or down smoothly.\nAutomatic Crash Recovery in the event of abnormal program termination.[/color][/size]\n\n[size=4][color=orangered][u][b]Accessibility[/b][/u][/color][/size]\n\n[size=4][color=khaki]Tracks and selections can be fully manipulated using the keyboard.\nLarge range of keyboard shortcuts.\nExcellent support for JAWS, NVDA and other screen readers on Windows, and for VoiceOver on Mac.[/color][/size]\n\n[size=4][color=orangered][u][b]Effects[/b][/u][/color][/size]\n\n[size=4][color=deepskyblue]Change the pitch without altering the tempo (or vice-versa).\nRemove static, hiss, hum or other constant background noises.\nAlter frequencies with Equalization, Bass Boost, High/Low Pass and Notch Filter effects.\nAdjust volume with Compressor, Amplify, Normalize, Fade In/Fade Out and Adjustable Fade effects.\nRemove Vocals from suitable stereo tracks.\nCreate voice-overs for podcasts or DJ sets using Auto Duck [/color][/size]\n\n[size=4][color=orangered][u][b]effect[/b][/u][/color][/size]\n\n[size=4][color=violet]Other built-in effects include:\nEcho\nPhaser\nWahwah\nPaulstretch (extreme stretch)\nReverse\nTruncate Silence\nRun &quot;Chains&quot; of effects on a project or multiple files in Batch Processing mode.[/color][/size]\n\n[size=4][color=orangered][u][b]Plug-ins[/b][/u][/color][/size]\n\n[size=4][color=tomato]Add new effects with LADSPA, Nyquist, VST and Audio Unit effect plug-ins.\nEffects written in the Nyquist programming language can be easily modified in a text editor - or you can even write your own plug-in.[/color][/size]\n\n[size=4][color=orangered][u][b]Analysis[/b][/u][/color][/size]\n[size=4][color=lime]\nSpectrogram view modes for visualizing frequencies.\n&quot;Plot Spectrum&quot; command for detailed frequency analysis.\n&quot;Sample Data Export&quot; for exporting a file containing amplitude values for each sample in the selection.\nContrast Analysis for analyzing average rms volume differences between foreground speech and background music.\nSupport for adding VAMP analysis plug-ins.[/color][/size]\n\n\n[size=5][color=tomato]DOWNLOAD !!![/color] [color=violet] SEED !!![/color]  [color=orange]ENJOY !!![/color][/size]\n\n:thumbsup::thumbsup::thumbsup::thumbsup::thumbsup::thumbsup::thumbsup::lol::smile::thumbsup::thumbsup::thumbsup:","torrent":{"xt":"urn:btih:b0cc8065e94c38c2f966cfe8118db7bb20ed5d70","amp;dn":"Audacity+win+2.0.3+%5Bbellatrix%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0cc8065e94c38c2f966cfe8118db7bb20ed5d70","infoHashBuffer":{"type":"Buffer","data":[176,204,128,101,233,76,56,194,249,102,207,232,17,141,183,187,32,237,93,112]},"announce":[],"urlList":[]}}