{"title":"Nise O Coracao da Loucura 2016 Nacional 1280x720p AAC Makalakato","uid":15477816,"size":1191764267,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:b10b08838a6885369eb2865a64bfcb2323a67b70&amp;dn=Nise+O+Coracao+da+Loucura+2016+Nacional+1280x720p+AAC+Makalakato&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"makalakat","files":1,"time":1470207032,"description":"Nome Original: Nise – O Coração da Loucura\r\nGênero: Drama biográfico\r\nLançamento: 2016\r\nNacionalidade: BRASIL\r\nDuração: 1h 46min\r\nDiretor: Roberto Berliner\r\nQualidade: BDRip\r\nFormato: MP4\r\nTamanho: 1.11 GB\r\n\r\nVideo: MPEG4 Video (H264) 1280x720 29.97fps 1100kbps\r\nAudio: AAC 48000Hz 6ch 448kbps\r\n\r\nAo voltar a trabalhar em um hospital psiquiátrico no subúrbio do Rio de Janeiro,  a doutora Nise da Silveira (Gloria Pires) propõe uma nova forma de tratamento aos pacientes que sofrem de esquizofrenia, eliminando o eletrochoque e a lobotomia. Seus colegas de trabalho discordam do seu meio de tratamento e a isolam, restando a ela assumir o abandonado Setor de Terapia Ocupacional, onde dá início a uma nova forma de lidar com os pacientes, através do amor e da arte.\r\n\r\nCom sua equipe ela opta pela arte como maneira de evasão para os pacientes, trazendo a pintura, escultura e desenho para dentro do hospício. A obra vai além de uma biografia de Nise, trazendo ao público a realidade, história e as obras de cada artista que surgiu do projeto desenvolvido, dedicando o tempo do filme a representar de maneira delicada a trajetória de cada individuo.\r\n\r\nA fotografia do filme dialoga a todo instante com a trilha sonora, trazendo tons suaves, simples e claros. A abertura das imagens é sempre pontuada com a singularidade que cada artista possui em suas técnicas de pintar, fazendo o publico perceber que cada um dos pacientes é tão único que seria possível um longa para retratar a vida de cada um deles. Nise da Silveira existiu, assim como seus pacientes, assim como as obras de arte apresentadas no filme. \r\n\r\nOs pacientes ocultos, por trás da tela, existiram e ainda existem, as terapias como lobotomia já se foram, porém o tratamento aos pacientes continua longe do que cada ser humano merece. O Museu da Imagem e do Inconsciente do Rio de Janeiro foi criado no hospício no qual a trama se passa e é aberto ao público diariamente, uma extensão necessária para o pós filme","torrent":{"xt":"urn:btih:b10b08838a6885369eb2865a64bfcb2323a67b70","amp;dn":"Nise+O+Coracao+da+Loucura+2016+Nacional+1280x720p+AAC+Makalakato","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b10b08838a6885369eb2865a64bfcb2323a67b70","infoHashBuffer":{"type":"Buffer","data":[177,11,8,131,138,104,133,54,158,178,134,90,100,191,203,35,35,166,123,112]},"announce":[],"urlList":[]}}