{"title":"Anno 1503 Gold Edition","uid":6947585,"size":974151726,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b2565ee96f9fa087bd966fff8a221bbb04e80b02&amp;dn=Anno+1503+Gold+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"esharoth","files":2,"time":1326288213,"description":"Title: Anno 1503 Gold Edition\nGenre: strategy / city-building / isometric\nReleased: 28th October 2004\nDeveloper: Max Design\nPublisher: Sunflowers Interactive Entertainment Software\nDescription:\nThis compilation contains the main game Anno 1503: The New World and its add-on Anno 1503: Treasures, Monsters &amp; Pirates.\n\nLay claim to the New World in an epic saga of adventure and discovery! Anno 1503 is a PC title that blends the excitement of real-time strategy with the depth of empire building. The aim of the game is to establish colonies and seek out wealth and power. Watch your colonies grow while establishing trade and diplomatic ties with neighbouring cultures. Engage in combat on land and at sea to protect your colonies or to maintain freedom and independence. The all-new combat system allows for much more sophisticated tactical preparation and some truly epic land and sea-based battles. Enjoy the variety and challenge of five varying climate zones while competing against computer-controlled players, including interactions with nine different cultures such as the Africans, Aztecs and Native Americans. Stretch your influence through a powerful economic system which varies depending on location and includes goods such as weaponry, raw materials, and necessities such as clothes and food as well as more exotic items like silk and spices. Trades can be made several different ways, via an easily accessible trading menu that allows you to interact with other nations and form peace treaties. However, some cultures may rely on a more offensive, aggressive style of interaction, which can lead to potential conflict.\n\nHow to play:\n1) Download the game;\n2) Mount or burn disc image;\n3) Run setup.exe to install (it will start automatically if you have autorun enabled);\n4) Play the game without the disc.\n\nIf you like the game, BUY it!","torrent":{"xt":"urn:btih:b2565ee96f9fa087bd966fff8a221bbb04e80b02","amp;dn":"Anno+1503+Gold+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2565ee96f9fa087bd966fff8a221bbb04e80b02","infoHashBuffer":{"type":"Buffer","data":[178,86,94,233,111,159,160,135,189,150,111,255,138,34,27,187,4,232,11,2]},"announce":[],"urlList":[]}}