{"title":"Malcolm Gladwell: Blink, The Tipping Point","uid":4776645,"size":2031659,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b290b982cc2275f95c81c59b7e58ef0a55493205&amp;dn=Malcolm+Gladwell%3A+Blink%2C+The+Tipping+Point&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"4ehfuedd2","files":2,"time":1237234517,"description":"Malcolm Gladwell's books in PDF format.\n\n\nMalcolm Gladwell: Blink - The Power of Thinking Without Thinking\n----------------------------------------------------------------\nThis book is all about those moments when we 'know' something without knowing why. Here Malcolm Gladwell, one of the world's most original thinkers, explores the phenomenon of 'blink', showing how a snap judgement can be far more effective than a cautious decision. By trusting your instincts, he reveals, you'll never think about thinking in the same way again...\n\n\t\nMalcolm Gladwell: The Tipping Point - How Little Things Can Make a Big Difference\n---------------------------------------------------------------------------------\nThe New Yorker writer Malcolm Gladwell introduces an exciting marketing theory called the &quot;tipping point: &quot; a simple social phenomenon which promises to have profound implications for how we view business strategies, social problems, even basic communication among individuals. In a society based on majority rule, Gladwell suggests that change is affected less by the quantity of people who adopt it, and more by getting the &quot;right&quot; people to adopt it. Using the marketing example of the public's renewed interest in Hush Puppy shoes, he traces how a small group of consumers were able to redefine the product as &quot;cool&quot;, starting a national buying trend that turned the company around. With clear explanations and effective examples, Gladwell reveals how focused advertising and promotion can often be a much more effective marketing strategy than nationwide campaigns.\n\n----\nMalcolm Gladwell: Outliers - http://thepiratebay.se/torrent/4875020","torrent":{"xt":"urn:btih:b290b982cc2275f95c81c59b7e58ef0a55493205","amp;dn":"Malcolm+Gladwell%3A+Blink%2C+The+Tipping+Point","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b290b982cc2275f95c81c59b7e58ef0a55493205","infoHashBuffer":{"type":"Buffer","data":[178,144,185,130,204,34,117,249,92,129,197,155,126,88,239,10,85,73,50,5]},"announce":[],"urlList":[]}}