{"title":"Oscar Wilde - Fiction, Plays, Poems &amp; Essays (18 books)","uid":11198675,"size":31087241,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2bdd85c0f27d3ec7694c10c01372165b482aac4&amp;dn=Oscar+Wilde+-+Fiction%2C+Plays%2C+Poems+%26amp%3B+Essays+%2818+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":2,"uploader":"workerbee","files":-1,"time":1413138652,"description":"\nOSCAR WILDE (1854-1900) was an Irish writer, poet, and one of London's most popular playwrights in the early 1890s.  He was known for his involvement in the rising philosophy of aestheticism and moved in fashionable cultural and social circles.  Famous for his biting wit, flamboyant dress and glittering conversation, he became one of the best-known personalities of his day.\n\nAt the turn of the 1890s, he refined his ideas about the supremacy of art in a series of dialogues and essays, and incorporated themes of decadence, duplicity, and beauty into his only novel, THE PICTURE OF DORIAN GRAY (1890).  The opportunity to construct aesthetic details precisely, and combine them with larger social themes, drew Wilde to write drama.  He wrote SALOME (1891) in French in Paris but it was refused a licence for England due to the absolute prohibition of Biblical subjects on the English stage.  Unperturbed, Wilde produced a series of popular society comedies in the1890s -- including LADY WINDERMERE'S FAN (1892), AN IDEAL HUSBAND (1895) and THE IMPORTANCE OF BEING EARNEST (1895) -- which made him one of the most successful playwrights of late Victorian London.\n\nAt the height of his fame and success, Wilde had the Marquess of Queensberry, the father of Wilde's lover, prosecuted for libel.  The trial unearthed evidence that caused Wilde to drop his charges and led to his own arrest and trial for gross indecency with other men.  After two more trials he was convicted and imprisoned for two years' hard labour.  While in prison, he wrote DE PROFUNDIS, which was published in 1905, a long letter which discusses his spiritual journey through his trials, forming a dark counterpoint to his earlier philosophy of pleasure.  Upon his release he left immediately for France, never to return to Ireland or Britain.  There he wrote his last work, THE BALLAD OF READING GAOL (1898), a long poem commemorating the harsh rhythms of prison life.  He died destitute in Paris at the age of 46.\n\n\nThe following books are in ePUB format unless otherwise noted:\n\n* THE BALLAD OF READING GAOL &amp; OTHER POEMS (Penguin Classics, 2010).\n\n* THE CANTERVILLE GHOST, THE HAPPY PRINCE &amp; OTHER STORIES (Penguin Classics, 2010).\n\n* COMPLETE SHORT FICTION (Penguin Classics, 2003).  Edited by Ian Small.\n\n* COMPLETE SHORT STORIES (Dover, 2006).\n\n* COMPLETE WORKS (Delphi Classics, 2013).\n\n* COMPLETE WORKS (HarperCollins, 2003).  Introduction by Merlin Holland.\n\n* COMPLETE WORKS (v. 3.1, 2014).  Edited by Pynch.\n\n* DE PROFUNDIS (Modern Library, 2000).  Preface by Richard Ellmann, with Notes by Jason Tougaw.\n\n* THE DECAY OF LIVING &amp; OTHER ESSAYS (Penguin Classics, 2010).\n\n* THE HAPPY PRINCE &amp; OTHER STORIES (Puffin Classics, 2009).  Introduced by Markus Zusak with Illustrations by Lars Bo.\n\n* THE IMPORTANCE OF BEING EARNEST &amp; OTHER PLAYS (Signet Classics, 1985).  Introduction by Sylvan Barnet.\n\n* LORD ARTHUR SAVILE'S CRIME &amp; OTHER STORIES (Penguin, 1994).\n\n* THE PICTURE OF DORIAN GRAY (Barnes &amp; Noble Classics, 2003).  Introduction and Notes by Camille Cauti.\n\n* THE PICTURE OF DORIAN GRAY (Penguin Classics, 2003).  Edited with an Introduction and Notes by Robert Mighall.\n\n* THE PICTURE OF DORIAN GRAY (Oxford World's Classics, 2006).  Edited with an Introduction and Notes by Joseph Bristow. -- PDF\n\n* THE UNCENSORED PICTURE OF DORIAN GRAY (Harvard UP, 2012).  Edited by Nicholas Frankel. -- PDF\n\n* THE WISDOM OF OSCAR WILDE (Philosophical Library, 1967; rep. Open Road, 2010).\n\n* A WOMAN OF NO IMPORTANCE (Duke Classics, 2013).\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                            &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:b2bdd85c0f27d3ec7694c10c01372165b482aac4","amp;dn":"Oscar+Wilde+-+Fiction%2C+Plays%2C+Poems+%26amp%3B+Essays+%2818+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2bdd85c0f27d3ec7694c10c01372165b482aac4","infoHashBuffer":{"type":"Buffer","data":[178,189,216,92,15,39,211,236,118,148,193,12,1,55,33,101,180,130,170,196]},"announce":[],"urlList":[]}}