{"title":"Aerosmith - Gold (2CD Greatest Hits) 2005 [FLAC] - Kitlope","uid":8050875,"size":1242444285,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b3cbcce4b879e628b469f500539e7c3b6e65c925&amp;dn=Aerosmith+-+Gold+%282CD+Greatest+Hits%29+2005+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":5,"uploader":"Kitlope","files":41,"time":1358813718,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: B3CBCCE4B879E628B469F500539E7C3B6E65C925\nFile Size: 1.15 GB\nYear: Original Release: Young Lust 2001 / This Release: Gold 2005\nLabel: Geffen\nCatalog #: B000293602 \n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\nAerosmith is an American rock band, sometimes referred to as &quot;The Bad Boys from Boston&quot;[4] and &quot;America's Greatest Rock and Roll Band.&quot;[5][6][7][8] Their style, which is rooted in blues-based hard rock,[9][10] has come to also incorporate elements of pop,[11] heavy metal,[9] and rhythm and blues,[12] and has inspired many subsequent rock artists.[13] The band was formed in Boston, Massachusetts in 1970. Guitarist Joe Perry and bassist Tom Hamilton, originally in a band together called the Jam Band, met up with singer Steven Tyler, drummer Joey Kramer, and guitarist Ray Tabano, and formed Aerosmith. In 1971, Tabano was replaced by Brad Whitford, and the band began developing a following in Boston.\n\nThey were signed to Columbia Records in 1972, and released a string of multi-platinum albums, beginning with their 1973 eponymous debut album, followed by their 1974 album Get Your Wings. In 1975, the band broke into the mainstream with the album Toys in the Attic, and their 1976 follow-up Rocks cemented their status as hard rock superstars.[14] Two additional albums followed in 1977 and 1979. Throughout the 1970s, the band toured extensively and charted a string of Hot 100 singles. By the end of the decade, they were among the most popular hard rock bands in the world and developed a loyal following of fans, often referred to as the &quot;Blue Army&quot;.[15] However, drug addiction and internal conflict took their toll on the band, which resulted in the departures of Perry and Whitford in 1979 and 1981, respectively; they were replaced by Jimmy Crespo and Rick Dufay.[10] The band did not fare well between 1980 and 1984, releasing a lone album, Rock in a Hard Place, which went gold but failed to match their previous successes.\n\nPerry and Whitford returned in 1984 and the band signed a new deal with Geffen Records. After a comeback tour, the band recorded Done with Mirrors (1985), which won some critical praise but failed to come close to commercial expectations. It was not until the band's collaboration with rap group Run-D.M.C. in 1986, and the 1987 release Permanent Vacation that they regained the level of popularity they had experienced in the 1970s.[16] Throughout the late 1980s and 1990s, the band scored several hits and won numerous awards for music from the multi-platinum albums Pump (1989), Get a Grip (1993), and Nine Lives (1997), and embarked on their most extensive concert tours to date. The band also became a pop culture phenomenon with popular music videos and notable appearances in television, film, and video games. Their comeback has been described as one of the most remarkable and spectacular in rock 'n' roll history.[9][10] Additional albums followed in 2001 and 2004. The band toured throughout the 2000s, touring every year except 2008. After 43 years of performing, the band continues to tour and record music. Their latest album, Music from Another Dimension!, was released on November 6, 2012.\n\nAerosmith is the best-selling American rock band of all time, having sold more than 150 million albums worldwide,[17] including 66.5 million albums in the United States alone.[18] They also hold the record for the most gold and multi-platinum albums by an American group. The band has scored 21 Top 40 hits on the Billboard Hot 100, nine number-one Mainstream Rock hits, four Grammy Awards, and ten MTV Video Music Awards. They were inducted into the Rock and Roll Hall of Fame in 2001, and were included among both Rolling Stone's and VH1's lists of the 100 Greatest Artists of All Time. \n\n\nGold 2005\n\n\nYoung Lust: The Aerosmith Anthology was a 2001 compilation album by American hard rock band Aerosmith. This compilation holds their greatest hits of their Geffen Records years between Done with Mirrors and Get a Grip, as well as some un-released material, B-sides, and live versions. It was reissued in 2005 as Gold, with cover art of the band replaced the original cover of couple getting undressed.\n\n\n\nTracks: \n\nDisc 1 \n\n1.\t&quot;Let the Music Do the Talking&quot; (from Done with Mirrors)\n2.\t&quot;My Fist Your Face&quot; (from Done with Mirrors)\n3.\t&quot;Shame on You&quot; (from Done with Mirrors])\n4.\t&quot;Heart's Done Time&quot; (from Permanent Vacation)\n5.\t&quot;Rag Doll&quot; (from Permanent Vacation)\n6.\t&quot;Dude (Looks Like a Lady)&quot; (from Permanent Vacation)\n7.\t&quot;Angel&quot; (from Permanent Vacation)\n8.\t&quot;Hangman Jury&quot; (from Permanent Vacation)\n9.\t&quot;Permanent Vacation&quot; (from Permanent Vacation)\n10.\t&quot;Young Lust&quot; (from Pump)\n11.\t&quot;The Other Side&quot; (from Pump)\n12.\t&quot;What It Takes&quot; (from Pump)\n13.\t&quot;Monkey on My Back&quot; (from Pump)\n14.\t&quot;Love in an Elevator&quot; (from Pump)\n15.\t&quot;Janie's Got a Gun&quot; (from Pump)\n16.\t&quot;Ain't Enough&quot; (from b-side to Love in an Elevator)\n17.\t&quot;Walk This Way (with Run-D.M.C.)&quot; (from Run-D.M.C. album Raising Hell)\n\n\nDisc 2 \n\n\n1.\t&quot;Eat the Rich&quot; (from Get a Grip)\n2.\t&quot;Love Me Two Times&quot; (from Air America)\n3.\t&quot;Head First&quot; (b-side of Cryin')\n4.\t&quot;Livin' on the Edge&quot; (Acoustic Version; original from Get a Grip)\n5.\t&quot;Don't Stop&quot; (b-side of Livin' on the Edge)\n6.\t&quot;Can't Stop Messin'&quot; (b-side of Livin' on the Edge)\n7.\t&quot;Amazing&quot; (Orchestral Version; original from Get a Grip)\n8.\t&quot;Cryin'&quot; (from Get a Grip)\n9.\t&quot;Crazy&quot; (from Get a Grip)\n10.\t&quot;Shut Up and Dance&quot; (from Get a Grip)\n11.\t&quot;Deuces Are Wild&quot; (from The Beavis and Butt-Head Experience, Big Ones)\n12.\t&quot;Walk on Water&quot; (from Big Ones)\n13.\t&quot;Blind Man&quot; (from Big Ones)\n14.\t&quot;Falling in Love (Is Hard on the Knees)&quot; (Live from A Little South of Sanity)\n15.\t&quot;Dream On&quot; (Live from A Little South of Sanity)\n16.\t&quot;Hole in My Soul&quot; (Live from A Little South of Sanity)\n17.\t&quot;Sweet Emotion&quot; (Live from A Little South of Sanity)\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:b3cbcce4b879e628b469f500539e7c3b6e65c925","amp;dn":"Aerosmith+-+Gold+%282CD+Greatest+Hits%29+2005+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3cbcce4b879e628b469f500539e7c3b6e65c925","infoHashBuffer":{"type":"Buffer","data":[179,203,204,228,184,121,230,40,180,105,245,0,83,158,124,59,110,101,201,37]},"announce":[],"urlList":[]}}