{"title":"Custom PC - October 2016 (gnv64)","uid":15572583,"size":28467705,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b489ddeac99e26daf62683c211004436856cf6d8&amp;dn=Custom+PC+-+October+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":4,"uploader":"gnv65","files":5,"time":1471279104,"description":"Custom PC - October 2016\r\nEnglish | 116 pages | True PDF | 26.7 mb\r\n\r\nCONTENTS\r\n86 PC building masterclass - If you’ve ever looked at a professional system build and thought ‘how do I do that?’ then this issue is for you. In our PC building masterclass, we take you through the whole process of building a PC, from start to finish. We tell you which slots and sockets to use for which components, where to put your fans and, perhaps more importantly, where to put all those cables and make a PC that looks like it was built by a pro. Whether you’re considering building your first PC, or if you’ve built a couple of machines already but want some tips and tricks, there will be something for you in our complete masterclass.\r\n\r\nHighlights\r\n10 A proper next-gen PC - Unimpressed by tradeshow concept projects, Richard Swinburne shows how the PC can be really improved.\r\n12 VR sickness - VR will only become mainstream if it doesn’t make gamers feel sick, argues Tracy King.\r\n20 Nvidia GeForce GTX 1060 - Nvidia’s cut-price Pascal chip takes aim at AMD’s Radeon RX480.\r\n28 Water cooling on the cheap Alphacool’s sub-£100 Eisbaer 240 promises an easy introduction to water cooling, with a complete, expandable pre-built kit that challenges all-in-one liquid coolers.\r\n40 Ultra-wide monitors - Fancy having a mini IMAX in your face? We put six massive, ultra-wide monitors through their paces.\r\n50 Micro-ATX cases - Smaller than an ATX case, but less restrictive than a mini-TX chassis, micro-ATX is a happy medium between both worlds. We test six micro-ATX cases to find the best ones.\r\n96 Raspberry Pi time-lapse photography - Gareth Halfacree shows you how to make a time-lapse photography video using any model of Raspberry Pi board.\r\n104 Expand an all-in-one liquid cooler - Want to add a bigger radiator or a separate reservoir to your all-in-one liquid cooler, as if you had a proper custom water-cooling system? Antony Leather shows you how it’s done.\r\n\r\nRegulars\r\n8 From the editor\r\n10 Richard Swinburne\r\n12 Tracy King\r\n14 Incoming\r\n16 Letters\r\n34 Custom kit\r\n38 How we test\r\n64 Elite\r\n75 Inverse look\r\n82 The engine room\r\n96 Hobby tech\r\n101 RealBench leaderboard\r\n102 Customised PC\r\n104 How to guides\r\n109 Your folding milestones\r\n110 Readers’ drives\r\n114 James Gorbold\r\n \nhttps://s3.postimg.io/kqecqnyc3/Custom_PC_October_2016.jpg","torrent":{"xt":"urn:btih:b489ddeac99e26daf62683c211004436856cf6d8","amp;dn":"Custom+PC+-+October+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b489ddeac99e26daf62683c211004436856cf6d8","infoHashBuffer":{"type":"Buffer","data":[180,137,221,234,201,158,38,218,246,38,131,194,17,0,68,54,133,108,246,216]},"announce":[],"urlList":[]}}