{"title":"Meat Loaf - The Very Best of -1998","uid":3722341,"size":169105473,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b4a9f3a0f9129985e30dc4a2cca08b6fd509c93a&amp;dn=Meat+Loaf+-+The+Very+Best+of+-1998&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":1,"uploader":"Ekolb","files":20,"time":1182647284,"description":"Meat Loaf is the stage name of Michael Lee Aday (born Marvin Lee Aday on September 27, 1947(1947-09-27)). He is an American rock singer and actor of stage and screen. He is noted for his albums Bat Out Of Hell I, II, and III and several famous songs from movies. The Neverland Express is the name of the band he fronts, as its lead singer. In 2001, he changed his first name to Michael.\n\nAday was born in Dallas, Texas. Despite setbacks (including bankruptcy, on more than one occasion), Meat Loaf is notable for the ultimate success of his music career, spawning some of the largest-selling albums of all time, and breaking several records for chart duration. Bat Out Of Hell, the debut album which had been four years in the making, has sold over 37 million copies. After almost 30 years, it still sells an estimated 200,000 copies annually, and stayed on the charts for over 9 years. Each of the seven tracks on the album eventually charted as a single hit.\n\nAlthough he enjoyed success with Bat Out Of Hell and Bat Out Of Hell II: Back Into Hell, Meat Loaf experienced some initial difficulty establishing a steady career within his native United States; however, he has retained iconic status and popularity in Europe, especially the UK, where he ranks 23rd for number of weeks overall spent on the charts, and is one of only two artists with an album never to have left the music charts. In Germany, Meat Loaf became notably popular following the release of Bat Out Of Hell II but has enjoyed most of his success among pop/rock fans. He ranked 96th on VH1&amp;#039;s &amp;#039;100 Greatest Artists of Hard Rock&amp;#039;.\n\nMeat Loaf has also appeared in over 50 movies or television shows sometimes even as himself, or as characters resembling his onstage personality, such as his memorable role as Eddie in The Rocky Horror Picture Show. He starred in the acclaimed feature film Fight Club, as Robert &quot;Bob&quot; Paulson; he is credited for this role as &quot;Meat Loaf Aday&quot;.\n\nThe Very Best of Meat Loaf is a 1998 album spanning the first 21 years of Meat Loaf&amp;#039;s recording career. Although not reaching the top ten in the UK, it recently went platinum, and was already platinum around the rest of the world just after its release. The album featured all of Meat Loaf&amp;#039;s best-known songs as well as a few from his more unknown albums from the 1980s. Unsurprisingly, the album featured no songs from the album &amp;#039;Blind Before I Stop&amp;#039; which was Meat Loaf&amp;#039;s major downfall in the 1980s, reaching a mere #28 in the UK charts.\n\nReleased 1998 \nRecorded 1977 - 1998 \nGenre Rock \nLength 116:57 \nLabel Virgin, Sony \nProducer(s) Various \n\nCD 1 \n\nHome By Now / No Matter What\nLife Is A Lemon And I Want My Money Back - (remix) \nYou Took The Words Right Out Of My Mouth (Hot Summer Night)\nTwo Out Of Three Ain&amp;#039;t Bad \nModern Girl \nRock &amp; Roll Dreams Come Through \nIs Nothing sacred \nParadise By The Dashboard Light \nHeaven Can Wait \n\nCD 2 \n\nI&amp;#039;d Do Anything For Love (But I Won&amp;#039;t Do That) \nKiss Is A Terrible Thing To Waste, A \nI&amp;#039;d Lie For You (And That&amp;#039;s The Truth)\nNot A Dry Eye In The House \nNocturnal Pleasure \nDead Ringer For Love \nMidnight At The Lost And Found \nObjects In The Rear View Mirror May Appear Closer Than They Are \nBat Out Of Hell \n\nEnjoy! and please seed..\nEkolb!","torrent":{"xt":"urn:btih:b4a9f3a0f9129985e30dc4a2cca08b6fd509c93a","amp;dn":"Meat+Loaf+-+The+Very+Best+of+-1998","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4a9f3a0f9129985e30dc4a2cca08b6fd509c93a","infoHashBuffer":{"type":"Buffer","data":[180,169,243,160,249,18,153,133,227,13,196,162,204,160,139,111,213,9,201,58]},"announce":[],"urlList":[]}}