{"title":"Metro.Last.Light.Redux-FLT","uid":10887008,"size":9925826277,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b4d46ff57ef6d7c5d48dfea71549b9bd5ea4838f&amp;dn=Metro.Last.Light.Redux-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"Taker009","files":-1,"time":1409081160,"description":"Metro.Last.Light.Redux-FLT\n\n\n\nIn Their 28th Year Of Glory, FairLight Released #1157 \n              \n\n\n\n            Metro: Last Light Redux (c) Deep Silver                  \n \n    Supplied by: FAIRLIGHT            : : Release Date: 26/08/2014          \n    Cracked by:  FAIRLIGHT              Game Type:    Action               \n    Packaged by: FAIRLIGHT              Image Format: ISO                  \n \n    DISCS: 1                            Protection: Steam                  \n\n    System Requirements : Nobody knows!                                      \n\n\n  Game information:\n  ================= \n\n  It is the year 2034. Beneath the ruins of post-apocalyptic Moscow, in  the\n  tunnels of the Metro, the remnants  of  mankind  are  besieged  by  deadly\n  threats from outside - and within. Mutants stalk the catacombs beneath the\n  desolate surface, and hunt amidst the poisoned skies above. \n\n  But rather than stand united, the station-cities of the Metro  are  locked\n  in a struggle for the ultimate power, a doomsday device from the  military\n  vaults of D6. A civil war is stirring that could wipe  humanity  from  the\n  face of the earth forever. As Artyom, burdened  by  guilt  but  driven  by\n  hope, you hold the key to our survival - the last  light  in  our  darkest\n  hour... \n\n  Metro: Last Light Redux  is  the  definitive  version  of  the  critically\n  acclaimed  'Metro:  Last  Light',  rebuilt  in  the  latest  and  greatest\n  iteration of the 4A Engine for Next Gen. Newcomers will get the chance  to\n  experience one of the finest story-driven shooters of all  time;  an  epic\n  adventure combining gripping survival  horror,  exploration  and  tactical\n  combat and stealth. \n\n  This definitive version also includes all previously released DLC,  adding\n  10 hours of bonus single-player content to the huge solo campaign. Fans of\n  the original game will notice  new  features  and  gameplay  improvements,\n  including new melee animations, the ability to check your watch  and  ammo\n  supplies on the fly, and new full-body player animations. \n\n  And those who favoured the more survival-horror oriented gameplay  of  the\n  cult prequel 'Metro 2033' will find a new way to experience  the  campaign\n  thanks to the introduction of  two  unique  Play  Styles  -  Survival  and\n  Spartan. The former transforms Last  light  from  a  more  action-oriented\n  stealth combat experience to a fraught, slow burn fight for survival. With\n  the legendary Ranger Mode included to offer an extra  layer  of  challenge\n  and immersion, Metro: Last Light Redux offers hours of AAA gameplay for an\n  incredible price. \n\n  Features:\n  ========= \n\n  * Immerse yourself in the Moscow Metro - witness one of the most\n    atmospheric worlds in gaming brought to life with stunning\n    next-gen visuals at 60FPS Brave the horrors of the Russian\n    apocalypse - equip your gasmask and an arsenal of hand-made\n    weaponry as you face the threat of deadly mutants, human foes,\n    and the terrifying environment itself\n  * Rebuilt and Remastered for next-gen - with all previous DLC\n    content included, new modes and features, and many gameplay\n    improvement, this is the definitive version of the critically\n    acclaimed classic that fans and newcomers alike will enjoy\n  * Two unique Play Styles : &quot;Spartan&quot; and &quot;Survival&quot; - approach the\n    game as a slow burn Survival Horror, or tackle it with the combat\n    skills of a Spartan Ranger in these two unique modes\n  * The legendary Ranger Mode returns - dare you play the fearsome\n    Ranger Mode? No HUD, UI, deadlier combat and limited resources\n    combine to create the ultimate immersive experience \n\n  Installation Information:\n  ========================= \n\n  * Burn or mount\n  * Install\n  * Play the game \n\n  NOTE: As usual, block the game exe in your firewall. \n\n                                                              /TEAM FAiRLIGHT","torrent":{"xt":"urn:btih:b4d46ff57ef6d7c5d48dfea71549b9bd5ea4838f","amp;dn":"Metro.Last.Light.Redux-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4d46ff57ef6d7c5d48dfea71549b9bd5ea4838f","infoHashBuffer":{"type":"Buffer","data":[180,212,111,245,126,246,215,197,212,141,254,167,21,73,185,189,94,164,131,143]},"announce":[],"urlList":[]}}