{"title":"Rise Against - Appeal To Reason (2008)","uid":4432552,"size":100878074,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b4dcde04b675125fea27442cda692972e1998125&amp;dn=Rise+Against+-+Appeal+To+Reason+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":4,"uploader":"pvtmadore","files":18,"time":1223365881,"description":"As usual, I have it first. I pre-ordered both a hardcopy and the digital version of this album, because that&amp;#039;s how much I love this band. I don&amp;#039;t think any amount of filesharing could ever hurt their following, and they&amp;#039;ll always make what they put into their albums times five hundred bazillion. Nonetheless, as usual I encourage you to support the band by purchasing the album. I also encourage you to seed this torrent as it is going to be slow if I&amp;#039;m the only one doing it. I&amp;#039;ve removed support on my torrent program for the songs &quot;Little Boxes&quot; and &quot;Re-Education Through Labor&quot; as they are both included here and that would be redundant. Further, an additional file is included in the form of a booklet that was received alongside the digital copy. If you&amp;#039;d like to thank me for doing this, buy a copy of the album yourself. I share music I think the world needs to hear. That&amp;#039;s all. Of course I have my own projects that need supporting and are not receiving such, but oh well, no sense crying. I&amp;#039;m not as good as these guys, though I hope one day when my music is for sale, someone who feels the world deserves to hear it will share it on the pirate bay, the world&amp;#039;s best torrent site.\n\nThanks.\nphm","torrent":{"xt":"urn:btih:b4dcde04b675125fea27442cda692972e1998125","amp;dn":"Rise+Against+-+Appeal+To+Reason+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4dcde04b675125fea27442cda692972e1998125","infoHashBuffer":{"type":"Buffer","data":[180,220,222,4,182,117,18,95,234,39,68,44,218,105,41,114,225,153,129,37]},"announce":[],"urlList":[]}}