{"title":"Kaspersky Internet Security 2014 14.0.0.4651 Final [ChingLiu]","uid":8812751,"size":246815719,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b509a3d706f9ccb6bde09649af4b2d9809204d41&amp;dn=Kaspersky+Internet+Security+2014+14.0.0.4651+Final+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"Ching_Liu","files":-1,"time":1376499348,"description":"WHAT'S NEW \n\nKaspersky Internet Security provides the following new features: \n- To increase security of applications, Trusted Applications mode has been added. When Trusted Applications mode is enabled, Kaspersky Internet Security automatically detects secure applications and allows running secure applications only. \n- The functionality of Safe Money has been improved. You can now select a web browser to open websites of banks or payment systems. The list of popular websites for financial operations with automatic enabling of the Safe Money mode has also been added. \n- The functionality of Parental Control has been improved: the option of setting up permissions to run games and applications has been added. The preset templates of Parental Control settings that are appropriate to the age of controlled users have been added. \n- It is now easier to set up Kaspersky Internet Security. Now only frequently used application settings are available for setup. \n- The latest versions of popular web browsers are now supported: protection components (e.g., Kaspersky URL Advisor, Safe Money) support Mozillaâ„¢ Firefoxâ„¢ 16.x, 17.x, 18.x, and 19.x; Internet ExplorerÂ® 8, 9, and 10; and Google Chromeâ„¢ 22.x, 23.x, 24.x, 25.x, and 26.x. \n- Protection against screen lockers has been added. You can unlock the screen using the specified key shortcut. Protection against screen lockers detects and eliminates the threat. \n- Protection against phishing is now more efficient: Anti-Phishing functionality has been improved and updated. \n- Application performance has been improved and computer resource consumption has been optimized. \n- The mode of limited activity when the computer is idle has been added. Now, when the computer is idle, Kaspersky Internet Security is less resource-intensive that allows saving power consumption while running on battery power. \n- Less time is required to start the application. \n- Application GUI performance has been improved, and the response time to user actions has been reduced.\n- Application reporting has been improved. Now reports are simpler and more obvious. \n- The option of participating in the Protect a Friend program has been added. You can now share a link to Kaspersky Internet Security with friends and receive bonus activation codes.\n\nHARDWARE AND SOFTWARE REQUIREMENTS \n\nTo ensure the functioning of Kaspersky Internet Security, your computer should meet the following requirements: \nGeneral requirements: \n*480 MB free disk space on the hard drive (including 380 MB on the system drive). \n*CD-/DVD-ROM (for installing from the installation CD) \n*Internet access (for the application activation and for updating databases and software modules) \n*Internet Explorer 8.0 or later. \n*MicrosoftÂ® WindowsÂ® Installer 3.0 or later. \n*Microsoft .NET Framework 4. \n\nRequirements for Microsoft Windows XP Home Edition (Service Pack 3 or later), Microsoft Windows XP Professional (Service Pack 3 or later), and Microsoft Windows XP Professional x64 Edition (Service Pack 2 or later): \n*IntelÂ® PentiumÂ® 800 MHz 32-bit (x86) / 64-bit (x64) processor or later (or a compatible equivalent). \n*512 MB free RAM. \n\nRequirements for Microsoft Windows VistaÂ® Home Basic (Service Pack 1 or later), Microsoft Windows Vista Home Premium (Service Pack 1 or later), Microsoft Windows Vista Business (Service Pack 1 or later), Microsoft Windows Vista Enterprise (Service Pack 1 or later), Microsoft Windows Vista Ultimate (Service Pack 1 or later), Microsoft Windows 7 Starter, Microsoft Windows 7 Home Basic, Microsoft Windows 7 Home Premium, Microsoft Windows 7 Professional, Microsoft Windows 7 Ultimate, Microsoft Windows 8, Microsoft Windows 8 Pro, and Microsoft Windows 8 Enterprise: \n*Intel Pentium 1 GHz 32-bit (x86) / 64-bit (x64) processor or higher (or a compatible equivalent). \n*1 GB free RAM (for 32-bit operating systems); 2 GB free RAM (for 64-bit operating systems).\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.kaspersky.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kaspersky.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:b509a3d706f9ccb6bde09649af4b2d9809204d41","amp;dn":"Kaspersky+Internet+Security+2014+14.0.0.4651+Final+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b509a3d706f9ccb6bde09649af4b2d9809204d41","infoHashBuffer":{"type":"Buffer","data":[181,9,163,215,6,249,204,182,189,224,150,73,175,75,45,152,9,32,77,65]},"announce":[],"urlList":[]}}