{"title":"Scribblenauts Unlimited-SKIDROW","uid":7847653,"size":1750725324,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b54f65d53075c2feac025dffa3f3fd3266375577&amp;dn=Scribblenauts+Unlimited-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":0,"uploader":"Gh0stNet","files":41,"time":1353516458,"description":"Scribblenauts Unlimited-SKIDROW\n\n\nDescription\n\nThe best-selling, award-winning franchise is back on your home PC in gorgeous HD for the first time.\nVenture into a wide-open world where the most powerful tool is your imagination. Help Maxwell solve robust puzzles in seamless, free-roaming levels by summoning any object you can think of. Create\nyour own original objects, assign unique properties, and share them with friends online using Steam Workshop to be used in game or further modified as you like\nFor the first time, learn the back-story about Maxwell's parents, 41 siblings (including his twin sister Lily), and how he got his magical notepad.\n\nFeatures\n\nObject Creator: Create original objects, assign unique properties, and share them with other players online. Use them in game or modify them as you like\nAll-New Unbound World: Explore an open universe with unlimited hours of fun using every level as your playground.\nObject Library: Store previously summoned objects and your own creations in Maxwell's Magic Backpack for easy access and future use.\nMerit Board: Each world comes with a comprehensive list of hints, including the new Starite Vision helper highlighting all nearby starites and starite shards.\n\nInstall Notes\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy ","torrent":{"xt":"urn:btih:b54f65d53075c2feac025dffa3f3fd3266375577","amp;dn":"Scribblenauts+Unlimited-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b54f65d53075c2feac025dffa3f3fd3266375577","infoHashBuffer":{"type":"Buffer","data":[181,79,101,213,48,117,194,254,172,2,93,255,163,243,253,50,102,55,85,119]},"announce":[],"urlList":[]}}