{"title":"Out in the Silence (2009) 720p BrRip x264 - YIFY","uid":11760902,"size":721852714,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:b5a47d52b4c4eea4ba6f0f3d8f2405f4a0f10f9e&amp;dn=Out+in+the+Silence+%282009%29+720p+BrRip+x264+-+YIFY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":5,"uploader":"YIFY","files":2,"time":1426580371,"description":"------------------------------------------------------------------------------- \n ------------------------------------------------------------------------------- \n \n Get all YIFYs newest releases first at\n Also there you will find a list of upcoming uploads, instant chat, account registration and an effective movie search. \n \n ------------------------------------------------------------------------------- \n ------------------------------------------------------------------------------- \n  &lt;a href=&quot; http://www.imdb.com/title/tt1564058/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt1564058/&lt;/a&gt;\n \n \n IMDB RATING: 7.1\n \n FORMAT.......................: MP4\n CODEC........................: X264\n GENRE........................: Documentary / Comedy\n FILE SIZE....................: 688.41 MB\n RESOLUTION...................: 1280*720\n FRAME RATE...................: 29.97 fps\n LANGUAGE.....................: English\n RUNTIME......................: 56 mins\n \n \n \n A gray winter sky hangs over lonely city streets, rotted oil derricks, and abandoned factories. This is Oil City, Pennsylvania, a fading industrial town in the heart of the American rust belt. It is the sort of town that Barrack Obama had in mind when he made his infamous comments about bitter small town residents clinging to their guns and religion as they watch the rest of the world pass them by. The peace and quiet is shattered when the filmmaker, Oil City native Joe Wilson, places the announcement of his wedding to another man in the local paper. The announcement catches the eye of Kathy Springer, a local woman whose teenage son, CJ, is being brutally tormented at school because he is gay. Ignored by the school authorities and with no where else to turn, she seeks help from Wilson and they begin a difficult but ultimately successful struggle to take on the school authorities who made every day &quot;eight hours of pure hell&quot; for CJ. The announcement has a very different effect on Diane Gramley, head of the local chapter of the ultra-conservative American Family Association. Infuriated by the prospect of the &quot;homosexual agenda&quot; invading her little town, she issues an action alert calling on townspeople to denounce same sex marriage and all other forms of &quot;perversion&quot;. Over the next four years Wilson navigates the ins and outs of being different in a conservative small town. He makes an unexpected friendship with an evangelical pastor that demonstrates the understanding that can develop when people on different sides of an issue lay down their swords and get to know one another. And he helps a lesbian couple renovate an historical downtown theatre that could catalyze the town's economic revitalization - if the community will accept them. The greatest change occurs in Wilson himself as he realizes that while maverick acts such as the publication of his wedding announcement can create a splash, creating lasting change in small towns takes the courage and ongoing commitment of local folks to speak out and live openly. \n \n SCREEN SHOTS","torrent":{"xt":"urn:btih:b5a47d52b4c4eea4ba6f0f3d8f2405f4a0f10f9e","amp;dn":"Out+in+the+Silence+%282009%29+720p+BrRip+x264+-+YIFY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5a47d52b4c4eea4ba6f0f3d8f2405f4a0f10f9e","infoHashBuffer":{"type":"Buffer","data":[181,164,125,82,180,196,238,164,186,111,15,61,143,36,5,244,160,241,15,158]},"announce":[],"urlList":[]}}