{"title":"Kerbal Space Program 0.23.5 ARM NASA mission","uid":9874080,"size":477432300,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b750e140b162b8ae38e36199746004d8c0dc26b8&amp;dn=Kerbal+Space+Program+0.23.5+ARM+NASA+mission&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"Unfawkable","files":-1,"time":1396455904,"description":"READ: This is not mine, I found it. Still haven't checked whether it's legit, but it seems legit to me. Will update once I've tried it out.\n\n\nHere's the changelog:\n\n* New SLS-styled Parts:\n- Size 3 Liquid Fuel + Oxy Tanks, in Full, Half and Quarter-Sized Variants\n- 4x Size 3 Engine Cluster. The single most powerful piece of rocketry we've ever added to KSP.\n- Advanced Size 3 Single-Nozzle Engine, for when you need immense amounts of thrust in your upper stages\n- New Liquid Fuel Booster: A new way to boost your spacecraft, the LFB is a single part featuring twin engines, plus a very respectable amount of fuel. What more, you can even stack more liquid fuel tanks on top of it.\n- The Launch Escape System: Modelled after the Apollo LES, this new escape tower can save your crew should you underestimate the sheer power of your new rockets.\n\n* New Part Joints:\n- Large parts feature a new system that allows them to attach much more rigidly to other parts, eliminating many cases where spamming struts was required.\n- Increased PhysX's global max angular velocity settings to improve joint stability.\n- Angular inertia values for parts now properly scale with mass. Some ships may feel heavier to fly now, but handling feels much more realistic overall. This also improves joint stability a lot.\n- Re-did the Strut Connector joints as well, to use the new joints system instead of their old ones. This dramatically improved their reliability and significantly reduced the number of ocurrences where ships spontaneously disassemble themselves on the launchpad.\n\nNew Features:\n\n* Added new buttons to the Map Filtering panel to filter Unknown and SpaceObject type vessels.\n* Focusing vessels on the Tracking Station will now display their patched conics trajectory.\n* Added Time Warp controls to the Tracking Station and Space Center scenes.\n* Added a button to the Time quadrant in the main flight UI to allow switching betwen Mission Time and Universal Time.\n* Targeted vessels now display their trajectories as patched conics instead of single orbits.\n* Maneuver Nodes are now persistent.\n* Targeted Objects are now persistent.\n* Added buttons to discard/accept maneuvers on the delta-v gauge by the navball.\n* Added buttons to add/remove an orbit to the date of a maneuver node, allowing nodes to be planned for several orbits ahead.\n* Maneuver handles can now be fine-tweaked with the mousewheel when hovering over them.\n* RCS and XenonGas containers on earlier stages are now drained before containers on later stages.\n* Celestial Bodies now show a 'Focus View' button on their context menus in Map View.\n\nBug Fixes and Tweaks:\n\n* Celestial bodies you have an encounter patch with will display that patch in local mode when they are focused on the Map View or Tracking Station.\n* Switching between Linear and Rotation controls in Docking UI mode no longer toggles SAS.\n* Fixed a bug where patched conics on extremely eccentric orbits could break the simulation at very high warp speeds.\n* Fixed incorrect rendering of ascending and descending nodes when targeting a non-closed orbit.\n* Fixed a bug where targeting an object on a hyperbolic orbit wouldn't display rendezvous information on the map.\n* Tweaked the thrust and Isp values of Ion Engines and the two tiny rocket engines. All were severely underpowered to be of any practical use.\n* Quicksaving is now allowed at all times. In unstable situations, an autosave won't be created at the same time.\n* Greatly improved the accuracy of the physics-&gt;rails transition, eliminating drift on nearby vessels when warping during a rendezvous situation, especially high-velocity ones.\n* The Map Filtering buttons now toggle independently on left click, and toggle single/all on right click.\n* Fixed several cases where Kerbals on EVA would glitch out in very painful ways, mostly when the game changed reference frames while they were in ragdoll state.\n* Intersection nodes between orbits no longer 'skip' the closest intersection when placing a maneuver node near the player's position. \n\n\n\nMore about the game at: http://forum.kerbalspaceprogram.com/forum.php","torrent":{"xt":"urn:btih:b750e140b162b8ae38e36199746004d8c0dc26b8","amp;dn":"Kerbal+Space+Program+0.23.5+ARM+NASA+mission","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b750e140b162b8ae38e36199746004d8c0dc26b8","infoHashBuffer":{"type":"Buffer","data":[183,80,225,64,177,98,184,174,56,227,97,153,116,96,4,216,192,220,38,184]},"announce":[],"urlList":[]}}