{"title":"Gulag: A History","uid":15848047,"size":6021371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b83c6bd0ccecb918505ebbaa6b30b8c547709f0a&amp;dn=Gulag%3A+A+History&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"marty14","files":1,"time":1474129588,"description":"Gulag: A History - Anne Applebaum [epub]\r\n\r\nThe Gulag—the vast array of Soviet concentration camps—was a system of repression and punishment whose rationalized evil and institutionalized inhumanity were rivaled only by the Holocaust.\r\n\r\nThe Gulag entered the world’s historical consciousness in 1972, with the publication of Alexander Solzhenitsyn’s epic oral history of the Soviet camps, The Gulag Archipelago. Since the collapse of the Soviet Union, dozens of memoirs and new studies covering aspects of that system have been published in Russia and the West. Using these new resources as well as her own original historical research, Anne Applebaum has now undertaken, for the first time, a fully documented history of the Soviet camp system, from its origins in the Russian Revolution to its collapse in the era of glasnost. It is an epic feat of investigation and moral reckoning that places the Gulag where it belongs: at the center of our understanding of the troubled history of the twentieth century.\r\n\r\nAnne Applebaum first lays out the chronological history of the camps and the logic behind their creation, enlargement, and maintenance. The Gulag was first put in place in 1918 after the Russian Revolution. In 1929, Stalin personally decided to expand the camp system, both to use forced labor to accelerate Soviet industrialization and to exploit the natural resources of the country’s barely habitable far northern regions. By the end of the 1930s, labor camps could be found in all twelve of the Soviet Union’s time zones. The system continued to expand throughout the war years, reaching its height only in the early 1950s. From 1929 until the death of Stalin in 1953, some 18 million people passed through this massive system. Of these 18 million, it is estimated that 4.5 million never returned","torrent":{"xt":"urn:btih:b83c6bd0ccecb918505ebbaa6b30b8c547709f0a","amp;dn":"Gulag%3A+A+History","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b83c6bd0ccecb918505ebbaa6b30b8c547709f0a","infoHashBuffer":{"type":"Buffer","data":[184,60,107,208,204,236,185,24,80,94,187,170,107,48,184,197,71,112,159,10]},"announce":[],"urlList":[]}}