{"title":"Microsoft Office 2007 Multi-Language Proofing Tools SP3 DVD","uid":13959703,"size":925489152,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b847fc98d6b15db2e1c86c6ce08cc5fe4030d40c&amp;dn=Microsoft+Office+2007+Multi-Language+Proofing+Tools+SP3+DVD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":0,"uploader":"jovo_bih","files":1,"time":1458576375,"description":"About this release\r\n\r\nIncludes: Proofing Tools for Office 2007 products (47 languages)\r\nRequirement: at least one Office 2007 product installed\r\n\r\nAbout Microsoft Office 2007 Proofing Tools\r\n\r\nMicrosoft Office 2007 Proofing Tools allows people to edit Office documents in 47 languages.\r\nThese editing tools may include spelling and grammar checkers, thesauruses, and hyphenators.\r\nProofing Tools may also include language-specific editing features such as Language AutoDetect, AutoSummarize, and Intelligent AutoCorrect.\r\n\r\nUsage\r\n\r\n- Mount / burn / extract ISO image\r\n- Install the desired Proofing Tools and restart Office\r\n- Just use the proofing tools as you normally would - you should now see them for your newly installed langauge. For example, you can set your proofing language to the new language to use spell check (if available) - to learn how to do that, see Switch between different languages by setting the proofing language\r\n\r\nDepending on which language you are using, proofing tools can check spelling or grammar, hyphenate text, and look up words in the thesaurus.\r\nYou can switch between proofing tools by selecting a different language for your document.\r\n\r\nSpelling checker\r\nFlags words in a document that may not be spelled correctly and may provide suggested replacements.\r\n\r\nGrammar/Style checker\r\nVerifies written text for grammatical correctness and detects stylistic problems.\r\n\r\nThesaurus\r\nLists synonyms and antonyms of words (if any are available).\r\n\r\nTranslation Dictionaries\r\nAllows you to translate single words or short phrases.\r\n\r\nAutoCorrect List\r\nFixes typos and misspelled words and inserts symbols and other pieces of text.\r\n\r\nHyphenator\r\nAutomatically breaks words at the end of lines and adds hyphens to help justify text within a line.\r\n\r\nContextual Speller\r\nFlags words that are spelled correctly but are not the correct words in the given context.\r\n\r\nPlease be nice, seed for a while ...\r\nThanks !","torrent":{"xt":"urn:btih:b847fc98d6b15db2e1c86c6ce08cc5fe4030d40c","amp;dn":"Microsoft+Office+2007+Multi-Language+Proofing+Tools+SP3+DVD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b847fc98d6b15db2e1c86c6ce08cc5fe4030d40c","infoHashBuffer":{"type":"Buffer","data":[184,71,252,152,214,177,93,178,225,200,108,108,224,140,197,254,64,48,212,12]},"announce":[],"urlList":[]}}