{"title":"DALE CARNEGIE - The 5 Essential People Skills: How to Assert You","uid":8906391,"size":442345590,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b87f3bbe137e26e6ba5e318af10699b17a7a7288&amp;dn=DALE+CARNEGIE+-+The+5+Essential+People+Skills%3A+How+to+Assert+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":0,"uploader":"leopardog","files":59,"time":1378916759,"description":"The 5 Essential People Skills: How to Assert Yourself, Listen to Others, and Resolve Conflicts by Dale Carnegie\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/1416595481/4353-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/1416595481/4353-20&lt;/a&gt;\n\nM4A FORMAT\n\n PUT THESE FIVE ESSENTIAL SKILLS TO WORK AND BEGIN YOUR TRANSFORMATION!\n\nHave you ever walked away from a conversation full of doubts and insecurities? Do you feel as if you've lost a little ground after every staff meeting? Most of us are either too passive or too aggressive in our business life, and we end up never getting the support, recognition, or respect we desire.\n\nThe business leaders and trainers from Dale Carnegie Training have discovered that applying appropriate assertiveness to all your interactions is the most effective approach to creating a successful career. The 5 Essential People Skills will help you be the most positively commanding, prosperous, and inspired professional you can be. You will learn how to:\n\nRelate to the seven major personality types\n\nLive up to your fullest potential while achieving personal success\n\nCreate a cutting-edge business environment that delivers innovation and results\n\nUse Carnegie's powerhouse five-part template for articulate communications that grow business\n\nResolve any conflict or misunderstanding by applying a handful of proven principles\n\nOnce you master these powerful skills, you will be well on your way to a new level of professional and personal achievement.","torrent":{"xt":"urn:btih:b87f3bbe137e26e6ba5e318af10699b17a7a7288","amp;dn":"DALE+CARNEGIE+-+The+5+Essential+People+Skills%3A+How+to+Assert+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b87f3bbe137e26e6ba5e318af10699b17a7a7288","infoHashBuffer":{"type":"Buffer","data":[184,127,59,190,19,126,38,230,186,94,49,138,241,6,153,177,122,122,114,136]},"announce":[],"urlList":[]}}