{"title":"Maurice Maeterlinck - Nobel Prize in Literature, 1911 (8 books)","uid":15928874,"size":21692888,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b89a10ba457907b49ed1ce36486e40fbcaa90264&amp;dn=Maurice+Maeterlinck+-+Nobel+Prize+in+Literature%2C+1911+%288+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":3,"uploader":"workerbee","files":13,"time":1475337609,"description":"MAURICE MAETERLINCK (1862-1949) was a Belgian playwright, poet, and essayist who was a Fleming, but wrote in French.  He was awarded the 1911 Nobel Prize in Literature &quot;in appreciation of his many-sided literary activities, and especially of his dramatic works, which are distinguished by a wealth of imagination and by a poetic fancy, which reveals, sometimes in the guise of a fairy tale, a deep inspiration, while in a mysterious way they appeal to the readers' own feelings and stimulate their imaginations.&quot;\n\nMaeterlinck was primarily a writer of Symbolist lyrical dramas.  His first verse collection, &quot;Hothouses&quot;, and his first play, &quot;Princess Maleine&quot;, were published in 1889.  Maeterlinck made a dramatic breakthrough in 1890 with two one-act plays, &quot;The Intruder&quot; and &quot;The Blind&quot;.  His love drama &quot;Pelléas and Mélisande&quot; (1892) is the unquestioned masterpiece of Symbolist drama and provided the basis for the opera by Claude Debussy.  Set in a nebulous, fairy-tale past, the play conveys a mood of hopeless melancholy and doom in its story of the destructive passion of Princess Mélisande, who falls in love with her husband's younger brother, Pelléas.  Only &quot;The Blue Bird&quot; (1908) rivaled &quot;Pelléas and Mélisande&quot; in popularity.  An allegorical fantasy conceived as a play for children, it portrays a search for happiness in the world.\n\nIn his plays, Maeterlinck used poetic speech, gesture, lighting, setting, and ritual to create images that reflect his characters' moods and dilemmas.  Often the protagonists are waiting for something mysterious and fearful that will destroy them; they have no foresight and only a limited understanding of themselves or the world around them.  As a dramatist, Maeterlinck influenced Hugo von Hofmannsthal, W.B. Yeats, John Millington Synge, and Eugene O'Neill.\n\nMaeterlinck's prose writings are remarkable blends of mysticism, occultism, and interest in the world of nature.  His most widely read prose writings are two extended essays: THE LIFE OF THE BEE (1901), a lively overview of my species' intricate architectural skills and their intrinsic sense of self-sacrifice; and THE INTELLIGENCE OF FLOWERS (1907), in which Maeterlinck argues that flowers possess the power of thought without knowledge, a capacity that constitutes a form of intelligence. \n\nThe following books are in PDF format unless otherwise noted:\n\n* Intelligence of Flowers, The (SUNY, 2008).  Translated and with an Introduction by by Philip Mosley.\n\n* Life of the Bee, The (Mentor, 1954).  Translated by Alfred Sutro, with an Introduction by Edwin Way Teale.\n\n* Life of the Bee, The (Dodd Mead, 1901).  Translated by Alfred Sutro. -- ePUB\n\n* Maeterlinck Reader, A: Plays, Poems, Short Fiction, Aphorisms, and Essays (Peter Lang, 2011).  Edited and translated by David Willinger and Daniel Gerould.\n\n* Nobel Prize Library: Maurice Maeterlinck (Nobel Foundation, 1971).  Includes the play &quot;The Blue Bird&quot;, translated by Alexander Teixeira de Mattos.\n\n* On Emerson and Other Essays (Dodd Mead, 1912).  Translated by Montrose J. Moses.\n\n* Thoughts from Maeterlinck (Dodd Mead, 1912).  Chosen and arranged by E.S.S.\n\n* Wisdom and Destiny (Dodd Mead, 1902).  Translated by Alfred Sutro.\n\n\n==&gt; Many thanks to @SECTOR for your kind help! &lt;==\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n \nhttps://pirates-forum.org/User-workerbee  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:b89a10ba457907b49ed1ce36486e40fbcaa90264","amp;dn":"Maurice+Maeterlinck+-+Nobel+Prize+in+Literature%2C+1911+%288+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b89a10ba457907b49ed1ce36486e40fbcaa90264","infoHashBuffer":{"type":"Buffer","data":[184,154,16,186,69,121,7,180,158,209,206,54,72,110,64,251,202,169,2,100]},"announce":[],"urlList":[]}}