{"title":"Cisco VPN Configuration Guide - 1st Ed (2014).pdf Gooner","uid":13191406,"size":9357982,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b908c30e566bebc331f67d4562d3b43e55baf308&amp;dn=Cisco+VPN+Configuration+Guide+-+1st+Ed+%282014%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1452440411,"description":"Cisco VPN Configuration Guide - Step-By-Step Configuration of Cisco VPNs for ASA and Routers - 1st Edition (2014).pdf Gooner\r\n\r\nPublisher: CreateSpace Independent Publishing Platform; 1 edition (July 23, 2014)\r\nLanguage: English\r\nISBN-10: 1500522902\r\nISBN-13: 978-1500522902\r\n\r\nBecome an expert in Cisco VPN technologies with this practical and comprehensive configuration guide. Learn how to configure IPSEC VPNs (site-to-site, hub-and-spoke, remote access), SSL VPN, DMVPN, GRE, VTI etc.\r\n\r\nThis book is packed with step-by-step configuration tutorials and real world scenarios to implement VPNs on Cisco ASA Firewalls (v8.4 and above and v9.x) and on Cisco Routers. It is filled with raw practical concepts, around 40 network diagrams to explain the scenarios, troubleshooting instructions, 20 complete configurations on actual devices and much more. Both beginners and experts will find some golden nuggets inside this practical guide.\r\n\r\nEvery Cisco Networking Professional in this planet will have to configure some kind of VPN sooner or later in his/her professional career. This VPN Guide, therefore, will be a great reference for years to come.\r\n\r\nSome of the topics covered include the following:\r\n\r\n* Policy-Based (IPSEC) and Route-Based VPNs (Comparison and Applications).\r\n* Practical Applications of each VPN Technology.\r\n* Configuration of Site-to-Site, Hub-and-Spoke and Remote Access IPSEC VPNs on Cisco Routers.\r\n* Configuration of Route-Based VPNs using GRE, Static VTI, Dynamic VTI.\r\n* Configuration of Dynamic Multipoint VPN (DMVPN) on Cisco Routers.\r\n* Configuration of PPTP VPNs on Cisco Routers.\r\n* Configuration of Site-to-Site and Hub-and-Spoke IPSEC VPNs (including IKEv2 IPSEC) on Cisco ASA Firewalls.\r\n* Configuration of Remote Access IPSEC VPN and Anyconnect SSL VPN on Cisco ASA Firewalls.\r\n* VPN Authentication using Active Directory, RSA Server and external AAA Server.\r\n* PLUS MUCH MORE\r\n\r\nIn addition to the most popular VPN topologies and scenarios, the book contains also some special cases for which you will not find information easily anywhere else.\r\n\r\nSome special cases and scenarios included in the book:\r\n\r\n* VPNs with sites having dynamic public IP address.\r\n* Implementations of hub-and-spoke together with remote access VPNs on the same device.\r\n* Using Dynamic Routing Protocols (EIGRP) to make VPNs on Routers more scalable.\r\n* Spoke to Spoke communication via the Hub Site (using VPN Hairpinning on ASA).\r\n* Remote Access users to communicate with Spoke sites via the Hub (using VPN Hairpinning on ASA).\r\n* Site-to-Site IPSEC VPN with duplicate subnets on the two sites.\r\n* IPSEC VPN Failover with backup ISP","torrent":{"xt":"urn:btih:b908c30e566bebc331f67d4562d3b43e55baf308","amp;dn":"Cisco+VPN+Configuration+Guide+-+1st+Ed+%282014%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b908c30e566bebc331f67d4562d3b43e55baf308","infoHashBuffer":{"type":"Buffer","data":[185,8,195,14,86,107,235,195,49,246,125,69,98,211,180,62,85,186,243,8]},"announce":[],"urlList":[]}}