{"title":"Andrei Tarkovsky - Stalker 1979[PT][PTbr][ENG][SPA][sonicalchemy","uid":3947923,"size":1468119289,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b9681a85b6bb075cb2b9a0682653886240ba84aa&amp;dn=Andrei+Tarkovsky+-+Stalker+1979%5BPT%5D%5BPTbr%5D%5BENG%5D%5BSPA%5D%5Bsonicalchemy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":2,"uploader":"sonicalchemy","files":10,"time":1198650373,"description":"Russian director Andrei Tarkovsky\\&amp;#039;s Stalker, an allegorical science fiction film like his earlier Solaris, was adapted from the novel Picnic by the Roadside by brothers Boris Strugatsky and Arkady Strugatsky. The film follows three men -- the Writer (Nikolai Grinko), the Scientist (Anatoliy Solonitsyn), and the Stalker (Alexander Kaidanovsky) -- as they travel through a mysterious and forbidden territory in the Russian wilderness called the \\&quot;Zone\\&quot;. In the Zone, nothing is what it seems. Objects change places, the landscape shifts and rearranges itself. It seems as if an unknown intelligence were actively thwarting any attempt to penetrate its borders. In the Zone, there is said to be a bunker, and in the bunker: a magical room which has the power to make wishes come true. The Stalker is the hired guide for the journey who has, through repeated visits to the Zone, become accustomed to its complex traps, pitfalls, and subtle distortions. Only by following his lead (which often involves taking the longest, most frustrating route) can the Writer and the Scientist make it alive to the bunker and the room. As the men travel farther into the Zone, they realize it may take something more than just determination to succeed: it may actually take faith. Increasingly unsure of their deepest desires, they confront the room wondering if they can, in the end, take responsibility for the fulfillment of their own wishes.\n\nTarkovsky remains, without question, one of the ultimate masters of the cinematic medium; a creator of deeply felt poetic ruminations on life, love, art and the metaphysical equations that fall somewhere beyond our grasp. He is/was a cinematic genius to rival both Bergman and Kieslowski, and his best films, like Andrei Rublev, Mirror, Nostalgia and The Sacrifice, are masterworks, fit to be filed away in the vaults marked \\&quot;absolute classic masterpieces: vol. 1\\&quot;. Although Stalker lacks the more enchanting or ethereal moments of those milestones, it still represents Takovsky\\&amp;#039;s ability to construct a deep and enriching story that plays as much off character detail and cinematic design as it does from notions of philosophy and mystical excess. By this point in his career, Tarkovsky had already dabbled in the broader notions of science fiction cinema with Solyaris, a film that I have always seen as the director\\&amp;#039;s great failure... because it showed Tarkovsky trying too hard to conform to the rigid restrictions of Lem\\&amp;#039;s watershed tome, therefore, obliterating the deep, poetic ambience that his previous film (Rublev) and later works (Mirror, Nostalgia) would so effortlessly create.\nTo some extent, Stalker is more like his masterpiece Mirror than the cold sci-fi of Solyaris, as it employs a more elliptical narrative that at times fractures beyond the point of clarity. We also see the same focus on a varying ensemble of characters, metaphysical alienation, internal and external use of emotional monologues, and one of the most amazing uses of cinematography ever seen. Here, the camera inhabits a different world to the characters, and, like other Tarkovsky films, somehow becomes an equal explorer; slowly moving away from the action to examine the location, the mood, and the relevance of the moment. With Tarkovsky, the camera is always relevant to the feel of the film... this affects his use of movement, composition, colour and contrast. Here, black and white and defused colour are inter-cut, to differentiate the strange power of the zone (central to the plot) in comparison to the bleak, desolate despair of the \\&quot;real-world\\&quot;. The opening sequences of the film set up an atmosphere of dense, post-apocalyptic industrial dejection that establishes the universe of the film better than any written exposition ever could... whilst the camera, with it\\&amp;#039;s deep black and white austerity, explores the decaying city and charred human remains in the same way in which von Trier\\&amp;#039;s camera would in the later, Tarkovsky-influenced, The Element of Crime.\nLike that film, the plot here seems simple... however, if we scratch beneath the surface, we will find a multitude of hidden depths and sub-textual theories that branch off from that central narrative arc. In the film, the world has been ravaged by some terrible (nuclear?) atrocity that has left much of the country segregated. Because of a strong chance of infection, the fall-out area of this accident has been labelled \\&quot;the zone\\&quot; and is now heavily guarded by police and government officials. It is said that there is a sanctum hidden deep within the zone that was formed (perhaps) by mystical extraterrestrials (or whatever it was that caused such devastation) that will grant those brave enough to discover it their ultimate wish. This, of course, leads to curiosity, and those who desire entrance into the zone must seek the aid of the stalkers... men on the fringes of society, familiar with the workings of the zone, and courageous (or desperate?) enough to smuggle in \\&quot;tourists\\&quot; for a substantial fee. The stalker here is a classic Tarkovsky character - a world away from the typical hero (or anti-hero) that you would find in most sci-fi films - a man of great sadness and bouts of philosophical reflection who, when not risking his life by entering the zone, lives in a dilapidated shack with his dejected wife and psychic daughter.\nAs with much of Tarkovsky\\&amp;#039;s work, the central concept of the film is more of an excuse for philosophical rambling and metaphorical dream-logic as opposed to the usual sci-fi hallmarks like explosions and cheep effects. Instead, he uses space and location in a way that is absolutely amazing, drawing on the idea of an architectural narrative as he would with Nostalgia, so that the approach to the lighting, cinematography and style of the performance is dictated by the design of the location. He also takes on Godard\\&amp;#039;s approach to sci-fi from Alphaville, with the present day filling in for the not to distant future (though here we see a much more expressionistic approach that puts emotional texture above post-modernist style). His uses of location are amazing, and the influence of this technique can be seen on everyone from Spielberg, to Winterbottom, to the abovementioned von Trier... however, the texture that Tarkovsky creates just simply cannot be copied. In this film, we see the interplay between the poetic and the philosophical, with the conflict between the writer and the scientist germane to the plot, mirrored in the external conflict between the elements of the script (science versus religion, etc). It\\&amp;#039;s intelligent stuff... and beautifully handled by the filmmakers.\nOne could argue that Stalker perhaps lacks the emotional transcendence of his previous Mirror, or the deft narrative layering of the later Nostalgia... though the initial combination of science-fiction theatricality with art-house sensibilities is never less than impressive. It also has one of the dirtiest and most oppressive visual designs that I have ever seen (more so than other dingy delights like Europa, Delicatessen and the films of David Fincher), which, suffice to say, fits the pacing of the film perfectly. It is true, I suppose, that some viewers may feel put off by the snail-like pace or the continual jumps in both narrative and character (something prevalent in all this filmmaker\\&amp;#039;s works), but those who are willing to travel with the Stalker will no doubt discover the film\\&amp;#039;s innumerable, magical and thought-provoking pleasures, hidden deep within the zone.\n\nBy Clive Winston\n\nEl film estÃƒ?Ã‚Â¡ basado en un relato de ciencia ficciÃƒ?Ã‚Â³n Picnic a la vera del camino, de los escritores rusos, los hermanos Arkady y Boris Strugatski. Stalker es un hombre, aparentemente rÃƒ?Ã‚Âºstico, cuyo oficio es hacer entrar a forasteros curiosos en La zona, una regiÃƒ?Ã‚Â³n envuelta en el enigma donde se cree que descendiÃƒ?Ã‚Â³ una nave extraterrestre. La Zona permanece sometida a una estricta custodia policial. Stalker sabe cÃƒ?Ã‚Â³mo vulnerar esa vigilancia\n\n\n\nNinguÃƒ?Ã‚Â©m sabia explicar o surgimento de uma zona misteriosa em nosso planeta. Seria efeito de um meteorito ou provocado por alienÃƒ?Ã‚Â­genas? Casas abandonadas, tanques enferrujados e cobertos pela vegetaÃƒ?Ã‚Â§Ãƒ?Ã‚Â£o eram testemunhas silenciosas daqueles que tentaram desvendar o segredo pela forÃƒ?Ã‚Â§a. Apesar do perigo do isolamento decretado pelo governo, muitos tentam entrar pois acreditam que lÃƒ?Ã‚Â¡ encontrarÃƒ?Ã‚Â£o um local onde todos desejos sÃƒ?Ã‚Â£o concedidos. Somente alguns marginais conhecidos como \\&quot;Stalkers\\&quot;, sabiam evitar as armadilhas espalhadas por todos os lados e penetrar nesta Zona. Um Stalker, guia um cientista e um escritor que querem desvendar o mistÃƒ?Ã‚Â©rio, mas para isso terÃƒ?Ã‚Â£o que enfrentar terrÃƒ?Ã‚Â­veis provocaÃƒ?Ã‚Â§Ãƒ?Ã‚Âµes.\nConsiderado um dos melhores filmes de ficÃƒ?Ã‚Â§Ãƒ?Ã‚Â£o cientÃƒ?Ã‚Â­fica de todos os tempos.\n\nStalker - 1979 - (Stalker)\nColorido - 134 min. - Fullscreen (4:3)\n\nDirected by\nAndrei Tarkovsky\nProduced by\nAleksandra Demidova\nWritten by\nArkadi Strugatsky\nBoris Strugatsky\nStarring\nAlexander Kaidanovsky\nAnatoli Solonitsyn\nNikolai Grinko\nMusic by\nEduard Artemyev\nDistributed by\nMosfilm\nRelease date(s)\nAugust 1979 (Soviet Union)\nRunning time\n163 min\nLanguage\nRussian\n\nDisc 1 XvidAvi/mp3 audio\nFramerate 29.970\nResolution 624X432\n1420kbps\nSamplerate 48khz\nRussian (AC3) 5.1ch - Dolby Pro Logic II\nBitrate 128kbps\n700mb\n\nDisc 2 XvidAvi/mp3 audio\nFramerate 29.970\nResolution 624X432\n920kbps\nSamplerate 48khz\nRussian (AC3) 5.1ch - Dolby Pro Logic II\nBitrate 128kbps\n700mb\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0079944/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0079944/&lt;/a&gt;\n\n[ENG][ESP][PT][PTbr] subtitles\n\nPlease cooperate and leave it seeding at least 2 times\n\nCoopere, deixe semeando ao menos duas vezes o tamanho do arquivo que baixar\n\nThis is the best quality rip I have done IMO\n\nEnjoy!! Apreciem!!\n\nsonicalchemy","torrent":{"xt":"urn:btih:b9681a85b6bb075cb2b9a0682653886240ba84aa","amp;dn":"Andrei+Tarkovsky+-+Stalker+1979%5BPT%5D%5BPTbr%5D%5BENG%5D%5BSPA%5D%5Bsonicalchemy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9681a85b6bb075cb2b9a0682653886240ba84aa","infoHashBuffer":{"type":"Buffer","data":[185,104,26,133,182,187,7,92,178,185,160,104,38,83,136,98,64,186,132,170]},"announce":[],"urlList":[]}}