{"title":"An Introduction to Information Theory (2nd Ed.), by J. R. Pierce","uid":15807951,"size":20094890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9dc296250d7819da37ccabaaf3c053a13a35424&amp;dn=An+Introduction+to+Information+Theory+%282nd+Ed.%29%2C+by+J.+R.+Pierce&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":1,"uploader":"bey0nd","files":4,"time":1473590858,"description":"An Introduction to Information Theory: Symbols, Signals and Noise (2nd Edition)\r\n\r\nBehind the familiar surfaces of the telephone, radio, and television lies a sophisticated and intriguing body of knowledge known as information theory. This is the theory that has permitted the rapid development of all sorts of communication, from color television to the clear transmission of photographs from the vicinity of Jupiter. Even more revolutionary progress is expected in the future.\r\n\r\nTo give a solid introduction to this burgeoning field, J. R. Pierce has revised his well-received 1961 study of information theory for a second edition. Beginning with the origins of the field, Dr. Pierce follows the brilliant formulations of Claude Shannon and describes such aspects of the subject as encoding and binary digits, entropy, language and meaning, efficient encoding, and the noisy channel. He then goes beyond the strict confines of the topic to explore the ways in which information theory relates to physics, cybernetics, psychology, and art. \r\n\r\nMathematical formulas are introduced at the appropriate points for the benefit of serious students. A glossary of terms and an appendix on mathematical notation are proved to help the less mathematically sophisticated.\r\n\r\nJ. R. Pierce worked for many years at the Bell Telephone Laboratories, where he became Director of Research in Communications Principles. His Introduction to Information Theory continues to be the most impressive nontechnical account available and a fascinating introduction to the subject for lay readers.\r\n\r\n====================================\r\nFile types: PDF / DjVu / ePub / mobi\r\nPaperback: 336 pages\r\nPublisher: Dover Publications; 2nd Revised ed. (November 1980)\r\nLanguage: English\r\nISBN-10: 0486240614\r\nISBN-13: 978-0486240619","torrent":{"xt":"urn:btih:b9dc296250d7819da37ccabaaf3c053a13a35424","amp;dn":"An+Introduction+to+Information+Theory+%282nd+Ed.%29%2C+by+J.+R.+Pierce","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9dc296250d7819da37ccabaaf3c053a13a35424","infoHashBuffer":{"type":"Buffer","data":[185,220,41,98,80,215,129,157,163,124,202,186,175,60,5,58,19,163,84,36]},"announce":[],"urlList":[]}}