{"title":"The Second Machine Age (2014) E. Brynjolfsson, A. McAfee (multi)","uid":9540530,"size":2936005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9edcd2417ab2cdd13d9f958939695521299431e&amp;dn=The+Second+Machine+Age+%282014%29+E.+Brynjolfsson%2C+A.+McAfee+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":4,"uploader":"7","files":-1,"time":1391033915,"description":"The Second Machine Age: Work, Progress, and Prosperity in a Time of Brilliant Technologies (2014) Erik Brynjolfsson, Andrew McAfee (multi) \n\n\nThe Second Machine Age: Work, Progress, and Prosperity in a Time of Brilliant Technologies by Erik Brynjolfsson, Andrew McAfee\n\n\nFormat: mobi/epub/azw3\nLength: 321 pages\nGenre: Non-Fiction/Computers &amp; Technology\nDate: 20 January 2014\n\nHow we build, use, and live with our digital creations will define our success as a civilization in the twenty-first century. Will our new technologies lift us all up or leave more and more of us behind?\n\nIn recent years, Google's autonomous cars have logged thousands of miles on American highways and IBM's Watson trounced the best human Jeopardy! players. Digital technologies--with hardware, software, and networks at their core--will in the near future diagnose diseases more accurately than doctors can, apply enormous data sets to transform retailing, and accomplish many tasks once considered uniquely human.\n\nIn The Second Machine Age MIT's Erik Brynjolfsson and Andrew McAfee reveal the forces driving the reinvention of our lives and our economy. As the full impact of digital technologies is felt, we will realize immense bounty in the form of dazzling personal technology, advanced infrastructure, and near-boundless access to the cultural items that enrich our lives.\n\nAmid this bounty will also be wrenching change. Professions of all kinds--from lawyers to truck drivers--will be forever upended. Companies will be forced to transform or die. Recent economic indicators reflect this shift: fewer people are working, and wages are falling even as productivity and profits soar.\n\nAuthors:\n\nErik Brynjolfsson is the director of the MIT Center for Digital Business and one of the most cited scholars in information systems and economics. Andrew McAfee is a principal research scientist at the MIT Center for Digital Business and the author of Enterprise 2.0.\n\n","torrent":{"xt":"urn:btih:b9edcd2417ab2cdd13d9f958939695521299431e","amp;dn":"The+Second+Machine+Age+%282014%29+E.+Brynjolfsson%2C+A.+McAfee+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9edcd2417ab2cdd13d9f958939695521299431e","infoHashBuffer":{"type":"Buffer","data":[185,237,205,36,23,171,44,221,19,217,249,88,147,150,149,82,18,153,67,30]},"announce":[],"urlList":[]}}