{"title":"Team Umizoomi Season 3 COMPLETE","uid":9764359,"size":6862018656,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ba3d8772ab49a62c28db33780802b97fe4252d59&amp;dn=Team+Umizoomi+Season+3+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":14,"uploader":"Timdogg","files":-1,"time":1394860213,"description":"&quot;Cuckoo Bears&quot; October 13, 2011 (2011-10-13) 30\nTeam Umizoomi can t wait to meet their favorite band The Cuckoo Bears, three mechanical bears that lives inside the Umi City Cuckoo Clock and perform every hour when the clock strikes 12. But when the Cuckoo Bears lose the gears that give them their power, it s up to their heroic fans to fix them before the clock strikes 12\n\n&quot;Stompasaurus&quot; January 17, 2012 (2012-01-17) 302\nThe team s friend Wyatt is getting a new Stompasaurus toy delivered. But when the delivery truck drives down a bumpy road, the toy s pieces go flying all over Umi City. Team Umizoomi sets out to retrieve the pieces and return them to Wyatt\n\n&quot;Job Well Done! &quot; January 18, 2012 (2012-01-18) 303\nTeam Umizoomi s friend David is saving his allowance to buy a cool Red Racer Bike, which is actually very expensive. Milli, Geo and Bot take on different jobs around the city to help David earn enough UmiDollars to buy the bike\n\n&quot;Rainy Day Rescue &quot; January 19, 2012 (2012-01-19) 304\nOn a rainy day in Umi City, the rainwater washes a nest of baby birds out of their tree. Team Umizoomi must splash their way through a water pipe, a muddy park, and a street river to rescue them\n\n&quot;Team Umizoomi VS. The Shape Bandit &quot; January 20, 2012 (2012-01-20) 305\nThere s a The Shape Bandit on the loose and he s taking shapes from all over Umi City. But when he takes Geo s Shape Belt, he has just crossed the line with the wrong team. Now it s up to Team Umizoomi to get Geo s Shape Belt back and save Umi City from falling apart\n\nNote: This is a hour long episode\n\n45 3 &quot;Shooting Star&quot; April 27, 2012 (2012-04-27) 307\nShooting Star is the tiniest horse at the ranch. More than anything he wants to be big like the other horses, so he can help out around the ranch. Feeling bad for him and wanting to help, Team Umizoomi takes Shooting Star on a mission to find four magical horseshoes that will make him grow\n\n&quot;Presto's Magic House &quot; May 18, 2012 (2012-05-18) 312\nTeam Umizoomi's morning routine is interrupted when Presto the Magician accidentally puts his wand in the washing machine, magic bubbles fill the laundry room, and Presto gets trapped inside of one. It s up to the trio to travel through Presto s now crazy-magic-infested house to rescue him\n\n&quot;DoorMouse in Space &quot; May 25, 2012 (2012-05-25) 314\nWhen DoorMouse accidentally gets launched into outer space, it's up to Team Umizoomi to save him. Milli, Geo and Bot must travel past meteors, space aliens and special stars to rescue DoorMouse in time. But they have to hurry before DoorMouse's rocket crashes on Mars\n\n&quot;Umi Sports Games &quot; August 13, 2012 (2012-8-13) 308\nTeam Umizoomi is playing in the biggest sports event around - the Umi Games. But to win the Umi Games Trophy, Milli, Geo and Bot will have to defeat the Sports Robots in each event\n\n&quot;The Kitty Rescue&quot; September 14, 2012 (2012-09-14) 317 Jonathan's kitten, Brownie is stuck inside a well and she can't get out. Team Umizoomi navigates their way down a river, across a farm and over a mountain to get to Jonathan's house to rescue her\n\n&quot;The Great Shape Race&quot; September 28, 2012 (2012-09-28) 310\nUmi-Car and Dump Truck are in a race to the top of Shape Mountain to see who will win the big prize... a magic Dodecahedron, which can give them the power to fly. But Milli, Geo, and Bot needs to keep an eye on Dump Truck; he'll stop at nothing to win\n\n&quot;Animal School House&quot; October 1, 2012 (2012-10-1) 320\nTen of Farmer Dan's animals are missing from his farm. Team Umizoomi finds them inside the Umi City School. The trio goes on an adventure all over the school to search for the mice, chickens, pigs and one stubborn donkey, so they can take them back to the farm where they belong\n\n&quot;Doctor Bot&quot; October 2, 2012 (2012-10-2) 319\nWhen the team's friend Mike falls off his scooter and scrapes his knee, it's Dr. Bot to the rescue. They sets off to the playground to deliver a bandage to Mike, while they remedy tricky situations along the way\n\n&quot;Boardwalk Games!&quot; October 3, 2012 (2012-10-3) 311\nThe team's friend Ryan wants to win the High-Flyer Helicopter at the Boardwalk Carnival, but it costs 27 tickets. Milli, Geo and Bot split up to play the carnival games to earn tickets so Ryan can get the helicopter\n\n&quot;Lost and Found Toys&quot; October 4, 2012 (2012-10-4) 316\nMilli, Geo, and Bot must return three lost toys to their glum friends: Jonathan, Mike, and Renee\n\n&quot;Let's Play Math Dragons!&quot; December 3, 2012 (2012-12-3) 313\nGeo shows Milli and Bot his favorite video game, Math Dragons, where they can play inside the game. To win, they have to journey through three exciting levels and collect all the baby dragon eggs\n\n&quot;Haircut Hijinx&quot; December 4, 2012 (2012-12-4) 309\nAfter Milli and Geo get their haircuts, the team's friend Owen is really excited; he's about to get a haircut. But when Owen's money blows away, the brave trio sets out on a hairy adventure to get it back\n\n&quot;The Umi City Treasure Hunt&quot; December 5, 2012 (2012-12-5) 318\nWhile playing pirates, Team Umizoomi meets their friend Square Beard the Pirate, who gives them the map to the lost treasure of Umi-City. Along with Umi-Pirate Ship, the pirate team go to find the three keys to unlock the mysterious lost treasue of Umi-City\n\n&quot;A Sledding Snow Day&quot; December 6, 2012 (2012-12-6) 315\nOnce again, it is snowing in Umi City. Casey is desperate to go sledding, but there's a problem; she doesn't have a sled. Milli, Geo and Bot must embark on a snowy journey through Umi City to bring Umi-sled to Casey before sunset because no one can sled after dark \n\nFormat                                   : AVI\nFormat/Info                              : Audio Video Interleave\nFile size                                : 309 MiB\nDuration                                 : 23mn 5s\nOverall bit rate                         : 1 873 Kbps\n\nVideo\nID                                       : 0\nFormat                                   : MPEG-4 Visual\nFormat profile                           : Simple@L3\nFormat settings, BVOP                    : No\nFormat settings, QPel                    : No\nFormat settings, GMC                     : No warppoints\nFormat settings, Matrix                  : Default (H.263)\nCodec ID                                 : XVID\nCodec ID/Hint                            : XviD\nDuration                                 : 23mn 5s\nBit rate                                 : 1 534 Kbps\nWidth                                    : 720 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 3:2\nFrame rate                               : 30.000 fps\nStandard                                 : NTSC\nColor space                              : YUV\nChroma subsampling                       : 4:2:0\nBit depth                                : 8 bits\nScan type                                : Progressive\nCompression mode                         : Lossy\nBits/(Pixel*Frame)                       : 0.148\nStream size                              : 253 MiB (82%)\nWriting library                          : XviD 1.2.1 (UTC 2008-12-04)\n\nAudio\nID                                       : 1\nFormat                                   : MPEG Audio\nFormat version                           : Version 1\nFormat profile                           : Layer 3\nMode                                     : Joint stereo\nMode extension                           : MS Stereo\nCodec ID                                 : 55\nCodec ID/Hint                            : MP3\nDuration                                 : 23mn 5s\nBit rate mode                            : Constant\nBit rate                                 : 320 Kbps\nChannel(s)                               : 2 channels\nSampling rate                            : 48.0 KHz\nCompression mode                         : Lossy\nStream size                              : 52.9 MiB (17%)\nAlignment                                : Aligned on interleaves\nInterleave, duration                     : 24 ms (0.72 video frame)\nWriting library                          : LAME3.98.2\n\n\nthank the original uploader","torrent":{"xt":"urn:btih:ba3d8772ab49a62c28db33780802b97fe4252d59","amp;dn":"Team+Umizoomi+Season+3+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba3d8772ab49a62c28db33780802b97fe4252d59","infoHashBuffer":{"type":"Buffer","data":[186,61,135,114,171,73,166,44,40,219,51,120,8,2,185,127,228,37,45,89]},"announce":[],"urlList":[]}}