{"title":"The Self Improvement Ebook Collection   (epub/mobi)","uid":6825940,"size":767918782,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba5a5a6c7a63d87edd684d47d423a1af8a79df28&amp;dn=The+Self+Improvement+Ebook+Collection+++%28epub%2Fmobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":5,"uploader":"neil1966hardy","files":1173,"time":1321562468,"description":"Brought to you from the Digital Librarian:\n\n\n    How - Dov Seidman\n    A Point in Time: The Search for Redemption in This Life and the Next - David Horowitz\n    How We Decide - Jonah Lehrer\n    Unthinkable: Who Survives When Disaster Strikes - and Why - Amanda Ripley\n    Mental Traps: The Overthinker's Guide to a Happier Life - AndrÃƒÆ’Ã‚Â© Kukla\n    Decoding Love - Andrew Trees\n    Bright-Sided: How Positive Thinking Is Undermining America - Barbara Ehrenreich\n    The Bro Code - Barney Stinson, Matt Kuhn\n    I Thought It Was Just Me: Women Reclaiming Power and Courage in a Culture of Shame - Brene Brown, Bren? Brown\n    What Should I Do With the Rest of My Life? - Bruce Frankel\n    The Art of Conversation - Catherine Blyth\n    Switch - Chip Heath, Dan Heath\n    Clark Howard's Living Large in Lean Times: 250+ Ways to Buy Smarter, Spend Smarter, and Save Money - Clark Howard, Mark Meltzer\n    Cognitive Surplus: Creativity and Generosity in a Connected Age - Clay Shirky\n    Earthing: The Most Important Health Discovery Ever? - Clinton Ober, Stephen T. Sinatra, Martin Zucker\n    Arrest-Proof Yourself: An Ex-Cop Reveals How Easy It Is for Anyone to Get Arrested, How Even a Single Arrest Could Ruin Your Life, and What to Do if the Police Get in Your Face - Dale C. Carson, Wes Denham\n    How to Win Friends and Influence People - Dale Carnegie\n    The Upside of Irrationality - Dan Ariely\n    It Gets Better: Coming Out, Overcoming Bullying, and Creating a Life Worth Living - Dan Savage, Terry Miller\n    Stumbling on Happiness - Daniel Gilbert\n    Ecological Intelligence: How Knowing the Hidden Impacts of What We Buy Can Change Everything - Daniel Goleman\n    Social Intelligence - Daniel Goleman\n    A Whole New Mind: Why Right-Brainers Will Rule the Future - Daniel H. Pink\n    Drive: The Surprising Truth About What Motivates Us - Daniel H. Pink\n    Mindsight: The New Science of Personal Transformation - Daniel J. Siegel\n    The 100 Thing Challenge - Dave Bruno\n    Beyond Stammering - Dave McGuire\n    Getting Things Done - David Allen\n    Out of Character: Surprising Truths About the Liar, Cheat, Sinner (And Saint) Lurking in All of Us - David DeSteno, Piercarlo Valdesolo\n    100 Simple Secrets of Happy People: What Scientists Have Learned and How You Can Use It - David Niven\n    The Power of Coincidence - David Richo\n    Reinventing the Body, Resurrecting the Soul: How to Create a New You - Deepak Chopra\n    The Book of Secrets - Deepak Chopra\n    Ethical Slut - Dossie Easton, Janet W. Hardy\n    Voluntary Simplicity Second: Toward a Way of Life That Is Outwardly Simple, Inwardly Rich - Duane Elgin\n    A New Earth: Awakening to Your Life's Purpose - Eckhart Tolle\n    The Power of Now: A Guide to Spiritual Enlightenment - Eckhart Tolle\n    Lateral Thinking - Edward De Bono\n    Think!: Before It's Too Late - Edward De Bono\n    The Gift of Fear - Gavin J. Becker, Tom Stechschulte\n    Talent Is Overrated - Geoff Colvin\n    Conquering Fear - Harold Kushner\n    Perfect Personality Profiles - Helen Baron\n    Letters to a Young Brother: MANifest Your Destiny - Hill Harper\n    Best Friends Forever - Irene S. Levine\n    Avoid Boring People: Lessons From a Life in Science - James D. Watson\n    Rework - Jason Fried, David Heinemeier Hansson\n    What Would Google Do? - Jeff Jarvis\n    Power: Why Some People Have Itand Others Don't - Jeffrey Pfeffer\n    The Happiness Myth: An Expose - Jennifer Hecht\n    Be Different: Adventures of a Free-Range Aspergian With Practical Advice for Aspergians, Misfits, Families &amp; Teachers - John Elder Robison\n    Brain Rules: 12 Principles for Surviving and Thriving at Work, Home, and School - John Medina\n    Uncertainty: Turning Fear and Doubt Into Fuel for Brilliance - Jonathan Fields\n    Clean Break - Karen Stewart\n    Ordinary Recovery: Mindfulness, Addiction, and the Path of Lifelong Sobriety - Kevin Griffin\n    Life! By Design: 6 Steps to an Extraordinary You - Laura Morton, Tom Ferry\n    Introvert Power: Why Your Inner Life Is Your Hidden Strength - Laurie Helgoe\n    How to Talk to Anyone - Leil Lowndes\n    Blink: The Power of Thinking Without Thinking - Malcolm Gladwell\n    Outliers: The Story of Success - Malcolm Gladwell\n    The Tipping Point: How Little Things Can Make a Big Difference - Malcolm Gladwell\n    What the Dog Saw: And Other Adventures - Malcolm Gladwell\n    Change Your Questions, Change Your Life: 10 Powerful Tools for Life and Work - Marilee G. Adams\n    What You Can Change ... And What You Can't - Martin E. Seligman\n    Reviving Ophelia - Mary Bray Pipher\n    The Pain Chronicles: Cures, Myths, Mysteries, Prayers, Diaries, Brain Scans, Healing, and the Science of Suffering - Melanie Thernstrom\n    Exploring the Labyrinth: A Guide for Healing and Spiritual Growth - Melissa Gayle West\n    Supercoach - Michael Neill\n    Sex, Lies, and Handwriting: A Top Expert Reveals the Secrets Hidden in Your Handwriting - Michelle Dresbold, James Kwalwasser\n    Unleashing the Power of Rubber Bands: Lessons in Non-Linear Leadership - Nancy Ortberg\n    The Game - Neil Strauss\n    How to Make People Like You in 90 Seconds or Less - Nicholas Boothman\n    NLP: New Technology: The New Technology - NLP Comprehensive, Steve Andreas, Charles Faulkner\n    Yes!: 50 Scientifically Proven Ways to Be Persuasive - Noah J. Goldstein, Steve J. Martin, Robert B. Cialdini\n    Taking the Leap: Freeing Ourselves From Old Habits and Fears - Pema ChÃƒÆ’Ã‚Â¶drÃƒÆ’Ã‚Â¶n\n    Life Is What You Make It - Peter Buffett\n    Tell to Win: Connect, Persuade, and Triumph With the Hidden Power of Story - Peter Guber\n    The Rules of Life, Expanded Edition: A Personal Code for Living a Better, Happier, More Successful Life - Richard Templar\n    59 Seconds: Think a Little, Change a Lot - Richard Wiseman\n    The 33 Strategies of War - Robert Greene, Don Leslie\n    The 48 Laws of Power - Robert Greene, Joost Elffers\n    Be Happy! - Robert Holden\n    Happiness Now! - Robert Holden\n    Rich Dad Poor Dad for Teens: The Secrets About Money--That You Don't Learn in School! - Robert T. Kiyosaki, Sharon L. Lechter\n    Willpower: Rediscovering the Greatest Human Strength - Roy F. Baumeister, John Tierney\n    The Ultimate Suburban Survivalist Guide: The Smartest Money Moves to Prepare for Any Crisis - Sean Brodrick\n    Real Happiness - Sharon Salzberg\n    Why Men Love Bitches: From Doormat to Dreamgirl-A Woman's Guide to Holding Her Own in a Relationship - Sherry Argov\n    Not &quot;Just Friends&quot;: Rebuilding Trust and Recovering Your Sanity After Infidelity - Shirley P. Glass, Jean Coppock Staeheli\n    Seven Habits of Highly Effective People - Stephen R. Covey\n    Mindfulness and Acceptance: Expanding the Cognitive-Behavioral Tradition - Steven C. Hayes Phd, Victoria M. Follette Phd, Marsha M. Linehan Phd Abpp\n    Where Good Ideas Come From: The Natural History of Innovation - Steven Johnson\n    The War of Art - Steven Pressfield\n    Do the Work - Steven Pressfield, Seth (frw) Godin\n    Getting More: How to Negotiate Successfully for What You Want in the Real World - Stuart Diamond\n    Kiss My Tiara - Susan Jane Gilman\n    Organize for a Fresh Start - Susan M. West\n    How to Be a Gentleman: A Timely Guide to Timeless Manners - Thomas Nelson\n    Gunn's Golden Rules - Tim Gunn\n    Strengths Finder 2.0 - Tom Rath\n    Secrets of Special Ops Leadership: Dare the Impossible--Achieve the Extraordinary - William A. Cohen Ph.d.\n    How Would You Move Mount Fuji?: Microsoft's Cult of the Puzzle - How the World's Smartest Companies Select the Most Creative Thinkers - William Poundstone\n    The Beginning... The End... Anew! - Zedart Hodges\n    What Shamu Taught Me About Life, Love, and Marriage: Lessons for People From Animals and Their Trainers - Amy Sutherland\n\n\n\nSelf Improvement - Religious\n\n\n    The Book: On the Taboo Against Knowing Who You Are - Alan Watts\n    The Middle Way: Faith Grounded in Reason - Dalai Lama, Geshe Thupten Jinpa\n    The 5 Love Languages: The Secret to Love That Lasts - Gary Chapman, Gary D. Chapman\n    Eastern Body, Western Mind: Psychology and the Chakra System as a Path to the Self - Judith Anodea\n    Twelve Steps to a Compassionate Life - Karen Armstrong\n    Awakening the Buddha Within : Eight Steps to Enlightenment - Lama Surya Das\n    Peace Is Every Breath: A Practice for Our Busy Lives - Thich Nhat Hanh\n\n\n\nSelf Improvement - Business &amp; Career\n\n\n    Best Practices: Managing People: Secrets to Leading for New Managers - Barry Silverstein\n    Motivating Employees : Bringing Out the Best in Your People - Barry Silverstein\n    The Intelligent Investor: The Definitive Book on Value Investing - Benjamin Graham, Jason Zweig\n    Freedom, Inc. - Brian M. Carney, Isaac Getz\n    A Random Walk Down Wall Street: The Time-Tested Strategy for Successful Investing - Burton G. Malkiel\n    The Art of Contrarian Trading: How to Profit From Crowd Behavior in the Financial Markets - Carl Futia\n    The Innovator's Solution: Creating and Sustaining Successful Growth - Clayton M. Christensen, Michael E. Raynor\n    The Billionaire Who Wasn't: How Chuck Feeney Made and Gave Away a Fortune Without Anyone Knowing - Conor O'Clery\n    The Everything Practice Interview Book: Be Prepared for Any Question - Dawn Rosenberg McKay\n    The Ten Commandments for Business Failure - Don Keough\n    The Two-Income Trap - Elizabeth Warren, Amelia Warren Tyagi\n    The Lean Startup - Eric Ries\n    Debt Collectors, CCJs, IVAs and Bankruptcy - GA, P\n    Crush It!: Why NOW Is the Time to Cash in on Your Passion - Gary Vaynerchuk\n    The Google Resume - Gayle Laakmann McDowell\n    Enchantment: The Art of Changing Hearts, Minds, and Actions - Guy Kawasaki\n    Your Money: The Missing Manual - J. D. Roth\n    Winning - Jack Welch, Suzy Welch\n    Winning: The Answers: Confronting 74 of the Toughest Questions in Business Today - Jack Welch, Suzy Welch\n    Instant Interviews: 101 Ways to Get the Best Job of Your Life - Jeffrey G. Allen\n    Good to Great: Why Some Companies Make the Leap...and Others Don't - Jim Collins\n    Built to Last - Jim Collins, Jerrold Mundis, Jerry I. Porras\n    Blue Collar &amp; Proud of It - Joe Lamacchia\n    Rethinking the Sales Force: Redefining Selling to Create and Capture Customer Value - John Devincentis, Rackham, Neil Rackham\n    Best Practices: Difficult People - John Hoover\n    Time Management: Set Priorities to Get the Right Things Done - John Hoover\n    The Personal MBA: Master the Art of Business - Josh Kaufman\n    Why Good Girls Don't Get Ahead... But Gutsy Girls Do - Kate White\n    Achieving Goals: Define and Surpass Your High Performance Goals - Kathleen Schienle\n    Hiring People: Recruit and Keep the Brightest Stars - Kathy Shwiff\n    Crucial Conversations Tools for Talking When Stakes Are High, Second Edition - Kerry Patterson, Joseph Grenny, Ron McMillan, Al Switzler\n    Zen and the Art of Making a Living: A Practical Guide to Creative Career Design - Laurence G. Boldt\n    Inside Steve's Brain - Leander Kahney\n    Getting Back to Work: Everything You Need to Bounce Back and Get a Job After a Layoff - Linda K. Rolie\n    Stop Sabotaging Your Career: 8 Proven Strategies to Succeed--In Spite of Yourself - Lois P. Frankel\n    Internet Marketing - Matt Bailey\n    The Education of Millionaires - Michael Ellsberg\n    Good Business: Leadership, Flow, and the Making of Meaning - Mihaly Csikszentmihalyi\n    The Mentor Leader: Secrets to Building People and Teams That Win Consistently - Nathan Whitaker\n    The 10 Laws of Career Reinvention: Essential Survival Skills for Any Economy - Pamela Mitchell\n    Innovation and Entrepreneurship - Peter Ferdinand Drucker\n    What Makes a Leader?: A Leading With Emotional Intelligence Conversation With Jack and Suzy Welch - Prof. Daniel Goleman Ph.d., Jack Welch, Suzy Welch\n    I Will Teach You to Be Rich: No Guilt, No Excuses - Just a 6-Week Programme That Works - Ramit Sethi\n    Brainfluence: 100 Ways to Persuade and Convince Consumers With Neuromarketing - Roger Dooley\n    Dealing With Difficult People - Roy C. Lilley\n    Making Ideas Happen - Scott Belsky\n    All Marketers Are Liars - Seth Godin\n    Linchpin - Seth Godin\n    Tribes: We Need You to Lead Us - Seth Godin\n    The Zen of Social Media Marketing: An Easier Way to Build Credibility, Generate Buzz, and Increase Revenue - Shama Hyder Kabani, Chris Brogan\n    The Smart Cookies' Guide to Making More Dough - Smart Cookies, Jennifer Barrett, Andrea Baxter\n    Fire Your Boss - Stephen M. Pollan, Mark Levine\n    The 4-Hour Workweek, Expanded and Updated: Escape 9-5, Live Anywhere, and Join the New Rich - Timothy Ferriss\n    Delivering Happiness: A Path to Profits, Passion, and Purpose - Tony Hsieh\n    The Four Pillars of Investing: Lessons for Building a Winning Portfolio - William J. Bernstein\n    The Steve Jobs Way: iLeadership for a New Generation - William L. Simon, Jay Elliot\n    Debt-Free U: How I Paid for an Outstanding College Education Without Loans, Scholarships, or Mooching Off My Parents - Zac Bissonnette, Andrew Tobias\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:ba5a5a6c7a63d87edd684d47d423a1af8a79df28","amp;dn":"The+Self+Improvement+Ebook+Collection+++%28epub%2Fmobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba5a5a6c7a63d87edd684d47d423a1af8a79df28","infoHashBuffer":{"type":"Buffer","data":[186,90,90,108,122,99,216,126,221,104,77,71,212,35,161,175,138,121,223,40]},"announce":[],"urlList":[]}}