{"title":"NuruMassage: Rachel Roxxx (A Wifes Revenge) 09.16.16","uid":15840121,"size":334858627,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:bab4a02b68540629527801e3e5bf084faf143274&amp;dn=NuruMassage%3A+Rachel+Roxxx+%28A+Wifes+Revenge%29+09.16.16&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":8,"uploader":"EndYou","files":1,"time":1474030486,"description":"... : More exclusive porn at : ...\r\n    https://thepiratebay.org/user/EndYou\r\n\r\n          ... : Screenshots : ... \nhttp://imgpremium.com/img-57dbcf7c01b85.html  \nhttp://imgpremium.com/img-57dbcf7c83878.html \r\n\r\nLoyal and sexy housewife, Rachel Roxxx's day is turned upside down while gathering up her husband Aaron Wilcox's clothes for the laundry. As she picks up his sweaty gym shorts, a business card falls out of his pocket. Rachel grabs it and suddenly her face drops. She decides to call this NURU MASSAGE spa and see what her husband has been up too. When she gets through to the receptionist, she's told he actually has an appointment scheduled today! With that information Rachel decides to head over there and surprise her cheating husband. As she enters the spa, she's mistaken for the 'new masseuse' and before she knows it, she's sitting face to face with her first client who just happens to be her husband's brother, Steven. It seems as though Steven has been using Aaron's membership, which confuses Rachel even more. She knows she came to the spa for a reason so when Steven suggests she give him the massage, she doesn't know what to say. When he tells her, it could be a revenge massage for all the time Aaron's come to the spa, she agrees and leads him into the shower. The wetter their bodies get, the more willing Rachel becomes, as she strokes his hard cock with her hand. They move to the bath and Rachel rubs her nipple pierced tits up and down Steven's chest while taking his dick in her mouth. The final step is the massage itself, where things get really slippery. As she slides her body up and down with him inside her wet pussy, she realizes whether it's the Nuru gel or the fact that she's riding her husband's brother, the taste of revenge never felt so.. slippery sweet.\r\n\r\nMPEG4 Video (H264) 960x544","torrent":{"xt":"urn:btih:bab4a02b68540629527801e3e5bf084faf143274","amp;dn":"NuruMassage%3A+Rachel+Roxxx+%28A+Wifes+Revenge%29+09.16.16","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bab4a02b68540629527801e3e5bf084faf143274","infoHashBuffer":{"type":"Buffer","data":[186,180,160,43,104,84,6,41,82,120,1,227,229,191,8,79,175,20,50,116]},"announce":[],"urlList":[]}}