{"title":"The Year of Voting Dangerously - Maureen Dowd (Audiobook, MP3)","uid":15834411,"size":360876022,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bc3762b663d1a8a488a4405e4af194d0a3996693&amp;dn=The+Year+of+Voting+Dangerously+-+Maureen+Dowd+%28Audiobook%2C+MP3%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"Squiddy82","files":13,"time":1473955089,"description":"Are men necessary?  Only if you want this audiobook ripped ;)\r\n\r\n\r\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\r\n\r\niTunes users - When added to your library, iTunes may classify these MP3 files as music. To change media type to audiobook, browse music library in album view, right-click (control-click on mac) the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\r\n\r\n\r\n\r\nThe Year of Voting Dangerously: The Derangement of American Politics\r\n\r\nWritten by: Maureen Dowd\r\nNarrated by: Elisabeth Rodgers\r\nLength: 12 hrs and 5 mins \r\nUnabridged Audiobook\r\nRelease Date:09-13-16\r\n\r\nMaureen Dowd's incendiary takes and takedowns from 2016 - the most bizarre, disruptive and divisive Presidential race in modern history.\r\n\r\nTrapped between two candidates with the highest recorded unfavorables, Americans are plunged into The Year of Voting Dangerously. In this perilous and shocking campaign season, The New York Times columnist traces the psychologies and pathologies in one of the nastiest and most significant battles of the sexes ever. Dowd has covered Donald Trump and Hillary Clinton since the '90s. She was with the real estate mogul when he shyly approached his first Presidential rope line in 1999, and she won a Pulitzer Prize that same year for her penetrating columns on the Clinton impeachment follies. Like her best-sellers, Bushworld and Are Men Necessary?, The Year of Voting Dangerously will feature Dowd's trademark cocktail of wry humor and acerbic analysis in dispatches from the political madhouse. If America is on the escalator to hell, then The Year of Voting Dangerously is the perfect guide for this surreal, insane ride","torrent":{"xt":"urn:btih:bc3762b663d1a8a488a4405e4af194d0a3996693","amp;dn":"The+Year+of+Voting+Dangerously+-+Maureen+Dowd+%28Audiobook%2C+MP3%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc3762b663d1a8a488a4405e4af194d0a3996693","infoHashBuffer":{"type":"Buffer","data":[188,55,98,182,99,209,168,164,136,164,64,94,74,241,148,208,163,153,102,147]},"announce":[],"urlList":[]}}