{"title":"Thinking In Java (4th Edition), by Bruce Eckel","uid":4175712,"size":6077683,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc611c9242f37d26df45b4546879300526a59126&amp;dn=Thinking+In+Java+%284th+Edition%29%2C+by+Bruce+Eckel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":1,"uploader":"bey0nd","files":-1,"time":1210111415,"description":"The legendary author Bruce Eckel brings Java to life with this extraordinarily insightful, opinionated and downright funny introduction. Thinking in Java introduces all of the language's fundamentals, one step at a time, using to-the-point code examples. More than virtually any other book, Thinking in Java helps you understand not just what to do -- but why. Eckel introduces all the basics of objects as Java uses them; then walks carefully through the fundamental concepts underlying all Java programming -- including program flow, initialization and cleanup, hiding implementations, reusing classes and polymorphism. Using extensive, to-the-point examples, he introduces error handling, exceptions, Java I/O, run-time type identification, and passing and returning objects. He covers the Java AWT, multithreading, network programming with Java -- even design patterns. The best way to understand the real value of this book is to hear what readers of the online version have been saying about it: &quot;much better than any other Java book I've seen, by an order of magnitude...&quot; &quot;mature, consistent, intellectually honest, well-written and precise...&quot; &quot;a thoughtful, penetrating analytical tutorial which doesn't kowtow to the manufacturers...&quot; &quot;Thank you again for your awesome book. I was really floundering, but your book has brought me up to speed as quickly as I could read it!&quot;For both beginner and experienced C and C++ programmers who want to learn Java.\n\n* From the basics of object development, all the way to design patterns and other advanced topics.\n\n* By the author of the best-selling Thinking in C++ -- winner of the 1995 Jolt Cola Award!\n\n* On-line version has already received tens of thousands of hits -- there's a huge built-in demand for this book! --This text refers to an out of print or unavailable edition of this title.","torrent":{"xt":"urn:btih:bc611c9242f37d26df45b4546879300526a59126","amp;dn":"Thinking+In+Java+%284th+Edition%29%2C+by+Bruce+Eckel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc611c9242f37d26df45b4546879300526a59126","infoHashBuffer":{"type":"Buffer","data":[188,97,28,146,66,243,125,38,223,69,180,84,104,121,48,5,38,165,145,38]},"announce":[],"urlList":[]}}