{"title":"Lesbian Seductions Older Younger 55 (Girlfriends Films) (2016)","uid":15877624,"size":1860023429,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:bd7021a1bed3fd9f7cd49e00d5d1d4e93d0d00d8&amp;dn=Lesbian+Seductions+Older+Younger+55+%28Girlfriends+Films%29+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":24,"uploader":"distinc","files":10,"time":1474547217,"description":"Lesbian Seductions Older Younger 55 (Girlfriends Films) (2016)\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=4840529640\r\n \nhttp://imagedisco.net/?g=9014291651\r\n\r\noral hardcore lesbian big tits medium tits small tits trimmed pussy fingering masturbation milf teen older-younger 69 pussy licking ass licking shaved pussy Girlfriends Films' Lesbian Seductions Older/Younger Series\r\n\r\nDescription:\r\n\r\n\r\nLesbian Seductions Older/Younger Vol. 55\r\n\r\nTheir only sin is unconventional love. The revealing twisted road from desire to pursuit and surrender.\r\n\r\nI own most of the SEDUCTIONS movies and this series is always an instant buy for me. If you are into older-younger scenes then you need to pay attention to this spectacular series, GFF's second most important series behind the legendary WSW series. Volume #55 is one of the best movie of the entire series, in my opinion. This movie features one hell of a great cast, 4 excellent pairings ( including a legendary dream pairing of historical proportion ) and some of the best girl-girl sex you'll see in your life. \r\n\r\nSCENE 1: Prinzzess seduces the young Megan Sage. Terrific scene where Prinzz shows once again that she is a superb seductress, Megan is the perfect younger prey for her. Very passionate scene. \r\n\r\nSCENE 2: In a dream pairing of historical proportion, two of the most legendary women in the history of GFF and lesbian porn makes love. Magdalene and Elexis are two immortal performers in the eyes of GFF fans all over the world and this scene shows why they will never be forgotten and why they helped put GFF on the map as the best studio in porn. \r\n\r\nSCENE 3: Hot MILF Alexis Fawx makes love to the very young Kristen Scott. This scene is a perfect example on why this series is so awesome: an older woman has sex with a much younger girl for more than 30 minutes, with both love and plenty of passion. A must-see scene for fans of the series. \r\n\r\nSCENE 4: Prinzz is back, this time she makes love to another legend, Zoey Holloway. As usual these two great performers brings their A game to please each other and the results are tough to forget. Overall, this is one of he finest release this year and another proof that GFF is the best studio on the planet","torrent":{"xt":"urn:btih:bd7021a1bed3fd9f7cd49e00d5d1d4e93d0d00d8","amp;dn":"Lesbian+Seductions+Older+Younger+55+%28Girlfriends+Films%29+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd7021a1bed3fd9f7cd49e00d5d1d4e93d0d00d8","infoHashBuffer":{"type":"Buffer","data":[189,112,33,161,190,211,253,159,124,212,158,0,213,209,212,233,61,13,0,216]},"announce":[],"urlList":[]}}