{"title":"Karl Marx : Greatness and Illusion (2016) (EPUB) [WWRG]","uid":15971625,"size":59840618,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd77df8002deb029cd28b69bd030154c42cd0672&amp;dn=Karl+Marx+%3A+Greatness+and+Illusion+%282016%29+%28EPUB%29+%5BWWRG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":2,"uploader":"Lion.King","files":3,"time":1475783573,"description":"As much a portrait of his time as a biography of the man, Karl Marx: Greatness and Illusion returns the author of Das Kapital to his nineteenth-century world, before twentieth-century inventions transformed him into Communism’s patriarch and fierce lawgiver. Gareth Stedman Jones depicts an era dominated by extraordinary challenges and new notions about God, human capacities, empires, and political systems―and, above all, the shape of the future.\r\n\r\nIn the aftermath of the Battle of Waterloo, a Europe-wide argument began about the industrial transformation of England, the Revolution in France, and the hopes and fears generated by these occurrences. Would the coming age belong to those enthralled by the revolutionary events and ideas that had brought this world into being, or would its inheritors be those who feared and loathed it? Stedman Jones gives weight not only to Marx’s views but to the views of those with whom he contended. He shows that Marx was as buffeted as anyone else living through a period that both confirmed and confounded his interpretations―and that ultimately left him with terrible intimations of failure.\r\n\r\nKarl Marx allows the reader to understand Marx’s milieu and development, and makes sense of the devastating impact of new ways of seeing the world conjured up by Kant, Hegel, Feuerbach, Ricardo, Saint-Simon, and others. We come to understand how Marx transformed and adapted their philosophies into ideas that would have―through twists and turns inconceivable to him―an overwhelming impact across the globe in the twentieth century","torrent":{"xt":"urn:btih:bd77df8002deb029cd28b69bd030154c42cd0672","amp;dn":"Karl+Marx+%3A+Greatness+and+Illusion+%282016%29+%28EPUB%29+%5BWWRG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd77df8002deb029cd28b69bd030154c42cd0672","infoHashBuffer":{"type":"Buffer","data":[189,119,223,128,2,222,176,41,205,40,182,155,208,48,21,76,66,205,6,114]},"announce":[],"urlList":[]}}