{"title":"Real Social Dynamics (RSD) Blueprint Decoded - Tyler [20 DVDs]","uid":11436091,"size":1995188606,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bee15ed060d11495a1923ea6a63bf306317c0d8b&amp;dn=Real+Social+Dynamics+%28RSD%29+Blueprint+Decoded+-+Tyler+%5B20+DVDs%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":3,"uploader":"torrentgator05","files":-1,"time":1415754833,"description":"Real Social Dynamics (RSD) Blueprint Decoded - Tyler Durden [20 DVDs] - Complete Edition\n\n-------------------------------------------------------\n\nNote: Highly compressed, low bitrate &amp; resolution (in order to fit in more devices or for archiving purposes).\n\n-------------------------------------------------------\n\nReal Social Dynamics Founded By Tyler Durden Explores A different approach to PUA. There are no lines to learn no stories to memorize. You can get the girl without faking it. Don't raise your value start with high value no need for DHV spikes.\n\n-------------------------------------------------------\n\nThe Blueprint Decoded takes the overblown expectations and stomps them into the ground.\n\nExperiencing this program is going to change your entire life.\n\nYour life will NEVER be the same after this. Point blank period.\n\nEvery aspect, from how you interact with women to how you walk through the world in general ? it?s all about to change.\n\nThis is going to teach you to see the truth of your life, how it relates to women, and how to get the type of massive success that?s normally reserved for the top guys (who?ve not only gone out for years and years, but who also had the mastermind group to ?decode? in detail all of their experiences).\n\nExpect that your brain will melt out of your ears after this...\n\nMost people in attendance couldn?t sleep during the program (as you?ll see on video, at one point I asked ?Who hasn?t been able to sleep during this program? and over half of the room shot their hands up), and many couldn?t sleep for several days after the experience.\n\nWhy??\n\nBecause this program is going re-wire your reality, re-wire the way you interact (and get massive success) with women, and re-wire the way that you experience the world.\n\nThe last thing that I?d leave you with is this...\n\nI created this program for myself and myself only.\n\nThe time I spent, I couldn?t have cared less what anyone else thought of it.  I created this because I wanted to live my own life to the fullest.\n\nI needed to know this stuff... for me.\n\nWhat I?m about to reveal to you... these are the secrets that have carried me through a lot of tough times, through crippling challenges, and to a level of success with women that?s enabled me full choice and abundance for the rest of my life.\n\nIf you?ve taken value from any of my writings on the blog and RSD Nation, in the newsletters, or any of my past speaking engagements...\n\nWell, that stuff is like a pale joke compared to what you?re about to experience (so be ready for it).\n\nThis is the secret knowledge that I use to train my instructors, the stuff that I use to do rapid-fire ?change work? with everyone who takes my live programs... and ultimately, the keys that I?ve used to demonstrate a world-class level of skill with women on a professional level that blows people away every time.\n\n-------------------------------------------------------\n\nProduct page: &lt;a href=&quot;\nhttp://www.blueprintdecoded.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.blueprintdecoded.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:bee15ed060d11495a1923ea6a63bf306317c0d8b","amp;dn":"Real+Social+Dynamics+%28RSD%29+Blueprint+Decoded+-+Tyler+%5B20+DVDs%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bee15ed060d11495a1923ea6a63bf306317c0d8b","infoHashBuffer":{"type":"Buffer","data":[190,225,94,208,96,209,20,149,161,146,62,166,166,59,243,6,49,124,13,139]},"announce":[],"urlList":[]}}