{"title":"Dragon Quest VIII : Journey of the Cursed King [PS2] [NTSC]","uid":5391770,"size":4180148271,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:bf7fac48eb3a6ad198a1903a1d4018abded8cd47&amp;dn=Dragon+Quest+VIII+%3A+Journey+of+the+Cursed+King+%5BPS2%5D+%5BNTSC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":3,"uploader":"thenoobish","files":2,"time":1267092475,"description":"Here is a clean version of Dragon Quest VIII with no AR hack. This game is great!\n\n\n\nDragon Quest VIII : Journey of the Cursed King NTSC/U\n\nSystem: PS2\nFormat: ISO &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Dragon_Quest_VIII&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Dragon_Quest_VIII&lt;/a&gt;\n\nDragon Quest: The Journey of the Cursed King, is a role-playing video game developed by Level-5 and published by Square Enix for the PlayStation 2\nhome video game console. It was first released in Japan, and was later released in North America and PAL region, making it the first main series installment released in the PAL region. It is the eighth installment of the popular Dragon Quest series and it is the first English version of a Dragon Quest game to drop the Dragon Warrior title.\n\nDragon Quest VIII uses cel-shading textures for the characters and scenery and is the first game in the series to have fully three dimensional environments. This game retains most of the series' role-playing game elements, such as turn-based combat and the experience level system. Dragon Quest VIII follows the silent Hero, the main character, and his party of allies as they journey towards their goal of defeating the wicked Dhoulmagus. The kingdom of Trodain has been cursed by Dhoulmagus and the King, Trode, and his daughter, Medea, have both been transformed and it is up to the Hero to return them to their original form and save the kingdom.\n\nDragon Quest VIII has enjoyed much success since its release, both in Japan and in the US. It is a Square Enix Ultimate Hits and a Sony Greatest Hits title. A survey conducted in 2006 by the magazine Famitsu earned the game the #4 spot as the best video game of all time after Final Fantasy X, Final Fantasy VII and Dragon Quest III.","torrent":{"xt":"urn:btih:bf7fac48eb3a6ad198a1903a1d4018abded8cd47","amp;dn":"Dragon+Quest+VIII+%3A+Journey+of+the+Cursed+King+%5BPS2%5D+%5BNTSC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf7fac48eb3a6ad198a1903a1d4018abded8cd47","infoHashBuffer":{"type":"Buffer","data":[191,127,172,72,235,58,106,209,152,161,144,58,29,64,24,171,222,216,205,71]},"announce":[],"urlList":[]}}