{"title":"Bad Soldier - Chris Ryan [EN EPUB MOBI AZW3] [ebook] [p_s]","uid":15801212,"size":1546159,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c03891002ebb6412a01dba0107798e93df4597bd&amp;dn=Bad+Soldier+-+Chris+Ryan+%5BEN+EPUB+MOBI+AZW3%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"perfect_stan","files":3,"time":1473505942,"description":"Bad Soldier by Chris Ryan (Danny Black #4)\r\nEnglish | 2016 | Mystery &amp; Thriller | 1.5 MB\r\n\r\n\r\nA migrant boat battles through the rough Mediterranean. Its passengers are desperate, starving and scared.\r\nThey are also being ruthlessly targeted by the SAS.\r\nIslamic State militants are smuggling themselves into Europe using these boats. Only by locating such men before they make it into the UK can the Regiment stop them committing their acts of terror on British soil.\r\nWhen one of these migrants reveals plans for a sickening Christmas Day atrocity in London, SAS operative Danny Black is tasked with infiltrating the most dangerous theatre of war in the world: Islamic State heartland. There, he and his team must lift a brutal IS commander – the only man who knows all the details of the London attack. The commander surrounds himself with vicious militants and a harem of sex slaves whom he treats in the most sadistic ways imaginable. And his jihadi wife is, if possible, even more abominable than him.\r\nAs Danny pits himself against the violent thugs of the Islamic State, he learns that it is not just the UK that is under threat. His very presence on the mission has put at risk the safety of those closest to him. And he discovers that there are greater forces at work here, who do not care if the innocent live or die.\r\nNow there is nothing Danny will not do, no line he will not cross, to protect his family. Whether that makes him a good soldier or a bad soldier he neither knows nor cares. Because as he is fast learning, it is sometimes impossible to tell the difference between the two.\r\nAnd as every SAS soldier is trained to understand, the worst threats often come from the most unexpected places…\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:c03891002ebb6412a01dba0107798e93df4597bd","amp;dn":"Bad+Soldier+-+Chris+Ryan+%5BEN+EPUB+MOBI+AZW3%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c03891002ebb6412a01dba0107798e93df4597bd","infoHashBuffer":{"type":"Buffer","data":[192,56,145,0,46,187,100,18,160,29,186,1,7,121,142,147,223,69,151,189]},"announce":[],"urlList":[]}}