{"title":"Coldplay - Viva La Vida[2008]","uid":4245920,"size":110971011,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c05118b64a4732c3c9e066826eb50d93817f394f&amp;dn=Coldplay+-+Viva+La+Vida%5B2008%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":6,"uploader":"Emma241984","files":17,"time":1213788725,"description":"Coldplay are an English Alternative band formed in London in 1997. The group comprises vocalist/pianist/guitarist Chris Martin, lead guitarist Jonny Buckland, bassist Guy Berryman, and drummer/multi-instrumentalist Will Champion. Coldplay have been one of the most commercially successful acts of the new millennium, selling over 30 million albums. The band are also known for their hit singles, such as, Yellow, Speed Of Sound, and their Grammy Award-winning Clocks. Coldplay achieved worldwide fame with the release of their single Yellow, followed by the success of their debut album, Parachutes [2000], which was nominated for the Mercury Prize. Both Parachutes and its follow-up, A Rush of Blood to the Head [2002], were released to commercial success; the latter was named NME&amp;#039;s Album of the Year.\n\nViva La Vida or Death and All His Friends, or its short name Viva la Vida, is the fourth studio album by British band Coldplay. It is scheduled to be released on June 12th 2008 in the UK and June17th 2008 in North America. The project is largely produced by Brian Eno. Coldplay have released two singles from the record, Violet Hill and Viva la Vida. Viva La Vida takes its name from a painting by Frida Kahlo, the acclaimed 20th century Mexican artist; the titles literal translation is - live the life. The albums artwork features the painting Liberty Leading the People [La Liberte guidant le peuple] by French painter Eugene Delacroix, commemorating the July Revolution of 1830. Track 10 included a hidden track [The Escapist], which I have extracted for your listening convenience and called Track 11. \n\nTracks:\n01  Life In Technicolor  \n02  Cemeteries Of London  \n03  Lost  \n04  42  \n05  Lovers In Japan/Reign Of Love  \n06  Yes  \n07  Viva La Vida  \n08  Violet Hill  \n09  Strawberry Swing  \n10  Death And All His Friends\n\nHidden Track:\n11  The Escapist \n\nReleased 12 June 2008 (2008-06-12)\nRecorded 2007\nGenre Alternative rock\nLength 45:53\nLabel Parlophone, Capitol\nProducer Markus Dravs, Brian Eno, Rik Simpson, Jon Hopkins \nFormat: Mp3\nFile Size: 105MB\nEncoder: Lame 3.97","torrent":{"xt":"urn:btih:c05118b64a4732c3c9e066826eb50d93817f394f","amp;dn":"Coldplay+-+Viva+La+Vida%5B2008%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c05118b64a4732c3c9e066826eb50d93817f394f","infoHashBuffer":{"type":"Buffer","data":[192,81,24,182,74,71,50,195,201,224,102,130,110,181,13,147,129,127,57,79]},"announce":[],"urlList":[]}}