{"title":"Guns N Roses Use Your Illusion I","uid":8261864,"size":109688309,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c070bd1084812fd31b14ad493c55166f93457d28&amp;dn=Guns+N+Roses+Use+Your+Illusion+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":2,"uploader":"Ironmaiden2013","files":-1,"time":1363400346,"description":"Use Your Illusion I is the third studio album by the American rock band Guns N' Roses. It was the first of two albums released in conjunction with the Use Your Illusion Tour, the other being Use Your Illusion II. The two are thus sometimes considered a double album - in fact both were double albums consisting of 2 vinyl albums each (Warman's Records Field Guide) . The album debuted at No. 2 on the Billboard charts, selling 685,000 copies in its first week, behind Use Your Illusion II's first week sales of 770,000.[1] Use Your Illusion I has sold 5,502,000 units in the U.S. as of 2010, according to Nielsen SoundScan.[2] Each of the Use Your Illusion albums have been certified 7Ã— Platinum by the RIAA. It was nominated for a Grammy Award in 1992.\n\nOverview\n\nThe Use Your Illusion albums represent a turning point in the sound of Guns N' Roses. Although they did not abandon the hard-rock tendencies vivid in their first album, Appetite for Destruction, Use Your Illusion I demonstrated, for the first time, more or less, elements of blues, classical music, heavy metal, punk rock and rock and roll classic. For example, lead singer Axl Rose plays piano on several tracks of both albums. This fact is evidenced by the numerous music videos produced in conjunction with these albums. Use Your Illusion I contains two of the three songs, &quot;November Rain&quot; and &quot;Don't Cry&quot;, whose videos are generally held by fans to be part of a trilogy. The third song, &quot;Estranged&quot;, is on Use Your Illusion II.\n\nAnother influence on the different sound to this album compared to the band's earlier work is the replacement of drummer Steven Adler (who was unable to perform well enough for the sessions due to drug problems) by former Cult drummer Matt Sorum.\n\nA number of songs on the album were written in the band's early days. They were not included on Appetite for Destruction but can be found on the popular bootlegged so-called 'Rumbo Tapes', an album of early demo tapes. &quot;Back Off Bitch&quot;, &quot;Bad Obsession&quot;, &quot;Don't Cry&quot; (referred to by Rose during the ensuing tour as 'the first song [they] ever wrote together'), &quot;November Rain&quot;, and &quot;The Garden&quot; are considered part of this group. There's also a cover of Paul McCartney's &quot;Live and Let Die&quot;.\n\nBesides stylistic differences, another new aspect seen in Use Your Illusion I was longer songs. &quot;November Rain&quot;, an epic ballad, is nearly nine minutes long, and &quot;Coma&quot; is more than 10 minutes long. Another change was the presence of tracks sung by other members of the band (even though certain songs from Appetite for Destruction and G N' R Lies featured other members on duet vocals): lead vocals on &quot;Dust N' Bones&quot;, &quot;You Ain't the First,&quot; &quot;14 Years&quot; and &quot;Double Talkin' Jive&quot; are performed by rhythm guitarist Izzy Stradlin.\n\nThe band had some difficulty achieving the final sound of the album, especially during the mixing stages of the production of both albums. According to a 1991 cover story by Rolling Stone magazine, after mixing 21 tracks with engineer/producer Bob Clearmountain, the band decided to scrap the mixes and start from scratch with engineer Bill Price of Sex Pistols fame.[4]\n\nSlash has stated that a great deal of the material for the album was written on acoustic guitars in a couple of nights at his house (the Walnut House), after several months of non-productivity\n\nReleased on midnight of September 17, 1991, the Use Your Illusion albums were among the most anticipated in rock history. Predictions in the industry were of sales reaching the likes of Michael Jackson's Thriller and Bruce Springsteen's Born in the U.S.A., this despite the fact that major stores K-Mart and Walmart refused to stock the albums due to the profanity present. Estimates suggested that over 500,000 copies of the two albums were sold in just 2 hours.[13] Both albums ultimately underperformed expectations domestically, with Use Your Illusion I selling 5,502,000 and both being certified 7x Platinum by the RIAA.[14][15] Use Your Illusion I debuted below Use Your Illusion II mainly due to the fact that the second album contained the main lead single of the two albums &quot;You Could Be Mine&quot;.\n\nReception to Use Your Illusion I was mainly positive, and it is regarded as the more hard-rocking album of the two due in part to the influence of Izzy Stradlin.[6] Critics praised the highlights of the album such as &quot;November Rain&quot; and &quot;Coma&quot;, the closing track, but criticised the amount of filler on the album. Asked if the wait was worth it, David Frick of Rolling Stone noted &quot;yes&quot;.\n\n\nTrack Listing:\n\n1. \t&quot;Right Next Door to Hell&quot;   \t\n2. \t&quot;Dust N' Bones&quot; \n3. \t&quot;Live and Let Die&quot; \n4. \t&quot;Don't Cry&quot; (original version) \t\n5. \t&quot;Perfect Crime&quot;  \n6. \t&quot;You Ain't the First&quot;  \n7. \t&quot;Bad Obsession&quot;   \t\n8. \t&quot;Back Off Bitch&quot;   \t\n9. \t&quot;Double Talkin' Jive&quot;\n10. \t&quot;November Rain&quot;   \t\n11. \t&quot;The Garden&quot; \n12. \t&quot;Garden of Eden&quot;   \n13. \t&quot;Don't Damn Me&quot;   \t\n14. \t&quot;Bad Apples&quot;  \n15. \t&quot;Dead Horse&quot;   \t\n16. \t&quot;Coma&quot; \n\nEnjoy and seed please.  \t\t\n","torrent":{"xt":"urn:btih:c070bd1084812fd31b14ad493c55166f93457d28","amp;dn":"Guns+N+Roses+Use+Your+Illusion+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c070bd1084812fd31b14ad493c55166f93457d28","infoHashBuffer":{"type":"Buffer","data":[192,112,189,16,132,129,47,211,27,20,173,73,60,85,22,111,147,69,125,40]},"announce":[],"urlList":[]}}