{"title":"I Was Hitler's Pilot: The Memoirs of Hans Baur","uid":16033477,"size":1302287,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0a6a9b2e22f0bf57f6e79dd2d07f7d7a7a9eef7&amp;dn=I+Was+Hitler%27s+Pilot%3A+The+Memoirs+of+Hans+Baur&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":5,"uploader":"marty14","files":1,"time":1476452950,"description":"I Was Hitler's Pilot: The Memoirs of Hans Baur - Hans Baur [epub]\r\n\r\nA decorated First World War pilot, Hans Baur was one of the leading commercial aviators of the 1920s before being pitched into the thick of it as personal pilot to a certain ‘Herr Hitler’. Hitler, who loathed flying, felt safe with Baur and would allow no one else to pilot him. As a result, an intimate relationship developed between the two men and it is this, which gives these memoirs special significance. Hitler relaxed in Baur’s company and talked freely of his plans and of his real opinions about his friends and allies. \r\n\r\nBaur was also present during some of the most salient moments of the Third Reich; the Röhm Putsch, the advent of Eva Braun, Ribbentrop’s journey to Moscow, the Bürgerbräukeller attempt on Hitler’s life; and when war came, he flew Hitler from front to front. He remained in Hitler's service right up to the final days in the Führerbunker. In a powerful account of Hitler’s last hours, Baur describes his final discussions with Hitler before his apparent suicide; and his last meeting with Magda Goebbels in the tortuous moments before she killed her three children. Remarkably, throughout it all Baur’s loyalty to the Führer never wavered. His memoirs capture these events in all their fascinating and disturbing detail","torrent":{"xt":"urn:btih:c0a6a9b2e22f0bf57f6e79dd2d07f7d7a7a9eef7","amp;dn":"I+Was+Hitler%27s+Pilot%3A+The+Memoirs+of+Hans+Baur","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0a6a9b2e22f0bf57f6e79dd2d07f7d7a7a9eef7","infoHashBuffer":{"type":"Buffer","data":[192,166,169,178,226,47,11,245,127,110,121,221,45,7,247,215,167,169,238,247]},"announce":[],"urlList":[]}}