{"title":"Shadowrun 5th ed Core Rulebook","uid":8698323,"size":111024833,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0e51f4296e87a6b8dc399850e05ab82fcdbde00&amp;dn=Shadowrun+5th+ed+Core+Rulebook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":1,"uploader":"harks88","files":2,"time":1374005038,"description":"Shadowrun 5th ed Core Rulebook\nDescription\t\n\n\nShadowrun, Fifth Edition:  The newest version of one of the most \n\npopular and successful role-playing worlds of all time, a fusion of \n\nman, magic, and machine in a dystopian near-future. With rules for \n\ncharacter creation, magic, combat, Matrix hacking, rigging, and \n\nmore.Building on the award-winning Shadowrun, Fourth Edition rule \n\nset, the new edition brings the game forward while preserving the \n\nfun that has made it so enduring.\n\nHere are some highlights of the new edition: \n\nGrittier &amp; Deadlier: The down-and-dirty Sixth World setting is a \n\nplace where shadowrunners need to count their bullets carefully and \n\nbe cautious about whom they trust. Fifth Edition rules reflect that, \n\nmaking players aware of their choices and the price they have to pay \n\nto be the best. It also supports deadlier combat, while still making \n\nsure the player characters can stay alive long enough to take care \n\nof business.\n\nStreamlined Matrix: Matrix rules have been improved and streamlined, \n\nbringing them more in line with the rest of the game and making them \n\nmore intuitive. Running the Matrix has never been easier.\n\nIncreased Gear Options: Changes in Fifth Edition mean there are more \n\nfunctions for gear, which leads to an increased variety of the toys \n\nshadowrunners love!\n\nFaster Character Creation and More Player Aids: New to Shadowrun and \n\neager to hit the streets as quickly as possible? Fifth Edition\n\n character creation rules make it faster and easier to \n\ncreate a full-fledged character and dive into the shadows. \n\nAdditionally, from an expanded gamemaster advice section to pre-\n\ngenerated gear kits, Shadowrun, Fifth Edition has tools and \n\nresources to help players quickly get into the game and onto the \n\nstreets.\n\n\nMore read through the book.......\n\n\nFormat: Image PDF\nGenre :\tbooks\nSize  : 105 MB\n\nYour review encourage me...","torrent":{"xt":"urn:btih:c0e51f4296e87a6b8dc399850e05ab82fcdbde00","amp;dn":"Shadowrun+5th+ed+Core+Rulebook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0e51f4296e87a6b8dc399850e05ab82fcdbde00","infoHashBuffer":{"type":"Buffer","data":[192,229,31,66,150,232,122,107,141,195,153,133,14,5,171,130,252,219,222,0]},"announce":[],"urlList":[]}}