{"title":"QI Series 1-10 Season A-J  mp4 -- XL UNCUT HDTV 720p if availabl","uid":9027178,"size":29734870850,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c12b561563bebcb7e7a6787d1dc2cb639c6d3a55&amp;dn=QI+Series+1-10+Season+A-J++mp4+--+XL+UNCUT+HDTV+720p+if+availabl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":23,"uploader":"Tari1978","files":158,"time":1381382165,"description":"Contains every episode in Series 1-10 (Season A-J) of QI (Quite Interesting) from the BBC. It includes every episode broadcast in the XL (uncut) format, which began with Series 6 (Season F) episode 3. Every episode from the beginning of Series 8 (Season H) is in 720p, with the exception of six episodes: s08e09 XL House and Home, s08e13 XL Holidays, s09e12 XL Illumination, s09e17 XL Immortal Bard, s10e14 XL Jingle Bells, and s10e18 XL Just the Job; please upload these and leave a comment here if you have the XL version in 720p.\n\nNOTE: First, every episode from Series 1 (Season A) episode 1 up to Series 6 (Season F) episode 2 lasts 29 minutes; 44 minute XL uncut versions were not broadcast for these episodes. Second, Series 1-7 (Season A-G) are *not* in 720p high definition; they were originally broadcast only in standard definition. \n\nI have compressed the files carefully so there is minimal loss of quality; the 186 files occupy only 27.6 GB, an average of 180 MB per file (most lasting 29 or 44 minutes). I have used the mp4 container with AVC video and AAC audio. If you want less-compressed AVI and MKV files, use thepiratebay.se/torrent/6161914 for Series 1-5 (omitting Series 6-8), and thepiratebay.se/torrent/8946288 for Series 6-10 - but this requires a much larger download for only a modest improvement in quality (and it omits the Series 1-3 extras).\n\nI have included all the Series 1-3 DVD extras, all the VG episodes, Comic Relief Special 2011, Genesis 2011 (Making of QI), and Sport Relief 2012. Series 1-3 are from the DVDs; most of the other episodes are web-rips from many different sources made at the time of the original broadcasts, with some recordings of my own. I apologise to the original uploaders for not having kept a record of their online identities. I have used the Wikipedia episode names and numbers.\n","torrent":{"xt":"urn:btih:c12b561563bebcb7e7a6787d1dc2cb639c6d3a55","amp;dn":"QI+Series+1-10+Season+A-J++mp4+--+XL+UNCUT+HDTV+720p+if+availabl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c12b561563bebcb7e7a6787d1dc2cb639c6d3a55","infoHashBuffer":{"type":"Buffer","data":[193,43,86,21,99,190,188,183,231,166,120,125,29,194,203,99,156,109,58,85]},"announce":[],"urlList":[]}}