{"title":"[NubileFilms] Jennifer White (Young Love / 09.16.2015)","uid":12427128,"size":285601151,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c14bd96c2cf76b70eedcd090668664f967ef1c29&amp;dn=%5BNubileFilms%5D+Jennifer+White+%28Young+Love+%2F+09.16.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":27,"uploader":"chkm8te","files":1,"time":1442398413,"description":"[NubileFilms] Jennifer White (Young Love / 09.16.2015)\n\nLusty brunette Jennifer White is dressed to impress as she settles in to work. When Chad White makes it clear that he has other ideas by approaching Jennifer from behind and giving her medium boobs a long nipple-pinching massage, though, the brunette proves to be more than willing to set aside her work for fun.\n\nSoon Chad has gotten Jennifer out of her dress and down to a thong that encases her bouncing ass. He slides his hand beneath the slip of fabric to let his fingertips dance along the folds of Jennifer's juicy pussy, and then urges her onto the desk so that he can slide the thong down her long legs and replace his fingers with his talented mouth.\n\nJennifer is happy to enjoy her lover's pussy feast, but she doesn't want to remain passive forever. Pulling Chad up, she works him out of his button-down shirt and then undoes his pants so that she can pull his dick out. That's all the preliminaries the brunette fireball needs before Chad drives into her tight twat and starts thrusting hard enough to make her tits bounce.\n\nOnce Jennifer has enjoyed her first climax of the day, she can't wait to drop to her knees to suck the taste of her own snatch from Chad's cock and then turn around so that her belly is on the desk and her ass is offered to her lover as a gift. Chad doesn't hesitate to press back into Jennifer's warmth and take her from behind with firm strokes that leave her gasping her pleasure.\n\nThe couple takes a few moments to switch things up with Jennifer raising one leg high in the air while Chad slams into her from below, but Chad has something even hotter in mind. He pulls the desk chair up and sits down on it, inviting Jennifer to sit in his lap and give him a stiffie ride in her creamy bald pussy. She is happy to oblige, slamming her hips until she explodes in ecstasy.\n\nMoments later, Chad reaches his limit. Jennifer hops off of his lap and gets down on her knees with her mouth open to take the shot of cum that lands between her lips and across her face. Looking hot after her facial, the brunette licks Chad's cock clean to enjoy the last few drops of his love.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=zqzf17tdoe8al72eta0b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=zqzf17tdoe8al72eta0b.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=dvrlgbcwua81zcetza3u.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=dvrlgbcwua81zcetza3u.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:c14bd96c2cf76b70eedcd090668664f967ef1c29","amp;dn":"%5BNubileFilms%5D+Jennifer+White+%28Young+Love+%2F+09.16.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c14bd96c2cf76b70eedcd090668664f967ef1c29","infoHashBuffer":{"type":"Buffer","data":[193,75,217,108,44,247,107,112,238,220,208,144,102,134,100,249,103,239,28,41]},"announce":[],"urlList":[]}}