{"title":"Hannibal Buress - My Name Is Hannibal [2010] v0","uid":8343893,"size":86895100,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c264fb7cfcc0f22dd8d65d32cf4bcd9a99be0684&amp;dn=Hannibal+Buress+-+My+Name+Is+Hannibal+%5B2010%5D+v0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":0,"uploader":"rambam1776","files":-1,"time":1365156762,"description":"Hannibal Buress - My Name Is Hannibal 2010 V0\n &lt;a href=&quot;\nhttp://pitchfork.com/reviews/albums/14560-my-name-is-hannibal/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pitchfork.com/reviews/albums/14560-my-name-is-hannibal/&lt;/a&gt;\n\nChicago's Hannibal Buress is a relatively unknown 27-year-old comic whose credits are limited to some night talk show gigs, appearances in a few scenes from buddy Louis C.K.'s new FX show &quot;Louie&quot;, and, most notably, working as a writer on &quot;Saturday Night Live&quot;'s dismal past season. My Name Is Hannibal, his debut album of stand-up, was recorded at Chicago's now-extinct Lakeshore Theatre and features almost an hour of Buress' dryly-delivered observations on topics that would seem too quirky or far-out if it weren't for his ability to keep things conversational. His set feels something like indulging a friend in a strange late night discussion where weed-induced analytical precision is applied to goofy but commonplace ideas: Unlocking the mixological mysteries of the Flaming Dr. Pepper, contemplating the purpose of the fire SUV, exploring the ridiculousness of fly-related idioms.\n\nNo, this isn't high-minded stuff, and it's almost completely lacking in anything you could call &quot;commentary.&quot; And given how well his conclusions and quotable, whip-smart punchlines complement these musings, you could see where Buress might want to delve deeper, to try and unearth something really thought-provoking. But he's too busy making you laugh. His relaxed approach (&quot;People always think I'm high all the time. 'Hannibal, you look high, you sound high, you high?' No, I'm not high... I'm just way cooler than you.&quot;) draws attention to the fact that he's doing a bit and somehow managing to make it feel chatty and off-the-cuff. So it makes sense that Buress has been called &quot;the black Mitch Hedberg&quot; (a tag he's brushed off), but you can also hear Steven Wright's fondness for classic joke structures, Patton Oswalt's pop-culture insight, and Louis C.K.'s self-awareness.\n\nBuress takes on overly familiar topics-- rap videos, Grand Theft Auto, airline travel-- and makes something fresh out of them by simply writing better jokes. To compare My Name Is Hannibal to another big comedy record from this year, Aziz Ansari's Intimate Moments for a Sensual Evening, Buress gets over by sticking to the script and executing flawlessly, earning his laughs thanks to his material and not his persona. Which isn't to say that Buress doesn't have personality, just that he tends to exist on the &quot;comic's comic&quot; end of the spectrum. And there's something gratifying about seeing a young comic making his way on those terms, especially when it results in one of the more laugh-filled hours you're likely to spend this year.\n\n01 - I Don't Know You Either\n02 - Stuff About Rap And Some Other Things\n03 - My Name Is Hannibal\n04 - Metal Arms\n05 - I Play Video Games\n06 - Weed And Things\n07 - Fire Suv\n08 - Balling Out Of Control\n09 - In The Streets\n10 - Pickle Juice\n11 - It's Hard Out Here\n12 - I'm 'Bout It 'Bout It\n13 - Men And Women Are Vastly Different From Each Other\n14 - Pigeons Get Murked\n15 - Family Stuff","torrent":{"xt":"urn:btih:c264fb7cfcc0f22dd8d65d32cf4bcd9a99be0684","amp;dn":"Hannibal+Buress+-+My+Name+Is+Hannibal+%5B2010%5D+v0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c264fb7cfcc0f22dd8d65d32cf4bcd9a99be0684","infoHashBuffer":{"type":"Buffer","data":[194,100,251,124,252,192,242,45,216,214,93,50,207,75,205,154,153,190,6,132]},"announce":[],"urlList":[]}}