{"title":"DangerDoom-The Mouse and the Mask Retail Release (unedited) unde","uid":3395385,"size":95861268,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c34b60245ec8c15d91e832149b4c7b36fc96a8ad&amp;dn=DangerDoom-The+Mouse+and+the+Mask+Retail+Release+%28unedited%29+unde&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":0,"uploader":"indierockerseattle","files":18,"time":1129088805,"description":"Some of the cartoon character voices are edited.\nseems to be the same as my early release of the album which i also uploaded here, but i am uploading this one as a retail copy rip at 320 kbps .mp3 quality\n\n\nArtist: DangerDoom (Dangermouse &amp; MF Doom)\nAlbum: The Mouse and the Mask\nYear: 2005\nGenre: Hip Hop\nLabel: Epitaph\nTime: 39:56\nTrack List:\n     1. El Chupa Nibre\n     2. Sofa King\n     3. The Mask Feat. Ghostface\n     4. Perfect Hair\n     5. Benzie Box Feat. Cee-Lo\n     6. Old School Feat. Talib Kweli\n     7. A.T.H.F.\n     8. Basket Case\n     9. No Names\n    10. Crosshairs\n    11. Mince Meat\n    12. Vats of Urine\n    13. Space Ho's\n    14. Bada Bing\nFile Type: MP3 Audio\nTotal Size: 91.40 MB\n\n\nTwo of this generation's most respected hip-hop artists, Danger Mouse and MF DOOM, have come together to produce DANGERDOOM: The Mouse and the Mask, an album inspired by Adult Swim, Cartoon Network's popular late-night animation network. The album will be released on Epitaph Records, in association with Adult Swim. The album will contain character voices and skits from Adult Swim's most popular original shows, including Aqua Teen Hunger Force, Sealab 2021 and Harvey Birdman, Attorney at Law.\nDanger Mouse is recognized as one of music's most innovative artists and producers. Danger Mouse's The Grey Album, an ingenious re-production of Jay-Z's Black Album with the Beatles' White Album, was named the Album-of-the-Year in 2004 by Entertainment Weekly and catapulted him into the international spotlight. Danger Mouse recently produced Gorillaz Demon Days album, which has sold more than 500,000 copies worldwide in it's initial first weeks of release. His next project is Gnarls Barkley, a collaboration with music's flamboyant, one-of-a-kind force of nature, Cee-Lo.\n\nAfter a five-year hiatus that ended in 1998, Daniel Dumile, a former member of KMD, emerged as MF DOOM, a persona inspired by the comic supervillain Dr. Doom, and released the critically praised albums Operation: Doomsday and Mmm...Food. DOOM also released one of 2004's most acclaimed albums, Madvillain (featured in Spin, Rolling Stone, Vibe, The New Yorker, etc), under the same name and Venomous Villain under the name Victor Vaughn. He has been involved in a number of collaborations with the industry's finest and has a project with Ghostface Killah (Wu-Tang Clan) in the works.","torrent":{"xt":"urn:btih:c34b60245ec8c15d91e832149b4c7b36fc96a8ad","amp;dn":"DangerDoom-The+Mouse+and+the+Mask+Retail+Release+%28unedited%29+unde","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c34b60245ec8c15d91e832149b4c7b36fc96a8ad","infoHashBuffer":{"type":"Buffer","data":[195,75,96,36,94,200,193,93,145,232,50,20,155,76,123,54,252,150,168,173]},"announce":[],"urlList":[]}}