{"title":"Adobe CS5 Master Collection SN block-script [MAC Only]","uid":5529568,"size":28068,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c4172ca39b7f2f6a05184233bfda58f2359d58a1&amp;dn=Adobe+CS5+Master+Collection+SN+block-script+%5BMAC+Only%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":1,"uploader":"Godoid","files":3,"time":1272846138,"description":"This is for the Mac. NOT for Windows. Please keep Windows discussions off this thread.\n\nFollow the included instructions and you're good to go. If you're having problems with the serial, remember to install as a trial first, then use the serial when you first run a CS5 app. If you haven't downloaded CS5 yet, get it from Adobe for free: http://www.adobe.com/ap/downloads/\n\nA note about the included Block Adobe Activation script:\nThe app will block the same servers used for CS4. Not one new server is needed. If you already have blocked Adobe before on your machine, you can skip it.\n\nYes there are bigger lists out there. They will prevent you from being able to get updates, use Adobe Live, get additional content or get additional help or visit Adobe community forums.\nYou can safely update your apps, they will not get blocked. All the necessary servers are blocked by the script. Anything else if optional, it will not invalidate your serial, ever. I promise.\nAnd let's all thank thebug for the script. I added the dialog boxes but he did all the hard work!\n\nFYI, the serials are good for any of the following apps, if it's not listed, it probably won't work:\n\nAdobeÃ‚Â® PhotoshopÃ‚Â® CS5 Extended\nAdobeÃ‚Â® IllustratorÃ‚Â® CS5\nAdobeÃ‚Â® InDesignÃ‚Â® CS5\nAdobeÃ‚Â® AcrobatÃ‚Â® 9.3 Professional\nAdobeÃ‚Â® FlashÃ‚Â® CatalystTM CS5\nAdobeÃ‚Â® FlashÃ‚Â® Professional CS5\nAdobeÃ‚Â® FlashÃ‚Â® BuilderTM 4 Standard\nAdobeÃ‚Â® DreamweaverÃ‚Â® CS5\nAdobeÃ‚Â® FireworksÃ‚Â® CS5\nAdobeÃ‚Â® ContributeÃ‚Â® CS5\nAdobeÃ‚Â® PremiereÃ‚Â® Pro CS5\nAdobeÃ‚Â® After EffectsÃ‚Â® CS5\nAdobeÃ‚Â® SoundboothÃ‚Â® CS5\nAdobeÃ‚Â® OnLocationTM CS5\nAdobeÃ‚Â® EncoreÃ‚Â® CS5\nAdobeÃ‚Â® Bridge CS5\nAdobeÃ‚Â® Device Central CS5\nAdobeÃ‚Â® Media Encoder CS5\nAdobeÃ‚Â® Extension Manager\n\nPlease do NOT post serials on this thread. They are made public and will be blacklisted.\n\n-----------------------------------------------------------------------------------\n\nDICKHEAD WARNING: THIS IS NOT A TORRENT I UPLOADED. THIS WAS POSTED FOR PEOPLE WHO WANT IT. IF YOU DON'T JUST FUCK OFF!!\n\nWant L.o.c.k.e.r.z invites? post your e-mail here as a comment!!\nRequest a Demonoid torrents? post the torrents full name here as a comment.\nFan Us for more stuff: search for u.n.l.o.c.k.e.r.z of Facebook.\n{in all names remove the dots for the real name. TPB-SuperGirl fucked me with her screening cunt ;P}\n\n----------------------------------------------------------------------------------\n\nFor all of you that have problems with installation\nI thought it would be useful to post step by step installation instructions. I already posted them at the &quot;Adobe CS5 Master Collection [MAC]&quot; torrent on The Pirate Bay. In particular read the &quot;REMOVE.....&quot; section of this post if you have problems with your Adobe installations. With respect to where to go for your installation packages: I prefer to get them from the torrents. They are the same as what you download from the Adobe website. However, there has been some discussion on Demonoid about Adobe matching registration info with your IP address when you download the package. I'm not sure about the validity of this claim but I prefer to play safe and get the packages via torrents.\n\nIf you follow the steps below you will not have to run the &quot;Block Activation&quot; script included in this torrent. Basically the &quot;Terminal&quot;, &quot;TextEdit&quot; and &quot;Finalize Adobe CS5 Installation&quot; steps below guide you manually through the automated &quot;Block Activation&quot; script. Please install CS5 in the way that you prefer.\n\nYou may notice below that I recommend to &quot;turn off Airport&quot; during installation and to run &quot;sudo dscacheutil -flushcache&quot; after updating the /etc/hosts file. I'm not sure if these steps are necessary but I recommend to do so anyway. Also notice the link to Acrobat 9 Pro at the bottom of the post:\n\nREMOVE OLD ADOBE INSTALLATIONS (IF APPLICABLE) BEFORE INSTALLING ADOBE CS5\nRemove the following Adobe applications, folders and files before installing the Adobe CS5 Master Collection (but check notes below this list first):\n/Applications/Adobe... (everything with Adobe)\n/Library/Application Support/Adobe\n/Library/Application Support/FLEXnet Publisher\n/Library/Preferences/com.adobe... (everything with com.adobe)\n/Library/Preferences/FLEXnet Publisher\n~/Library/Application Support/Adobe\n~/Library/Application Support/Adobe/Acrobat\n~/Library/Preferences/Acrobat\n~/Library/Preferences/Acrobat Distiller Prefs\n~/Library/Preferences/Adobe... (everything with Adobe)\n~/Library/Preferences/com.adobe... (everything with com.adobe)\n\nA few notes:\n- / is the system root folder (which you can find in Finder by clicking on the hard drive icon at devices)\n- ~ is the User folder (which you can find in Finder by clicking on the home icon at places)\n- I strongly recommend to delete the &quot;/Library/Application Support/FLEXnet Publisher&quot; and &quot;/Library/Preferences/FLEXnet Publisher&quot; folders if you have old Adobe applications installed. Keeping an old version of this folder can cause a variety of licensing errors. It will automatically be regenerated with the CS5 installation.\n- Obviously, if you're attached to your old Adobe application preferences, don't delete the preferences files in the system and User libraries. There is no harm in doing so, they'll be automatically regenerated but by deleting them you will loose your user preferences. I prefer to start with a clean system but that may not be the case for everybody.\n\nINSTALLATION OF ADOBE CS5\nDisconnect from network/internet (Turn AirPort Off). Double click &quot;CS5_Master_Collection.dmg&quot; to install the Adobe CS5 Master Collection. Whilst installing CS5, ensure that you choose &quot;Install this product as a trial&quot; and DO NOT enter any serials. If you've already installed CS5 applications using a serial, load any of the installed CS5 applications and select Help &gt; Deactivate. Quit all of the installed CS5 applications.\n\nTERMINAL\nLaunch a Terminal window (in /Applications/Utilities) and copy and paste:\nsudo /Applications/TextEdit.app/Contents/MacOS/TextEdit /etc/hosts\n\nHit return and type your admin password.\nThe &quot;hosts&quot; file should automatically open in TextEdit.\n\nTEXTEDIT\nIf the following lines are already part of the &quot;hosts&quot; file close it and continue with the &quot;Finish&quot; section. If not hit return (in the opened &quot;hosts&quot; file) and copy and paste following lines:\n127.0.0.1 activate.adobe.com\n127.0.0.1 practivate.adobe.com\n127.0.0.1 ereg.adobe.com\n127.0.0.1 activate.wip3.adobe.com\n127.0.0.1 wip3.adobe.com\n127.0.0.1 3dns-3.adobe.com\n127.0.0.1 3dns-2.adobe.com\n127.0.0.1 adobe-dns.adobe.com\n127.0.0.1 adobe-dns-2.adobe.com\n127.0.0.1 adobe-dns-3.adobe.com\n127.0.0.1 ereg.wip3.adobe.com\n127.0.0.1 activate-sea.adobe.com\n127.0.0.1 wwis-dubc1-vip60.adobe.com\n127.0.0.1 activate-sjc0.adobe.com\n\nSave the &quot;hosts&quot; file, DO NOT Save As?.\n\nFINALIZE ADOBE CS5 INSTALLATION\nIn Terminal copy and paste:\nsudo dscacheutil -flushcache\n\nHit return (and type your admin password if asked for it). The Adobe activation servers are now blocked.\n\nFINISH ADOBE CS5 INSTALLATION\nLaunch any of the installed CS5 applications and enter a serial that is included in the torrent.\n\nConnect back to network/internet (Turn AirPort On). You can start using CS5 applications.\nRun any CS5 application &gt; Help &gt; Updates... multiple times until all installed Adobe CS5 applications are up to date.\n\nADOBE ACROBAT 9 PRO INSTALLATION\nDownload Adobe Acrobat 9 Pro (not included in the CS5 torrent). On the Demonoid website search for &quot;Acrobat Pro 9.0 + 9.1 Update + SN&quot;.\nAdobe Acrobat 9 Pro can be installed by double clicking &quot;Adobe Acrobat 9 Pro.dmg&quot;. After installation is finished install the 9.1.0 update by double clicking the &quot;AcroProUpd910_all.dmg&quot; installation package.\nLaunch Adobe Acrobat 9 Pro and enter the serial that is included in the torrent.\n\nRun Adobe Acrobat &gt; Help &gt; Check for Updates... multiple times until Adobe Acrobat 9 Pro is up to date.","torrent":{"xt":"urn:btih:c4172ca39b7f2f6a05184233bfda58f2359d58a1","amp;dn":"Adobe+CS5+Master+Collection+SN+block-script+%5BMAC+Only%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4172ca39b7f2f6a05184233bfda58f2359d58a1","infoHashBuffer":{"type":"Buffer","data":[196,23,44,163,155,127,47,106,5,24,66,51,191,218,88,242,53,157,88,161]},"announce":[],"urlList":[]}}