{"title":"Dark History of the Catholic Church: Wars, Witch Hunts ...","uid":15796395,"size":13649470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c418f9dae524017d94740a7e9ddd093eb832bca5&amp;dn=Dark+History+of+the+Catholic+Church%3A+Wars%2C+Witch+Hunts+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":0,"uploader":"marty14","files":1,"time":1473462104,"description":"Dark History of the Catholic Church: Schisms, Wars, Inquisitions, Witch Hunts, Scandals, Corruption - Michael Kerrigan [epub]\r\n\r\nThe world’s largest Christian organization with 1.2 billion members, the Catholic Church is one of the world’s oldest institutions and has played a crucial part in the development of Western civilization. But in its rise from Jewish sect to global faith, it has been both the persecuted and the persecutors; it has become powerful but guilty of corruption; and it has preached moral purity but has been marred by abuse scandals.\r\n\r\nFrom the persecution of the early Christians in ancient Rome, through the terrors of the anti-heresy witchhunts of the notorious Grand Inquisitor, Torquemada, to papal collaboration with the Nazis during World War II, Dark History of the Catholic Church tells the stories of heretics and pogroms, Mother Teresa and martyred priests, papal purges and crooked clergy, false prophets and faithless pontiffs. \r\n\r\nIllustrated with 180 photographs, paintings, and illustrations, Dark History of the Catholic Church reveals the infamous underside of the world’s oldest Christian faith","torrent":{"xt":"urn:btih:c418f9dae524017d94740a7e9ddd093eb832bca5","amp;dn":"Dark+History+of+the+Catholic+Church%3A+Wars%2C+Witch+Hunts+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c418f9dae524017d94740a7e9ddd093eb832bca5","infoHashBuffer":{"type":"Buffer","data":[196,24,249,218,229,36,1,125,148,116,10,126,157,221,9,62,184,50,188,165]},"announce":[],"urlList":[]}}