{"title":"LIMBO.PC.Version.[Install And Play]-13uzer37","uid":6618423,"size":86258761,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c442c1676e86424a1fdbae4879d43a2691908083&amp;dn=LIMBO.PC.Version.%5BInstall+And+Play%5D-13uzer37&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":1,"uploader":"WoWguy6","files":-1,"time":1313884020,"description":"1              3                   UZER                3           7\n\n\n\n\nGAMEPLAY\n\nThe player controls the boy for the entire game. As is typical of most two-dimensional platform games, the player can make the boy run left or right on the screen, jump, climb up short ledges or up and down ladders and ropes, and push or pull objects. The game is presented through dark, greyscale graphics and with minimalist ambient sounds, creating an eerie, haunting environment. The dark visuals also hide numerous environmental and physical traps, such as bear traps on the forest floor or monsters in the shadows that will attempt to kill the boy. These monsters include a giant spider and worms that dig into the boy\\\\\\'s brain and force him to travel in one direction until the worms are killed.\n\nThe second half of the game features puzzles and traps involving more mechanical aspects, such as machinery, electromagnetism, and gravity. Many of these traps are not apparent until triggered, often killing the boy. Should this happen, the player restarts the game at the last checkpoint; there is no limit on how many times this can occur. However, the player can often avoid these traps and then use them later, such as using a bear trap to clamp onto an animal carcass at the end of a rope and pulling it taut, allowing the boy to climb up to a ledge that was otherwise out of reach. Because these traps are not known until the player activates them, the developers called the game a \\\\\\&quot;trial and death\\\\\\&quot; game, as the player will likely encounter numerous deaths before they solve each puzzle and complete the game. Many deaths are animated with images of dismemberment or beheading of the boy, but an optional gore filter blacks out the screen instead of showing these deaths. Game achievements (optional in-game goals) include finding hidden insect eggs and completing the game with five or fewer deaths.\n\n\n\n\n\nInstall nOtes:\n\n1. Open \\\\\\&quot;INSTALL.exe\\\\\\&quot;\n2. Choose language and install\n3. ENJOY!!! (READ BELOW FOR VERY IMPORTANT INFO!!!!)","torrent":{"xt":"urn:btih:c442c1676e86424a1fdbae4879d43a2691908083","amp;dn":"LIMBO.PC.Version.%5BInstall+And+Play%5D-13uzer37","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c442c1676e86424a1fdbae4879d43a2691908083","infoHashBuffer":{"type":"Buffer","data":[196,66,193,103,110,134,66,74,31,219,174,72,121,212,58,38,145,144,128,131]},"announce":[],"urlList":[]}}