{"title":"F1.2014-RELOADED","uid":11230665,"size":2629441684,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c49be1970567edf72623ca2529b3b6b8a554cca9&amp;dn=F1.2014-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":4,"uploader":"Taker009","files":-1,"time":1413522320,"description":"                                     nERv \n\n                            F1 2014  (c) Codemasters\n\n           10/2014 :..... RELEASE.DATE .. PROTECTION .......: Steam + CEG\n                   :.......... DISC(S) .. GAME.TYPE ........: Racing, Sports\n\n   \n\n   Feel the power of new turbocharged FORMULA ONE cars in the most accessible\n   FORMULA 1 video game yet. F1 2014 features all the cars, drivers and\n   circuits from the 2014 FIA FORMULA ONE WORLD CHAMPIONSHIP, including new\n   tracks in Russia and Austria, the return of the Hockenheimring in Germany\n   and the 2014 FORMULA 1 GULF AIR BAHRAIN GRAND PRIX which ran at night for\n   the first time in 2014. A new driver evaluation system which tunes the\n   game to your level, shorter career options, refined handling and new Very\n   Easy difficulty level brings FORMULA ONE alive for absolute novices.\n   Experienced gamers can customise their settings to enjoy a more serious\n   simulation of the demands placed upon FORMULA ONE drivers. An expanded\n   Scenario mode, extensive online multiplayer options and split-screen\n   racing enhances F1 2014's recreation of the world of FORMULA ONE for\n   long-established fans and newcomers to the series.\n\n   NEW CIRCUITS\n   Race the new Spielberg circuit in Austria, the new Sochi Autodrom in\n   Russia and the return of the Hockenheimring, plus experience the\n   2014 FORMULA 1 GULF AIR BAHRAIN GRAND PRIX which was run as a night race\n   for the first time this year\n\n   ALL THE CARS, ALL THE STARS\n   F1 2014 features all of the new season's driver changes up and down the\n   grid and the dramatic changes in this season's cars\n\n   EXTENSIVE MULTIPLAYER OPTIONS\n   Prove yourself in two-player split-screen or online in 16 player races\n   with 6 AI to simulate full 22 car grids\n\n   DRIVER EVALUATION SYSTEM\n   Replacing the Young Driver Test in-game is the driver evaluation system,\n   which tunes the game to your level following a one lap race\n\n   RACENET Track your stats and get new regular online challenges with\n   RaceNet, Codemasters' free online community hub\n\n   ERS DEBUTS Replacing last season's KERS system, ERS delivers drivers\n   more power automatically and opens up overtaking opportunities\n   - feel how this extra power changes the race\n\n   EXPANDED SCENARIO MODE\n   Complete an increased range of scenarios based on real-world racing\n   situations and earn medals in this extended mode\n\n   REFINED HANDLING\n   Enhanced game physics combine with refined handling via gamepads to\n   deliver a more authentic and accessible driving experience for all\n   players\n\n   TURBOCHARGED FORMULA ONE\n   Experience the raw power delivered by the new turbochargers in changes\n   the handling in each F1 2014 car\n\n   ENHANCED CAREER MODES\n   Play through a full FORMULA ONE season or choose from shorter seasons,\n   including 7 race and 12 race options.\n\n  \n\n  1. Unrar.\n  2. Burn or mount the image.\n  3. Install the game.\n  4. Copy over the cracked content from the /Crack directory to\n     your game install directory.\n  5. Play the game.\n  6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:c49be1970567edf72623ca2529b3b6b8a554cca9","amp;dn":"F1.2014-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c49be1970567edf72623ca2529b3b6b8a554cca9","infoHashBuffer":{"type":"Buffer","data":[196,155,225,151,5,103,237,247,38,35,202,37,41,179,182,184,165,84,204,169]},"announce":[],"urlList":[]}}