{"title":"Dante: The Story of His Life","uid":16044593,"size":1027554,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4f09ece445ddf929df2503a402656c19a225539&amp;dn=Dante%3A+The+Story+of+His+Life&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":3,"uploader":"marty14","files":1,"time":1476550412,"description":"Dante: The Story of His Life - Marco Santagata [epub]\r\n\r\nMarco Santagata’s Dante: The Story of His Life illuminates one of the world’s supreme poets from many angles―writer, philosopher, father, courtier, political partisan. Santagata brings together a vast body of Italian scholarship on Dante’s medieval world, untangles a complex web of family and political relationships for English readers, and shows how the composition of the Commedia was influenced by local and regional politics.\r\n\r\nSantagata traces Dante’s attempts to establish himself in Florentine society as a man of both letters and action. He raises the intriguing possibility that Dante translated an illness, thought by some to be epilepsy, into an intensely physical phenomenology of love in the Vita Nova. Most importantly, Santagata highlights Dante’s constant need to readjust his political stance―his involvement with the pro-Papacy Guelph faction as well as his network of patrons―in response to unfolding events. Linking these shifts to the changing ethical and political convictions expressed in the Commedia, Santagata reveals the paradoxical achievement of Dante’s masterpiece: a unified, universal poem nonetheless intimately entwined with the day-to-day dealings of its author.\r\n\r\nThe most striking facet of Dante’s personality was a belief in his unique destiny. In every aspect of his life―his birth under the sign of Gemini, falling in love with Beatrice, banishment from Florence―Dante glimpsed the shadow of his fate. This idea, cultivated by the poet in his youth, grew into the conviction that God had invested him with the prophetic mission of saving humanity","torrent":{"xt":"urn:btih:c4f09ece445ddf929df2503a402656c19a225539","amp;dn":"Dante%3A+The+Story+of+His+Life","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4f09ece445ddf929df2503a402656c19a225539","infoHashBuffer":{"type":"Buffer","data":[196,240,158,206,68,93,223,146,157,242,80,58,64,38,86,193,154,34,85,57]},"announce":[],"urlList":[]}}