{"title":"Underground (eng subs) [1995] Emir Kusturica","uid":6194696,"size":1469424404,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c53c2b2a1ac8b6b2705458a197fbd100eb886b5b&amp;dn=Underground+%28eng+subs%29+%5B1995%5D+Emir+Kusturica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1298422157,"description":" &lt;a href=&quot;http://bayimg.com/PAeAjaADA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/PAeAjaADA&lt;/a&gt;\n\nUnderground (1995) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0114787/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0114787/&lt;/a&gt;\n\nSerbian language with English subtitles.\n\nUnderground (Serbian: Podzemlje) is a 1995 award-winning film directed by Emir Kusturica with a screenplay by DuÃ…Â¡an Kovacevic.\n\nIt is also known by the subtitle Once Upon a Time There Was a Country (Serbian: Bila jednom jedna zemlja), which was the title of the 5-hour mini-series shown on Serbian RTS television.\n\n  Miki Manojlovic  ...  Marko  \n  Lazar Ristovski  ...  Crni (Blacky)  \n  Mirjana Jokovic  ...  Natalija  \n  Slavko Stimac  ...  Ivan  \n  Ernst StÃƒÂ¶tzner  ...  Franz  \n  Srdjan Todorovic  ...  Jovan  \n  Mirjana Karanovic  ...  Vera  \n  Milena Pavlovic  ...  Jelena  \n  Danilo 'Bata' Stojkovic  ...  Deda (as Bata Stojkovic)  \n  Bora Todorovic  ...  Golub  \n  Davor Dujmovic  ...  Bata  \n  Dr. Nele Karajlic  ...  Falling Gypsy  \n  Branislav Lecic  ...  Mustafa  \n  Dragan Nikolic  ...  Film Director  \n  Erol Kadic  ...  Janez \n\nThe film uses the epic story of two friends to portray and satirise the history of Yugoslavia since the Second World War. The film was an international co-production among companies from FR Yugoslavia, France, Germany and Hungary.\n\nThe theatrical version is 163 minutes long. In interviews, Kusturica stated that his original version ran for over 320 minutes, and that he was forced to cut it by co-producers.\n\nThe film has not been widely reviewed by English-language critics, though it has gained generally favorable reviews. On the Rotten Tomatoes website, it currently garners an 83% approval rating out of 18 reviews. Kevin Thomas of the Los Angeles Times called it a &quot;sprawling, rowdy, vital film laced with both outrageous absurdist dark humor and unspeakable pain, suffering and injustice.&quot;\n\nThe film was considered controversial by some critics. Stanko Cerovic, director of the Serbo-Croatian editorial department of Radio France Internationale, said that it promoted Serbian nationalist propaganda. The state-owned Radio Television of Serbia had a small role in financing the film, and the film used rented Yugoslav army equipment as props. While some critics claimed the film propagated a pro-Serbian and Chetnik view of the Yugoslav conflict (including animosities during WWII), others suggested that its characterization of Balkan ethnic groups was equally caustic to each.\n\nSlavoj Ã…Â½iÃ…Â¾ek and the French writer Bernard-Henri LÃƒÂ©vy said they considered themselves 'enemies' of Kusturica on the basis of his film Underground. LÃƒÂ©vy commended the film's cinematography and narrative structure.\n\nUnderground is Emir Kusturica's wildly ambitious, relentlessly energetic, tragicomic allegory for the history of his native Yugoslavia from the Nazi invasion of World War II up to the disintegration of the unified country in the bloodshed and genocide of the Balkan wars. It is primarily the story of two friends, Marko (Miki Manojlovic) and Blacky (Lazar Ristovski), who start out as black marketeers providing weapons to the anti-fascist resistance, even as they become embroiled in a love triangle over the actress Natalija (Mirjana Jokovic), who they both adore. The film's allegorical structure becomes readily apparent when the war ends, and Marko becomes a prominent figure in Yugoslavia's new Communist government, while keeping Blacky and many of their other friends hidden in an underground bunker, unaware that the war against Germany has ended. It's an obvious metaphor for the deceit and manipulation rampant in Yugoslavia under Communism, with the common people kept in the dark while the party leadership enriched themselves and gorged on power.\n\nWith such weighty themes threading through the film, one would expect it to be a heavy and ponderous experience, especially considering its nearly three-hour running time. Rather, it is surprisingly light on its feet, with a boisterous spirit and a comic exuberance that only begins to falter when the film takes a turn into horrifying darkness for its final act, mirroring Yugoslavia's descent into the scourging fire of ethnic war. Before this bracing coda, the film is often darkly hilarious even at its saddest or most violent moments. Blacky, a fun-loving soul with a generous heart and a prodigious capacity for celebration, often drafts a full marching band into following him around everywhere he goes. The film is propelled by the pulse of the region's music, a constant ba-bum-bum-bum rhythm emanating from the ever-present horn section. Underground is a joyous, celebratory, delirious satire that traces a country's history in the overblown, comic saga of a pair of friends whose story reflects the larger struggles of their nation.\n\nUnderground is a visually aggressive dystopian dream in the style of Terry Gilliam or Jean-Pierre Jeunet, but it's no rip-off; its cultural specificity, and the personal longing with which Kusturica tells his tale ensure that. The film seamlessly knits cartoon silliness with haunting sorrow and just about every tone and emotion in between. Its wildly schizophrenic sprawl is built on a foundation of that particular combination of existential pain and unquenchable appetite for life, that full-on bear-hug of the pure and profane, singular to Eastern European art and literature. Blacky, in particular, evokes that most bawdy, passionate, lovable, and despicable of literary patriarchs, Dostoevsky's Fyodor Pavlovich Karamazov. Kusturica's film has a breadth, depth, scope, texture, and density of theme, ideas, and emotions that approximates life itself. His characters aren't a simple collection of entwined psychological motivations, sometimes in league and sometimes in conflict with one another; they're a messy mass of roiling contradictions, which is to say they're convincingly human, despite (or maybe because of) their often over-the-top antics.\n\nThe film's greatness lies in how the unfolding relationship between Marko and Blacky, their sometimes violent brotherly love for one another, parallels the passionate strife of their homeland. In the film's nearly three-hour running time, Kusturica throws at us repeated motifs of filial loyalty, human duplicity, the anguish of separation, the human tendency to construct false but convenient realities, and the shattering cost of war and violence. All of these ideas are woven into the film in such a way that they feel subordinate to character. As an audience, we ride along entertained by the wild antics of Blacky, Marko, and their cohorts, the film's big ideas slowly coming into focus over the course of its long runtime. Making a film meant to express a national and cultural identity is fraught with risk, the most obvious of which is a bloated, self-serious end product. Kusturica's succeeded in creating a national epic that is a deeply intimate and ornately detailed study of the texture of human existence. But perhaps Underground's greatest feat is a pitch-perfect Felliniesque ending that offers resilient optimism for a place in the world where hope has been a rare commodity for the past half-century.\n\n","torrent":{"xt":"urn:btih:c53c2b2a1ac8b6b2705458a197fbd100eb886b5b","amp;dn":"Underground+%28eng+subs%29+%5B1995%5D+Emir+Kusturica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c53c2b2a1ac8b6b2705458a197fbd100eb886b5b","infoHashBuffer":{"type":"Buffer","data":[197,60,43,42,26,200,182,178,112,84,88,161,151,251,209,0,235,136,107,91]},"announce":[],"urlList":[]}}