{"title":"Blind Melon - Discography (1992-2008) [FLAC]","uid":8838362,"size":1385757218,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c5635265026e35ededb57d76ae3e9e964cd06e84&amp;dn=Blind+Melon+-+Discography+%281992-2008%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":8,"uploader":"politux","files":-1,"time":1377185083,"description":"\n  Blind Melon - Discography (1992-2008) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Alternative\n  Source: CD\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n  \n  1992 Blind Melon\n  1995 Soup\n  1996 Nico\n  2008 For My Friends\n\n  Whereas most up-and-coming alternative bands of the early '90s borrowed from the leaders of the pack (Nirvana, Soundgarden, Nine Inch Nails, etc.), Blind Melon were an exception to the rule -- their roots lay in classic rock (Lynyrd Skynyrd, Grateful Dead, Led Zeppelin). And while a promising career lay ahead of them, tragedy would ultimately end the band abruptly. The group came together in 1989 in Los Angeles, although all their respective members had migrated there from other U.S. locales (singer Shannon Hoon from Indiana; guitarist Christopher Thorn from Pennsylvania; and guitarist Rogers Stevens, bassist Brad Smith, and drummer Glenn Graham all hailed from Mississippi). The complete opposite of all the glossed-up glam metal that was permeating the Sunset Strip at the time, the quintet used a refreshing back-to-basics approach, both musically and visually (giving off a heavy retro vibe early on). The band considered several names -- Brown Cow, Mud Bird, Naked Pilgrims, and Head Train -- before agreeing on Blind Melon, a phrase that Smith's father would use to describe a couple of hippie neighbors from back home in Mississippi.\n\n  With the band's lineup and name solidified, Capitol Records became interested solely on the strength of a four-song demo, titled The Goodfoot Workshop. Although Blind Melon only had a limited repertoire of songs at the time, they managed to convince Capitol that they had a healthy backlog of compositions, and were signed in 1991. The band set out shortly thereafter to work on an EP, produced by longtime Neil Young producer David Briggs and titled The Sippin' Time Sessions. But when the end results came out surprisingly slick and doctored, the project was shelved. Hoon, in the meantime, became reacquainted with an old friend of his sister's from back home in Indiana, Guns N' Roses' frontman Axl Rose, who invited Hoon to sing backup on several tracks for Guns N' Roses' Use Your Illusion I set. Hoon lent his vocal talents to several tracks, the best-known being the ballad &quot;Don't Cry,&quot; even appearing along with GNR in the song's epic video. Doubled with a high-profile appearance on MTV's 120 Minutes Tour in the spring of 1992 (along with Live, Big Audio Dynamite, and Public Image Ltd.), a buzz began to emerge regarding Blind Melon. The only problem was, they still didn't have an album in the racks.\n\n  The band had gone back into the studio earlier in the year with Temple of the Dog/Pearl Jam producer Rick Parashar, and although the sessions were completed by springtime, their self-titled debut didn't see the light of day until September 1992, by which time their springtime industry buzz had long since dissipated. For the remainder of the year and the early part of 1993, the quintet toured U.S. clubs nonstop (as well as landing arena opening slots for their pals Guns N' Roses). Although several videos/singles came and went without much MTV/radio fanfare, the Samuel Bayer-directed clip for their upbeat ditty &quot;No Rain&quot; (in which Blind Melon's album cover -- which included an old picture of Graham's sister dressed in a bumblebee-like outfit -- came to life) became a smash and catapulted the single and the album to the top of the charts (Blind Melon would eventually go platinum four times over).\n\n  Blind Melon spent the remainder of 1993 on the road opening for Neil Young and Lenny Kravitz, before embarking on their own headlining tour of theaters in 1994 (during which time they were nominated for a pair of Grammys, for Best New Artist and Best Rock Performance). But it was during this time that drug use spiraled out of control for Hoon, and the band was forced to pull the plug on the remainder of the tour as Hoon sought treatment. Blind Melon managed to play a few more shows later in the year -- handing in a memorable appearance at Woodstock '94 and opening up for the Rolling Stones on select dates in September. Recording sessions began in the fall of 1994 for their sophomore effort in New Orleans, with renowned producer Andy Wallace behind the boards.","torrent":{"xt":"urn:btih:c5635265026e35ededb57d76ae3e9e964cd06e84","amp;dn":"Blind+Melon+-+Discography+%281992-2008%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5635265026e35ededb57d76ae3e9e964cd06e84","infoHashBuffer":{"type":"Buffer","data":[197,99,82,101,2,110,53,237,237,181,125,118,174,62,158,150,76,208,110,132]},"announce":[],"urlList":[]}}