{"title":"Trey Songz - Ready (Deluxe Version)(320kps@SSDJ)","uid":5987375,"size":143946636,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c56afe9746ee240c936e8015014b360ed989df24&amp;dn=++Trey+Songz+-+Ready+%28Deluxe+Version%29%28320kps%40SSDJ%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":3,"uploader":"michelinman","files":19,"time":1290780029,"description":"[img]http://ecx.images-amazon.com/images/I/51qg3LgEfKL._SL500_AA300_.jpg[/img]\n# Audio CD \n# Number of Discs: 1\n# Format: CD\n# Label: Atlantic\nExcept for his shirt of course. Trey is unwavering to make his mark as one of the best R&amp;B singers in the game. Trey most prominent appearances really started resurfacing when another singer/ rapper Drake appeared on the scene, and really propelled him back out to the forefront as that R&amp;B dude. I can\\'t lie with Drake being the hottest commodity out now because of his ability to sing and rap he took the industry by storm, and Trey helped propel his career with hit songs such as \\&quot;Successful.\\&quot; Riding on that wave now it\\'s time for Trey to put his money where his mouth is and you guys are wondering did he do just that? I reviewed what I felt was the best tracks on his album. \n[IMG]http://i896.photobucket.com/albums/ac169/pbf99/tr.gif[/IMG]\n1.Panty Droppa (Interlude) - I wish it was a whole song\n\n2) Neighbors Know My Name - Favorite parts of the song are the chorus and bridge. Verses do nothing for me personally.\n\n3) I Invented Sex - Great \\'cut song\\'. Got my first listen via Drake\\'s mixtape \\&quot;Heartbreak Drake\\&quot; so it\\'s kind of old to me now. I\\'ll still listening to it so that has to mean something.\n\n4) I Need a Girl - Least favorite track but it\\'s good.\n\n5) One Love - Air guitar that opens the song is explicite. This song is reminiscent of a rock/love ballad and it\\'s a a good look for Songz. His syrupy voice laced over the instrumentals makes for a sweet musical treat.\n\n6) Does He Do It - One of those songs living in the average arena. Nothing special about the vocals or music arrangements. (3/5)\n\n7) Say Aah!! - This is a quirky song but it WORKS! Definitely a club banger &amp; Fabo\\'s appearance sealed the deal for me. Fab\\'s comedic ad libs reinforces the airiness of the song.\n\n8) LOL :-) - Another light-hearted song but it works for me in spite of Gucci Mane\\'s appearance\n\n9) Ready to Make Love (Interlude)- Should be its on song! The night time sounds in the background are an interesting element that blends well with Trey\\'s urgency for love-making. (\n\n10) Jupiter Love - As a lyric in the song states, this track \\&quot;elevates\\&quot; me to another level. Wonderful blend on this track.\n\n11) Be Where You Are - An ode to a woman\\'s physical beauty. The opening of the song doesn\\'t catch my ear but the chorus makes up for it.\n\n12) Successful - Commercial success...enough said (5/5)\n\n13) Black Roses - My description of this track - ROCK &amp; BLUES - and I love it because it reminds of Lenny Kravitz. The arrangement on this song is out of this world! I love when artists/producers step outside the box and create a winner.\n\n14) Love Lost - A song that\\'s simple in its composition but makes your mind race with all kinds of \\&quot;shoulda, woulda, couldas\\&quot;. I love the line...\\&quot;Now I\\'m ridin to the 90\\'s hits, listening to Aerosmith...\\&quot; This illustrates Trey\\'s versatile taste in music and that ALL genres of music are beautiful.\n\n15) Hollalude (Interlude) - New Age sounding interlude leaving the listener clamoring for MORE in the following track \\&quot;Holla If You Need Me\\&quot;\n\n16) Holla If You Need Me - Nice follow-up to interlude.\n\n17) Yo Side of the Bed - Beautiful song. I researched high and low for credit to Prince because his signature is all over this (think Purple Rain). I\\'m a little disappointed at thI didn\\'t find the recognition but that\\'s not my fight. I\\'m just a pleased listener. \n\n[IMG]http://i896.photobucket.com/albums/ac169/pbf99/ENJOY.gif[/IMG]\n[img]http://torrent-stats.info/8015/85d4f156.png[/img]","torrent":{"xt":"urn:btih:c56afe9746ee240c936e8015014b360ed989df24","amp;dn":"++Trey+Songz+-+Ready+%28Deluxe+Version%29%28320kps%40SSDJ%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c56afe9746ee240c936e8015014b360ed989df24","infoHashBuffer":{"type":"Buffer","data":[197,106,254,151,70,238,36,12,147,110,128,21,1,75,54,14,217,137,223,36]},"announce":[],"urlList":[]}}