{"title":"James Bond 007: Nightfire [PC] Full+Online Play [FastSeed!]","uid":3911664,"size":1109480141,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c579abdbb46307b89352d4572c387ba537777604&amp;dn=James+Bond+007%3A+Nightfire+%5BPC%5D+Full%2BOnline+Play+%5BFastSeed%21%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":2,"uploader":"click4dylan","files":-1,"time":1196195493,"description":"==  == == == ======= ==== =====    -     ====   = ===== ===== ====== == ==== ==\n  ==  ====        *1    ========     ==        ==    =======  1*      ====     ==  =\n\nGuess what? We have a dedicated line seeding this torrent with a 1Gb upstream for screaming fast downloads!\n\nIf you would rather download via an HTTP link with download manager support, download Nightfire using this link: www.absolute-mayhem.net/nightfire_aio_multiplayer.zip\n\nALSO, PLEASE UPDATE TO THE LATEST ONLINE PATCH AT WWW.ABSOLUTE-MAYHEM.NET - AN UNOFFICIAL PATCH THAT FIXES VERY MANY ANNOYING GLITCHES, BUGS, AND CRASHING!\n\n\nCOME ON PEOPLE, 465 PEERS AND 65 SEEDS AND STILL 20 PEOPLE PLAYING AT A TIME ONLINE?? SHOW YOUR SUPPORT AND PLAY ONLINE! Click multiplayer then click join game, click internet and then click update, thats all there is to it!! play online and we will have hundreds and hundreds of people playing online!\n\n\nNO INSTALL REQUIRED. JUST UNRAR WITH WINRAR AND PLAY! \n\n----------------------------------------------------------------------------------\nJames Bond 007: Nightfire is brought to you by [NORULEZ]\n/                                                                        \n______-NORULEZ RULES!!! BE SURE TO VISIT OUR BOND SERVER &amp; WEBSITE!-____/\n\nPC VERSION: NOT RIPPED!! FULL VERSION INCLUDES ALL MOVIES, CUTSCENES AND ONLINE PLAY! ENGLISH VERSION! WORKS ON WINDOWS 7, VISTA, XP, 2000, AND WINDOWS 98 INCLUDING x64!\n\nFor info on creating your own new maps (AND GET THE GEARCRAFT MAP EDITOR FROM GEARBOX SOFTWARE!) or make your own models for this game visit www.nfbsp.com\n\nTo download tons of mods and maps or to contact me visit(down)\n\nTorrent info updated as of 10/25/2008\n\nTroubleshooting: if you have problems with cutscenes showing up white, you need to install a specific codec driver available at: http://www.free-codecs.com/indeo_codec_download.htm\n\n\nTroubleshooting: Can't get online to work? Don't use the 1.1 update patch! Also make sure when you click multiplayer to also click Join Game and then Internet rather than LAN and then press Update to get the list of servers. Click on a server and then press join game. To talk to other players while in game press Y and type your message then press enter.\n\n\n____________________________________________________________________________________\nthe pc game james bond 007: nightfire fully cracked and ready to play. online features work perfectly for up to 32 players at a time. also includes the bond storyline with all the cutscenes. for a lot of my mods that i created for this game, go to(my clan site). No serial is required, and you don't need daemon tools or any image burning software to play. Just run the bond.exe to play the game after extracting the rar. no need to worry about updating the game version, all servers use 1.0 or 3.5 (both compatible). seed everyone, seed! we need new players! requires 128MB of ram and a direct3d capable video card (uses directx 8.1). just unzip it with winrar from www.rarlabs.com and play it using Bond.exe. no installation necessary! thanks for downloading.\n\nthis torrent by 2GoldenBullet$\n","torrent":{"xt":"urn:btih:c579abdbb46307b89352d4572c387ba537777604","amp;dn":"James+Bond+007%3A+Nightfire+%5BPC%5D+Full%2BOnline+Play+%5BFastSeed%21%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c579abdbb46307b89352d4572c387ba537777604","infoHashBuffer":{"type":"Buffer","data":[197,121,171,219,180,99,7,184,147,82,212,87,44,56,123,165,55,119,118,4]},"announce":[],"urlList":[]}}