{"title":"The Americans - Season 3","uid":13721639,"size":7784653706,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c5c6014ae4dbd7dc1387810f441953798e97e853&amp;dn=The+Americans+-+Season+3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":26,"uploader":"POtHS11","files":24,"time":1456947233,"description":"The Americans - Season 3\r\n\r\n1. EST Men\r\n\r\nTensions simmer between Philip and Elizabeth as they disagree over handling orders from the Centre. When Elizabeth loses key intel, Philip enlists Annelise on a mission with an unexpected outcome.\r\n\r\n\r\n2. Baggage\r\n\r\nElizabeth and Philip come together to deal with a mission gone wrong, but struggle to reconcile their increasingly opposing ideologies. Stan welcomes a Soviet defector, Zinaida, to America. Nina acclimates to her new living arrangements.\r\n\r\n3. Open House\r\n\r\nDanger mounts for Elizabeth and Philip as they get closer to the inner circle of the C.I.A. Afghan Group.\r\n\r\n4. Dimebag\r\n\r\nPhilip faces a moral dilemma while developing an asset. Philip and Elizabeth's friction escalates. Stan develops a theory with serious repercussions for national security. Paige makes a surprising birthday wish.\r\n\r\n5. Salang Pass\r\n\r\nPhilip juggles the many women in his life while Elizabeth takes drastic measures to complete a mission. Stan asserts a plan to save Nina with an unlikely ally.\r\n\r\n6. Born Again\r\n\r\nGabriel has surprising information. Elizabeth begins to take family matters into her own hands. Stan receives upsetting news from his past and turns to Sandra for support.\r\n\r\n7. Walter Taffet\r\n\r\nPhilip and Elizabeth feel the weight of a new family secret while following up on the KGB's interests in South Africa. Stan faces struggles both at work and at home. Martha confronts a shocking development.\r\n\r\n8. Divestment\r\n\r\nMartha and Clark's marriage meets its most challenging test yet. As pressures on Philip intensify, Elizabeth turns to Gabriel with a difficult request. Nina receives a new assignment that reconnects her with her past.\r\n\r\n9. Do Mail Robots Dream of Electric Sheep?\r\n\r\nPhilip and Elizabeth struggle with the gravity of unexpected collateral damage. Stan and Oleg hatch a risky plan to help save Nina.\r\n\r\n10. Stingers\r\n\r\nPhilip and Elizabeth deploy a plan for the C.I.A.'s Mujahideen visitors. Tensions at the Jennings' home escalate.\r\n\r\n11. One Day in the Life of Anton Baklanov\r\n\r\nPhilip and Elizabeth's home and work lives collide in new and dangerous ways. Nina struggles to figure out her next steps. Arkady assigns Oleg and Tatiana to an operation with uncertain potential.\r\n\r\n\r\n12. I Am Abassin Zadran\r\n\r\nMartha hosts an unexpected guest. Philip and Elizabeth must work a formidable Mujahideen commander. Paige acts out.\r\n\r\n13. March 8, 1983\r\n\r\nElizabeth and Paige take a trip that lands them in treacherous territory. After an emotionally charged mission, Philip turns to an unlikely source for solace. Stan's plan to save Nina culminates in unforeseen ways\r\nOne decision threatens the future of the family. Get a First Look at the all new season of The Americans, and see what danger awaits this January on FX.\r\n\r\n\r\n\r\nCritical response\r\n\r\nThe third season has received widespread critical acclaim. On Rotten Tomatoes, it received a 100% approval rating, with a rating average of 9.1/10. The critical consensus reads: &quot;Family-driven drama and psychological themes propel The Americans' tautly drawn tension, dispensing thrills of a different ilk this season.&quot;[20] On Metacritic, it scored 92 out of 100 based on 23 reviews.[21]\r\nAccolades\r\n\r\nThe series was awarded with a 2014 Peabody Award, with the organization stating, &quot;In this ingenious, addictive cliffhanger, Reagan-era Soviet spies—married with children and a seemingly endless supply of wigs—operate out of a lovely 3BR home in a suburb of Washington, D.C. Between their nail-biter missions (and sometimes in the midst of them), the series contemplates duty, honor, parental responsibility, fidelity, both nationalistic and marital, and what it means to be an American.&quot;[22]\r\n\r\nFor the 5th Critics' Choice Television Awards, it won for Best Drama Series and received three acting nominations—Keri Russell for Best Actress in a Drama Series, Matthew Rhys for Best Actor in a Drama Series, and Lois Smith for Best Guest Performer in a Drama Series.[23] For the 31st TCA Awards, the series was nominated for Program of the Year, Rhys was nominated for Individual Achievement in Drama, and it won for Outstanding Achievement in Drama.[24]\r\n\r\nFor the 67th Primetime Emmy Awards, Margo Martindale won for Outstanding Guest Actress in a Drama series after her third consecutive nomination, and Joshua Brand was nominated for Outstanding Writing for a Drama Series for &quot;Do Mail Robots Dream of Electric Sheep?&quot;.[25][26]\r\n\r\nFor the 68th Writers Guild of America Awards, the series was nominated for Best Drama Series.[27]","torrent":{"xt":"urn:btih:c5c6014ae4dbd7dc1387810f441953798e97e853","amp;dn":"The+Americans+-+Season+3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5c6014ae4dbd7dc1387810f441953798e97e853","infoHashBuffer":{"type":"Buffer","data":[197,198,1,74,228,219,215,220,19,135,129,15,68,25,83,121,142,151,232,83]},"announce":[],"urlList":[]}}