{"title":"Starbound (v2.3.0.5) [GOG]","uid":15447336,"size":1519097952,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c5f78db036bb9c9424dc2f4c20a326ef3b03f371&amp;dn=Starbound+%28v2.3.0.5%29+%5BGOG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":"ojusko","files":1,"time":1469903490,"description":"Install instructions:\r\n- Run &quot;setup_starbound_2.3.0.5.exe&quot;\r\n- Play\r\n\r\nChangelog for Patch 1.0.3 / GOG-5 Changelog (29th July 2016): \r\n\r\n*Bug Fixes \r\n\r\n-Remove unbalanced wormerang listing from penguin weapon shop \r\n-Resolve issue of banner rendering in front of a bookcase \r\n-Resolve issue where the Grand Pagoda Library boss would sometimes reset \r\n-Resolve issue where some weapons would let you wall jump in distortion sphere \r\n-Make ore nibbler critter capturable without exploding \r\n-Remove inappropriate tag from farm animal eggs \r\n-No longer open multiples of the same scripted interfaces (Rob Repairo, Tech Console) \r\n-Resolve issue where cultists would die on destroying a ballista in the Baron’s Keep \r\n-Remove elemental aura visual effect when changing weapons \r\n-Resolve issue where techs would interfere with each others tool suppression \r\n-Improve performance when player has a lot of quests \r\n-Resolve some issues with grappling hook \r\n-Bosses are now immune to healing from staff secondary abilities \r\n-Some pixels in armors were bad and are now not bad \r\n-Fix issue where crew ship benefits would reset on ship upgrade \r\n-This unfortunately resets your current fuel capacity and fuel efficiency benefits as they have been moved to a more reliable storage format \r\n-Teach NPCs how to use some trickier doors like wooden gates \r\n-Npcs may now get stuck in the ground less often \r\n-Make tech gui not crash when encountering unknown tech \r\n-Fix 3d printer issue when removing objects \r\n-Change power scaling of crew members to more closely match the power scaling of the player \r\n-Make it so saplings don’t break when they are unable to grow into a tree \r\n-Players should no longer get stuck in the ground if they beam to a friend in distortion sphere \r\n-Remove deprecated keybindings \r\n-Remove reference to a missing asset for the Avian temple boss \r\n-Gui adjustment to allow bigger numbers in the Terrramart shipment box \r\n-Remove deprecated elevator recipes \r\n-Fix tabbing issues in the codex window \r\n\r\n*Other \r\n\r\n-Statically link Visual C++ 2015 for the win32 version of starbound \r\n-Keep rotten food in the food tab \r\n-UI usability improvements to server connect screen \r\n-Dismiss confirmation windows when the source of them is not in reach \r\n-Adjustments to ore samples \r\n-Make it impossible to starve to death during cinematics \r\n-Pressing the key for a selected action bar slot now deselects the slot \r\n-Non-elemental Fluffalo drop more plant fibre \r\n-Adjust npc and monster placement for generated quests \r\n-Grappling hook adjustments; increased range, functional dual wielding \r\n-NPCs will now beam away to join your ship crew as soon as you recruit them \r\n-Natural materials will now magically match the hue shift of the biome when placed \r\n-Using the paint tool with the default color setting will clear any hue shift on unpainted blocks \r\n-Make vertical scroll bars start at the top by default \r\n-Improve one-handed damage of NPCs \r\n-Add some clothes and dialog for novakids in generated quests \r\n-Change some confusingly inaccurate labels for paintings in the grand pagoda library \r\n-Tweak Shockhopper projectile lifetime and damage polys \r\n\r\n*Visual C++ 2015 Launch Errors \r\n\r\nSince release, some people have been unable to play Starbound due to Visual C++ 2015 runtime failing to install on their PCs. This tends to be an issue with PCs on out-of-date versions of Windows, and tends to be solved by updating your Windows service packs and manually installing the Visual C++ 2015 runtime, but some people have been unable to do this or have found that it hasn’t worked for them. \r\n\r\nWe’ve statically linked Visual C++ 2015 for the win32 version of Starbound, which should hopefully clear up this issue for a lot of people. You’ll need to select ‘Launch Starbound – win32’ when you launch Starbound on Steam. Smile \r\n\r\n*OpenGL 2.0 Launch Errors \r\n\r\nIf you’re getting an error on launch that says ‘OpenGL 2.0 not available’, please ensure you’ve updated your graphics drivers! \r\n\r\n*OS X 10.8 Launch Errors \r\n\r\nIf you’re unable to launch Starbound on a version of OS X lower than 10.9, please try updating to a more recent version of OS X!\r\n\r\n\r\nTitle: STARBOUND\r\nGenre: Action - Adventure - Sandbox\r\nWorks on: Windows (XP, Vista, 7, 8, 10), Mac OS X (10.6.8) and Linux (Ubuntu 14.04, Ubuntu 16.04)\r\nLanguages: Audio and text: English\r\nFeatures: single-player - multi-player - co-op\r\nReleased: July 22, 2016\r\nSize: 1.5 GB\r\nCompany: Chucklefish / Chucklefish\r\nStore page: https://www.gog.com/game/starbound\r\n\r\nAbout:\r\nStarbound is an extraterrestrial sandbox adventure game! You’ve fled your home, only to find yourself lost in space with a damaged ship. Your only option is to beam down to the planet below and gather the resources you need to repair your ship and set off to explore the vast, infinite universe…\r\nUse the starmap to travel between star systems, settle down and farm the land, build and colonize a modern metropolis, take on quests to earn a living, or complete story missions to unlock some of the greater galactic mysteries!\r\nWith lots to do and a near-infinite number of procedurally generated worlds to discover, Starbound allows players to create their own adventures in space.\r\nWhat will you find?\r\nChoose from one of 7 playable races and customize your character\r\nSave the universe in a story campaign featuring unique characters, bosses, dungeons and quests!\r\nYou're the captain of your very own starship! Decorate it, expand it and use it to explore a procedurally generated universe\r\nColonize uncharted planets and collect gifts from your tenants - if they like you, they may even ask to join your ship crew!\r\nThree game modes - Casual (no need to eat), Survival (eat to survive/drop items on death) and Hardcore (permadeath)\r\nCraft thousands of objects - building materials, armor, weapons, furniture and more\r\nCapture unique monsters to fight alongside you\r\nAll content is available in online drop-in/drop-out co-op\r\nBuilt from the ground up to be easily moddable. You have the tools to make the universe your own - add new races, biomes, dungeons, and quests\r\n\r\nMinimum system requirements - Windows: OS: Windows XP or later, Processor: Core 2 Duo, Memory: 2 GB RAM, Graphics: 256 MB graphics memory and directx 9.0c compatible gpu, DirectX: Version 9.0c, Network: Broadband Internet connection, Storage: 3 GB available space\r\nRecommended system requirements - Windows: OS: Windows XP or later, Processor: Core i3, Memory: 4 GB RAM, Graphics: Discrete GPU capable of directx 9.0c, DirectX: Version 9.0c, Network: Broadband Internet connection, Storage: 4 GB available space","torrent":{"xt":"urn:btih:c5f78db036bb9c9424dc2f4c20a326ef3b03f371","amp;dn":"Starbound+%28v2.3.0.5%29+%5BGOG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5f78db036bb9c9424dc2f4c20a326ef3b03f371","infoHashBuffer":{"type":"Buffer","data":[197,247,141,176,54,187,156,148,36,220,47,76,32,163,38,239,59,3,243,113]},"announce":[],"urlList":[]}}