{"title":"Wole Soyinka - Nobel Prize in Literature, 1986 (11 books)","uid":11877721,"size":21058664,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c669027501c96577ddf2f94bbc6160c0213dc3fa&amp;dn=Wole+Soyinka+-+Nobel+Prize+in+Literature%2C+1986+%2811+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"workerbee","files":23,"time":1430588803,"description":"\nWOLE SOYINKA (b. 1934) is a Nigerian playwright, poet and political activist.  He was awarded the 1986 Nobel Prize in Literature, the first African to be so honored, and described by the Swedish Academy as a writer &quot;who in a wide cultural perspective and with poetic overtones fashions the drama of existence.&quot;\n\nSoyinka took an active role in Nigeria's political history and its struggle for independence from Great Britain.  In 1967 during the Nigerian Civil War, he was accused of conspiring with the Biafra rebels, and was held as a political prisoner for 22 months until 1969.  Soyinka has published about 20 works: drama, novels and poetry.  He writes in English and his literary language is marked by great scope and richness of words.\n\nAs dramatist, Soyinka has been influenced by, among others, the Irish writer, J.M. Synge, but links up with the traditional popular African theatre with its combination of dance, music, and action.  He bases his writing on the mythology and folklore of his own tribe, the Yoruba.  Notable plays include A DANCE OF THE FORESTS (1963), A PLAY OF GIANTS (1984), and DEATH AND THE KING'S HORSEMAN (1987).  In THE BACCHAE OF EURIPIDES (1973), Soyinka rewrote the Bacchae for the African stage.\n\nThough he considers himself primarily a playwright, Soyinka's novel THE INTERPRETERS (1965) is a narratively complicated work which has been compared to Joyce and Faulkner, and in which six Nigerian intellectuals discuss and interpret their African experiences.  His autobiographical works include AKÃ‰ (1981), an account of his childhood, and YOU MUST SET FORTH AT DAWN (2006).\n\nSoyinka has been a strong critic of successive Nigerian governments, especially the country's many military dictators, as well as other political tyrannies, including the Mugabe regime in Zimbabwe.  Much of his writing has been concerned with &quot;the oppressive boot and the irrelevance of the colour of the foot that wears it.&quot;  Africa's ills and Western responsibility are addressed in THE OPEN SORE OF A CONTINENT (1996), THE BURDEN OF MEMORY, THE MUSE OF FORGIVENESS (1999), and ON AFRICA (2012).\n\n\nThe following books are in PDF format unless otherwise indicated:\n\n* AKÃ‰: The Years of Childhood (Vintage, 1983)\n\n* THE BACCHAE OF EURIPIDES: A Communion Rite (Norton, 1974)\n\n* THE BURDEN OF MEMORY, THE MUSE OF FORGIVENESS (Oxford UP, 1999) -- PDF + ePUB\n\n* CLIMATE OF FEAR: The Quest for Dignity in a Dehumanized World (Random House, 2005) -- ePUB\n\n* A DANCE OF THE FORESTS (Oxford UP, 1963)\n\n* DEATH AND THE KING'S HORSEMAN (Hill &amp; Wang, 1987)\n\n* THE INTERPRETERS (Africana, 1972)\n\n* OF AFRICA (Yale UP, 2012) -- ePUB\n\n* A PLAY OF GIANTS (Methuen, 1984)\n\n* THE OPEN SORE OF A CONTINENT: A Personal Narrative of the Nigerian Crisis (Oxford UP, 1996)\n\n* YOU MUST SET FORTH AT DAWN (Random House, 2007) -- ePUB\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n            &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:c669027501c96577ddf2f94bbc6160c0213dc3fa","amp;dn":"Wole+Soyinka+-+Nobel+Prize+in+Literature%2C+1986+%2811+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c669027501c96577ddf2f94bbc6160c0213dc3fa","infoHashBuffer":{"type":"Buffer","data":[198,105,2,117,1,201,101,119,221,242,249,75,188,97,96,192,33,61,195,250]},"announce":[],"urlList":[]}}