{"title":"In the Valley of the Kings: Carter and the Mystery of Tut's Tomb","uid":15816227,"size":2947205,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c699d7be2158e83175979fac8640bab498337ab9&amp;dn=In+the+Valley+of+the+Kings%3A+Carter+and+the+Mystery+of+Tut%27s+Tomb&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"marty14","files":1,"time":1473687297,"description":"In the Valley of the Kings: Howard Carter and the Mystery of King Tutankhamun's Tomb - Daniel Meyerson [epub]\r\n\r\nIn 1922, the British archaeologist Henry Carter opened King Tutankhamun’s tomb, illuminating the glories of an ancient civilization. And while the world celebrated the extraordinary revelation that gave Carter international renown, by the time of his death, the discovery had nearly destroyed him.\r\n\r\nCarter began his career inauspiciously. At the age of seventeen he was hired as a copyist of tomb art by the brash, brilliant, and boldly unkempt father of modern archaeology, Flinders Petrie. Carter struck out on his own a few years later, sensing that something amazing lay buried beneath his feet, waiting for him to uncover it.\r\n\r\nBut others had the same idea: The ancient cities of Egypt were crawling with European adventurers and their wealthy sponsors, each hoping to outdo the others with glittering discoveries–even as growing nationalist resentment against foreigners plundering the country’s most treasured antiquities simmered dangerously in the background.\r\n\r\nNot until Carter met up with the risk-taking, adventure-loving occultist Lord Carnarvon did his fortunes change. There were stark differences in personality and temperament between the cantankerous Carter and his gregarious patron, but together they faced down endless ridicule from the most respected explorers of the day. Seven dusty and dispiriting years after their first meeting, their dream came to astonishing life. \r\n\r\nBut there would be a price to pay for this partnership, their discovery, and the glory and fame it brought both men–and the chain of events that transpired in the wake of their success remains fascinating and shocking to this day","torrent":{"xt":"urn:btih:c699d7be2158e83175979fac8640bab498337ab9","amp;dn":"In+the+Valley+of+the+Kings%3A+Carter+and+the+Mystery+of+Tut%27s+Tomb","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c699d7be2158e83175979fac8640bab498337ab9","infoHashBuffer":{"type":"Buffer","data":[198,153,215,190,33,88,232,49,117,151,159,172,134,64,186,180,152,51,122,185]},"announce":[],"urlList":[]}}