{"title":"Jim Rohn - The Power of Ambition (6CD in 57 Files) - Gravitons","uid":8074829,"size":376340271,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c6af4d4f12e50806f322ca44506849aabcacb956&amp;dn=Jim+Rohn+-+The+Power+of+Ambition+%286CD+in+57+Files%29+-+Gravitons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":1,"uploader":"gravitons","files":59,"time":1359358226,"description":"Similar to the following torrent in content and quality but it is broken down into MP3 files instead of being in a zip file and it is 358 MB instead of 2.98 GiB:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7366658/The_Power_of_Ambition_by_Jim_Rohn_-_6_CD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7366658/The_Power_of_Ambition_by_Jim_Rohn_-_6_CD&lt;/a&gt;\n\n=================================\n\nIn The Power of Ambition: Unleashing the Conquering Drive Within You, renowned speaker and author Jim Rohn reevaluates the role of ambition in all aspects of our lives, exploring the facts, debunking the fiction and revealing the six life-changing steps anyone can take to build their legitimate ambition.\n\nLet Jim Rohn be your guide as you learn how to use your ambition not only to change what is going on around you, but what is going on within you.\n\nAlong the way, you will also learn:\n\n    How to develop the three cornerstones of an ambitious life\n    Why enlightened self-interest leads to wealth and why self-preservation leads only to poverty\n    Why life reserves its treasures for those who deserve them, not for those who need them\n    The seven components of resilience and how they can work for you\n    How creativity and courage can keep you actively working toward your goals\n    The secrets of successful networking and other ways to make your relationships work for you\n    The five aspects of patience in action, otherwise known as persistence\n\nTrue ambition is a disciplined, eager desire for achievement. It is a state of mind, a way of life. With The Power of Ambition you can take charge of your own personal happiness, chart your own course through life and let your legitimate ambition create whatever you desire, take you wherever you want to go.\n\n6 CD\t\t","torrent":{"xt":"urn:btih:c6af4d4f12e50806f322ca44506849aabcacb956","amp;dn":"Jim+Rohn+-+The+Power+of+Ambition+%286CD+in+57+Files%29+-+Gravitons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6af4d4f12e50806f322ca44506849aabcacb956","infoHashBuffer":{"type":"Buffer","data":[198,175,77,79,18,229,8,6,243,34,202,68,80,104,73,170,188,172,185,86]},"announce":[],"urlList":[]}}