{"title":"UFO - .A Conspiracy Of Stars 2015 ak","uid":11713944,"size":126173908,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c75a56eba70b2b124a8d3c1b59cbf1a801c07789&amp;dn=UFO+-+.A+Conspiracy+Of+Stars+2015+ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":33,"leechers":1,"uploader":"analogkid6103","files":13,"time":1424455237,"description":"\nUFO are an English heavy metal and hard rock band that was formed in 1969. UFO became a transitional group between early hard rock and heavy metal and the New Wave of British Heavy Metal. UFO were ranked No. 84 on VH1's &quot;100 Greatest Artists of Hard Rock&quot;.\n\nThere are even more stories about UFO than they've composed songs. Any band who have been in the music business for more than 40 years are bound to have experienced difficult times, but also dazzling successes and spectacular events. UFO's success story began in London way back in 1969, when vocalist Phil Mogg, drummer Andy Parker, guitarist Mick Bolton and bassist Pete Way formed the group. Even in the seventies, the band distinguished themselves with their very own, unmistakable style, touching a nerve among their growing following with rock numbers like &quot;Prince Kajuku&quot;, &quot;Follow You Home&quot; or &quot;C'mon Everybody&quot; from their albums UFO 1, Flying and UFO Live.\n\nThe global breakthrough arrived when German guitarist, Michael Schenker, joined the fold in 1973, having left his band Scorpions to follow an offer by Phil Mogg and Pete Way. UFO released three consecutive rock classics with Schenker (Phenomenon, Force It and No Heavy Pettin), featuring classics like &quot;Doctor Doctor&quot;, &quot;Shoot, Shoot&quot;, or &quot;Rock Bottom&quot;. Following the arrival of keyboarder/rhythm guitarist Paul Raymond, UFO released their two studio albums Lights Out and Obsession, including the hit singles &quot;Too Hot To Handle&quot;, &quot;Lights Out&quot; and &quot;Only You Can Rock Me&quot;. Their live cut Strangers In The Night came out in 1979 and is referred to by the press to this day as one of the best live releases of all time, while also signalling the end of the Mogg, Way, Schenker, Parker &amp; Raymond line-up.\nimage\nThe reorganised band underwent fifteen years marked by various eras and numerous line-up changes. To everyone's surprise, autumn 1993 saw the return of the former UFO line-up consisting of Mogg, Way, Schenker, Parker and Raymond. This new edition of the classic team brought out Walk On Water, their first joint effort after one and a half decades, and embarked on a world tour. However, Schenker left UFO during the Walk On Water tour again to continue working with his own group, MSG, while Mogg &amp; Way went on to release their second album, Chocolate Box.\n\nThe UFO albums Covenant and Sharks, recorded by Mogg, Way and Schenker, arrived at the stores in 2000 and 2002. Vinnie Moore went on to follow in Schenker's footsteps, who had returned to MSG, recording the songs on You Are Here with Jason Bonham. During the subsequent world tour, UFO cut a show in Germany, which was later released on the live album, Showtime, and the same-named DVD featuring additional bonus material. Later, Bonham bid his farewells and UFO's original drummer Andy Parker returned on The Monkey Puzzle and its successor The Visitor. So with Phil Mogg, Paul Raymond and Andy Parker, the band today consists of three original members, plus American guitar slinger Vinnie Moore - the perfect complement.\n\n\n\nBand Members\n\nPhil Mogg\nAndy Parker\nPaul Raymond\nVinnie Moore\n\n\n\nDiscography\n\nUFO 1 (1970)\nUFO 2: Flying (1971)\nLive (UFO album) (1971)\nPhenomenon (1974)\nForce It (1975)\nNo Heavy Petting (1976)\nLights Out (1977)\nObsession (1978)\nStrangers in the Night (1979)\nNo Place to Run (1980)\nThe Wild, the Willing and the Innocent (1981)\nMechanix (1982)\nMaking Contact (1983)\nMisdemeanor (1985)\nAin't Misbehavin' (1988)\nHigh Stakes &amp; Dangerous Men (1992)\nWalk on Water (1995)\nCovenant (2000)\nSharks (2002)\nYou Are Here (2004)\nThe Monkey Puzzle (2006)\nThe Visitor (2009)\nSeven Deadly (2012)\nA Conspiracy of Stars (2015)\n\n\n\nA Conspiracy of Stars (2015)\n\n\n\n01 The Killing Kind\n02 Run Boy Run\n03 Ballad Of The Left Hand Gun\n04 Sugar Cane\n05 Devils In The Detail\n06 Precious Cargo\n07 The Real Deal\n08 One And Only\n09 Messiah Of Love\n10 Rolling Rolling\n11 King of the Hill (Bonus Track)\n\nGenre: Heavy\nSubgenre: Hard Rock / Heavy Metal\nBitrate: 320 k\nSize: 120.33 MB\nShow/Hide Files","torrent":{"xt":"urn:btih:c75a56eba70b2b124a8d3c1b59cbf1a801c07789","amp;dn":"UFO+-+.A+Conspiracy+Of+Stars+2015+ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c75a56eba70b2b124a8d3c1b59cbf1a801c07789","infoHashBuffer":{"type":"Buffer","data":[199,90,86,235,167,11,43,18,74,141,60,27,89,203,241,168,1,192,119,137]},"announce":[],"urlList":[]}}