{"title":"Love Warrior: A Memoir (2016) by Glennon Doyle Melton","uid":15870678,"size":1379715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c761ea400c9bf234d3d564c0ef95b9a260ab1202&amp;dn=Love+Warrior%3A+A+Memoir+%282016%29+by+Glennon+Doyle+Melton&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":2,"uploader":"Dr.Soc","files":3,"time":1474421602,"description":"Love Warrior (Oprah's Book Club): A Memoir by Glennon Doyle Melton\r\nEnglish | 2016 | ISBN: 1250128544, 1473648645 | 272 pages | AZW3, MOBI, EPUB | 1.4 MB\r\n\r\nThe Newest Oprah Bookclub 2016 Selection\r\n\r\nThe highly anticipated new memoir by bestselling author Glennon Doyle Melton tells the story of her journey of self-discovery after the implosion of her marriage.\r\n\r\nJust when Glennon Doyle Melton was beginning to feel she had it all figured out―three happy children, a doting spouse, and a writing career so successful that her first book catapulted to the top of the New York Times bestseller list―her husband revealed his infidelity and she was forced to realize that nothing was as it seemed. A recovering alcoholic and bulimic, Glennon found that rock bottom was a familiar place. In the midst of crisis, she knew to hold on to what she discovered in recovery: that her deepest pain has always held within it an invitation to a richer life.\r\n\r\nLove Warrior is the story of one marriage, but it is also the story of the healing that is possible for any of us when we refuse to settle for good enough and begin to face pain and love head-on. This astonishing memoir reveals how our ideals of masculinity and femininity can make it impossible for a man and a woman to truly know one another - and it captures the beauty that unfolds when one couple commits to unlearning everything they've been taught so that they can finally, after thirteen years of marriage, commit to living true―true to themselves and to each other.\r\n\r\nLove Warrior is a gorgeous and inspiring account of how we are born to be warriors: strong, powerful, and brave; able to confront the pain and claim the love that exists for us all. This chronicle of a beautiful, brutal journey speaks to anyone who yearns for deeper, truer relationships and a more abundant, authentic life","torrent":{"xt":"urn:btih:c761ea400c9bf234d3d564c0ef95b9a260ab1202","amp;dn":"Love+Warrior%3A+A+Memoir+%282016%29+by+Glennon+Doyle+Melton","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c761ea400c9bf234d3d564c0ef95b9a260ab1202","infoHashBuffer":{"type":"Buffer","data":[199,97,234,64,12,155,242,52,211,213,100,192,239,149,185,162,96,171,18,2]},"announce":[],"urlList":[]}}