{"title":"McAfee Total Protection 2012 (Full Version) + License for 3 PC's","uid":7906827,"size":305914627,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c7698b00d7927356c24ffdfc1c82266fa6e9fba8&amp;dn=McAfee+Total+Protection+2012+%28Full+Version%29+%2B+License+for+3+PC%27s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":2,"uploader":"raghu50","files":1,"time":1355118182,"description":"R@g!-!!_!50 (raghu50) I bring to you another of my releases. McAfee Total Protection 2012 Full Version with License for 3 PC's. Works with Windows 7 perfectly well. For 1 year use only.\n\nInstallation Instructions - \n\n1. Extract the rar file using Winrar or something similar.\n\n2. Open the folder and run the file named 'CDSetup'\n\n3. Follow the installation, then when you get to the 'Installation Options' part, chose to install the up to date protection - NOT THE CD installation\n\n4. Continue to follow the installation until completely installed.\n\n5. When prompt to activate, register with your details (DO NOT USE AN EXISTING ACCOUNT).\n\nYOU NOW HAVE A FULL YEAR FREE MCAFEE TOTAL PROTECTION FOR UP TO 3 COMPUTERS.\n\nFrequently Asked Questions - \n\nQ. Why has it installed an old version of McAfee?\nA. You did not choose to install the up to date protection, you chose CD installation, therefore you will need to uninstall and re-install following the instructions above.\n\nQ. Does this deffinately work?\nA. Many people have used this for years now without any problems whatsoever.\n\nQ. Will I still get all Mcafee updates?\nA. Absolutely. The crack makes it seem like you have bought the software, and registers you a full account, therefore you have the same privileges as anyone who would have bought the software.\n\nQ. When will my Mcafee expire?\nA. It will expire exactly 12 months from the day you activate it.\n\nQ. Can I use it again after it expires.\nA. Absolutely! When your subscription expires, just uninstall, then install again following the instructions, but use a different email address.\n\nQ. I get a compatibility problem message when installing on Windows 7. How can I fix this?\nA. This software definitely works on Windows 7, as myself and many other people have this installed on Windows 7 without any problems. If you come across the compatibility message, just choose the 'Run Program' option. It even works on Windows 7 64bit\n\nPlease keep seeding. Thanks!\n","torrent":{"xt":"urn:btih:c7698b00d7927356c24ffdfc1c82266fa6e9fba8","amp;dn":"McAfee+Total+Protection+2012+%28Full+Version%29+%2B+License+for+3+PC%27s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7698b00d7927356c24ffdfc1c82266fa6e9fba8","infoHashBuffer":{"type":"Buffer","data":[199,105,139,0,215,146,115,86,194,79,253,252,28,130,38,111,166,233,251,168]},"announce":[],"urlList":[]}}