{"title":"Tom Waits - Rain Dogs (1985)","uid":5191740,"size":100147834,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c805fef4e107d68aa70b9d44065c50bd38b32400&amp;dn=Tom+Waits+-+Rain+Dogs+%281985%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":1,"uploader":"muzik62","files":-1,"time":1259749876,"description":"Tom Waits - Rain Dog (1985)\n\nmp3 320\n\nIncludes Video FLW downloaded from Utube\n\n\n---------- Tracks ---------\n01 Singapore\n02 Clap Hands\n03 Cemetery Polka\n04 Jockey Full Of Bourbon\n05 Tango Till They're Sore\n06 Big Black Mariah\n07 Diamonds &amp; Gold\n08 Hang Down Your Head\n09 Time\n10 Rain Dogs\n11 Midtown (Instrumentl)\n12 9Th &amp; Hennepin\n13 Gun Street Girl\n14 Union Square\n15 Blind Love\n16 Walking Spanish\n17 Downtown Train\n18 Bridge Of Rain Dog (Instrumental)\n19 Anywhere I Lay My Head\n\nI have long loved Tom Waits, and have a host of his albums, but this gem of a record remains by far his best effort. It isn't just that many of his best songs are on this album, but that virtually all of the songs are at least highly listenable. The quality of RAIN DOGS can be seen in the fact that a large number of artists have recorded this album's songs.\nMusically, the amazing arrangements sound like Kurt Weill meets Captain Beefheart meets a carnival barker meets a bottle of bourbon. As the album begins and moves from &quot;Singapore&quot; to &quot;Clap Hands,&quot; you know that you are not dealing with a three-chords-and-a-cloud-of-dust performer. What is stunning after the album's first few songs, however, is how lyrical Waits becomes as the album goes on. For all the raucousness of some of the numbers, it is easily balanced by the beauty of songs like &quot;Downtown Train,&quot; the gorgeous &quot;Time,&quot; or the mournfully drunken &quot;Blind Love.&quot; Waits employs a crack back up band, with significant guess appearances with performers like Keith Richards. The star back up musician is, however, Marc Ribot, who as he so often does provides stunningly original guitar lines that embellish every song upon which he appears.\nLyrically, Waits has never been better, turning out one superb line after another. Several of the songs read as more than decent poetry, and many individual lines pop out, such as (from &quot;Time&quot;) &quot;The things you can't remember tell the thing you can't forget&quot; or, in the best line about being down, down and out I have heard, &quot;When you're east of East St. Louis&quot; (with apologies to East St. Louis). Or what about this great line from &quot;Blind Love&quot;: &quot;They say if you get far enough away/You'll be on your way back home.&quot; Even some of the less well-known songs on the album, like &quot;Tango Till They're Sore,&quot; are lyrically stunning.\nI'm a big fan of Tom Waits, but while in his other albums I always find him at least interesting, I still find there are a lot of individual songs that aren't up to the level of his best work. RAIN DOGS is Tom's best album partly because it contains many of his best songs, but partly because it contains absolutely none of his worse. This is all the more remarkable given the fact that RAIN DOGS was one of the first albums to take advantage of the greater capacity of CDs to expand the number of cuts. Despite the larger number of songs, there are no weak cuts and no filler.\n\nmuzik62","torrent":{"xt":"urn:btih:c805fef4e107d68aa70b9d44065c50bd38b32400","amp;dn":"Tom+Waits+-+Rain+Dogs+%281985%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c805fef4e107d68aa70b9d44065c50bd38b32400","infoHashBuffer":{"type":"Buffer","data":[200,5,254,244,225,7,214,138,167,11,157,68,6,92,80,189,56,179,36,0]},"announce":[],"urlList":[]}}