{"title":"Chemistry of Plant Natural Products (gnv64)","uid":11853630,"size":21094382,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8254a0c1166b396abbd806de6acb1902751d9f4&amp;dn=Chemistry+of+Plant+Natural+Products+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"gnv65","files":3,"time":1430135184,"description":"Chemistry of Plant Natural Products - Stereochemistry, Conformation, Synthesis, Biology, and Medicine\nby Sunil Kumar Talapatra and Bani Talapatra\nSpringer | March 2015 | ISBN-10: 3642454097 | True PDF | 1180 pages | 20.1 mb\n\nAimed at advanced undergraduate and graduate students and researchers working with natural products, Professors Sunil and Bani Talapatra provide a highly accessible compilation describing all aspects of plant natural products. Beginning with a general introduction to set the context, the authors then go on to carefully detail nomenclature, occurrence, isolation, detection, structure elucidation (by both degradation and spectroscopic techniques) stereochemistry, conformation, synthesis, biosynthesis, biological activity and commercial applications of the most important natural products of plant origin. Each chapter also includes detailed references (with titles) and a list of recommended books for additional study making this outstanding treatise a useful resource for teachers of chemistry and researchers working in universities, research institutes and industry.\n\nAbout the Authors\nProfessor Sunil Kumar Talapatra has taught stereochemistry, conformational analysis, reaction mechanisms and alkaloids in the postgraduate classes of Calcutta University (CU) and Presidency College (now University), Kolkata for more than three decades, and has been teaching stereochemistry for the last three decades in some other universities of W. Bengal and Tripura as a Guest teacher. He did PhD (CU) and post-doctoral work with Professor (Mrs) Asima Chatterjee and then post-doctoral work (4 yr) with Professor Michael P Cava at OSU, Columbus.\nProfessor Bani Talapatra has taught natural products chemistry at Calcutta University (CU) for more than three decades, and in some other universities of W. Bengal and Tripura as a Guest teacher for more than a decade. She also taught general chemistry in a local undergraduate college for several years during her early professional career. She obtained the D.Sc. degree of the CU working in the laboratory of Professor (Mrs) Asima Chatterjee and then joined a Postdoctoral Fellowship at the Vanderbilt University (VU) with the renowned microbiologist, Professor V. Najjar.\n &lt;a href=&quot;\nhttp://s28.postimg.org/uuh21i1q5/Chemistry_of_Plant_Natural_Products.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s28.postimg.org/uuh21i1q5/Chemistry_of_Plant_Natural_Products.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:c8254a0c1166b396abbd806de6acb1902751d9f4","amp;dn":"Chemistry+of+Plant+Natural+Products+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8254a0c1166b396abbd806de6acb1902751d9f4","infoHashBuffer":{"type":"Buffer","data":[200,37,74,12,17,102,179,150,171,189,128,109,230,172,177,144,39,81,217,244]},"announce":[],"urlList":[]}}