{"title":"Holy Shit: A Brief History of Swearing - Melissa Mohr Audiobook","uid":10517237,"size":309957166,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c83be8c0dc6c1a1ffb54ddec431b1ec7fe6ee5d1&amp;dn=Holy+Shit%3A+A+Brief+History+of+Swearing+-+Melissa+Mohr+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":2,"uploader":"Squiddy82","files":-1,"time":1404925130,"description":"Audiobook says &quot;Visual aides found in the print edition of this book are available to you as a downloadable PDF.&quot;\n\nIf this PDF becomes available, it will be posted at the following link: &lt;a href=&quot;\nhttp://nullrefer.com/?download.audible.com/product_related_docs/BK_ADBL_018785.pdf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nullrefer.com/?download.audible.com/product_related_docs/BK_ADBL_018785.pdf&lt;/a&gt;\n\nIn the meantime, you can use one of the ebooks posted on TPB for reference.\n\n\n\n\nMP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\n\n\nHoly Sh*t: A Brief History of Swearing\n\nWritten by: Melissa Mohr\nNarrated by: Napoleon Ryan\nLength: 10 hrs and 45 mins\nFormat: Unabridged\nRelease Date:07-08-14\nProgram Type: Audiobook\n\nAlmost everyone swears, or worries about not swearing, from the two year-old who has just discovered the power of potty mouth to the grandma who wonders why every other word she hears is obscene. Whether they express anger or exhilaration, are meant to insult or to commend, swear words perform a crucial role in language. But swearing is also a uniquely well-suited lens through which to look at history, offering a fascinating record of what people care about on the deepest levels of a culture - what's divine, what's terrifying, and what's taboo.\n\nHoly Sh*t tells the story of two kinds of swearing - obscenities and oaths - from ancient Rome and the Bible to today. With humor and insight, Melissa Mohr takes listeners on a journey to discover how &quot;swearing&quot; has come to include both testifying with your hand on the Bible and calling someone a *#$&amp;!* when they cut you off on the highway. She explores obscenities in ancient Rome - which were remarkably similar to our own - and unearths the history of religious oaths in the Middle Ages, when swearing (or not swearing) an oath was often a matter of life and death.\n\nHoly Sh*t also explains the advancement of civility and corresponding censorship of language in the 18th century, considers the rise of racial slurs after World War II, examines the physiological effects of swearing (increased heart rate and greater pain tolerance), and answers a question that preoccupies the FCC, the US Senate, and anyone who has recently overheard little kids at a playground: are we swearing more now than people did in the past?\n\nA gem of lexicography and cultural history, Holy Sh*t is a serious exploration of obscenity - and it also just might expand your repertoire of words to choose from the next time you shut your finger in the car door. \n\n\n\n\nAudiobook says &quot;Visual aides found in the print edition of this book are available to you as a downloadable PDF.&quot;\n\nIf this PDF becomes available, it will be posted at the following link: &lt;a href=&quot;\nhttp://nullrefer.com/?download.audible.com/product_related_docs/BK_ADBL_018785.pdf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nullrefer.com/?download.audible.com/product_related_docs/BK_ADBL_018785.pdf&lt;/a&gt;\n\nIn the meantime, you can use one of the ebooks posted on TPB for reference.","torrent":{"xt":"urn:btih:c83be8c0dc6c1a1ffb54ddec431b1ec7fe6ee5d1","amp;dn":"Holy+Shit%3A+A+Brief+History+of+Swearing+-+Melissa+Mohr+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c83be8c0dc6c1a1ffb54ddec431b1ec7fe6ee5d1","infoHashBuffer":{"type":"Buffer","data":[200,59,232,192,220,108,26,31,251,84,221,236,67,27,30,199,254,110,229,209]},"announce":[],"urlList":[]}}