{"title":"William L. Shirer - The Rise and Fall of the Third Reich [epub]","uid":9028155,"size":2097188,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8490bdf4c1e7983f03a978380c10cd907f556a5&amp;dn=William+L.+Shirer+-+The+Rise+and+Fall+of+the+Third+Reich+%5Bepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":0,"uploader":"epub_888","files":-1,"time":1381405974,"description":"William L. Shirer's THE RISE AND FALL OF THE THIRD REICH is a monumental study of the 20th Century's most frightening moments. Now, 53 years after the end of World War II, it may seem incredible that our most valued institutions, and way of life, were threatened by the menace that Hitler and the Third Reich represented. Shirer's description of events and the cast of characters who played such pivotal roles in defining the course Europe was to take is unforgettable.\n\nBenefiting from his many years as a reporter, and thus a personal observer of the rise of Nazi Germany, and availing himself of some of the 485 tons of documents from the German Foreign Office, captured by the First Army, as well as countless other diaries, phone transcriptions, and other written records, meticulously kept at every level by the Germans, Shirer has put together a brutally objective account of how Hitler wrested political control of Germany, and planned and executed his 6 year quest to dominate the world, only at the end, to see Germany go down in flames.\n\nThe combination of personal recollection and amassing of historical evidence distinguishes this book as one of the great historical works of any time. For instance, he recounts that, from his apartment in Plosslgasse, in Vienna, he personally witnessed how perhaps half of Vienna's 180,000 Jews bargained their way to freedom in 1938.\n\nShirer explains that Hitler believed that France and England were too weak to pose much of a threat to his ambitions to subjugate Czechoslovakia, and later Poland. The momentary relief of Russia as a threat to his domination of Europe as a result of the flurry of diplomatic activity that proceeded his invasion of Poland is fascinating. There is no relief, throughout his narrative, of the brutality of Hitler and such a large contingent of Germans who populate this narrative.\n\nAlthough 1600 pages long, this is such a richly rewarding experience for anyone who wants to come to grips with the mysterious question as to how this menace to civilization ever came into being, much less was sustained for as long as it was. The answer, unfortunately, is that most of Germany, for a whole host of reasons, embraced Nazism and the fanaticism that Hitler engendered.\n\nFor another book that deals with this problem, why so much of Germany lent its support to Hitler, I heartily recommend HITLER'S WILLING EXECUTIONER'S, by Daniel Goldhagen, published by Vintage Books. Although filled with perhaps more statistical details then the non-professional historian would need, this book helps to adumbrate the themes in Shirer's great book.","torrent":{"xt":"urn:btih:c8490bdf4c1e7983f03a978380c10cd907f556a5","amp;dn":"William+L.+Shirer+-+The+Rise+and+Fall+of+the+Third+Reich+%5Bepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8490bdf4c1e7983f03a978380c10cd907f556a5","infoHashBuffer":{"type":"Buffer","data":[200,73,11,223,76,30,121,131,240,58,151,131,128,193,12,217,7,245,86,165]},"announce":[],"urlList":[]}}