{"title":"Beau travail (eng subs) [1999] Claire Denis","uid":6797269,"size":1474323275,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c8ba3513ca385f3a132f900ee412b6848dd8fb9c&amp;dn=Beau+travail+%28eng+subs%29+%5B1999%5D+Claire+Denis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1320504750,"description":" &lt;a href=&quot;http://bayimg.com/DAkAbaaDN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/DAkAbaaDN&lt;/a&gt;\n\nBeau Travail (1999) \n\nBeau travail (original title) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0209933/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0209933/&lt;/a&gt;\n\nBeau travail is a 1999 French movie directed by Claire Denis that is loosely based on Herman Melville's novella Billy Budd. However, instead of the maritime setting of the novella, the movie takes place in Djibouti where the protagonists are soldiers in the French Foreign Legion. Parts of the soundtrack of the movie are from the opera by Benjamin Britten also based on the novella.\n\n  Denis Lavant  ...  Galoup  \n  Michel Subor  ...  Commander Bruno Forestier  \n  GrÃƒÂ©goire Colin  ...  Gilles Sentain  \n  Richard Courcet  ...  Legionnaire  \n  Nicolas Duvauchelle  ...  Legionnaire  \n\nA riveting adaptation of Herman Melville's Billy Budd, looks in lyrical detail at the rote physical rituals of military life in a French Foreign Legion outpost in East Africa. \n\nThis simmering drama isn't an action picture but an exploration of moral and social values. Filled with implied eroticism, it's a rumination on the bitter predicament of a man stewing in petty jealousy that turns to murderous hate. \n\nThe imagery is stylized in this darkly poetic film, set in an arid landscape and under blistering sun. Denis makes exceptional use of silences and stillness to set mood and suggest emotional layers. \n\nIt's a beautiful film to watch as it captures the drills and training regimens of shirtless, muscular young men as forms of dance. The Legionnaires' outpost is the substitute for Melville's sailing ship, the soldiers for the sailors in a confined world. \n\nThe focus is on a troubled sergeant, Galoup (Denis Lavant), and his irrational dislike for a raw recruit, Gilles Sentain (Gregoire Colin, Oliver, Oliver), whom he sees as an untrustworthy misfit. For his part, Sentain is entirely dutiful. But the sergeant is poised to destroy him in a classic struggle of good and evil. \n\nThe film's vision of military men devoted to meaningless tasks, and constantly preparing for combat with an unseen enemy, is haunting, as is the resentment of the sergeant cast out from the tight community of the lesser ranked. His commander is Bruno Forestier (Michel Subor), a brooding careerist who has lost all sense of military purpose. The music track includes excerpts from Benjamin Britten's ``Billy Budd'' and a song by Neil Young and Crazy Horse\n\n\n\n","torrent":{"xt":"urn:btih:c8ba3513ca385f3a132f900ee412b6848dd8fb9c","amp;dn":"Beau+travail+%28eng+subs%29+%5B1999%5D+Claire+Denis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8ba3513ca385f3a132f900ee412b6848dd8fb9c","infoHashBuffer":{"type":"Buffer","data":[200,186,53,19,202,56,95,58,19,47,144,14,228,18,182,132,141,216,251,156]},"announce":[],"urlList":[]}}