{"title":"Ableton Live 9 Suite v9.0.5 AIO Installer","uid":8754764,"size":1421510980,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c90f8b47301e0dcfe249059167901189b5f53d7c&amp;dn=Ableton+Live+9+Suite+v9.0.5+AIO+Installer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":"-nelly-","files":-1,"time":1375122376,"description":"                Ableton Live 9 Suite v9.0.5 AIO Installer - -nelly-\n                ===================================================\n\n\n\n                 N.B. THIS INSTALLER MUST BE RAN AS ADMINISTRATOR\n                 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\nAbleton Live Suite v9.0.5 - this updated software for musicians and DJs, allowing you to create music, perform live, to make installation, a new library with the beautiful sounds and other useful resources. Ableton Suite contains 10 instruments from Ableton, including synths, a sampler, electric and acoustic drums, as well as numerous sampled instruments.\n\nImprovements and feature changes:\n=================================\n\nAdded control surface support for M-Audio Axiom Air 25, 49 and 61 keyboards.\nAdded new default presets for Analog, Electric, Operator, Simpler, Sampler, Tension, Auto Filter, EQ Eight and Saturator for improved compatibility with control surfaces.\nThe menu item 'View -&gt; Detail -&gt; Track' was renamed to 'View -&gt; Detail -&gt; Device'.\nUpdated lessons and info texts.\n\nBugfixes:\n=========\n\n-The Ableton Index process could block the GUI after launching Live.\n-Fixed a bug which could decrease Live's GUI performance in sets containing a very large amount of devices.\n-The Arpeggiator device could play too many notes under certain conditions.\n-MIDI velocity fades would not work in an Instrument- or MIDI Effect Rack's key zone editor.\n-Chains assigned to certain velocity ranges in an Instrument Rack's Velocity Zone Editor would not be triggered under certain conditions.\n-Using the TAB key while renaming a track would not jump to the next track name if certain control surface scripts were enabled in the MIDI / SYNC preferences.\n-The Launchpad could sometimes show artifacts of the Mixer mode in User Mode II after switching between the two modes.\n-Status updates that are sent back to a MIDI controller from a control surface script could interfere with status updates from manual MIDI mappings.\n-Live could crash when moving VST or AU plug-ins to a different track while the plug-in's GUI was open.\n-Live could crash when closing a Live set that contains AU plug-in devices with Program Change automation.\n-Live could crash when using 'undo' and 'redo' actions on non-configured plug-in parameters.\n-Live could crash under certain conditions when re-enabling the audio engine if the currently loaded Live set contains VST or AU plug-ins.\n-Live could crash when changing the warp mode of multiple clips at once, if one of the clips contains a .rex file.\n-Live could crash when loading a Live set containing a Convolution Reverb device.\n-Live could crash under certain conditions when moving an automation segment.\n-Triggering an Audio-to-MIDI conversion from the browser could corrupt the Live set, if the target track was created inside a group track.\n-Live could crash under certain conditions after saving a Max for Live device in the Max editor.\n-Improved the text of the error message which is shown after a certain type of crash on Windows systems (&quot;HandleStageOne&quot; class).\n-Under certain conditions, Live would show an error message after updating to a new version: &quot;Can't access file database: database error, prepare statement: No such table: sqlite_stat1&quot;.\n-The Windows installer would sometimes not install the &quot;Microsoft Visual C++ Redistributable&quot; package correctly, which could result in a &quot;Side-by-Side -Configuration Error&quot; when trying to launch Live.\n-The links to the accompanying Demo Sets in the &quot;What's new in Live 9&quot; Lesson would not open the correct demo set for feature-limited versions.\n\nChanges for Push:\n=================\n\nIt's now possible to browse user folders that were added to 'Places' in Live's Browser. Note that empty folders are hidden on Push.\nWhen 'Clip Workflow' mode is selected, the 'Duplicate' button now only affects the currently selected clip and not the entire scene. Shift + 'Duplicate' will Capture and Insert a scene.\nThe Scene Launch Buttons would be lit even if no scene exists.\nPressing the 'Select' button and a Scene Launch Button would fire the scene instead of just selecting it.\nWhen using 'Undo' after duplicating a scene, the LEDs of the previously duplicated clips would remain lit.\nNavigating Drum Rack banks using Shift + Octave Up / Down would not work correctly.\nHolding a Track Select button to unfold a group track would not work anymore.\nUnder certain conditions, audio clip recording would suddenly stop when enabling the &quot;Fixed Length&quot; function on Push.\nLive could crash after hot-swapping a Drum Rack, if Push and another control surface script was activated in Live's MIDI/SYNC preferences.\nLive could freeze while working on a Drum Rack if the Push control surface script was selected twice in the MIDI / SYNC preference pane (1x with the &quot;Live&quot; port and 1x with the &quot;User&quot; port).\n\nSystem requirements: \n====================\n\nPC with Windows XP, Windows Vista, Windows 7 or Windows 8.\nMulticore processor. \n2 GB RAM.\n1024x768 display.\nDVD drive or broadband internet connection for installation.\nx32bit and x64bit.\n\nINFO:\n=====\n\n9 Ableton Live Suite v9.0.5\nRelease: 2013\nVersion: v9.0.5\nDeveloper: Ableton\n\n\n=================================================================\n\n\nFor anyone WHO MAY HAVE issues with installation, extraction, wrong file extensions, passwords etc for this or any of my other installer torrents. Go to:\n\nStart-Computer-Documents-Organize-Folder and search options-View\n\nThen from the scroll menu that appears, un-tick the option of &quot;Hide extensions for known file types&quot;. Click on &quot;Apply&quot; and then click on &quot;OK&quot; (Screen shot below):\n &lt;a href=&quot;\nhttp://i.imgur.com/5rFrOno.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/5rFrOno.jpg&lt;/a&gt;\n\nOnce you've done that. Return to your downloaded installer torrent of mine and change the file extension to .exe\n\nThen right click on it and select &quot;Run as administrator&quot;. \n\nNONE of my torrents are, or ever have been passworded or have any other type of security, re-directs etc on them.\n\nAll my installers come loaded with installation instructions in both a text document and a full installation video.\n\n\n=================================================================\n\n\n-nelly- home page at The Pirate Bay link below:\n\n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/-nelly-/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/-nelly-/&lt;/a&gt;\n\n\nCheck out the new PirateWiki!\n\n           &lt;a href=&quot;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&lt;/a&gt;\n\n\nFor re-seed requests, help, support or anything else relating to The Pirate Bay. You'll find it all, and more, at suprbay. The official support forum of The Pirate Bay. Visit it at the link below:\n\n  &lt;a href=&quot;\nhttps://forum.suprbay.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/index.php&lt;/a&gt; \n\n\n\n","torrent":{"xt":"urn:btih:c90f8b47301e0dcfe249059167901189b5f53d7c","amp;dn":"Ableton+Live+9+Suite+v9.0.5+AIO+Installer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c90f8b47301e0dcfe249059167901189b5f53d7c","infoHashBuffer":{"type":"Buffer","data":[201,15,139,71,48,30,13,207,226,73,5,145,103,144,17,137,181,245,61,124]},"announce":[],"urlList":[]}}