{"title":"Solomon Northup - Twelve / 12 Years a Slave (1853)","uid":9429821,"size":7210406,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c913fa857946598b438b0e56d772a8240f23a34e&amp;dn=Solomon+Northup+-+Twelve+%2F+12+Years+a+Slave+%281853%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"workerbee","files":-1,"time":1388774058,"description":"\n* Reupload *\n\n\nSolomon Northup - Twelve Years a Slave (Dover, 1970; 2000).  Introduction by Philip S. Foner.\n\nISBN: 9780486411439 | 352 pages | EPUB &amp; MOBI\n\n\nSOLOMON NORTHUP (1808 - ca. 1857) was a free-born African American from Saratoga Springs, New York.  His memoir, TWELVE YEARS A SLAVE, recounts his kidnapping in 1841 and sale into slavery, where he was kept in bondage for 12 years in Louisiana before the American Civil War.  The book provides details of slave markets in Washington, DC, as well as describing at length cotton cultivation on major plantations in Louisiana.  Northup was rescued in 1853.\n\nPublished soon after Harriet Beecher Stowe's novel, Uncle Tom's Cabin, Northup's book sold 30,000 copies and was an immediate bestseller.  It went through several editions in the nineteenth century.  Supporting Stowe's fictional narrative in detail, Northup's first-hand account of his twelve years of bondage contributed to the national political debate over slavery leading up to the Civil War, drawing endorsements from major Northern newspapers, anti-slavery organizations, and evangelical groups.\n\nA film based on the story and directed by Steve McQueen was released in October 2013.\n\n\nReviews\n\n\n&quot;For sheer drama, few accounts of slavery match Solomon Northup s tale of abduction from freedom and forcible enslavement.&quot; -- Ira Berlin\n\n&quot;A moving, vital testament to one of slavery's many thousands gone who retained his humanity in the bowels of degradation.  It is also a chilling insight into the peculiar institution.&quot; -- Saturday Review\n","torrent":{"xt":"urn:btih:c913fa857946598b438b0e56d772a8240f23a34e","amp;dn":"Solomon+Northup+-+Twelve+%2F+12+Years+a+Slave+%281853%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c913fa857946598b438b0e56d772a8240f23a34e","infoHashBuffer":{"type":"Buffer","data":[201,19,250,133,121,70,89,139,67,139,14,86,215,114,168,36,15,35,163,78]},"announce":[],"urlList":[]}}