{"title":"The Lost Kingdoms of Africa","uid":15932668,"size":7494186,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c926d471141cea3a0ab1485eb7571e5b3c5a491c&amp;dn=The+Lost+Kingdoms+of+Africa&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"marty14","files":1,"time":1475369389,"description":"The Lost Kingdoms of Africa - Gus Casely-Hayford [epub]\r\n\r\nFor many of us the history of Africa is, at best, vague. We might think of Egyptian pyramids, legendary queens (of Sheba or Cleopatra) and Zulu warriors. The truth, however, is one of remarkably diverse, creative, culturally rich civilisations.\r\n\r\nIn this book, which accompanies an 8-part BBC series, Gus Casely-Hayford takes us on a fascinating journey through the history of this remarkable continent. We will encounter archaeological sites of staggering beauty that rival the Great Wall of China, vast and ancient universities that predate Oxford and Cambridge, kingdoms of extraordinary wealth, artistic traditions that still inspire artists today, great religious sites that surpass the Vatican, and a country with more pyramids than Egypt. In recent years new archaeological and anthropological research has opened up the study of African history in ways previously unimaginable.\r\n\r\nLong-lost kingdoms are suddenly being brought back to life. Civilisations that had faded into myth are revealing their secrets. Using this latest research, Gus Casely-Hayford is able to tell the history of Africa's major kingdoms in an entirely new, colourful and richly-informed way. Accessible and inspiring, &quot;The Lost Kingdoms of Africa&quot; is both a major addition to our understanding of this oft-overlooked history and a source of genuine delight and wonder","torrent":{"xt":"urn:btih:c926d471141cea3a0ab1485eb7571e5b3c5a491c","amp;dn":"The+Lost+Kingdoms+of+Africa","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c926d471141cea3a0ab1485eb7571e5b3c5a491c","infoHashBuffer":{"type":"Buffer","data":[201,38,212,113,20,28,234,58,10,177,72,94,183,87,30,91,60,90,73,28]},"announce":[],"urlList":[]}}