{"title":"Sonic Heroes (Direct Play) (Full Game) (Adventure) (Classic)","uid":6878551,"size":848178934,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c93b25ecd32bc6f861a906061e2af913924eb0af&amp;dn=Sonic+Heroes+%28Direct+Play%29+%28Full+Game%29+%28Adventure%29+%28Classic%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":2,"uploader":"FuCtUpPuNk","files":7,"time":1323552066,"description":"INSTALLATION:\n1. Using 7-zip OR Winrar, Extract The File &quot;SONICHEROES.7z&quot;\nRight Click/7-Zip/Extract Files\nor \nRight Click/Winrar Extract Files\n\n2. run &quot;Launcher.exe&quot; or &quot;Tsonic_win.exe&quot; to run the game\n\n3. play\n-----------------------\n-----------------------\n-----------------------\n\nGAMEPLAY:\nThe game introduces several new gameplay elements. Unlike most Sonic games, where players control one character, three characters are available at any time to choose from, as the player may switch the party's leader freely, whilst the other two characters follow, with the formation depending on the leader. Each team contains three character types: speed, power and flight. Speed characters are able to perform spin dashes, homing attacks and light dashes, and can form whirlwinds that allow them to climb up poles. Power characters can use their strength to fight against strong enemies and break obstacles, as well as enter a gliding formation to ride up air fans. Finally, Flight characters have the ability to fly in the air for a short amount of time and can more easily attack airborne enemies. Each ability is also represented in the interface by color; blue for speed, yellow for flight, and red for power. By acquiring certain items or reaching checkpoints, characters can level up, increasing their efficiency when used against enemies. Each team also has a Team Blast skill, which can be performed when the Team Blast meter becomes full, and this can be achieved by performing such actions as destroying enemies or collecting rings.\nBy collecting a key hidden within each level and reaching the end of the level without getting hit, players can enter the Special Stage. In these stages, the player must run through a tube collecting colored orbs containing boost and avoiding bombs in order to catch a Chaos Emerald before it reaches the end of the tube. Chaos Emeralds are shared amongst all characters, and collecting all the emeralds, as well as clearing the game with all four teams, unlocks the last story.\n*******************************\n\nTEAMS:\n*TeamSonic -     Members: Sonic, Tails, Knuckles\n    The main team of the game, who band together after hearing of Eggman's plan to take over the world in three days. Their levels are of medium difficulty and contain high speed sections. Team Sonic's Team Blast allows Sonic to rapidly fire himself at enemies in a quick time. Team Sonic battles Team Rose and Team Dark along the way.\n\nTeamDark -     Members: Shadow, Rouge, E-123 Omega\n    After Rouge sneaks into Eggman's base looking for treasure, she finds Shadow, who has lost his memory following his assumed death in Sonic Adventure 2, and E-123 Omega, a robot who seeks revenge on Eggman after being shut down. With all their problems relating to Eggman, the three decide to team up. Their levels represent the hardest difficulty, containing longer levels with more focus on skill and battle. Using Team Dark's Team Blast stops most enemies for a short amount of time, and this also freezes time, allowing a bigger Time Bonus at the Result Screen, however fans, and automatic doors are shut off, because time is frozen. Team Dark battles Team Chaotix and Team Sonic along the way.\n\n\nTeamRose -     Members: Amy, Cream, Big\n    A trio who join up to search for someone important. Amy is chasing after Sonic whilst Cream seeks to find her Chao friend Cheese's companion, Chocola, and Big is seeking out his friend, Froggy, with only a newspaper clipping to go by. Their team represents easy difficulty, containing shorter levels than the other teams, including a tutorial stage. Using Team Rose's Team Blast grants temporary invincibility with use, and levels each of them up. Team Rose battles Team Sonic and Team Chaotix along the way\n\nTeamChaotix -     Members: Espio, Charmy, Vector\n    Running a quiet detective agency, the Chaotix Team take on a request from a mysterious client in the hopes of a big payday. Their levels are mission-based, with each level requiring the player to fulfill a certain objective. Additionally, Espio has the ability to become invisible to enemies when using Leaf Swirl. Team Chaotix's Team Blast, allows rings to be collected when defeating enemies, numbes being either 5, 10, or 20. Team Chaotix battles Team Dark and Team Rose along the way.\n\nIf all A-ranks are achieved, Hard Mode is unlocked. The player goes through all stages as Team Sonic, although this time it is much harder. Most paths from Team Dark and Team Chaotix are open, but rarely any Team Rose paths, although some custom paths are created for this mode.\n****************************************\n\nPLOT:\nFive months after the events of Sonic Adventure 2, Sonic Heroes initially sees Sonic off running around the world looking for adventure. Joining up with his friends Tails and Knuckles, who give him a message from Dr. Eggman stating that he will take over the world in three days, Team Sonic is formed and the classic trio head off to stop Eggman's latest plan. But they are not alone on this endeavor, as other characters from the series form their own teams to find Eggman first. The Chaotix Detective Agency has not had a client in a long time and need to pay the rent for the house. Charmy comes flying in with a box containing a walky-talky and become hired by an unknown client to find the Doctor, and they take on the name Team Chaotix. Rouge finds Shadow (who was presumably dead) locked up in a chamber and, however, awakes E123-Omega (also in the same chamber) unknowingly who is mad at Eggman for deactivating him and decides to take revenge on him. When Shadow gains consciousness, E123-Omega shoots all around the place, followed by him saying, &quot;Must eradicate all Eggman's robots.&quot; Shadow is then seen jumping wall-to-wall to escape being shot, as Omega is also aiming at him too. Rouge breaks up their fight before they kill each other. After that short fight, Rouge decides they should team up to find Eggman and become Team Dark. Amy Rose, Cream the Rabbit, and Big the Cat team up to find Cream's Chao Chocola, Big's Froggy, and Sonic after seeing a newspaper article of Sonic holding both Froggy and Chocola. Eventually, they believe that this is all connected with Eggman. The player must control their chosen team to complete each stage, defeat Eggman's robots, and complete boss battles against Eggman himself, as well as defeat the other teams that have formed and stand in their way of finding Eggman first.\nAs each team reaches the final stage and defeat Eggman, they finally meet together and discover that the enemy they have been chasing is not Eggman, but is actually Metal Sonic, disguised as Eggman; the Doctor himself has been locked away, and Team Chaotix discovers that Eggman was their mysterious client. Metal Sonic reveals that he was created for the sole purpose of destroying Sonic and that Eggman's failures made that impossible. He decides to take matters into his own hands by locking up Eggman and transforming his body. The teams come together to battle Metal Sonic in its large, robotic form (called Metal Madness first, and later Metal Overlord when his transformation is complete), before Team Sonic transforms into its members' Super Forms and defeat Metal Sonic (as Metal Overlord), who returns to his original form. In the aftermath, Team Chaotix chases after Eggman, who is attempting to sneak away in order to avoid paying Team Chaotix their reward. Sonic and Tails leave, and Amy chases them. Rouge says she will look for someone else's treasure, while Knuckles chases after her. Shadow and Omega pick up the body of Metal Sonic, and in the end, Team Sonic goes off on their next adventure.\n\n\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSerious Sam: The First and Second Encounter\nNexuiz\nall doom, heretic sotsr, hexen + ddc, n similar stuff (52 games)    NOTE: This Requires a mod to play online (skulltag), it's free, google it\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:c93b25ecd32bc6f861a906061e2af913924eb0af","amp;dn":"Sonic+Heroes+%28Direct+Play%29+%28Full+Game%29+%28Adventure%29+%28Classic%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c93b25ecd32bc6f861a906061e2af913924eb0af","infoHashBuffer":{"type":"Buffer","data":[201,59,37,236,211,43,198,248,97,169,6,6,30,42,249,19,146,78,176,175]},"announce":[],"urlList":[]}}