{"title":"This.War.of.Mine-RELOADED","uid":11469746,"size":785874944,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c94ae96a889422cde751d1d7e756c8428af61a20&amp;dn=This.War.of.Mine-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":36,"leechers":1,"uploader":"Tenguken","files":-1,"time":1416070062,"description":"              This War of Mine (c) 11 bit studios\n\n11/2014 :..... RELEASE.DATE .. PROTECTION\n      1 :.......... DISC(S) .. GAME.TYPE ........: Adventure, Indie, \n                                                   Simulation\n\nAbout This Game In This War Of Mine you do not play as an elite soldier,\nrather a group of civilians trying to survive in a besieged city; struggling\nwith lack of food, medicine and constant danger from snipers and hostile\nscavengers. The game provides an experience of war seen from an entirely new\nangle.\n\nThe pace of This War of Mine is imposed by the day and night cycle. During\nthe day snipers outside stop you from leaving your refuge, so you need to\nfocus on maintaining your hideout: crafting, trading and taking care of your\nsurvivors. At night, take one of your civilians on a mission to scavenge\nthrough a set of unique locations for items that will help you stay alive.\n\nMake life-and-death decisions driven by your conscience. Try to protect\neverybody from your shelter or sacrifice some of them for longer-term\nsurvival. During war, there are no good or bad decisions; there is only\nsurvival. The sooner you realize that, the better.\n\nThis War of Mine:\n* Inspired by real-life events\n* Control your survivors and manage your shelter\n* Craft weapons, alcohol, beds or stoves  anything that helps you survive\n* Make decisions - an often unforgiving and emotionally difficult experience\n* Randomized world and characters every time you start a new game\n* Charcoal-stylized aesthetics to complement the game's theme\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game.\n4. Play the game.\n5. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:c94ae96a889422cde751d1d7e756c8428af61a20","amp;dn":"This.War.of.Mine-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c94ae96a889422cde751d1d7e756c8428af61a20","infoHashBuffer":{"type":"Buffer","data":[201,74,233,106,136,148,34,205,231,81,209,215,231,86,200,66,138,246,26,32]},"announce":[],"urlList":[]}}