{"title":"Before Sunrise[1995][DvDrip][Eng][MustWatch][BandwidthWasters]","uid":4119388,"size":870294789,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c95940225b96f92a0530ea67a3a460c21fd35bc5&amp;dn=Before+Sunrise%5B1995%5D%5BDvDrip%5D%5BEng%5D%5BMustWatch%5D%5BBandwidthWasters%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":0,"uploader":"bandwidthwasters","files":2,"time":1207473371,"description":"IMDB Rating : 8.0/10 (25,097 votes)\n\n\nBefore Sunrise is a passionate and intelligent romance between a young American (Jesse) and a French student (Celine). A chance encounter on the train incites intrigue, and Jesse provocatively suggests that Celine postpones her return to France and embarks instead on a spontaneous expedition to Vienna. In the course of their 14-hour relationship, the two share in their love for the unrehearsed and their appreciation for the unexpected as they explore in a powerful meeting of hearts and minds.\n\n\nUser on IMDB : \n\nI had never heard of this film before a couple of weeks ago, but its concept interested me when I heard it: an American man meets a European woman on his last night in Europe and they spend the night together talking. It sparked my interest, but I never expected it to be this great. Before Sunrise is a masterpiece, and it&amp;#039;s also one of the most romantic films on record. To my surprise, it completely lacked the cynicism of the 1990s. It&amp;#039;s impossible to really talk too much about it, since there is no real plot, so to speak (although there are plenty of thoroughly interesting things you could talk about; it is sort of like My Dinner With Andre, where there is a conversation, but it&amp;#039;s not JUST the conversation that matters), but let me just say, see it. SEE IT!","torrent":{"xt":"urn:btih:c95940225b96f92a0530ea67a3a460c21fd35bc5","amp;dn":"Before+Sunrise%5B1995%5D%5BDvDrip%5D%5BEng%5D%5BMustWatch%5D%5BBandwidthWasters%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c95940225b96f92a0530ea67a3a460c21fd35bc5","infoHashBuffer":{"type":"Buffer","data":[201,89,64,34,91,150,249,42,5,48,234,103,163,164,96,194,31,211,91,197]},"announce":[],"urlList":[]}}