{"title":"Sponge Bob Square Pants The Movie.mpg","uid":3814208,"size":820885604,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c9c9cfa936fe4c0c55e0f335120a346a1278d94e&amp;dn=Sponge+Bob+Square+Pants+The+Movie.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":6,"uploader":"bungee","files":1,"time":1190387953,"description":"This movie was totally up to my expectations. I&amp;#039;ve been a Spongebob fan since its premiere in 1999, so I saw it without paying attention to any of the reviews. I heard a bunch of complaints that the plot didn&amp;#039;t have the charisma of the TV episodes and wasn&amp;#039;t fast-paced enough. I can&amp;#039;t imagine how much more excitement could have been packed into this film, though. If the movie didn&amp;#039;t have some absurdity, all the characters would be tied too heavily to the main plot and not able to experience their antics that are the essence of Spongebob Squarepants (such as hilarious obstacles and sporadic musical numbers). The wacky ending captivated kids&amp;#039; attention and made moviegoers over 18 burst into gales of laughter.\n\nYou can tell that every show worker had so much fun creating this film. The characters&amp;#039; facial expressions look even more over-the-top than on the show, and the voice acting of Tom Kenny, Bill Fagerbakke, and many others is perfect. Plus, David Hasselhoff was a real sport to do that cameo. The backgrounds and scenery are beautifully done (under the art direction of Mr. Nick Jennings, I assume). In April of 2003, TV Guide featured Spongebob on the cover as a show to watch if you&amp;#039;re feeling depressed, so you will definitely not feel blue after this movie.","torrent":{"xt":"urn:btih:c9c9cfa936fe4c0c55e0f335120a346a1278d94e","amp;dn":"Sponge+Bob+Square+Pants+The+Movie.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9c9cfa936fe4c0c55e0f335120a346a1278d94e","infoHashBuffer":{"type":"Buffer","data":[201,201,207,169,54,254,76,12,85,224,243,53,18,10,52,106,18,120,217,78]},"announce":[],"urlList":[]}}