{"title":"Mary Helen Bowers - Ballet Beautiful: Body Blast","uid":8749409,"size":842159360,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c9ee67c32e3ab1de47512f8667b6049477cd6c8f&amp;dn=Mary+Helen+Bowers+-+Ballet+Beautiful%3A+Body+Blast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":0,"uploader":"acer47x","files":1,"time":1374998157,"description":"Country : USA \nCategory : Fitness ballet \nVideo Tutorial Length : 1:00:39 \nYear : 2012 \nLanguage : English \nTranslation : None \n\nDescription : Training in an elegant ballet style combined with a relaxed classical piano music. Everything was done so that you get a long, lean muscles ballerina (using only the weight of your own body, you do not need a machine.) The first part of &quot;Swan hands&quot; - a graceful movements of your hands when the flow from one exercise to another (it looks easy, but the arms and shoulders definitely &quot;light&quot;). This is followed by exercises on the floor to work out the abdominal muscles, the classic &quot;bridges&quot; and &quot;&quot; twist. &quot;In the last two parts of all the attention paid to your buttocks. Initially worked out the back of the legs with exercise for stretching and leg lifts (such as ballet,&quot; arabesque &quot; .) And at the conclusion of exercise to work out the muscles of the hips. Mary Helen Bowers, coach Natalie Portman (&quot;Black Swan&quot; / &quot;Black Swan&quot;), also included in the program of stretching / stretching between the basic exercises.\n\nElegant ballet-style toning combined with soothing classical piano music. It's all designed to give you the long, lean muscles of a ballerina (only using your body weight, no barre required). The first segment is &quot;Swan arms&quot; - gracefully moving your arms through a wide range of fluid motions (it looks easy, but your arms and shoulders will definitely &quot;feel the burn&quot;). Then it's down on the floor for the abwork, classics like bridges and crunches. The last two sections focus on your buttocks. The first targets the back of your legs with leg extensions and leg lifts (called &quot;arabesques,&quot; to give them a ballet flavor). The final butt section primarily focuses on your hips. Mary Helen Bowers, Natalie Portman's &quot;Black Swan&quot; Trainer, also includes lots of short, between-move stretches. Â© 2012.\n\nQuality : DVDRip \nFormat : AVI \nVideo : MPEG4 Video (H264) 640x360 30fps 1582kbps \nAudio : MP3 44100Hz stereo 256kbps ","torrent":{"xt":"urn:btih:c9ee67c32e3ab1de47512f8667b6049477cd6c8f","amp;dn":"Mary+Helen+Bowers+-+Ballet+Beautiful%3A+Body+Blast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9ee67c32e3ab1de47512f8667b6049477cd6c8f","infoHashBuffer":{"type":"Buffer","data":[201,238,103,195,46,58,177,222,71,81,47,134,103,182,4,148,119,205,108,143]},"announce":[],"urlList":[]}}