{"title":"[NaughtyAmericaVR] - Spring Break VR - Kate England, Tali Dova","uid":13978394,"size":2436144760,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ca2d3a20e1c770ed4199435f658b0f4ab1b8a85f&amp;dn=%5BNaughtyAmericaVR%5D+-+Spring+Break+VR+-+Kate+England%2C+Tali+Dova&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":6,"uploader":"distinc","files":3,"time":1458667632,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=8911196813\r\n \nhttp://imagedisco.net/?g=6485108444\r\n\r\n\r\n\r\nDescription:\r\n\r\nYou're laying outside by the pool with your girlfriend (Kate England) and her two voluptuous friends (Elsa Jean, Tali Dova). After a few minutes of talking, her friends go inside and it's just you and Kate by the pool. Kate gets close and stares you straight in the eyes with an enticing look on her face. She tells you that she really wants to have a foursome with her two friends, and hopes that you'd be up for it. Naturally, you agree to this phenomenal invitation and follow her inside to seal the deal.\r\n\r\n\r\n\r\nYou then proceed to follow Kate inside. You find yourself sitting on the bed with the three girls standing in front of you. They get undressed. They begin to perform fellatio on you. Eventually Tali Dova gets on top of you and you have sex with her while the other two just kind of sit next to her and stare into your soul. Then she gets off of you, and Elsa Jean takes her turn on top, whilst Kate and Tali are now staring at you and saying things. Within 6 minutes or so, you've successfully fucked all of them. Now it's time to take the action to the bedroom floor, where Elsa is on top of you reverse-cowgirl style, and the other two are kissing. Then you fuck Elsa from behind, then Tali from behind, then Elsa from the front, then Tali from the front. The fellatio trio forms once more to finish you off. All of which can be seen in the screens I've provided below. The end. Have a wonderful day everyone &lt;3","torrent":{"xt":"urn:btih:ca2d3a20e1c770ed4199435f658b0f4ab1b8a85f","amp;dn":"%5BNaughtyAmericaVR%5D+-+Spring+Break+VR+-+Kate+England%2C+Tali+Dova","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca2d3a20e1c770ed4199435f658b0f4ab1b8a85f","infoHashBuffer":{"type":"Buffer","data":[202,45,58,32,225,199,112,237,65,153,67,95,101,139,15,74,177,184,168,95]},"announce":[],"urlList":[]}}