{"title":"Just Cause 2 Proper-SKIDROW","uid":5530052,"size":4217546752,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ca592b2a30f16bb44e2876c760df3ec6a034fe5c&amp;dn=Just+Cause+2+Proper-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":6,"uploader":"DjAligator14","files":-1,"time":1272898931,"description":"proudly presents\n\nJust Cause 2 Proper / SQUARE ENIX - Eidos Interactive\n\n\nRELEASE DATE : 23-03-2010               PROTECTION : Steamworks\n\nGAME TYPE    : Shooter                  DISKS      : 1 DVD\n\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\n\nWe're a professional team of dedicated sceners with big mark\n\nunder sceners. We believe on the ground idealism of the root\n\nof the real old school scene. We do all this for fun and\n\nnothing else. We don't earn anything on our hobby, as we do\n\nthis for the competition and the heart of what got the scene\n\nstarted in the mid eighties.\n\nIf you think you got something to offer, then don't hold back\n\non contacting us as soon as possible.\n\ntwice the fun   / double the trouble\n\nProper Notes:\n\nIn RELOADED exe steamworks triggers are not resolved, look\n\nexample:\n\n00401010     51              PUSH ECX\n\n00401011     B8 30354900     MOV EAX,JustCaus.00493530\n\n00401016     FFD0            CALL EAX           &lt;- CRASH HERE\n\n00401018     59              POP ECX\n\n00401019   - FFE0            JMP EAX\n\nProperly fixed:\n\n00401010     51              PUSH ECX\n\n00401011     B8 10926F00     MOV EAX,JustCaus.006F9210 &lt;- Good\n\naddress restored\n\n00401016     90              NOP\n\n00401017     90              NOP\n\n00401018     59              POP ECX\n\n00401019   - FFE0            JMP EAX\n\nRELOADED did also miss 2 vital game files in archives_win32\n\nfolder. Files pc4.arc and pc4.tab to be precise.\n\nAlso our crack do not take 20 secs to start exe.\n\nAs a bonus, we have made a language selector for you all. The\n\nRELOADED version only enables english, when there is actually\n\n6 languages included in the game. English, German, French,\n\nItalian, Spanish and Russian.\n\nOn with the game release information:\n\nDive into an adrenaline-fuelled free-roaming adventure. As\n\nagent Rico Rodriguez, your orders are to find and kill your\n\nfriend and mentor who has disappeared on the island paradise\n\nof Panau. There, you must cause maximum chaos by land, sea and\n\nair to shift the balance of power. With the unique grapple and\n\nparachute combo, BASE jump, hijack and create your own\n\nhigh-speed stunts. With 400 square miles of rugged terrain and\n\nhundreds of weapons and vehicles, Just Cause 2 defies gravity\n\nand belief.\n\nUNIQUE VERTICAL GAMEPLAY - Take to the air like no other game.\n\nExperience total aerial freedom with the unique parachute and\n\ndual grapple\n\nUNBELIEVABLE ADRENALINE-FUELLED STUNTS - Free fall, base jump,\n\nvehicle surf, para sail, skydive, grapple, slingshot, leap\n\nbetween vehicles, hang from helicopters, scale buildings. The\n\nimpossible is within your grasp.\n\nUPGRADED DUAL GRAPPLE - Your best tool is now a weapon. Fire\n\ntwo shots with the grapple hook and attach unwilling enemies\n\nto high-speed vehicles, hang them upside down from buildings,\n\ntether objects in mid air. The possibilities are as vast as\n\nyour imagination.\n\nDISCOVER THE SECRETS OF PANAU - Explore the island paradise;\n\nfrom sprawling cities, secluded beaches and towering mountain\n\npeaks   more than 400 square miles of your own personal\n\nplayground.\n\nEXPERIENCE TRUE FREEDOM - Hundreds of objectives can be\n\ncompleted in any way or order that you choose. When it s time\n\nfor a break from Agency business, kick back and enjoy all the\n\nattractions that Panau has to offer.\n\nMASSIVE SELECTION OF VEHICLES - Catch air on a high-speed dirt\n\nbike, race across the sea in a power boat, or fire a spread of\n\nrockets from an attack chopper   more than 100 land, sea and\n\nair vehicles are yours for the taking.\n\n\nInstall Notes:\n\n1. Unpack release\n\n2. Mount image or burn it\n\n3. Install\n\n4. Copy the content from the SKIDROW folder on the DVD to your\n\ninstallation directory and overwrite\n\n5. Play the game\n\nThe minimum system requirements are as follows:\n\nOPERATING SYSTEM: Microsoft Windows Vista (Windows XP is unsupported)\nDIRECTX: Microsoft DirectX 10\nCPU: Dual-core CPU with SSE3 (Athlon 64 X2 4200 / Pentium D 3GHz)\nRAM: 2GB system Memory\nGRAPHICS: DX10 compatible graphics card with 256 MB of memory\n(Nvidia GeForce 8800 series/ ATI Radeon HD 2600 Pro)\nSOUND: 100% DirectX 10 compatible sound card\nDVD-ROM: Quad-speed (4x) DVD-ROM drive\nHARD DRIVE: 10GB of free drive space\nINPUT DEVICES: Keyboard and Mouse.\n\nThe recommended system requirements are as follows:\n\nOPERATING SYSTEM: Microsoft Windows Vista SP1 or Windows 7\nDIRECTX: Microsoft DirectX 10.1\nCPU: Intel CoreÃ‚Â® 2 Duo 2.6 GHz or AMD Phenom X3 2.4GHz or equivalent\nRAM: 3GB system Memory\nGRAPHICS: DX10 compatible graphics card with 512 MB of memory\n(Nvidia GeForce GTS 250 series/ ATI Radeon HD 5750 series)\nSOUND: 100% DirectX 10 compatible Dolby Digital 5.1 sound card\nDVD-ROM: 8 Speed DVD-ROM drive\nHARD DRIVE: 10GB of free drive space\nINPUT DEVICES: Keyboard and Mouse. (Microsoft Xbox360 controller supported)","torrent":{"xt":"urn:btih:ca592b2a30f16bb44e2876c760df3ec6a034fe5c","amp;dn":"Just+Cause+2+Proper-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca592b2a30f16bb44e2876c760df3ec6a034fe5c","infoHashBuffer":{"type":"Buffer","data":[202,89,43,42,48,241,107,180,78,40,118,199,96,223,62,198,160,52,254,92]},"announce":[],"urlList":[]}}