{"title":"Morrowind.Game.of.the.Year.Edition.GOTY.(Bethesda.Softworks)-WWW","uid":11692675,"size":785372729,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ca7850fd16e530fc744590c7cf18e4a1fef8f7d1&amp;dn=Morrowind.Game.of.the.Year.Edition.GOTY.%28Bethesda.Softworks%29-WWW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":1,"uploader":"WDoubleYouW","files":2,"time":1423598415,"description":"W     W DDD           b    l     Y   Y          W     W\nW  W  W D  D ooo u  u bbb  l eee   Y   ooo u  u W  W  W\n W W W  D  D o o u  u b  b l e e   Y   o o u  u  W W W \n  W W   DDD  ooo  uuu bbb  l ee    Y   ooo  uuu   W W  \n\n#################################################\n\nRelease Name:\nMorrowind.Game.of.the.Year.Edition.GOTY.(Bethesda.Softworks)-WWW\nCA7850FD16E530FC744590C7CF18E4A1FEF8F7D1\n\nRelease Type: Game\nGame: Morrowind Game of the Year Edition\nVersion: 1.6.1820\nLanguage: English\n\nExpansions:\nTribunal\nBloodmoon\n\nOfficial Add-ons:\nEntertainers\nBitter Coast Sounds\nArea Effect Arrows\nHelm of Tohan\nMaster Index\nLeFemm Armor\nAdamantium Armor\nSiege at Firemoth\n\nTools:\nTES Construction Set\n\n#################################################\n\nSystem Requirements:\n\nOS: Windows ME/98/2000/XP/Vista/7/8/8.1\nProcessor: 500 MHz Intel Pentium III, Celeron, or AMD Athlon\nMemory: 256 MB\nGraphics: 32MB Direct3D Compatible video card with 32-bit color support and DirectX 8.1\nDirectXÂ®: 8.1\nHard Drive: 1GB free hard disk space\nSound: DirectX 8.1 compatible sound card \n\n#################################################\n\nAbout This Game:\n\nThe Elder Scrolls III: MorrowindÂ® Game of the Year Edition includes Morrowind plus all of the content from the Bloodmoon and Tribunal expansions. The original Mod Construction Set is not included in this package.\n\nAn epic, open-ended single-player RPG, Morrowind allows you to create and play any kind of character imaginable. You can choose to follow the main storyline and find the source of the evil blight that plagues the land, or set off on your own to explore strange locations and develop your character based on their actions throughout the game. Featuring stunning 3D graphics, open-ended gameplay, and an incredible level of detail and interactivity, Morrowind offers a gameplay experience like no other.\n\nIn Tribunal, you journey to the capital city of Morrowind, called Mournhold, to meet the other two god-kings of Morrowind, Almalexia and Sotha Sil. Your journey will lead you to the Clockwork City of Sotha Sil and massive, epic-sized dungeons, where strange and deadly creatures await you, including goblins, lich lords, and the mysterious Fabricants.\n\nBloodmoon takes you to the frozen Island of Solstheim where you'll experience snow, blizzards, and new creatures, including frost trolls, ice minions, and wolves... just to name a few. You'll have a choice of stories to follow and have the opportunity to defend the colony, take control over how the colony is built up, and eliminate the werewolves. Or, you can decide to join the werewolves and become one of them, opening up a whole new style of gameplay. \n\nKey Features:\n\n*Explore the forests, caves, and snow-covered wastelands of the island of Solstheim.\n\n*Delve into new, epic-sized dungeons and visit the Capital City of Mournhold and the Clockwork City of Sotha Sil.\n\n*Fight new creatures including bears and wolves, lich lords and goblins, ice minions and spriggans.\n\n*Direct the construction of a mining colony and face the threat of savage werewolves.\n\n*Become a werewolf and indulge your thirst for the hunt.\n\n#################################################\n\nHow to install:\n1. Mount MORROWIND_GOTY.iso\n2. Install by following the on-screen instructions.\n3. Run Morrowind Launcher\n4. Click &quot;Data Files&quot; and select which expansions/add-ons you want to be active (by default, all are enabled).\n5. Click Options and choose the display options you want. Note that you will have to mod this game to get widescreen resolutions (Google it).\n6. Play!\n\n#################################################\n\nFAQs\nQ: Is this the full game?\nA: Yes.\n\nQ: Does this include all addons/DLC?\nA: Yes.\n\nQ: Is this up to date?\nA: Yes, it is updated to version 1.6.1820.\n\nQ: Does this require Steam?\nA: No.\n\nQ: It CTDs. Help!\nA: Google is your friend. This pirated version will CTD for most of the same reasons the bought version will. There are many mods that help prevent CTD.\n\nQ: Is this version Large Address Aware?\nA: Yes I already have applied the Large Address Aware patch (AKA 4gb patch) for you. You should no longer CTD when it needs more than 2gb of memory.\n\nQ: Have you applied the the Morrowind Code Patch or Timeslip's Exe optimization?\nA: No, since you may desire to configure these settings yourself. The only modifications I have applied is a generic CD-check removal and the 4gb LAA patch, which should not conflict with any other patches you may wish to apply.\n\nQ: I can't apply the Morrowind Code Patch on this!\nA: Grab my Morrowind Code Patch kit here:\n\nQ: Will this work with MSGO?\nA: Yes.\n\nQ: Is this version moddable?\nA: Yes.\n\nQ: I cannot get mods to work. Help!\nA: The same rules for modding the bought version of the game apply to this pirated version.\n\nQ: I already have a different version of Morrowind installed. Can I use this to update to the Game of the Year Edition?\nA: I recommend that you uninstall your current version and replace it with this version, since this contains everything already.\n\nQ: Will I lose my saves?\nA: No.\n\nQ: Is this multilingual?\nA: No. English is the only language supported.\n\nQ: Will this installer work on a Mac?\nA: Buy me a Mac and I'll figure it out.\n\nQ: Will this work even if I have a previous botched installation of Morrowind?\nA: I believe I have completely fail-safed this installer so that it should work regardless of prior installations.\n\nQ: Does this contain viruses?\nA: No.\n\nQ: Will you marry me?\nA: No.\n\n#################################################\n\nCredits:\nBethesda Game Studios for the game.\n\n#################################################\n\nIf you enjoy the game, BUY it. Support game developers!","torrent":{"xt":"urn:btih:ca7850fd16e530fc744590c7cf18e4a1fef8f7d1","amp;dn":"Morrowind.Game.of.the.Year.Edition.GOTY.%28Bethesda.Softworks%29-WWW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca7850fd16e530fc744590c7cf18e4a1fef8f7d1","infoHashBuffer":{"type":"Buffer","data":[202,120,80,253,22,229,48,252,116,69,144,199,207,24,228,161,254,248,247,209]},"announce":[],"urlList":[]}}