{"title":"[NubileFilms] Aidra Fox, Jillian Janson (Cum Together)","uid":11689664,"size":254904341,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ca92a9bdc319cb0c975a98a97f342dac2c5bb91e&amp;dn=%5BNubileFilms%5D+Aidra+Fox%2C+Jillian+Janson+%28Cum+Together%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":4,"uploader":"chkm8te","files":1,"time":1423471311,"description":"[NubileFilms] Aidra Fox, Jillian Janson (Cum Together / 02.09.2015)\n\nJuicy hotties Aidra Fox and Jillian Janson are dressed to kill in bras and thongs that hug the curves of their luscious bodies and ready to work together to seduce Tommy Gunn. The girls kick things off with a teasing show, making out behind filmy curtains and then stepping out and running their hands all over their own and each other's bodies while Tommy watches.\n\nWhen the girls finally approach, Tommy is already rock hard and ready for the double blowjob that's coming his way. Eventually Aidra takes the lead while Jillian backs off and slips Aidra's thong down her legs, leaving her creamy twat open for a pussy fingering and licking. The responsibility soon shifts to Tommy to continue the pussy feast while Jillian pushes her thong aside and slides down on his cock.\n\nThe girls enjoy their respective positions for a time, with Jillian pumping her hips in a rhythm that leaves her breath coming in panting gasps while Aidra moans from the joy of Tommy's tongue. While Jillian's snatch is still pulsing, Aidra leans forward and uses her talented tongue to work every last second of climactic pleasure from her lover.\n\nThen the girls trade places so that Aidra can get her fuck hole filled by Tommy's rock hard cock. Jillian can't get enough of getting her juicy twat licked while Aidra bounces behind her. When Aidra has had enough and leans back to use her feet to rub Tommy's cock while Jillian sucks the tip.\n\nNext Jillian crawls on top of Aidra for a lingering kiss that sets up a double pussy stack for Tommy's pleasure. He sinks his cock into Jillian's snatch first, pounding away at her fuck hole for a few minutes before giving Aidra the same treatment. With such alternating attention, Tommy soon drives both Jillian and Aidra over the edge of pleasure.\n\nEager to repay Tommy for all the joy he has given them, Aidra and Jillian go back to their double blowjob. Tommy finally loses his load all over Aidra's hands, leaving a creamy treat for the girls to savor and snowball.\n\nScreens:  &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=dpx9wsecjrtetstk19sg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=dpx9wsecjrtetstk19sg.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=9gfgl4y3sbu4nbbr7d5i.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=9gfgl4y3sbu4nbbr7d5i.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ca92a9bdc319cb0c975a98a97f342dac2c5bb91e","amp;dn":"%5BNubileFilms%5D+Aidra+Fox%2C+Jillian+Janson+%28Cum+Together%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca92a9bdc319cb0c975a98a97f342dac2c5bb91e","infoHashBuffer":{"type":"Buffer","data":[202,146,169,189,195,25,203,12,151,90,152,169,127,52,45,172,44,91,185,30]},"announce":[],"urlList":[]}}