{"title":"John McDougall - The Healthiest Diet on the Planet","uid":15927712,"size":19771194,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb310e51c271ed4328fadd3f44ab73b59564e1ac&amp;dn=John+McDougall+-+The+Healthiest+Diet+on+the+Planet&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"PBased","files":2,"time":1475326310,"description":"The bestselling author and internationally celebrated physician and expert on nutrition offers an appealing, approachable health solution—eat the foods you love to lose weight and get healthy.\r\n\r\nFor years, we’ve been told that a healthy diet is heavy on meat, poultry, and fish, and avoids carbohydrates, particularly foods high in starch—empty calories harmful to our bodies.\r\n\r\nBut what if everything we’ve heard was backwards?\r\n\r\nHigh in calories and cholesterol, animal fats and proteins too often leave you hungry and lead to overeating and weight gain. They are often the root causes of a host of avoidable health problems—from indigestion, ulcers, and constipation to obesity, diabetes, heart disease, and cancer. On the other hand, complex carbohydrates like whole grains, legumes, tubers, and other starches provide your body with essential proteins and nutrients that satisfy the appetite while simultaneously fighting illness. But Americans eat far too few calories from carbohydrates—only about forty percent, according to Dr. John McDougall, internationally renowned expert on nutrition and health, featured on the documentary Forks Over Knives.\r\n\r\nThe Healthiest Diet on the Planet helps us reclaim our health by enjoying nutritious starches, vegetables, and fruits. McDougall takes on the propaganda machines pushing dangerous, high-fat fad diets and cuts through the smoke and mirrors of the diet industry. He offers a clear, proven guide to what we should and shouldn’t eat to prevent disease, slow the aging process, improve our physical fitness, be kind to the environment, and be our most attractive selves.\r\n\r\nFeaturing two dozen color photos and mouth-watering, easy-to-follow recipes for buckwheat pancakes, breakfast tortillas, baked potato skins, rainbow risotto, red lentil soup, green enchiladas, dairy-free lasagna and pizza, and more, The Healthiest Diet on the Planet will help you look great, feel better, and forever change the way you think about health and nutrition","torrent":{"xt":"urn:btih:cb310e51c271ed4328fadd3f44ab73b59564e1ac","amp;dn":"John+McDougall+-+The+Healthiest+Diet+on+the+Planet","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb310e51c271ed4328fadd3f44ab73b59564e1ac","infoHashBuffer":{"type":"Buffer","data":[203,49,14,81,194,113,237,67,40,250,221,63,68,171,115,181,149,100,225,172]},"announce":[],"urlList":[]}}