{"title":"Karin Slaughter - The Kept Woman - Will Trent Series 8","uid":15382255,"size":1229551,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb721c1cbcfa119ba0721cf645e1248eff03fde5&amp;dn=Karin+Slaughter+-+The+Kept+Woman+-+Will+Trent+Series+8&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":2,"uploader":"DavidTenn","files":2,"time":1469239102,"description":"The latest novel in the Will Trent series from No. 1 bestselling author, Karin Slaughter.\r\n\r\nA body is discovered in an empty Atlanta warehouse. It's the body of an ex-cop, and from the moment Special Agent Will Trent walks in he knows this could be the most devastating case of his career. Bloody footprints leading away from the scene reveal that another victim - a woman - has left the scene and vanished into thin air. And, worst of all, the warehouse belongs to the city's biggest, most politically-connected, most high-profile athlete - a local hero protected by the world's most expensive lawyers. A local hero Will has spent the last six months investigating on a brutal rape charge.\r\n\r\nBut for Will - and also for Dr Sara Linton, the GBI's newest medical examiner - the case is about to get even worse. Because an unexpected discovery at the scene reveals a personal link to Will's troubled past. The consequences will wreak havoc on his life and the lives of those he loves, those he works with, and those he pursues.\r\n\r\nBut Sara's scene-of-the-crime diagnosis is that they only have a few hours to find the missing woman before she bleeds out","torrent":{"xt":"urn:btih:cb721c1cbcfa119ba0721cf645e1248eff03fde5","amp;dn":"Karin+Slaughter+-+The+Kept+Woman+-+Will+Trent+Series+8","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb721c1cbcfa119ba0721cf645e1248eff03fde5","infoHashBuffer":{"type":"Buffer","data":[203,114,28,28,188,250,17,155,160,114,28,246,69,225,36,142,255,3,253,229]},"announce":[],"urlList":[]}}