{"title":"VMware.Fusion.Professional.v6.0.2","uid":9176419,"size":245237999,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:cbd0b169122de75bf7d18515f6f6fc5f7507b488&amp;dn=VMware.Fusion.Professional.v6.0.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":0,"uploader":"failzone","files":2,"time":1384158533,"description":"VMware Fusion (for the Mac) The Best Way to Run Windows on a Mac\nThe #1 Rated Solution by Apple Online Customers to Switch to a Mac and Run Windows Without Rebooting*\nVMware Fusion 4 is recommended for home users, students and business professionals who are looking for the easiest, fastest and most reliable way to run Windows programs on their Macs without rebooting.\n\nOptimized for Mountain Lion, Windows 8 and the Latest Macs to Deliver the Ultimate Windows on Mac Experience\n\nWhats new? vmware.com/products/fusion/features.html\n\nVersion 5.0.1:\n* Contains bug fixes and minor improvements\n\nVersion 5.0.2:\nOptimized for Mountain Lion, Windows 8 and the Latest Macs to Deliver the Ultimate Windows on Mac Experience\nUSB 3.0 stability improvements.\nGraphics improvements when running the Microsoft Office 2013 preview.\nFixed an issue that caused the library and the Fusion start menu contents to get out of sync.\nFixed an issue that caused Mac OS X (Mountain Lion) guests to see stale directory information when using HGFS.\nFixed a multi-monitor behavior on Mac OS X (Mountain Lion) when Use All Displays in Full Screen is selected.\nFixed an issue that caused the full screen short-cut key to intermittently fail when Caps Lock was on.\nEasy Install improvements for Microsoft Windows 8.\nFixed key repeat behavior (typematic) on certain versions of Mac OS X (Mountain Lion).\nFixed an intermittent problem that caused Fusion to quit when the network editor was opened.\nFixed cancelling of the import of OVF virtual machines.\nAddressed graphics issues with Autodesk Inventor, Altium Designer, and Solidworks.\nFixed an issue installing on Macs with a user or group named &quot;0&quot;.\nFixed error compiling HGFS on Linux 3.6 kernels.\nChanged the selection color in the library icon view.\nRenamed the Pause key menu item to aid with accessibility and automation.\nFixed an issue importing a Parallels virtual machine that has no network devices.\nResolved an issue that caused the PC Migration Assistant to not complete when migrating a Windows PC.\n\nVMware Fusion 6 is optimized for the latest Macs and ready for OS X Mavericks and Windows 8.1 to deliver the ultimate Windows on Mac experience.\n\nWhats New in Version 6.0.2\n\nVMware Fusion 6.0.2 is a minor upgrade recommended for all users of VMware Fusion. This release includes the following improvements and resolved issues.\n\nResolved an issue that causes virtual machines to fail to power on due to insufficient memory.\nEasy Install support for final versions of Windows 8.1 and Windows Server 2012 R2.\nImproved performance when opening VMware Fusion.\nResolved an issue that caused the HGFS kernel module to fail to build on certain versions of Linux.\nImproved support for OS X Mavericks:\nFinder tags.\nImproved drag-and-drop to OS X guests.\nImproved menu-bar handling.\nImproving handling of multiple displays in Unity mode.\nImproved support for Recovery Partition with a OS X Mavericks guest.\nFixed an issue with boot device selection with a OS X guest.\nImproved handling of virtual machine window restoration after a restart.\nImproved the &quot;Migrate a PC&quot; feature to be more compatible with Mavericks file sharing.\nImproved detection of Parallels Desktop 8 when importing virtual machines.\nImproved message when no boot device is found.\nPrevent disk layout changes on an encrypted virtual machine.\nFixed an issue that prevented auto-start virtual machine from powering on.\nFileVault can be activated in a Mac OS guest installed on a SATA virtual disk.\nResolved the isse where a virtual machine ceases to function (hang) while powering off, particularly if the guest OS was in the middle of a BSOD or kernel panic.\nResolved an issue building the shared folders kernel module on Ubuntu 13.10.","torrent":{"xt":"urn:btih:cbd0b169122de75bf7d18515f6f6fc5f7507b488","amp;dn":"VMware.Fusion.Professional.v6.0.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbd0b169122de75bf7d18515f6f6fc5f7507b488","infoHashBuffer":{"type":"Buffer","data":[203,208,177,105,18,45,231,91,247,209,133,21,246,246,252,95,117,7,180,136]},"announce":[],"urlList":[]}}