{"title":"Rayman Origins GOG","uid":8719395,"size":2122201188,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cc7c181aa447188e24068e91ca26f346261d7511&amp;dn=Rayman+Origins+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":2,"uploader":"IAmsoICan","files":6,"time":1374393406,"description":"What's cool about it:\n\n    Includes over 60 levels of 2D platforming game play designed for all ages and playing styles. Unlock new abilities progressively and return to previous levels to discover new paths and secrets.\n    Play as Rayman in the solo campaign, or have up to three friends jump in at any time to play as Globox or as one of the two Teensies. You can leave at any time without affecting your friend s progression.\n    A rich world with over 100 characters and 12 unique environments created by some of gaming s most reputed artists and animators.\n\nOverview:\n\nThe Glade of Dreams is up in arms again! This idyllic world, where there is usually little more to do than eat, sleep, play (and enjoy a friendly fray or two among friends), is up to its eyeballs in trouble. It seems Rayman and his heroic gang of hilarious misfits has kicked off a war with just a little snoring! Their nightmarish neighbors from the Land of the Livid Dead don t seem to share the same taste in music and have come to crash the party! Never ones to shy away from a challenge, Rayman and his friends are more than happy to knock these nasty killjoys back to oblivion, especially since it involves saving nymphs, making mischief, and earning fantastic new powers to make even more mischief. And this won t be the first time! As it turns out, the fun-loving Creator of the Glade, known as Bubble Dreamer, is a highly sensitive being whose every mood impacts the Glade for good or bad! Rayman has had to beat back the creatures of Bubble Dreamer s nightmares before, and that s what he, Globox, and the crafty Teensy casters are going to do again before the fabric of the Glade falls to pieces and their entire world fades like a bad dream.\n\nRayman Origins brings back many of the classic characters, revived in their original 2D form, as well as a whole new world of characters and environments. Discover the roots of Rayman by collecting pieces of the Glade s history, and assemble them to reveal the truth behind Rayman s origins. For whimsical action-packed platformer fun in colorful 2D there is no better place than this magical world, and you can now visit it alone or with up to three friends in co-op mode!\n","torrent":{"xt":"urn:btih:cc7c181aa447188e24068e91ca26f346261d7511","amp;dn":"Rayman+Origins+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc7c181aa447188e24068e91ca26f346261d7511","infoHashBuffer":{"type":"Buffer","data":[204,124,24,26,164,71,24,142,36,6,142,145,202,38,243,70,38,29,117,17]},"announce":[],"urlList":[]}}