{"title":"Sherlock Series 1, 2, &amp; 3 + Extras BDRip TSV","uid":9471258,"size":12498052635,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cd299f2f3a91e1ca5d3f6dca8e676e1cf24b8a07&amp;dn=Sherlock+Series+1%2C+2%2C+%26amp%3B+3+%2B+Extras+BDRip+TSV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":10,"uploader":"TSV","files":-1,"time":1389580985,"description":"All episodes from all 3 seasons BDRip + Extras. All files were 1080p/bluray and have been converted to 1100MB MKV's 720x406 h264 5.1 surround sound.\nAll episodes are 90 minutes long.\n\n\n\nSherlock is a British television crime drama that presents a contemporary adaptation of Sir Arthur Conan Doyle's Sherlock Holmes detective stories. Created by Steven Moffat and Mark Gatiss, it stars Benedict Cumberbatch as Sherlock Holmes and Martin Freeman as Doctor John Watson. Nine episodes have been produced, the first three of which aired in 2010. Series two aired in 2012, and a third series started to air in 2014. The show's executive producer Steven Moffat, has announced that a fourth series has been commissioned, with scripts being planned. The series has been sold to over 200 territories.\n\nThe show was conceived by Moffat and Gatiss during train journeys to and from the Doctor Who production base in Cardiff, where they were both writers. They aspired to produce a modern-day version of Conan Doyle's stories in which Holmes uses the technologies that are available to him today in order to help him solve crimes. Credited as co-creators, Moffat and Gatiss each write one episode per series, with the other written by Stephen Thompson. Hartswood Films produced the series for the BBC and co-produced it with WGBH Boston for its Masterpiece anthology series. The series is primarily filmed in Cardiff, although the production also uses a variety of other locations. North Gower Street in London was used for exterior shots of Holmes and Watson's 221B Baker Street residence.\n\nSherlock depicts &quot;consulting detective&quot; Holmes, assisting the Metropolitan Police Service, primarily Detective Inspector Greg Lestrade (Rupert Graves), in solving various crimes. Holmes is assisted by his flatmate, Dr John Watson, who has returned from military service in Afghanistan. Although the series depicts a variety of crimes and perpetrators, Holmes' conflict with his archnemesis Jim Moriarty (Andrew Scott) is a recurring feature. Pathologist Molly Hooper (Louise Brealey) assists Holmes in her laboratory. Other recurring roles include Una Stubbs as Mrs. Hudson, Holmes and Watson's landlady; and co-creator Mark Gatiss as Sherlock's brother, Mycroft Holmes.\n\nAfter an unaired pilot in 2009, the first series of three 90-minute episodes was transmitted on BBC One and BBC HD in 2010, with a second series of three episodes first broadcast in 2012. Critical reception was extremely positive, with many reviews commending the quality of the writing, performances and direction. Sherlock has been nominated for numerous awards, including BAFTAs and Emmys, winning several across a variety of categories. The first two series have been released on DVD and Blu-ray, alongside tie-in editions of some of Conan Doyle's original books. Soundtrack albums from series one and two have also been released.\n\n\nPlease seed at a decent speed.\n\n\nEnjoy,\n\n\n\nTSV.","torrent":{"xt":"urn:btih:cd299f2f3a91e1ca5d3f6dca8e676e1cf24b8a07","amp;dn":"Sherlock+Series+1%2C+2%2C+%26amp%3B+3+%2B+Extras+BDRip+TSV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd299f2f3a91e1ca5d3f6dca8e676e1cf24b8a07","infoHashBuffer":{"type":"Buffer","data":[205,41,159,47,58,145,225,202,93,63,109,202,142,103,110,28,242,75,138,7]},"announce":[],"urlList":[]}}