{"title":"Deciphering Sun Tzu: How to Read The Art of War (2014) pdf","uid":11740810,"size":1124968,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd3dc7a1f20d5608868ebfda449eb9be470e11b0&amp;dn=Deciphering+Sun+Tzu%3A+How+to+Read+The+Art+of+War+%282014%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":0,"uploader":"bookzilla","files":1,"time":1425814209,"description":"As the People's Republic's seemingly inexorable rise to economic and military power continues, never has the need for a better grasp of Chinese strategic thought by the West been more acute. In Deciphering Sun Tzu, Derek Yuen seeks to reclaim for the reader the hidden contours and lost Chinese and Taoist contexts of Sun Tzu's renowned treatise The Art of War, a literary classic and arguably one of the most influential books ever written. He also explains its historical, philosophical, strategic, and cross-cultural significance. His comprehensive analysis of Sun Tzu, based on a close reading of the Chinese sources, also reconstructs the philosophy, Taoist methodology and worldview that effectively form the cornerstones of Chinese strategic thinking, which are arguably as relevant today as at any moment in history. Yuen's innovative reading and analysis of Sun Tzu within and from a Chinese context is a new way of approaching the strategic master's main concepts, which he compares with those of Clausewitz, Liddell-Hart and other Western strategists. Deciphering Sun Tzu offers illuminating analysis and contextualisation of The Art of War in a manner that has long been sought by Western readers and opens new means of getting to grips with Chinese strategic thought","torrent":{"xt":"urn:btih:cd3dc7a1f20d5608868ebfda449eb9be470e11b0","amp;dn":"Deciphering+Sun+Tzu%3A+How+to+Read+The+Art+of+War+%282014%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd3dc7a1f20d5608868ebfda449eb9be470e11b0","infoHashBuffer":{"type":"Buffer","data":[205,61,199,161,242,13,86,8,134,142,191,218,68,158,185,190,71,14,17,176]},"announce":[],"urlList":[]}}