{"title":"Getting started in Electronics [Forrest M. Mims] [PDF]","uid":8944135,"size":13191432,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd5f709cb5e0331af38e4460f07b5b850f368005&amp;dn=Getting+started+in+Electronics+%5BForrest+M.+Mims%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":0,"uploader":"diypromo","files":1,"time":1379732215,"description":"Getting started in Electronics [PDF]\n\nBy Forrest M. Mims\n\n\nThe book was developed during a 58-day marathon session of laying out the book and then drawing/printing the pages with a 0.7 mm mechanical pencil. It was then necessary to develop and test each of the 100 circuits. Each circuit was built and tested at least three times to avoid errors. The final round of tests was done directly from the hand-lettered text. The problem with the final testing was that many of the circuits could be built from memory without referring to the circuit diagrams in the book. This, of course, could have allowed errors to slip through. So it was necessary to check off each connection to make sure the book version was correctly reassembled from scratch.\n\nThis was the first Radio Shack book that was entirely hand-lettered. Dave Gunzel, then Radio Shack's technical editor, decided it was time for a fully hand-lettered book, and I was glad to oblige. &quot;Engineer's Notebook,&quot; which preceded &quot;Getting Started in Electronics,&quot; was introduced with several typed pages before full hand lettering was begun. It was Dave's idea to introduce these books, which eventually led to the &quot;Engineer's Mini-Notebook&quot; series. Dave used to witness science entries in my hand-lettered lab notebooks, and those notebooks triggered his idea for me to do the hand-lettered books.","torrent":{"xt":"urn:btih:cd5f709cb5e0331af38e4460f07b5b850f368005","amp;dn":"Getting+started+in+Electronics+%5BForrest+M.+Mims%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd5f709cb5e0331af38e4460f07b5b850f368005","infoHashBuffer":{"type":"Buffer","data":[205,95,112,156,181,224,51,26,243,142,68,96,240,123,91,133,15,54,128,5]},"announce":[],"urlList":[]}}