{"title":"Portable Microsoft Visual FoxPro 9 SP2","uid":6620700,"size":82678154,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cd88b5c245457ebebab9d8b7cb6b3ca91e0ceaec&amp;dn=Portable+Microsoft+Visual+FoxPro+9+SP2+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"mrizzo2","files":-1,"time":1313982446,"description":"As a former software developer who made a nice living with FoxPro\n2.5 application development (accounting systems and inventory control\nsystems along with Point of Sale systems in addition to several other\nvertical market applications too) I can tell you this piece of software\nwas a goldmine for those with an understanding of the needs of users \nand the willingness to provide the features and functionality required\nto make the best use of it as a tool in the service of humankind.\nI had a number of well known companies using my software and development \nexpertise in Canada, USA and the United Kingdom especially.\n\nIt is still a great help to us today, we use it to maintain email lists\nand to create them for Outlook 2000 etc, and I'm planning to write an \nAccounting application again soon to post here for you as a free download\nequally!\n\n\nBill Gates should give this away too \n(along with placing XP into the public domain)!\n\nIf you need to try the different versions for ease of development and\nuse generally speaking here is a portable version of visual Foxpro version\n9 as found on the net posted by - Birungueta - although we also have \nversions 2.5 and 2.6 available on a separate download for you to perhaps\nsettle for instead too.\n\n\nMichael Rizzo Chessman","torrent":{"xt":"urn:btih:cd88b5c245457ebebab9d8b7cb6b3ca91e0ceaec","amp;dn":"Portable+Microsoft+Visual+FoxPro+9+SP2+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd88b5c245457ebebab9d8b7cb6b3ca91e0ceaec","infoHashBuffer":{"type":"Buffer","data":[205,136,181,194,69,69,126,190,186,185,216,183,203,107,60,169,30,12,234,236]},"announce":[],"urlList":[]}}