{"title":"PESEdit.com 2011 Patch 4.0 + 4.0.1 - The New Season","uid":6600736,"size":1813471169,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cd9da1aff4c3746d71fa5cbd7f0afbd837589fa1&amp;dn=PESEdit.com+2011+Patch+4.0+%2B+4.0.1+-+The+New+Season&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":2,"uploader":"aufhauzer","files":4,"time":1313194292,"description":"New Features:\n\n    Balls: Torfabrik + CL Finale Munich\n    Boots: adidas adiPower Predator White-Blue, Nike MV Superfly III Orange, Puma v1.11 Green\n    Faces: Lots of new faceserver faces (in total more than 2850 faces!)\n    Kits: Aachen, Aston Villa, Atalanta, Atletico, Athletic, Aue, Augsburg, Barcelona, Belgium, Benfica, Birmingham, Bochum, Braunschweig, Bremen, Brest, Brugge, Celta, Cesena, Chivas Guadalajara, Cottbus, CSKA Sofia, Derby, Dijon, Dnipro, Dortmund, Dresden, Ecuador, Espanyol, Evian, Fiorentina, Eintracht Frankfurt, Freiburg, Espanyol, FSV Frankfurt, Freiburg, Galatasaray, Genoa, Granada, Hamburg, Hertha BSC, Hoffenheim, Ingolstadt, Inter, Karlsruhe, KÃƒÂ¶ln, Lecce, Leeds, Lens, Leverkusen, Levski, Lorient, Manchester United, 1860 MÃƒÂ¼nchen, Napoli, Novara, Palermo, Paris, Porto, Qatar, QPR, Racing, Reading, Recreativo, Roma, Siena, Sporting, Steaua, Swansea, Tottenham, Rostock, Valencia, Valladolid, Villarreal, Young Boys\n    Other: updated a few national teams (England, Germany, Italy, Spain); updated lots of lineups for club teams\n    Transfers: Up-to-date until 11/08/11 for nearly all teams\n\n\nNote: Remember to use the switch before starting a master league or become a legend career. Read and follow the instructions and information here before posting questions.\n\nGeneral Features:\n\n    7 Big Leagues (Bundesliga, Premier League, Ligue 1, Eredivisie, Serie A, Primera DivisiÃƒÂ³n, Russian Premier League) Completed including correct squads, kits, lineups, logos, map locations; All players with correct stats, appearence and boots\n    5 2nd divisions to choose from in the selector (2. Bundesliga, Npower Championship, Segunda DivisiÃƒÂ³n, Serie B &amp; Ligue 2)\n    Other newly added teams are\n        All missing Champions &amp; Europa league teams\n        Fluminense, Gremio &amp; Santos\n        Standard de LiÃƒÂ¨ge, Trabzonspor, Austria Vienna, FC ZÃƒÂ¼rich, FC Dnipro, Dynamo Moscow, Lokomotiv Moscow, CD Nacional, Sturm Graz, SC VitÃƒÂ³ria, Wisla Krakow, Legia Warszawa, Luzern, Kayserispor\n        Albania, Belarus, Estonia, Georgia, Lithuania, Macedonia\n        Braunschweig, Dresden, Rostock\n    Correct squads, player names &amp; kits for all national teams in the game\n    New stadiums to choose from in the selector (Imtech Arena, Moses Mabhida Stadium, PESEDIT Stadium, SchÃƒÂ¼co Arena)\n    New adboards\n    Latest boots + assigned to correct players\n    New edit mode hairstyles\n    New faces (more than 2500 in faceserver!!!)\n    New kits (most 11/12 kits already included!)\n    New menus (30 custom menu pics, 2 default Messi themes)\n    New music (list below)\n    New referee kits\n    New scoreboards (more than 20 scoreboards selectable in PESEDIT Selector)\n\nExact features of each patch version can be found in the Readme.pdf.\n\nInstallation:\n\n    Delete the folder \\&quot;kitserver\\&quot; from the PES 2011 main directory and also delete the start menu folder \\&quot;PESEdit.com 2011 Patch\\&quot; - skip this if this is the first time you install PESEdit.com 2011 Patch.\n    Install the patch using install.exe, make sure to choose the directory you installed PES 2011 to.\n    Start the game via pes2011.exe / start menu folder \\&quot;PESEdit.com 2011 Patch\\&quot; / PESEDIT SELECTOR\n\n\n\n\n","torrent":{"xt":"urn:btih:cd9da1aff4c3746d71fa5cbd7f0afbd837589fa1","amp;dn":"PESEdit.com+2011+Patch+4.0+%2B+4.0.1+-+The+New+Season","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd9da1aff4c3746d71fa5cbd7f0afbd837589fa1","infoHashBuffer":{"type":"Buffer","data":[205,157,161,175,244,195,116,109,113,250,92,189,127,10,251,216,55,88,159,161]},"announce":[],"urlList":[]}}