{"title":"Ana Brett &amp; Ravi Singh - Kundalini Yoga 14 DVD's-set","uid":8839917,"size":9258842190,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cdcfd5b0ab4114ff81fe148468545a33632eab6f&amp;dn=Ana+Brett+%26amp%3B+Ravi+Singh+-+Kundalini+Yoga+14+DVD%27s-set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":6,"uploader":"acer47x","files":14,"time":1377215587,"description":"Change Your Life! Kundalini Yoga is the all-in-one inner/outer fitness system which will help you get everything covered, on every level, every day, in every way! This complete full body toning workout also focuses on an in-depth repatterning of the nervous system and emotions for new energy, new insights, and personal breakthroughs you may have never thought possible! In this inspiring DVD workout, Ana &amp; Ravi take you to a new level of fitness and self-growth. Included are an in-depth Kundalini Yoga workout, as well as two profound sets and a meditation to purify your past and liberate you from old habits and feelings which dont contribute to your fulfillment. As in all the Ana &amp; Ravi DVDs, super inspiring music will enhance your workout. Kundalini Yoga is the perfect practice to help you live long, look amazing, seize the day and prosper! Featuring the Matrix Menu option and Pre-Sets to help you get it all covered in the time you have. Also included: Bonus Material and the Born Free set which will truly take you on a journey from the mundane to the miraculous!\nit contains KY warm-ups, Two Transformer Sets, a very powerful set called Born Free, Deep Relaxation, a Beautiful Gobinday Chant and then a surprise - a more powerful yet Purify Your Past Set.\nThe warm-ups include traditional exercises we learned in other Ana and Ravis DVDs - stomach grinds, spinal flexes, twists, rag doll, etc - all very pleasant.\nThe Transformer 1 and Transformer 2 sets include exercise that work both emotional and physical, some are done standing, some sitting, some lying down - movements include second position plie squats with arm and breath movements (modifications are offered), navel center exercises (leg lifts and a modification of a stretch pose), etc. I really like the commentary - Ana and Ravi explain how these movements work on both physical and emotional levels.\nDVD 1\nKundalini Yoga - Transform Your Body, Feed Your Soul Workout\nKundalini Yoga Meditation for Beginners &amp; Beyond\nKundalini Yoga Solar Power\nKundalini Yoga for Energy &amp; Super Radiance!\nKundalini Yoga Ultimate Stretch Yoga Workout\nKundalini Yoga Quick Fixes\nKundalini Yoga Warrior Workout\nDVD 2\nFat Free Yoga - Lose Weight &amp; Feel Great\nKundalini Yoga for Beginners &amp; Beyond\nDance the Chakras Yoga Workout\nAM/PM Yoga - Start &amp; End Your Day in a Great Way\nKundalini Yoga Navel Power\nYoga House Call\nYoga Beauty Body\n\n\n\nAVI | XviD 655kbps | 640 x 480 29.97fps | MP3 128kbps","torrent":{"xt":"urn:btih:cdcfd5b0ab4114ff81fe148468545a33632eab6f","amp;dn":"Ana+Brett+%26amp%3B+Ravi+Singh+-+Kundalini+Yoga+14+DVD%27s-set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdcfd5b0ab4114ff81fe148468545a33632eab6f","infoHashBuffer":{"type":"Buffer","data":[205,207,213,176,171,65,20,255,129,254,20,132,104,84,90,51,99,46,171,111]},"announce":[],"urlList":[]}}