{"title":"BangBus - Evie Olson (Colombian Hottie ditches friend for road d","uid":15872614,"size":679743771,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:cdd4761ac053745ff8bb3374d927c238c9f77755&amp;dn=BangBus+-+Evie+Olson+%28Colombian+Hottie+ditches+friend+for+road+d&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":7,"uploader":"xxxlavalxxx","files":2,"time":1474454742,"description":"We are at it again, This week we found a pair of unwitting girls outside the coffee shop. We were just coming in for some cafesito and we saw them walking in the parking lot. We stopped them and told them we were producers for an up and coming show coming out on Tv and we needed girls to read from a script. One girl she told me her name was Evie was all for it, but her other friend Talia was suspicious (and rightly so.) So we knew the key to getting in the van was to convince Talia to get in. One we got them in the bus though it was easy. They were ready to go topless and asses in the air for 100 each! Then we almost lost them when I asked them to touch my boys dick. Talia drew the line and abandoned her friend Evie (who ditches their friend in a bus full of dudes?) But we found that once Talia had left Evie was more willing and she turned out to love her some dick. She wanted to get fucked and we gave her what she was looking for. It was fun ditching her on the side of the road. She should of listened to her friend.\r\nTags:Amateur, Big Ass, Big Booty, Big Cock, Blowjob, Brunette, Cow Girl, Cum-in-mouth, Cumshot, Doggystyle, Hardcore, Latina, Missionary, Swallow, Tattoos, Vaginal, Young\r\n \nhttp://imgdone.com/viewer.php?file=33768934692785186178.jpg\r\n \nhttp://imgdone.com/viewer.php?file=20753661280393041075.jpg","torrent":{"xt":"urn:btih:cdd4761ac053745ff8bb3374d927c238c9f77755","amp;dn":"BangBus+-+Evie+Olson+%28Colombian+Hottie+ditches+friend+for+road+d","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdd4761ac053745ff8bb3374d927c238c9f77755","infoHashBuffer":{"type":"Buffer","data":[205,212,118,26,192,83,116,95,248,187,51,116,217,39,194,56,201,247,119,85]},"announce":[],"urlList":[]}}