{"title":"Professional C# 5.0 and .NET 4.5.1 [PDF] [StormRG]","uid":9822667,"size":21694746,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cdde65b4661d2b36064406d2756f3641f880897f&amp;dn=Professional+C%23+5.0+and+.NET+4.5.1+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":2,"uploader":"steelballz","files":-1,"time":1395717852,"description":"Description\nProfessional C# 5.0 and .NET 4.5.1 \nAuthor:Nagel, Christian, Glynn, Jay, Skinner, Morgan\nPublished: Feb. 24 2014\nPublisher:Wrox \nISBN-10:1118833031\nISBN-13:9781118833032\nASIN:B00IKGFANS\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple \nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nComprehensive, advanced coverage of C# 5.0 and .NET 4.5.1\n\nWhether you're a C# guru or transitioning from C/C++, staying up to date is critical to your success. Professional C# 5.0 and .NET 4.5.1 is your go-to guide for navigating the programming environment for the Windows platform. After a quick refresher of the C# basics, the team of expert authors dives in to C# 5.0 and updates for NET 4.5.1. Includes:\n\nDifferent behaviors for .NET 4.5.1 and the changes to Visual Studio 2013\nChanges to ASP.NET Core, Web Forms, MVC, and Web API\nUpdated Windows 8 deployments and localization, event logs, and data flow\nShuffling of ADO.NET Entity Framework\nAdditions to Windows Workflow Foundation\nNew Windows Runtime 2.0 updates\n\nFrom the Back Cover\n\nSharpen your C# skills with this essential resource\n\nWritten by a dream team of .NET experts, Professional C# 5.0 and .NET 4.5.1 includes everything developers need to work with C#, the language of choice for .NET applications. This book is perfect for both experienced C# programmers looking to sharpen their skills and professional developers who are using C# for the first time. The authors deliver unparalleled coverage of Visual Studio 2013 and .NET Framework 4.5.1 additions, as well as new test-driven development and concurrent programming features. Source code for all the examples are available for download, so you can start writing Windows desktop, Windows Store apps, and ASP.NET web applications immediately.\n\nProfessional C# 5.0 and .NET 4.5.1\n\nCovers the major updates and improvements in Visual Studio 2013, including a new explanation of how C# developers will interact with VS\nProvides everything the professional developer needs to know about C# and putting it to work\nExplores the updates for .NET 4.5.1 GC, the new UI for Visual Studio 2013, and Windows Store apps for Windows 8.1\nFeatures helpful examples and hands-on code, as well as resourceful ways to handle common problems\n\nWrox Professional guides are planned and written by working programmers to meet the real-world needs of programmers, developers, and IT professionals. Focused and relevant, they address the issues technology professionals face every day. They provide examples, practical solutions, and expert education in new technologies, all designed to help programmers do a better job.\n\nProgrammer Forums\n\nJoin our Programmer to Programmer forums to ask and answer programming questions about this book, join discussions on the hottest topics in the industry, and connect with fellow programmers from around the world.\n\nCode Downloads\n\nTake advantage of free code samples from this book, as well as code samples from hundreds of other books, all ready to use.\n\nRead More\n\nFind articles, e-books, sample chapters, and tables of contents for hundreds of books, and more reference resources on programming topics that matter to you.\nAbout the Author\n\nChristian Nagel is software architect with more than 20 years of development experience. He is a Microsoft Certified Trainer, Professional Developer, and Microsoft MVP for Visual C#.\n\nJay Glynn started writing software more than 20 years ago. He currently works for VGT as a software engineer writing server-based software.\n\nMorgan Skinner has programmed in C# and .NET since 2000; he joined Microsoft in 2001. \n\n\n\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:cdde65b4661d2b36064406d2756f3641f880897f","amp;dn":"Professional+C%23+5.0+and+.NET+4.5.1+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdde65b4661d2b36064406d2756f3641f880897f","infoHashBuffer":{"type":"Buffer","data":[205,222,101,180,102,29,43,54,6,68,6,210,117,111,54,65,248,128,137,127]},"announce":[],"urlList":[]}}