{"title":"Family Guy - Season 6 - Complete","uid":4179824,"size":2564658324,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ce756f9a9db49d99f3e45e97c7b2417272b63a36&amp;dn=Family+Guy+-+Season+6+-+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":3,"uploader":"grex86","files":-1,"time":1210343919,"description":"Season 6: 2007-2008\n\nFOX celebrated the 100th episode as &quot;Stewie Kills Lois&quot;. The differing episode for the 100th show can be explained by their not including the three episodes making up the DVD movie in their count, and by counting the hour-long season premiere Blue Harvest as two episodes.\n\n1 \t99 \t&quot;Blue Harvest&quot;  \tSeptember 23, 2007 \t5ACX16 5ACX22\nIn this hour-long special episode of Family Guy, Peter retells the story of Star Wars Episode IV: A New Hope from his own point of view to keep his family entertained when the power goes out throughout their home (several Family Guy characters are recast into roles from the film). \n\n2 \t100 \t&quot;Movin&amp;#039; Out (Brian&amp;#039;s Song)&quot;  \tSeptember 30, 2007 \t5ACX14\nPeter convinces Brian to move in with his girlfriend Jillian even though he&amp;#039;s been feeling smothered by her, and things take a turn for the worse when Stewie tries to sabotage their relationship. Meanwhile, Meg and Chris get jobs at the convenience store, where Chris befriends the manager. \n\n3 \t101 \t&quot;Believe It or Not, Joe&amp;#039;s Walking on Air&quot;  \tOctober 7, 2007 \t5ACX15\nJoe, feeling uncomfortable with his disability, regains his ability to walk after a leg transplant. He decides to play extreme sports and spends most of his time with more athletic people, forsaking Peter, Quagmire, Cleveland and even his wife Bonnie, all of whom set out to re-cripple him to bring him back to Earth. \n\n4 \t102 \t&quot;Stewie Kills Lois (1)&quot;  \tNovember 4, 2007 \t5ACX17\nStewie becomes angry with Lois after she leaves him behind on a private cruise with Peter, and appears to murder her out of revenge. However, everyone is led to believe that her death was an accident--until suspicion falls on Peter after he reveals he recently took out a life insurance policy on his wife. \n\n5 \t103 \t&quot;Lois Kills Stewie (2)&quot;  \tNovember 11, 2007 \t5ACX18\nReturning from her presumed death, Lois reveals her attempted killer to be Stewie. Stewie then takes his family hostage and goes on the lam, heading towards the CIA Headquarters where he gains complete control. Desperate to put an end to Stewie&amp;#039;s reign of terror, Lois realizes what she must do... \n\n6 \t104 \t&quot;Padre de Familia&quot;  \tNovember 18, 2007 \t5ACX20\nPeter takes so much pride in being an American citizen that he starts an anti-immigrant campaign in town--until he discovers that he himself is actually an illegal immigrant born in Mexico. Unable to prove or obtain his citizenship, he loses his job and must work at his father-in-law Carter&amp;#039;s estate as a servant. \n\n7 \t105 \t&quot;Peter&amp;#039;s Daughter&quot;  \tNovember 25, 2007 \t5ACX21\nAfter recovering from a coma, Meg finds herself interested in a med student who treats her at the hospital. Peter, however, who has grown protective of her during her stasis, feels very uncomfortable with her new boyfriend. Meanwhile, Brian and Stewie buy and plan to renovate a dilapidated house. \n\n8 \t106 \t&quot;McStroke&quot;  \tJanuary 13, 2008 \t5ACX19\nPeter accepts an offer of unlimited burgers at a local fast food restaurant, though he suffers a stroke after eating too many. After recovering, Peter strives to expose the evils of the company with the help of a talking cow. Meanwhile, Stewie tries to become the most popular boy at James Woods High School. \n\n9 \t107 \t&quot;Back to the Woods&quot;  \tFebruary 17, 2008 \t6ACX02\nJames Woods returns to Quahog to seek revenge against Peter by stealing his identity after finding his wallet. Peter is left with nothing, but neither he nor his family are willing to let James get away with this, and Peter counters by ruining the actor&amp;#039;s career and public image. \n\n10 \t108 \t&quot;Play it Again, Brian&quot;  \tMarch 2, 2008 \t6ACX01\nFeeling their marriage has hit a snag, Peter and Lois take Brian&amp;#039;s offer to go with him for a relaxing vacation at Martha&amp;#039;s Vineyard. However, as Peter gets drunk, Brian ends up spending more time with Lois and even tries to have sex with her. Meanwhile, Herbert babysits Meg, Chris and Stewie back home. \n\n11 \t109 \t&quot;The Former Life of Brian&quot;  \tApril 27, 2008 \t6ACX04\nBrian discovers that he is the legitimate father of an old flame&amp;#039;s unruly son, who is dropped off at the Griffins&amp;#039; house so Brian can raise him. After the two warm up to each other, Brian manages to turn the boy&amp;#039;s life in the right direction, though he himself becomes a bit self-centered. \n\n12 \t110 \t&quot;Long John Peter&quot;  \tMay 4, 2008 \t6ACX06\nChris falls hopelessly in love with a beautiful vet intern and turns to Peter for advice on dating, but not before Peter takes a parrot from the vet and terrorizes the town under the belief he is a pirate. When his advice ends up driving the intern away, Peter decides to hook Chris up with another girl. \n\n-----------------------------------------------\n\nADDONS: &quot;The Family Guy 100th Episode Special&quot;\n\nThis special celebrates the side-splitting irreverent humor of the animated series Family Guy by taking a look back at some of the funniest moments, satirical spoofs and music numbers of the past 100 episodes and features interviews hosted by Seth MacFarlane.\n\n-----------------\n[from WikiPedia - http://en.wikipedia.org/wiki/List_of_Family_Guy_episodes]\nthank&amp;#039;s to TPB; LOL; XOR; FOX and Seth MacFarlane...\n\n\ncollected by grex\t\t\n","torrent":{"xt":"urn:btih:ce756f9a9db49d99f3e45e97c7b2417272b63a36","amp;dn":"Family+Guy+-+Season+6+-+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce756f9a9db49d99f3e45e97c7b2417272b63a36","infoHashBuffer":{"type":"Buffer","data":[206,117,111,154,157,180,157,153,243,228,94,151,199,178,65,114,114,182,58,54]},"announce":[],"urlList":[]}}