{"title":"The Art of LEGO Design","uid":15918134,"size":451851315,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce878c85307e56e2297b70989d9ecd7cb1dae392&amp;dn=The+Art+of+LEGO+Design&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":13,"uploader":null,"files":3,"time":1475221945,"description":"http://ititli.com/images/XrDawzpSG.jpg\r\n\r\nThe most impressive LEGO models often take careful planning (and lots of pieces), but with some inspiration, a little imagination, and a number of tried-and-true techniques, you too can turn bricks into a masterpiece.\r\n\r\nIn The Art of LEGO® Design, author Jordan Schwartz explores LEGO as an artistic medium. This wide-ranging collection of creative techniques will help you craft your own amazing models as you learn to see the world through the eyes of some of the greatest LEGO builders. Each concept is presented with a collection of impressive models to spark your imagination, like fantastic dragons, futuristic spaceships, expressive characters, and elaborate dioramas. You’ll discover some of the inventive techniques that LEGO artists use to:\r\n\r\n    Create lifelike creatures from unusual elements like inside-out tires and minifigure capes\r\n    Design sleek cars without showing a single stud\r\n    Add ambience to dioramas with light bricks or LEDs\r\n    Craft eye-catching textures to create cobblestone roads and brick walls\r\n    Build sturdy, detailed, posable mechs and other figures\r\n    Add depth with forced perspective and interesting silhouettes\r\n\r\nInterviews with the talented builders behind many of the book’s models reveal their thoughts on the design process and what inspires them most. Even if you’ve been building with LEGO since you could crawl, you’ll find new inspiration in The Art of LEGO Design.\r\n\r\nThe Art of LEGO Design: Creative Ways to Build Amazing Models by Jordan Schwartz\r\nEnglish | 2014 | 288 Pages | ISBN: 1593275536 | PDF/EPUB/MOBI | 69 MB/125 MB/236 MB","torrent":{"xt":"urn:btih:ce878c85307e56e2297b70989d9ecd7cb1dae392","amp;dn":"The+Art+of+LEGO+Design","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce878c85307e56e2297b70989d9ecd7cb1dae392","infoHashBuffer":{"type":"Buffer","data":[206,135,140,133,48,126,86,226,41,123,112,152,157,158,205,124,177,218,227,146]},"announce":[],"urlList":[]}}