{"title":"Infernal Restraints--Entranced Part 2  Harley Ace High Fix","uid":15847524,"size":2269372060,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:cf01070603ffc4f166910f8fbd041ba178244281&amp;dn=Infernal+Restraints--Entranced+Part+2++Harley+Ace+High+Fix&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":5,"uploader":"merzedes","files":1,"time":1474121085,"description":"Note: Previous torrent was deleted since file was duplicate of Part 1, not IR part 2.\r\n\r\nShallow2.\r\n\r\n\r\n\r\nEntranced Part 2 | Harley Ace\r\n\r\nSeptember 16, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nTherapist Brings Patient's Kinky Dreams to Life \r\n\r\nIn the first half of this installment, Harley Ace found her way to the office of therapist O.T. in order to help her sort out the violent and sexual dreams she had been having for many years. He proposed an unorthodox treatment wherein he would hypnotize her and, while she was under, work through the tangle of fears and desires she had in her head. Once Harley was under his spell, however, O.T. started abusing his power to live out some of his own sick twisted fantasies. Now we return to the two of them, still in the midst of immersion therapy.\r\n\r\nWe find Harley sat up on the couch, her legs spread by shackles at her ankles, and her neck and head held tightly in place by a metal collar. O.T. has decided to ramp up the intensity of his treatment for the second half of their session together. He brings out his knife and starts trailing its blade all over her soft, exposed body. It's easy to see the fear behind Harley's eyes as she watches him drag it across her skin, and when he rubs the flat side against her clit her body visibly tenses up. She shakes as she tries to hold her body perfectly still so as not to end up getting accidentally cut. \r\n\r\nShaking and whimpering is all well and good, but when O.T. takes out the flogger and starts beating Harley's face and tits with it, all of the tension she's built up breaks into a thousand pieces and she is sobbing and screaming. It only gets louder when O.T. takes out his cattle prod. It's not even close to her by the time she is screaming &quot;no&quot; and trying to pull away from its electrified tips. She'll be alright though. The good doctor knows that the best way to calm her panic is with a hitachi vibrator and a metal pussy hook. \r\n \r\nScreens \nhttp://www.infernalrestraints.com/device/bondage/trailer.php?y=2016&amp;p=09_16hace3&amp;u=InfernalRestraints-Harley-Ace-Entranced-Part-2\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:cf01070603ffc4f166910f8fbd041ba178244281","amp;dn":"Infernal+Restraints--Entranced+Part+2++Harley+Ace+High+Fix","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf01070603ffc4f166910f8fbd041ba178244281","infoHashBuffer":{"type":"Buffer","data":[207,1,7,6,3,255,196,241,102,145,15,143,189,4,27,161,120,36,66,129]},"announce":[],"urlList":[]}}