{"title":"Microprose Magic the Gathering 2010 Custom Installer ISO","uid":5428468,"size":646238208,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cf53f5baf125e8ba140ca7feedce7b09f385af62&amp;dn=Microprose+Magic+the+Gathering+2010+Custom+Installer+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"Huggybaby","files":-1,"time":1268329754,"description":"Microprose Magic the Gathering 2010 Custom Installer ISO (Windows XP, Vista, 7, x32 and x64) \n\nMagic the Gathering 2009 Edition (Updated March 2010)\nA custom installer for Sid Meier's classic\nMagic: The Gathering, Duels of the Planeswalkers, Spells of the Ancients\nPublished by Microprose\n\nBrought to you by Hip63 and the CCGHQ Team at http://www.slightlymagic.net/forum\n\n========================================================\nUPDATE Get the latest CardArtNew here: http://www.slightlymagic.net/forum/viewtopic.php?f=2&amp;t=2349\n========================================================\n\nBEFORE:\n\nInstall Magic: The Gathering, Duels of the Planeswalkers.\nInstall Spells of the Ancients.\nTry getting it to run with compatibility mode, which never reliably worked.\nSee your wizard move too fast in Shandalar. See missing cards in your deckbuilder.\nSee invisible text in game dialogues.\nSpend hours and hours googling for solutions, and following dead links.\nFinally, if you still had the time, motivation, knowledge and hard drive space,\ngive up and install a virtual machine, then Windows 95 or 98, then DOTP and SOTA all over again.\nBe stuck with a limited selection of cards.\n\n\nTODAY:\n\nAll those hassles have been obliterated with:\n\n===========================================================\n          M A G I C :   T H E   G A T H E R I N G\n  &quot; D U E L S   O F   T H E   P L A N E S W A L K E R S &quot;\n             - - - 2 0 0 9   E D I T I O N - - -\n===========================================================\n\nThis is an updated installer for MAGIC: THE GATHERING\n&quot;Duels of the Planeswalkers/Spells of the Ancients&quot;.\n\nIt has been modified to install and play on new operating systems\nsuch as Windows XP, Windows Vista and Windows 7.\n\nIt has been tested with both 32-bit and 64-bit versions.\n\nIt runs in a screen resolution of 1024 x 768.\n\nThis version includes Mok's Manalink 2.01 unofficial updates,\nSmiling Spectre's Application Compatibility Fix to\ncorrect graphics issues, and hundreds of new cards added by\nthe Magic The Gathering Community, released as of early March 2009!\n\n\nThe CD-Rom Features:\n====================\nA professional grade installer that allows the user full control of the installation.\n\nA reworked Autorun Menu featuring an animated splash screen and original CD artwork and sounds.\n\nA new Tutorial Viewer. (Sorry, it's not interactive anymore, but all the info is still there.)\n\nAll the original manuals as PDF files. These are available from the program menu and the Tutorial Viewer as well.\n\n\nThe Installer Features:\n=======================\nInstaller presentation with slide show and music from the original installer.\n\nAll the original registry entries are created by the installer.\n\nThe full game is installed already patched with manalink 2.01 plus\nall the latest community card packs. \n\nA new Magic the Gathering Launcher Application that allows for starting the\nDeck Builder, Magic or Shandalar, and Character Generator directly from the Launcher.\nThe Manuals can also be viewed from the Launcher.\n\nHowever, the BIG feature of the new installer is the fact that it automatically installs\nSmiling Spectre's ACT Fix WITHOUT having to use the Application Compatibility Toolkit.\n\nAnd everything still fits on a single CD-Rom disc too!\n\n\nINSTRUCTIONS\n============\nThe ISO image can be burned to disc with any CD burning program.\nAlternately, you can mount the image in a virtual drive such as DAEMON TOOLS, \nSlysoft.com's Virtual Clone Drive, MagicDisk from MagicISO.com, etc.\n\nIf the installer doesn't begin, navigate to the CD and run autorun.exe.\nAfter that it is just a simple install process (that will look VERY familiar) ;)\n\n* - Your OS should be installed on your C drive. \n\n* - Do NOT Install to a long folder path!\nThe Application Fix does not work with long folder paths!\n\nEXAMPLES:\n---------\nC:Program FilesMagicTG\t     -GOOD! \n\nC:Program FilesMagic the Gathering -BAD! Will have issues\n\nAfter installing, the Install window will pop up again.\nYou can install the tutorial viewer at this time.\nIf you don't want to do that, then close the window.\n\n* - Be sure to update the CardArtNew images. See CardArtNew Instructions.txt.\n\nLaunch the game from the Magic TG Launcher shortcut on your desktop or\nthe shortcut in the Programs menu.\n\n* - The Launcher minimizes to the system tray, and you can have more than one open\nat a time, so keep an eye on it.\n\n* - Sometimes when starting or loading a game,\nthe display may not &quot;fill the screen&quot; and the game will run\nin a window in upper left corner of the screen. To correct\nthis, simply save, exit, then reload the game and it\nshould correct the issue.\n\n* - When Starting a new Shandalar Game, it is\nRECOMMENDED that you save your character's image before\nproceeding, or you may not have a character at all!\n\nTo view the Tutorial, run C:Program Files (x86)MagicTGTutorial.exe or\nsee the shortcut in your Start/All Programs Menu. \n\n\nCREDITS:\n========\nMok for cracking and updating the game, and keeping it alive.\nHe proved it could be done even without the source code and with no help.\nWithout him none of this would be possible.\n\nBog Wraith, the most experienced DOTP user in the world, for his enthusiasm and support.\nHe kept the team together and the ball rolling. Go Canucks!\n\nHip63 for spending COUNTLESS hours making the installer, re-doing the tutorial videos,\nintegrating the ACT fix, making the installer work on Vista and Windows 7, etc etc.\n\nSmiling Spectre for his invaluable ACT fix.\n\nThe guys in the new Manalink 2 forum at\nhttp://www.slightlymagic.net/forum/viewforum.php?f=25 for continuing development.\n(Go there to get all kinds of new stuff like cards, play modes and graphics.)\n\nAnd of course the CCGHQ Team at http://www.slightlymagic.net/forum.\n\nEXTRAS:\n=======\nWe have archived all the original game CD's at\nhttp://www.slightlymagic.net/forum/viewtopic.php?f=55&amp;t=898\n\nCome see us!\nAnd most importantly:\n================\nEnjoy Every One!\n================\n\nHuggybaby\nMarch 2010\n","torrent":{"xt":"urn:btih:cf53f5baf125e8ba140ca7feedce7b09f385af62","amp;dn":"Microprose+Magic+the+Gathering+2010+Custom+Installer+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf53f5baf125e8ba140ca7feedce7b09f385af62","infoHashBuffer":{"type":"Buffer","data":[207,83,245,186,241,37,232,186,20,12,167,254,237,206,123,9,243,133,175,98]},"announce":[],"urlList":[]}}