{"title":"Babylon of Egypt: The Archaeology of Old Cairo and its Origins","uid":15816199,"size":9829831,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cfe1671a2c528547d74cb202f03d95adbd59f88f&amp;dn=Babylon+of+Egypt%3A+The+Archaeology+of+Old+Cairo+and+its+Origins&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"marty14","files":1,"time":1473686667,"description":"Babylon of Egypt: The Archaeology of Old Cairo and the Origins of the City - Peter Sheehan [epub]\r\n\r\nThis book presents a history of Old Cairo based on new archaeological evidence gathered between 2000 and 2006 during a major project to lower the groundwater level affecting the churches and monuments of this area of Cairo known by the Romans as Babylon. Examination of the material and structural remains revealed a sequence of continuous occupation extending from the sixth century BC to the present day. These include the massive stone walls of the canal linking the Nile to the Red Sea, and the harbor constructed by Trajan at its entrance around AD 110.\r\n \r\nThe Emperor Diocletian built the fortress of Babylon around the harbor and the canal in AD 300, and much new information has come to light concerning the construction and internal layout of the fortress, which continues to enclose and define the enclave of Old Cairo. Important evidence for the early medieval transformation of the area into the nucleus of the Arab city of al-Fustat and its later medieval development is also presented","torrent":{"xt":"urn:btih:cfe1671a2c528547d74cb202f03d95adbd59f88f","amp;dn":"Babylon+of+Egypt%3A+The+Archaeology+of+Old+Cairo+and+its+Origins","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfe1671a2c528547d74cb202f03d95adbd59f88f","infoHashBuffer":{"type":"Buffer","data":[207,225,103,26,44,82,133,71,215,76,178,2,240,61,149,173,189,89,248,143]},"announce":[],"urlList":[]}}