{"title":"Kagney Linn Karter - Anal, Swallowing, and Then Some","uid":16044005,"size":510765056,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:d02422c0f080de1414eb268f267eed10ec3607bb&amp;dn=Kagney+Linn+Karter+-+Anal%2C+Swallowing%2C+and+Then+Some&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":18,"uploader":null,"files":1,"time":1476543403,"description":"http://imgbum.net/327/9702/\r\n \nhttp://sharezones.biz/view.php?filename=2011/12/13/b918d84a8c4f674a5340b6c2558c24bf.jpg\r\n\r\n\r\n\r\n\r\nKagney Linn Karter - Anal, Swallowing, and Then Some / Kagney Linn Karter Is Relentless\r\n\r\n\r\n\r\nKagney is teasing in a couple different bikinis, one black and white and the other pink, and the sun is smiling on her body. She gets naked as she overlooks the valley and he has the booty shake down pat. I’ve never seen Kagney look better and her body is in peak form. Just a beautiful, sexy woman. After the tease, she is working over the 2 foreign cocks. She does some deep throating and ball licking and gets her face fucked. Ramon fucks her in reverse while she continues to service Toni then the boys switch holes. That’s just a warmup because the boys soon take turns in her ass. Ramon is fucking her ass in cowgirl when Roni goes in for the killshot. They DP her and she takes a double anal and a DPP! All consecutively. They continue to abuse her holes and the DP probably lasts the longest. Kagney asks to be choked and gives her all in this scene. Kagney is volcanic in this scene and takes some balls deep anal like she’s been doing it forever. Relentless is a good title for this one because she just won’t quit! More DP and DAP follows at Ms. Karter’s request. And for good measure, she squirts in pile driver position causing the juice to cascade on her face. Unbelievable scene! But it’s not over yet as she strokes Toni off in her closed mouth. She shows the load off then signals for Ramon to nut in her mouth as well. She swallows the cosmopolitan treat and can only smile about it. WOW!!!!","torrent":{"xt":"urn:btih:d02422c0f080de1414eb268f267eed10ec3607bb","amp;dn":"Kagney+Linn+Karter+-+Anal%2C+Swallowing%2C+and+Then+Some","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d02422c0f080de1414eb268f267eed10ec3607bb","infoHashBuffer":{"type":"Buffer","data":[208,36,34,192,240,128,222,20,20,235,38,143,38,126,237,16,236,54,7,187]},"announce":[],"urlList":[]}}