{"title":"Madame Blavatsky: The Woman Behind the Myth","uid":15890736,"size":4823869,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0270967e5fefaefa565800c5dba09de216bda5d&amp;dn=Madame+Blavatsky%3A+The+Woman+Behind+the+Myth&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":1,"uploader":"marty14","files":1,"time":1474737695,"description":"Madame Blavatsky: The Woman Behind the Myth - Marion Meade [epub]\r\n\r\nRecklessly brilliant, Helena Petrovna Blavatsky scandalized her 19th century world with a controversial new religion that tried to synthesize Eastern and Western philosophies. If her contemporaries saw her as a freak, a charlatan, and a snake oil salesman, she viewed herself as a special person born for great things. She firmly believed that it was her destiny to enlighten the world. Rebelliously breaking conventions, she was the antithesis of a pious religious leader. She cursed, smoked, overate, and needed to airbrush out certain inconvenient facts, like husbands, lovers, and a child.\r\n\r\nMarion Meade digs deep into Madame Blavatsky’s life from her birth in Russia among the aristocracy to a penniless exile in Europe, across the Atlantic to New York where she became the first Russian woman naturalized as an American citizen, and finally moving on to India where she established the international headquarters of the Theosophical Society in 1882. As she chased from continent to continent, she left in her aftermath a trail of enthralled followers and the ideas of Theosophy that endure to this day. While dismissed as a female messiah, her efforts laid the groundwork for the New Age movement, which sought to reconcile Eastern traditions with Western occultism. Her teachings entered the mainstream by creating new respect for the cultures and religions of the East—for Buddhism and Hinduism—and interest in meditation, yoga, gurus, and reincarnation.\r\n\r\nMadame Blavatsky was one of a kind. Here is her richly bizarre story told with compassion, insight, and an attempt to plumb the truth behind those astonishing accomplishments","torrent":{"xt":"urn:btih:d0270967e5fefaefa565800c5dba09de216bda5d","amp;dn":"Madame+Blavatsky%3A+The+Woman+Behind+the+Myth","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0270967e5fefaefa565800c5dba09de216bda5d","infoHashBuffer":{"type":"Buffer","data":[208,39,9,103,229,254,250,239,165,101,128,12,93,186,9,222,33,107,218,93]},"announce":[],"urlList":[]}}