{"title":"The Essential Charlie Parker (1992) @320","uid":5501859,"size":221079997,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d046a5c6d62e31286c7669079fe1a254a055b6cf&amp;dn=The+Essential+Charlie+Parker+%281992%29+%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":"artpepper","files":-1,"time":1271551035,"description":"The Essential Charlie Parker - 1992\nVerve Records (Scans included)\n\n@320 kbps\n\n\n\n\n\n\n\n\n\nCharlie &quot;Bird&quot; Parker is one of the giants of 20th century music. Alto saxophonist Parker combined what he had learned from the blues, swing, classical, even country music with a harmonic and rhythmic adventurousness that became known as bebop, becoming one of the greatest soloists in jazz history. \n\n\nMany musicians who played with Parker went on to make jazz/music history themselves: Max Roach, Thelonious Monk, Miles Davis, and Kenny Dorham, among others. THE ESSENTIAL gives a wonderful cross-section of the music Parker recorded for Verve Records from 1946 to 1953. \n\n\nYou get Bird in quintets with Monk, Buddy Rich, and Dizzy Gillespie (&quot;Relaxing With Lee&quot;), in a wailing jam session with Coleman Hawkins and Buck Clayton (&quot;I Got Rhythm&quot;), fusing bop and Afro-Cuban/Latin music with Machito's big band (&quot;Mango Mangue&quot;), and sailing sweetly with a string section (&quot;Just Friends&quot;). \n\n\nNot sure where to start with Parker, or with bebop or post-swing-era jazz? The answer is in this album's title. Recorded  in New York, New York and Los Angeles, California between 1946 and 1953. \n\n\n\n\n\nTrack Listing:\n\n01 - Now's The Time - 3:04\n02 - If I Should Lose You - 2:49\n03 - Mango Mangue - 2:56\n04 - Bloomdido - 3:27\n05 - Star Eyes - 3:31\n06 - Confirmation (master take) - 3:01\n07 - My Little Suede Shoes - 3:07\n08 - Just Friends - 3:33\n09 - Lover Man - 3:24\n10 - I Got Rhythm - 12:57\n11 - Repetition - 3:00\n12 - K.C. Blues - 3:27\n13 - Relaxing With Lee (master take) - 2:49\n14 - April In Paris - 3:09\n15 - Okiedoke - 3:05\n16 - The Song Is You - 2:57\n\nTotal Running Time 60:14\n\n\n\n\nPersonnel: Charlie Parker (alto saxophone); Jimmy Carroll (conductor, arranger); Gene Johnson, Freddie Skerritt, Willie Smith (alto saxophone); Jose Madera, Coleman Hawkins, Lester Young (tenor saxophone); Leslie Johnakins (baritone saxophone); Mario Bauza, Paquito Davilla, Bobby Woodlen, Dizzy Gillespie, Red Rodney, Buck Clayton, Miles Davis (trumpet); Mitch Miller (oboe); Bronislaw Gimpel, Max Hollander, Milt Lomask (violin); Frank Brieff (viola); Frank Miller (cello); Myor Rosen (harp); Al Haig, Stan Freeman, Rene Hernandez, Thelonious Monk, Hank Jones, Walter Bishop, Jr., John Lewis, Ken Kersey (piano); Irving Ashby (guitar); Percy Heath, Ray Brown, Roberto Rodriguez, Curly Russell, Teddy Kotick, Billy Hadnott (bass); Max Roach, Buddy Rich, Roy Haynes, Kenny Clarke (drums); Jose Mangual (bongo); Luis Miranda (congas); Umbaldo Nieto (timbale); Machito (maracas); Neal Hefti's Orchestra.","torrent":{"xt":"urn:btih:d046a5c6d62e31286c7669079fe1a254a055b6cf","amp;dn":"The+Essential+Charlie+Parker+%281992%29+%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d046a5c6d62e31286c7669079fe1a254a055b6cf","infoHashBuffer":{"type":"Buffer","data":[208,70,165,198,214,46,49,40,108,118,105,7,159,225,162,84,160,85,182,207]},"announce":[],"urlList":[]}}