{"title":"Leni Riefenstahl - Adolf Hitler - Triumph Of The Will (English S","uid":3549084,"size":734662895,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d076e966c0c3f4bd6fa54264cef2234ab4c20b43&amp;dn=Leni+Riefenstahl+-+Adolf+Hitler+-+Triumph+Of+The+Will+%28English+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":0,"uploader":"Kefissos","files":2,"time":1162328896,"description":"Triumph of the Will (German: Triumph des Willens) is a documentary and propaganda film by the German filmmaker Leni Riefenstahl that chronicles the 1934 Nazi Party Congress in Nuremberg. It features footage of uniformed party members (though relatively few German soldiers), who are marching and drilling to classical melodies. The film contains excerpts from speeches given by various Nazi leaders at the Congress, including portions of speeches by Adolf Hitler. Hitler commissioned the film and served as an unofficial executive producer; his name appears in the opening credits. The overriding theme of the film is the return of Germany as a great power, with Hitler as a German Messiah who will bring glory to the nation.\n\nTriumph of the Will was released in 1935 and rapidly became one of the best-known examples of propaganda in film history. Riefenstahl\\&amp;#039;s techniques, such as moving cameras, the use of telephoto lenses to create a distorted perspective, aerial photography, and revolutionary approach to the use of music and cinematography, have earned Triumph recognition as one of the greatest propaganda films in history. Riefenstahl won several awards, not only in Germany but also in the United States, France, Sweden, and in other countries. The film was popular in the Third Reich and elsewhere, and has continued to influence movies, documentaries, and commercials to this day, even as it raises the question over the dividing line between art and morality.\n\nIncludes english subtitles.\n\n\nAVI File Details\n========================================\nName.........: Leni.Riefenstahl-Triumph.des.Willens.(DivX.5).avi\nFilesize.....: 700 MB (or 717,400 KB or 734,617,600 bytes)\nRuntime......: 01:50:30 (158,973 fr)\nVideo Codec..: DivX 5.0\nVideo Bitrate: 785 kb/s\nAudio Codec..: 0x0055(MP3) ID\\&amp;#039;d as MPEG-1 Layer 3\nAudio Bitrate: 93 kb/s, monophonic VBR \nFrame Size...: 512x400 (1.28:1) [=32:25]","torrent":{"xt":"urn:btih:d076e966c0c3f4bd6fa54264cef2234ab4c20b43","amp;dn":"Leni+Riefenstahl+-+Adolf+Hitler+-+Triumph+Of+The+Will+%28English+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d076e966c0c3f4bd6fa54264cef2234ab4c20b43","infoHashBuffer":{"type":"Buffer","data":[208,118,233,102,192,195,244,189,111,165,66,100,206,242,35,74,180,194,11,67]},"announce":[],"urlList":[]}}