{"title":"Annie Lennox - 2014 - Nostalgia FLAC","uid":11261043,"size":228190710,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d0b3f6b72d4f0395242504efd639cd416795deb1&amp;dn=Annie+Lennox+-+2014+-+Nostalgia+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":0,"uploader":"eika256","files":-1,"time":1413963794,"description":"Annie Lennox - 2014 - Nostalgia\n\nAnnie Lennox's 2014 covers collection, Nostalgia, finds the former Eurythmics vocalist soulfully interpreting various pop, jazz, and R&amp;B standards. In many ways, Nostalgia works as a companion piece to her similarly inventive 2010 album, the holiday-themed Christmas Cornucopia. As with that album, Lennox eschews predictability by picking an unexpected set of songs and producing them with detailed care. While Nostalgia certainly fits nicely next to any number of other standards albums by veteran pop stars, it does nothing to diminish Lennox's distinctive style. On the contrary, working with producer Mike Stevens, Lennox has crafted an album that brings to mind the sophisticated, contemporary sound of her original studio releases while allowing her to revel in the grand popular song tradition. Moving between evocative piano accompaniment, orchestral numbers, moody synthesizer arrangements, and even some rollicking small-group swing, Lennox takes a theatrical -- yet always personal -- approach to each song, finding endlessly interesting juxtapositions and stylistic combinations to explore. She references Miles Davis' plaintive take on the Porgy and Bess classic &quot;Summertime,&quot; tenderly evinces a combination of Billie Holiday and Sade on &quot;Strange Fruit,&quot; and draws on both Aretha Franklin and Screamin' Jay Hawkins for &quot;I Put a Spell on You.&quot; Elsewhere, tracks like &quot;I Cover the Waterfront&quot; and &quot;Mood Indigo&quot; bring to mind similar recordings from Carole King and Bryan Ferry. Ultimately, even without Nostalgia's impeccable production, in the end it's Lennox's burnished, resonant vocals that steal the focus here, and just like the songs she's picked, their beauty will likely stand the test of time. (AllMusic)\n\nTrack list:\n01. Memphis in June\n02. Georgia on My Mind\n03. I Put a Spell on You\n04. Summertime (From ''Porgy and Bess'')\n05. I Cover the Waterfront\n06. Strange Fruit\n07. God Bless the Child\n08. You Belong to Me\n09. September in the Rain\n10. I Can Dream, Can't I\n11. The Nearness of You\n12. Mood Indigo\n\nEnjoy and share!","torrent":{"xt":"urn:btih:d0b3f6b72d4f0395242504efd639cd416795deb1","amp;dn":"Annie+Lennox+-+2014+-+Nostalgia+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0b3f6b72d4f0395242504efd639cd416795deb1","infoHashBuffer":{"type":"Buffer","data":[208,179,246,183,45,79,3,149,36,37,4,239,214,57,205,65,103,149,222,177]},"announce":[],"urlList":[]}}