{"title":"Pendulum of War: The Three Battles of El Alamein","uid":15854565,"size":1846784,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0f9201625ef2ba6f3233e63219d14f827078007&amp;dn=Pendulum+of+War%3A+The+Three+Battles+of+El+Alamein&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"marty14","files":1,"time":1474226067,"description":"Pendulum of War: The Three Battles of El Alamein - Niall Barr [epub]\r\n\r\nBased on extensive original research, Pendulum of War looks at the arguments behind the change in fortunes of Britain’s desert army in 1942. Barr provides a vivid picture of the fighting at El Alamein from the early desperate days of July to the final costly victory in November. A compelling new history of a crucial turning point in the Second World War, and a detailed picture of the British Army at a critical stage in its fight against Hitler’s Germany.\r\n\r\nIn June 1942, following the fall of Tobruk, the defeated British Eighth Army was streaming back towards the tiny railway halt of El Alamein in the western desert of Egypt. The Eighth Army had suffered a humiliating defeat at the hands of Rommel’s Panzerarmee Afrika. Yet just five months later, the famous bombardment opened the Eighth Army’s own offensive which destroyed the Axis threat to Egypt.\r\n\r\nExplanations for the remarkable change of fortune have generally been sought in the personalities of the commanders Generals Auchinleck and Montgomery, and that of their legendary opponent, Field Marshall Rommel.\r\n\r\nPendulum of War is the story of how an army learnt from its mistakes. Niall Barr shows that the focus on personality has blurred the continuity of experience that saw the Eighth Army transform itself from a tactically inept collection of units into a battle-winning force that eventually mastered the veterans of Rommel’s Afrika Korps. The book provides a vivid and fresh perspective on the fighting at El Alamein from the early desperate days of July to the final costly victory in November","torrent":{"xt":"urn:btih:d0f9201625ef2ba6f3233e63219d14f827078007","amp;dn":"Pendulum+of+War%3A+The+Three+Battles+of+El+Alamein","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0f9201625ef2ba6f3233e63219d14f827078007","infoHashBuffer":{"type":"Buffer","data":[208,249,32,22,37,239,43,166,243,35,62,99,33,157,20,248,39,7,128,7]},"announce":[],"urlList":[]}}