{"title":"The Willpower Instinct: How Self-Control Works","uid":7825440,"size":491280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d11930e25d49a6b1b4bb13b5be8c7c7029c91806&amp;dn=The+Willpower+Instinct%3A+How+Self-Control+Works&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":0,"uploader":"mdusanjay","files":1,"time":1352917076,"description":"The Willpower Instinct: How Self-Control Works, Why It Matters, and What You Can Do To Get More of It by Kelly McGonigal\nAvery | 2011 | ISBN: 1583334386 | English | 272 pages | EPUB \n\nBased on Stanford University psychologist Kelly McGonigal's wildly popular course &quot;The Science of Willpower,&quot; The Willpower Instinct is the first book to explain the new science of self-control and how it can be harnessed to improve our health, happiness, and productivity.\n\nInformed by the latest research and combining cutting-edge insights from psychology, economics, neuroscience, and medicine, The Willpower Instinct explains exactly what willpower is, how it works, and why it matters. For example, readers will learn:\n\n* Willpower is a mind-body response, not a virtue. It is a biological function that can be improved through mindfulness, exercise, nutrition, and sleep.\n* Willpower is not an unlimited resource. Too much self-control can actually be bad for your health.\n* Temptation and stress hijack the brain's systems of self-control, but the brain can be trained for greater willpower\n* Guilt and shame over your setbacks lead to giving in again, but self-forgiveness and self-compassion boost self-control.\n* Giving up control is sometimes the only way to gain self-control.\n* Willpower failures are contagious--you can catch the desire to overspend or overeat from your friendsÂ­Â­--but you can also catch self-control from the right role models.\n\nIn the groundbreaking tradition of Getting Things Done, The Willpower Instinct combines life-changing prescriptive advice and complementary exercises to help readers with goals ranging from losing weight to more patient parenting, less procrastination, better health, and greater productivity at work.","torrent":{"xt":"urn:btih:d11930e25d49a6b1b4bb13b5be8c7c7029c91806","amp;dn":"The+Willpower+Instinct%3A+How+Self-Control+Works","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d11930e25d49a6b1b4bb13b5be8c7c7029c91806","infoHashBuffer":{"type":"Buffer","data":[209,25,48,226,93,73,166,177,180,187,19,181,190,140,124,112,41,201,24,6]},"announce":[],"urlList":[]}}