{"title":"Encino Man(1992)DVDRip.AC3(ENG)-DROCK","uid":6265439,"size":733499621,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d12e2a1fff1360d573085167f794e17cfca9476d&amp;dn=Encino+Man%281992%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":3,"uploader":"drock232","files":-1,"time":1300888143,"description":"A clueless caveman meets his intellectual match in the form of Pauly Shore in this teen-oriented comedy. Dave Morgan (Sean Astin) is a high school student in Encino, California, where he spends most of his time with his dazed-and-confused buddy Stoney Brown (Shore) and tries to figure out why his girlfriend Robyn (Megan Ward) left him for thick-headed jock Matt (Michael DeLuise). Hoping to boost his low status in the High School pecking order, Dave wants to put in a swimming pool at his family's home for a massive post-prom party. While Dave and Stoney are digging the pit, an earthquake strikes that unearths a frozen caveman (Brendan Fraser). To Dave and Stoney's surprise, the frozen Neanderthal soon comes to life, and after a bath, a shave, and a new set of clothes, the boys are passing off their dim-witted-but-friendly companion &quot;Link&quot; as an exchange student from Estonia. Link soon becomes the most popular guy at school, and Dave is determined to use Link's social success as a way to win back Robyn and foil Matt. Encino Man marked the directorial debut of Les Mayfield, who previously produced the critically acclaimed documentary Hearts of Darkness: A Filmmaker's Apocalypse. \n\nRipped with Handbrake.\n\nLength: 1 Hour 28 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:d12e2a1fff1360d573085167f794e17cfca9476d","amp;dn":"Encino+Man%281992%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d12e2a1fff1360d573085167f794e17cfca9476d","infoHashBuffer":{"type":"Buffer","data":[209,46,42,31,255,19,96,213,115,8,81,103,247,148,225,124,252,169,71,109]},"announce":[],"urlList":[]}}