{"title":"FIFA 2010 [RAZOR1911-ENG version] Crack Included","uid":5219703,"size":7539720192,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d13d0584f0ce6660664679c56266e450e329fa64&amp;dn=FIFA+2010+%5BRAZOR1911-ENG+version%5D+Crack+Included&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":1,"uploader":"razvan93","files":-1,"time":1260887510,"description":"FIFA Soccer 10 (C) Electronic Arts\nDate: 25-09-2009\nGame Type: Sports\nProtection: Securom\n\nPlay professional soccer your way in EA SPORTS FIFA Soccer 10. From the pressure. Refinements to the shooting system and tweaks to the ball physics create a wider,  more realistic variety of shots that enhance the exhilaration of scoring. With over 50  improvements, FIFA 10's new Manager Mode is as close as you can get to running a  team without actually being named to the job .The moment you step onto the pitch, FIFA 10 challenges you to think and react like a real player.\n\nEA SPORTS FIFA 10 gives players new levels of control to experience the beautiful game like never before. This is a soccer game in which players can select a soccer team from across national and international leagues and clubs, compete in a variety of gameplay modes (e.g., single matches and tournament-style), and improve skills through practice shootouts. Wider dribble touches and new collision sharing allow for a less predictable yet extended fight for possession, resulting in more realistic battles between the dribbler and his defender. Improved Urgency AI logic, with over 50 new movement cycles, delivers more responsive positioning so your players stay focused on the ball and move at a speed appropriate to the action. Players better analyze space resulting in pinpoint passes that give their receivers more options and time to outrun the defence.\n\nInstall Notes:\n\n1. Mount or burn image\n2. Install\n3. Copy the files from the Razor1911 dir to your installation dir overwriting the existing one\n4. Run the game using FIFA10.exe\n5. Have fun! \n","torrent":{"xt":"urn:btih:d13d0584f0ce6660664679c56266e450e329fa64","amp;dn":"FIFA+2010+%5BRAZOR1911-ENG+version%5D+Crack+Included","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d13d0584f0ce6660664679c56266e450e329fa64","infoHashBuffer":{"type":"Buffer","data":[209,61,5,132,240,206,102,96,102,70,121,197,98,102,228,80,227,41,250,100]},"announce":[],"urlList":[]}}