{"title":"Brandon Sanderson - Shadows of Self (Mistborn #5) (GraphicAudio)","uid":15463182,"size":1099409743,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d1611d831bab654b824bad7bc79c83e2d5491e4c&amp;dn=Brandon+Sanderson+-+Shadows+of+Self+%28Mistborn+%235%29+%28GraphicAudio%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":5,"uploader":"Laverna","files":8,"time":1470069230,"description":"The Mistborn trilogy's heroes are now figures of myth and legend, even objects of religious veneration. They are succeeded by wonderful new characters, chief among them Waxillium Ladrian, known as Wax, hereditary Lord of House Ladrian but also, until recently, a lawman in the ungoverned frontier region known as the Roughs. There he worked with his eccentric but effective buddy, Wayne. They are &quot;twinborn,&quot; meaning they are able to use both Allomantic and Feruchemical magic.\r\n\r\nShadows of Self shows Mistborn's society evolving as technology and magic mix, the economy grows, democracy contends with corruption, and religion becomes a growing cultural force, with four faiths competing for converts.\r\n\r\nThis bustling, optimistic, but still shaky society now faces its first instance of terrorism, crimes intended to stir up labor strife and religious conflict. Wax and Wayne, assisted by the lovely, brilliant Marasi, must unravel the conspiracy before civil strife stops Scadrial's progress in its tracks.\r\n\r\n\r\n\r\n\r\n\r\nRead by Nathanial Perry\r\nFormat: MP3\r\n\r\nStarring:\r\n\r\nTerence Aselford as Narrator, Chris Genebach as Wax, Bradley Smith as Wayne, Dani Stoller as Marasi, Tracy Olivera as MeLaan, Yasmin Tuazon as Lessie, Bob Payne as Aradel, Eva Wilhelm as Steris, Richard Rohan as TenSoon, David Harris as Innate, Michael John Casey as Reddi, Lily Beacon as Vwafendal, Bruce Alan Rauscher as Winsting and Chris Davenport as Edwarn. With David Jourdan, Eric Messner, Larua C. Harris, Thomas Keegan, Robbie Gay, Matthew Keenan, Maggie Donnelly, Rebecca Sheir, Jonathan Feur, Nanette Savard, Kimberly Gilbert, Michael Glenn, Casey Platt, Rose Elizabeth Supan, Mort Shelby, Nick DePinto, Lise Bruneau, Christopher Scheeren, Gregory Wooddell, Evan Casey, Patrick Bussink, James Lewis, Colleen Delany, Ken Jackson, Eric Singdahlsen, James Konicek, Tim Carlin, Christopher Walker, Scott Graham, Dylan Lynch, Tony Nam, Scott McCormick and Thomas Penny","torrent":{"xt":"urn:btih:d1611d831bab654b824bad7bc79c83e2d5491e4c","amp;dn":"Brandon+Sanderson+-+Shadows+of+Self+%28Mistborn+%235%29+%28GraphicAudio%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1611d831bab654b824bad7bc79c83e2d5491e4c","infoHashBuffer":{"type":"Buffer","data":[209,97,29,131,27,171,101,75,130,75,173,123,199,156,131,226,213,73,30,76]},"announce":[],"urlList":[]}}