{"title":"The Hollywood Book of Extravagance","uid":15932605,"size":4490567,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d179a5447ce4e2ea9da7b63efb0aae4117f6a15c&amp;dn=The+Hollywood+Book+of+Extravagance&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"marty14","files":1,"time":1475369042,"description":"The Hollywood Book of Extravagance: The Totally Infamous, Mostly Disastrous, and Always Compelling Excesses of America's Film and TV Idols - James Robert Parish [epub]\r\n\r\nSavor the inside scoop on over-the-top superstars\r\n\r\n&quot;I'm not a paranoid, deranged millionaire... I'm a billionaire!&quot;\r\n\r\n&quot;Acting is an empty and useless profession.&quot;\r\n\r\n&quot;Good girls go to heaven. Bad girls go everywhere else.&quot;\r\n\r\n&quot;I'm interested in being provocative and pushing people's buttons.&quot;\r\n\r\nWhich screen icons gave us the quotes above? How do stars get away with self-indulgent, unrestrained behaviors - or do they? In The Hollywood Book of Extravagance, longtime industry insider and Hollywood historian James Robert Parish gives you a provocative look behind the scenes at the lavish indulgences and larger-than-life egos of Tinseltown's rich and famous.\r\n\r\nThe featured celebrities range from heartthrobs to industry tycoons, and from yesterday's matinee idols to today's hottest celebs. The stars are grouped according to their excesses: ego, neurosis, partying, power, rich living, and romancing. You'll devour little-known details on the excesses and exploits of notables ranging from Mae West to Madonna, Greta Garbo to Marilyn Monroe and Marlon Brando, Bela Lugosi to John Belushi, Zsa Zsa Gabor to Paris Hilton, Errol Flynn to Jude Law, and many more","torrent":{"xt":"urn:btih:d179a5447ce4e2ea9da7b63efb0aae4117f6a15c","amp;dn":"The+Hollywood+Book+of+Extravagance","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d179a5447ce4e2ea9da7b63efb0aae4117f6a15c","infoHashBuffer":{"type":"Buffer","data":[209,121,165,68,124,228,226,234,157,167,182,62,251,10,174,65,23,246,161,92]},"announce":[],"urlList":[]}}