{"title":"The Beatles - Stereo and Mono Box Sets + Extras [FLAC]","uid":7761412,"size":9247077300,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d1fe1004d11b0ae4a2c3a0625519dfb814acafba&amp;dn=The+Beatles+-+Stereo+and+Mono+Box+Sets+%2B+Extras+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":16,"uploader":"rudown78","files":957,"time":1351239143,"description":"The Beatles: Remastered\n\nWe are delighted to announce the release of the original Beatles catalogue, which has been digitally re-mastered for the first time, for worldwide CD release on Wednesday, September 9, 2009 (9-9-09). Each of the CDs is packaged with replicated original UK album art, including expanded booklets containing original and newly written liner notes and rare photos. On the same date, two new Beatles boxed CD collections will also be released.\n\nThe albums have been re-mastered by a dedicated team of engineers at EMI's Abbey Road Studios in London over a four year period utilizing state of the art recording technology alongside vintage studio equipment, carefully maintaining the authenticity and integrity of the original analogue recordings. The result of this painstaking process is the highest fidelity the catalogue has seen since its original release.\n\nThe collection comprises all 12 Beatles albums in stereo, with track listings and artwork as originally released in the UK, and 'Magical Mystery Tour,' which became part of The Beatles' core catalogue when the CDs were first released in 1987. In addition, the collections 'Past Masters Vol. I and II' are now combined as one title, for a total of 14 titles over 16 discs. This will mark the first time that the first four Beatles albums will be available in stereo in their entirety on compact disc. These 14 albums will also be available for purchase together in a stereo boxed set.\n\nWithin each CD's new packaging, booklets include detailed historical notes along with informative recording notes. Also, a second boxed set has been created with the collector in mind. 'The Beatles in Mono' gathers together, in one place, all of the Beatles recordings that were mixed for a mono release. It will contain 10 of the albums with their original mono mixes, plus two further discs of mono masters (covering similar ground to the stereo tracks on 'Past Masters'). As an added bonus, the mono &quot;Help!&quot; and &quot;Rubber Soul&quot; discs also include the original 1965 stereo mixes, which have not been previously released on CD. These albums will be packaged in mini-vinyl CD replicas of the original sleeves with all original inserts and label designs retained.\n\n\n2009 Stereo Remasters:\n\nPlease Please Me (1963)\nWith the Beatles (1963)\nA Hard Day's Night (1964)\nBeatles for Sale (1964)\nHelp! (1965)\nRubber Soul (1965)\nRevolver (1966)\nSgt. Pepper's Lonely Hearts Club Band (1967)\nMagical Mystery Tour (1967)\nThe Beatles [White Album] (1968)\nYellow Submarine (1969)\nAbbey Road (1969)\nLet It Be (1970)\nPast Masters (1962-1970)\n\n\n2009 Mono Remasters:\n\nPlease Please Me (1963)\nWith the Beatles (1963)\nA Hard Day's Night (1964)\nBeatles for Sale (1964)\nHelp! (1965)\nRubber Soul (1965)\nRevolver (1966)\nSgt. Pepper's Lonely Hearts Club Band (1967)\nMagical Mystery Tour (1967)\nThe Beatles [White Album] (1968)\nMono Masters (1962-1970)\n\n\nExtras:\n\n1962-1966 [Red Album] (2010 Remaster)\n1967-1970 [Blue Album] (2010 Remaster)\n1 (2011 Remaster)\nYellow Submarine Songtrack (2012 Remaster)\n\n\nEach album has all the cover art included as well. Enjoy!","torrent":{"xt":"urn:btih:d1fe1004d11b0ae4a2c3a0625519dfb814acafba","amp;dn":"The+Beatles+-+Stereo+and+Mono+Box+Sets+%2B+Extras+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1fe1004d11b0ae4a2c3a0625519dfb814acafba","infoHashBuffer":{"type":"Buffer","data":[209,254,16,4,209,27,10,228,162,195,160,98,85,25,223,184,20,172,175,186]},"announce":[],"urlList":[]}}