{"title":"The.Complete.Visual.Guide.to.Building.A.House.pdf","uid":10280037,"size":29962015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d229cd5046ef7402ad890f4c29953a7c2209a7e1&amp;dn=The.Complete.Visual.Guide.to.Building.A.House.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"wildturkey00","files":2,"time":1401684725,"description":"Format: PDF\nGenre: tutorial\nPublished: 2014\n\nBook Description: Today's most comprehensive course in residential construction. The Complete Visual Guide to Building a House not only lives up to its name, but the detailed illustrations put this reference in a league of its own. It's your single source for reliable instruction in building a house from foundation to finishing touches - and it's a beautiful book as well.\n\nAn essential reference for builders, carpenters, and homeowners! Find everything you need in one easy-to-navigate guide that covers all the bases:\n* Building the outer structure: foundations; walls; ceilings; raftered and trussed roofs\n* Closing the house to weather: roofing; installing windows, doors, and siding; controlling moisture\n* Finishing the house: wall and floor coverings; hanging interior doors; installing trim and cabinets; building stairs\n\nExpert step-by-step instruction and detailed illustrations. The Compete Visual Guide to Building a House combines the expertise of builder-author John Carroll with over 1,200 full-color drawings by illustrator Chuck Lockhart. Finally, a step-by-step guide that provides a complete course in residential carpentry and construction from two pros who, together, have over 65 years of experience in the building trades.\n\nEliminate guesswork and avoid costly missteps. Building a house is a complex and challenging undertaking that requires knowing what needs to be done at every critical step - and that's exactly what you will find in The Complete Visual Guide to Building a House. With this guide in hand, you'll be armed with the right information and clear illustrations whenever you need them.","torrent":{"xt":"urn:btih:d229cd5046ef7402ad890f4c29953a7c2209a7e1","amp;dn":"The.Complete.Visual.Guide.to.Building.A.House.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d229cd5046ef7402ad890f4c29953a7c2209a7e1","infoHashBuffer":{"type":"Buffer","data":[210,41,205,80,70,239,116,2,173,137,15,76,41,149,58,124,34,9,167,225]},"announce":[],"urlList":[]}}