{"title":"InfiniteSkills Advanced Java Programming","uid":8705621,"size":1178015512,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d272106733e26dc9d3a89c280fe9265e54416921&amp;dn=InfiniteSkills+Advanced+Java+Programming&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":7,"uploader":"EliteBeast","files":-1,"time":1374145274,"description":"Duration 8 Hours mp4\n\nIn this advanced Java training course, expert author Mike McMillan builds on his beginners Java course, and goes deeper into programming topics that help you to understand these more advanced Java concepts. Designed for the more experienced Java developer, you should have a good working knowledge of the Java programming language before going through this tutorial.\n\nSome of the advanced topics that you will cover in this video training include; generic programming, sequential and associative data structures, classic data structures, sorting and searching, exception handling, database programming with JDBC, networking programming GUI development using Swing and an overview of Multithreading. You will also explore Java Applets, web applications (Servlets), advanced input and output classes, more advanced strings, regular expressions, Java graphics, and finally, closing off with a look at using Eclipse.\n\nBy the conclusion of this training course, you will have a clear understanding of each of the topics, which will allow you to go more in-depth with the concepts of your choice. Working files are included to allow you to learn the concepts using the same files that the author does throughout this computer based training course.\n\n101 videos + project files","torrent":{"xt":"urn:btih:d272106733e26dc9d3a89c280fe9265e54416921","amp;dn":"InfiniteSkills+Advanced+Java+Programming","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d272106733e26dc9d3a89c280fe9265e54416921","infoHashBuffer":{"type":"Buffer","data":[210,114,16,103,51,226,109,201,211,168,156,40,15,233,38,94,84,65,105,33]},"announce":[],"urlList":[]}}