{"title":"Life - Keith Richards - Audiobook MP3","uid":11196635,"size":666395971,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d28ddd353f21d619d6f17c06fdb82d47aafe370f&amp;dn=Life+-+Keith+Richards+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":2,"uploader":"Squiddy82","files":-1,"time":1413100017,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nLife\n\nWritten by: Keith Richards, James Fox\nNarrated by: Johnny Depp, Joe Hurley\nLength: 23 hrs and 8 mins\nUnabridged Audiobook\nRelease Date:10-26-10\n\nAs lead guitarist of the Rolling Stones, Keith Richards created the riffs, the lyrics, and the songs that roused the world. A true and towering original, he has always walked his own path, spoken his mind, and done things his own way.\n\nNow at last, Richards pauses to tell his story in the most anticipated autobiography in decades. And what a story! Listening obsessively to Chuck Berry and Muddy Waters records in a coldwater flat with Mick Jagger and Brian Jones, building a sound and a band out of music they loved. Finding fame and success as a bad-boy band, only to find themselves challenged by authorities everywhere. Dropping his guitar's sixth string to create a new sound that allowed him to create immortal riffs like those in &quot;Honky Tonk Woman&quot; and &quot;Jumpin' Jack Flash&quot;. Falling in love with Anita Pallenberg, Brian Jones's girlfriend. Arrested and imprisoned for drug possession. Tax exile in France and recording Exile on Main Street. Ever-increasing fame, isolation, and addiction, making life an ever faster frenzy. Through it all, Richards remained devoted to the music of the band, until even that was challenged by Mick Jagger's attempt at a solo career, leading to a decade of conflicts and ultimately the biggest reunion tour in history.\n\nIn a voice that is uniquely and unmistakably him - part growl, part laugh - Keith Richards brings us the truest rock-and-roll life of our times, unfettered and fearless and true.\n\nRead by Johnny Depp with Joe Hurley and featuring Keith Richards.","torrent":{"xt":"urn:btih:d28ddd353f21d619d6f17c06fdb82d47aafe370f","amp;dn":"Life+-+Keith+Richards+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d28ddd353f21d619d6f17c06fdb82d47aafe370f","infoHashBuffer":{"type":"Buffer","data":[210,141,221,53,63,33,214,25,214,241,124,6,253,184,45,71,170,254,55,15]},"announce":[],"urlList":[]}}