{"title":"Triumph  Discography [1976-2012] ak320","uid":16002839,"size":1479945451,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d28d86e24fabce848f8a5e6416e0b4bcd1e4b856&amp;dn=Triumph++Discography+%5B1976-2012%5D+ak320&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":10,"uploader":"analogkid6103","files":142,"time":1476146809,"description":"Triumph - Discography [1976-2012]ak320\r\n\r\nTriumph is a Canadian hard rock power trio that was popular in the late 1970s through the 1980s. Eight of the band's albums were certified gold or higher, and Triumph was nominated for multiple Juno Awards, including Group of the Year Award in 1979, 1985, 1986 and 1987.\r\n\r\n\r\n\r\n\r\nTriumph's third album, Just a Game (1979), featured  &quot;Hold On,&quot; which reached the Top 40. The album  went gold in the US. Hold On made it to #38 on Billboard: In St. Louis, the song made it to #1 on KSHE, an AOR-FM classic rock radio station. Aiso'Lay It On The Line' received agreat acceptance at AOR-FM radio in U.S. and Canada. The heavy-rotation of 'Lay It On The Line' solidified the band in the minds of rock audiences.  LAY IT remains the most widely played and recognized song from the Triumph catalogue.\r\n\r\nBoth 1981's Allied Forces and 1983's Never Surrender went gold in the United States. Triumph  released a string of  hit singles in the early 1980s. Allied Forces sold over a million copies in the U.S.\r\n\r\nNever Surrender saw the band take on more political overtones.  Never Surrender featured no fewer than five anthems. The Jimi Hendrix-inspired riff-rocker &quot;Too Much Thinking&quot; even samples Ronald Reagan from one of his presidential speeches\r\n Never Surrender went gold in the US. Irving Azoff demonstrated his faith in the trio by co-opting their debts and signing them for five albums. Following their 1984 label change, MCA took over distribution of their catalogue. \r\n\r\nThunder Seven debuted on compact disc in 1984, a time when relatively few could afford CD players. Despite two hit singles and videos, &quot;Spellbound&quot; and &quot;Follow Your Heart,&quot; the album failed to achieve expected levels, even though cassette and vinyl copies were soon released. Thunder Seven is the band's high mark, with Rik Emmett's lyrics addressing social concerns. Thunder Seven became a gold album in 2003.\r\n\r\nSince the group’s inception, individually and collectively, Triumph have contributed time, energy, music, facilities, equipment and funds in support of a wide range of charitable, educational and humanitarian causes. To many for me to list here. \r\nThanks razor1shrp for the lookout on Rik Emmett's whereabouts.\r\n\r\nTorrent Contents\r\n\r\n1976 - In The Beginning (Triumph)\r\n1977 - Rock &amp; Roll Machine\r\n1979 - Just A Game\r\n1980 - Progressions Of Power\r\n1981 - Allied Forces\r\n1983 - Live at the US Festival\r\n1983 - Never Surrender\r\n1984 - Thunder Seven\r\n1986 - The Sport Of Kings\r\n1987 - Surveillance\r\n1993 - Edge Of Excess\r\n2010 - Greatest Hits Remixed\r\n2012 - Live At Sweden Rock Festival\r\n\r\nClick files for track titles\r\n\r\n\r\nMembers\r\n\r\nCurrent members\r\n\r\n    Rik Emmett – guitar, lead and backing vocals, synthesizer, slide guitar, lap steel guitar, dobro, clavinet, music sequencer, bass, bass pedals (1975–1988, 2008–present)\r\n    Gil Moore – drums, percussion, lead and backing vocals (1975–1993, 2008–present)\r\n    Mike Levine – bass, keyboards, synthesizer, organ, piano, clavinet, bass pedals, backing vocals (1975–1993, 2008–present)","torrent":{"xt":"urn:btih:d28d86e24fabce848f8a5e6416e0b4bcd1e4b856","amp;dn":"Triumph++Discography+%5B1976-2012%5D+ak320","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d28d86e24fabce848f8a5e6416e0b4bcd1e4b856","infoHashBuffer":{"type":"Buffer","data":[210,141,134,226,79,171,206,132,143,138,94,100,22,224,180,188,209,228,184,86]},"announce":[],"urlList":[]}}