{"title":"Gun [Ntsc], Ps2","uid":5080037,"size":1192529459,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:d2b4e3d5fc78ef845e55d3456278b60a3f84d589&amp;dn=Gun+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":2,"uploader":"Big_dude","files":-1,"time":1252212419,"description":"Gun for the Ps2                                         Rel. 11/08/2005          \n       \n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         ISO\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with WinRar, game was tested and works. \nTry 7zip its free google it, if don't have WinRar.\n\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n        &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n        &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n       &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n       &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Tayio yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\n\nGame Description:\n\nThe Wild Wild West meets Grand Theft Auto in this free-roaming action game. Set in 1870, you are Colton White, a young gunslinger whose father is killed by an Indian tribe led by Reverend Reed. Just before passing away, your father hands you a token and reveals you are not his son. Sworn to avenge his death, you pursue the killers and unravel the secrets surrounding the item. Although you are on your own, temporary alliances can be formed with townspeople, Apaches and posse members, but watch your back as they can turn against you.\n\nThe main storyline, written by Hollywood screenwriter Randall Jahnson (The Mask of Zorro, 1998,) is linear. You will have to fight duels, defend towns against bandits, help build railway tracks, intervene in various conflicts and kill heavily-armed bossed. There are also many side missions or alternative ways to earn money. You can play poker in the casino, help out farmers with their livestock, assist the local sheriff or deliver items with the pony express. Other possibilities include bounty hunting, regular hunting for rare animals, mining for gold and various rescue missions. \n\nThe RPG elements involve acquiring and improving skills, such as QuickDraw (shown in Bullet Time,) Zoom Firing, Melee Combat, improved accuracy, the ability to throw axes and strategically equipping and upgrading different weapons. There are hand weapons (knives, tomahawks, bayonets), archery arms, explosive throwable items and regular guns, such as sharpshooter rifles, colts and winchesters. Some are earned during the missions, others can be bought and sold for cash in the towns.\n\nThe GTA reference is reflected in the main means of transportation: horses. There are different animals to find with extensive movement options. Go on wild chases, spurt, gallop, do skid attacks, or trample your enemies. Give them some rest from time to time, or you will wear them down to death. In the melee combat, you can do roll maneuvers, use objects to provide cover, grab your opponents and even scalp them. You are free to steer away from the main storyline and explore the giant landscape, with towns, deserts, mountains, wilderness and caves.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBest to burn at 8x or 4x speed.\n\nUse Verbatim Or use Tayio Yuden DVD+R or DVD-R Media for best quality.\n\nUsing any other media might not work at all.\n\nIf using DVD+R then booktype to DVD-ROM \n(If your mod-chip, or Ps2 doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:d2b4e3d5fc78ef845e55d3456278b60a3f84d589","amp;dn":"Gun+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2b4e3d5fc78ef845e55d3456278b60a3f84d589","infoHashBuffer":{"type":"Buffer","data":[210,180,227,213,252,120,239,132,94,85,211,69,98,120,182,10,63,132,213,137]},"announce":[],"urlList":[]}}