{"title":"The Complete Idiot's Guide to Shakespeare's Plays","uid":15759040,"size":10760060,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2c9fc8ae328c0a080da11f6448c386455a3ea1b&amp;dn=The+Complete+Idiot%27s+Guide+to+Shakespeare%27s+Plays&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":1,"uploader":"marty14","files":1,"time":1473087647,"description":"The Complete Idiot's Guide to Shakespeare's Plays - Cynthia Greenwoord [epub]\r\n\r\nThis accessible new guide to Shakespeare's major plays focuses on the essence of the spoken word and the benefits of watching the plays in performance - on the stage or screen - whenever possible. You'll find tips about plot, theme, famous passages and soliloquies, and how to hear the music within the Bard's verse and wordplay. \r\n\r\nRemember - Shakespearean theatre is a social art form, and in its earliest days, it was highly commercial. This book brings you closer to the heady world of freelance playwriting and the London playhouses of the 1590s. As a playwright and sharer in the Globe theatre, Shakespeare was at the forefront of Western show business. This book highlights Shakespeare's career, his dramatic influences, and what 16th-century playgoers in London would have experienced inside the theatre. \r\n\r\nIn The Complete Idiot's Guide to Shakespeare's Plays cultural and historical contexts for the major plays are explored, offering perspectives of the director and actor, in addition to that of the scholar and close reader. In particular, the book takes you behind the scenes with Shakespearean directors, who offer commentary about key challenges presented by the plays, famous roles, and a host of other production concerns. Professional actors also discuss how they've tackled lead roles in A Midsummer Night's Dream, Much Ado About Nothing, The Merchant of Venice, King Lear, Antony and Cleopatra, and The Tempest, among others. You'll find: \r\n\r\nTwenty (20) major plays explored in depth, explaining literary terms? and Elizabethan English, with attention to language and verse;\r\nA look at how the plays have been staged, from the earliest playhouses to contemporary auditoriums;\r\nAppendices spotlighting Shakespeare's likely collaborations, a glossary, suggested further reading, and tips about acclaimed film and audio versions.\r\n\r\nPerfect for English and drama students, general readers, theatergoers, and actors","torrent":{"xt":"urn:btih:d2c9fc8ae328c0a080da11f6448c386455a3ea1b","amp;dn":"The+Complete+Idiot%27s+Guide+to+Shakespeare%27s+Plays","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2c9fc8ae328c0a080da11f6448c386455a3ea1b","infoHashBuffer":{"type":"Buffer","data":[210,201,252,138,227,40,192,160,128,218,17,246,68,140,56,100,85,163,234,27]},"announce":[],"urlList":[]}}