{"title":"Wing Chun Kung Fu: Traditional Chinese King Fu for Self-Defense","uid":6439537,"size":148672891,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2f5f1414649274bc2b931b874eb9127cf977665&amp;dn=Wing+Chun+Kung+Fu%3A+Traditional+Chinese+King+Fu+for+Self-Defense+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"delta48","files":-1,"time":1306940522,"description":"Straightforward and efficient, Wing Chun Kung Fu is one of the most popular forms of Kung Fu because it emphasizes techniqu over strength. By using the skills of Wing Chun Kung Fu, a smaller and weaker person can easily overcome a larger strong opponent. With its focus on technique rather than force, it is suitable for both men and women, young and old, and for those of all levels of physical fitness.\nGrandmaster Ip Chun is regarded as the world's leading authority on Wing Chun. Bruce Lee--Wing Chun's most famous student--was taught by Ip Chun's father, Grandmaster Ip Man. Michael Ise is also a highly respected Qigong and martial arts master. Together they demonstrate that first form of Wing Chun (Siu Lim Tao) and show how it can be used for self-denence. They also outline the history and the art of Wing Chun and discuss its many other benefits, which include\n\nIncreased Energy and Vitality\nGreater Confidence and Inner Strength\nAn Understanding of the Skills and Benefits of Meditation\n\nWith expert instruction and more than 100 step-by-step photographs, Wing Chun Kung Fu makes it easy to master the power and grace of this ancient martial art.\nAbout the Author\nGrandmaster Ip Chun is the eldest son of legendary Grandmaster Ip Man, who was responsible for bringing Wing Chun to the modern world. Ip Chun is now considered the world's leading expert on Wing Chun Kung Fu.\n\nMichael Tse is Qigong and martial arts master. He is the author of Qigong for Health and Vitality. Both authors live in England.\n\n\n------\nPaperback: 144 pages\nPublisher: St. Martin's Griffin (April 1998)\nLanguage: English\nISBN-10: 0312187769\nISBN-13: 978-0312187767","torrent":{"xt":"urn:btih:d2f5f1414649274bc2b931b874eb9127cf977665","amp;dn":"Wing+Chun+Kung+Fu%3A+Traditional+Chinese+King+Fu+for+Self-Defense+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2f5f1414649274bc2b931b874eb9127cf977665","infoHashBuffer":{"type":"Buffer","data":[210,245,241,65,70,73,39,75,194,185,49,184,116,235,145,39,207,151,118,101]},"announce":[],"urlList":[]}}