{"title":"Rammstein - In Amerika (2015)ak","uid":12494029,"size":203696143,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d321c7a64d2aa66dcf2d4e0be68a93191c1a0c5c&amp;dn=Rammstein+-+In+Amerika+%282015%29ak&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":"analogkid6103","files":21,"time":1443225579,"description":"RAMMSTEIN made a triumphant return to the U.S. stage for the first time in 10 years, to headline one sold-out concert at New York City's Madison Square Garden. The venue's more than 18,000 seats were snatched up for the special appearance within less than 30 minutes of going on sale, heralding RAMMSTEIN's return with a frenzied fanfare on par with the German band's elaborate stage presentation. On September 25, Island/UMe will release &quot;Rammstein In Amerika&quot; in 2DVD and 2Blu-ray packages, pairing the incendiary Madison Square Garden concert, expertly filmed and recorded in 5.1 surround, with a feature-length documentary film directed by Hannes Rossacher. A 20-minute film about the making of RAMMSTEIN's sixth album, &quot;Liebe Ist Für Alle Da&quot;, is also included.\r\n\r\nThe two-hour &quot;Rammstein In Amerika&quot; documentary throws open the band's private archives spanning more than 20 years, including a trove of never-before-seen footage. Originated and personally overseen by RAMMSTEIN, the film is a fascinating chronological exploration of the band's history, from the members' shared experience of limited touring and other creative business opportunities behind the Iron Curtain in their native East Germany to bursting onto the world's stage as metal/rock heroes after Germany's reunification. The film follows RAMMSTEIN's first forays into U.S. touring and American music business dealings in the 1990s, their work with David Lynch for the &quot;Lost Highway&quot; soundtrack, global radio and music television success, and international touring, which included the 1999 arrest of two of the band's members in Massachusetts for elements of their stage presentation deemed by local police to be &quot;lewd and lascivious behavior.&quot;\r\n\r\nStudio: Spine Farm\r\nCertification:\r\nDuration: 223mins\r\nFormat: MP3\r\nCategory: Music \r\nReleased: 25th September 2015\r\n\r\nTracklist\r\n\r\n01. Rammlied\r\n02. B********?\r\n03. Waidmanns Heil\r\n04. Keine Lust\r\n05. Weisses Fleisch\r\n06. Feuer Frei!\r\n07. Wiener Blut\r\n08. Frühling In Paris\r\n09. Ich Tu Dir Weh\r\n10. Du Riechst So Gut\r\n11. Benzin\r\n12. Links 2 3 4\r\n13. Du Hast\r\n14. Pussy\r\n15. Sonne\r\n16. Haifisch\r\n17. Ich Will\r\n18. Engel","torrent":{"xt":"urn:btih:d321c7a64d2aa66dcf2d4e0be68a93191c1a0c5c","amp;dn":"Rammstein+-+In+Amerika+%282015%29ak","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d321c7a64d2aa66dcf2d4e0be68a93191c1a0c5c","infoHashBuffer":{"type":"Buffer","data":[211,33,199,166,77,42,166,109,207,45,78,11,230,138,147,25,28,26,12,92]},"announce":[],"urlList":[]}}