{"title":"Give And Take - A Revolutionary Approach to Success (Epub,Mobi) ","uid":9686267,"size":1471637,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d41f6c79073e19a90d762e9011d23a49e3e0e19f&amp;dn=Give+And+Take+-+A+Revolutionary+Approach+to+Success+%28Epub%2CMobi%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":4,"uploader":"GoonerTPB","files":2,"time":1393773542,"description":"Give and Take by Adam Grant\n\n\nFormat: mobi/epub\nGenre: Business\nPrint Length: 320 pages\nRelease Date: 11 April 2013\n\nDescription:\n\nFor generations, we have focused on the individual drivers of success: passion, hard work, talent, and luck. But today, success is increasingly dependent on how we interact with others. It turns out that at work, most people operate as either takers, matchers, or givers. Whereas takers strive to get as much as possible from others and matchers aim to trade evenly, givers are the rare breed of people who contribute to others without expecting anything in return.\n\nUsing his own pioneering research as Wharton's youngest tenured professor, Grant shows that these styles have a surprising impact on success. Although some givers get exploited and burn out, the rest achieve extraordinary results across a wide range of industries. Combining cutting-edge evidence with captivating stories, this landmark book shows how one of America's best networkers developed his connections, why the creative genius behind one of the most popular shows in television history toiled for years in anonymity, how a basketball executive responsible for multiple draft busts transformed his franchise into a winner, and how we could have anticipated Enron's demise four years before the company collapsed-without ever looking at a single number.\n\nPraised by bestselling authors such as Dan Pink, Tony Hsieh, Dan Ariely, Susan Cain, Dan Gilbert, Gretchen Rubin, Bob Sutton, David Allen, Robert Cialdini, and Seth Godin-as well as senior leaders from Google, McKinsey, Merck, Estee Lauder, Nike, and NASA-Give and Take highlights what effective networking, collaboration, influence, negotiation, and leadership skills have in common. This landmark book opens up an approach to success that has the power to transform not just individuals and groups, but entire organizations and communities.\n\nAuthor:\n\nAdam Grant is the youngest tenured professor and single highest-rated teacher at The Wharton School. He is a former record-setting advertising director, junior Olympic springboard diver, and professional magician. He has been honored as one of BusinessWeek's favorite professors and one of the world's top 40 business professors under 40. His consulting and speaking clients include Google, the NFL, Goldman Sachs, Merck, the World Economic Forum, the United Nations, and the U.S. Army, Navy, and Air Force. He holds a Ph.D. in organizational psychology from the University of Michigan and a B.A. from Harvard University.","torrent":{"xt":"urn:btih:d41f6c79073e19a90d762e9011d23a49e3e0e19f","amp;dn":"Give+And+Take+-+A+Revolutionary+Approach+to+Success+%28Epub%2CMobi%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d41f6c79073e19a90d762e9011d23a49e3e0e19f","infoHashBuffer":{"type":"Buffer","data":[212,31,108,121,7,62,25,169,13,118,46,144,17,210,58,73,227,224,225,159]},"announce":[],"urlList":[]}}