{"title":"Data Love: The Seduction and Betrayal of Digital Technologies","uid":15870818,"size":341705,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d42306f204bc619c40f2167b1a0a5c7238a7cf93&amp;dn=Data+Love%3A+The+Seduction+and+Betrayal+of+Digital+Technologies&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":2,"uploader":"Dr.Soc","files":1,"time":1474423809,"description":"Roberto Simanowski, &quot;Data Love: The Seduction and Betrayal of Digital Technologies&quot;\r\nISBN: 0231177267 | 2016 | EPUB | 176 pages | 334 KB\r\n\r\nIntelligence services, government administrations, businesses, and a growing majority of the population are hooked on the idea that big data can reveal patterns and correlations in everyday life. Because big data renders quantifiable what we think of as social, it helps propel the project of modernity, which strives for knowledge, progress, better services, and more comfortable lives. Data Love argues that the dark side of data mining cannot be confined to tensions between citizens and government: the phenomenon has instigated a transfiguration of society, one in which we are all involved. Big data has sparked a silent revolution, initiated by software engineers and carried out through algorithms. Unfolding at the heart of consumer culture, this revolution has led to a worrisome loss of self, an erosion of memory, and an abandonment of social utopias. Roberto Simanowski elaborates on the changes data love has brought to the human condition while exploring the entanglements of those whoout of stinginess, convenience, ignorance, narcissism, or passioncontribute to the amassing of evermore data about their lives, leading to the statistical evaluation and individual profiling of their selves. Simanowski illustrates the social implications of technological development and retrieves the concepts, events, and cultural artifacts of past centuries to help decode the programming of our present","torrent":{"xt":"urn:btih:d42306f204bc619c40f2167b1a0a5c7238a7cf93","amp;dn":"Data+Love%3A+The+Seduction+and+Betrayal+of+Digital+Technologies","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d42306f204bc619c40f2167b1a0a5c7238a7cf93","infoHashBuffer":{"type":"Buffer","data":[212,35,6,242,4,188,97,156,64,242,22,123,26,10,92,114,56,167,207,147]},"announce":[],"urlList":[]}}