{"title":"Fifty Shades Trilogy","uid":7189000,"size":6900670,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5364bff03b4c4157b5099ba55e9c338022d4147&amp;dn=Fifty+Shades+Trilogy+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":0,"uploader":"tduckin","files":-1,"time":1334559052,"description":"Fifty Shades Trilogy in EPUB format. Fifty Shades of Grey/Darker/Freed. &lt;--Numerical Order. Seed it for a while before disappearing. \n\nGo get some carpel tunnel ladies! :D\n\nOriginally developed from a fan fiction work called &quot;Master of the Universe&quot; inspired by the Twilight books by Stephenie Meyer, Fifty Shades of Grey is an erotic romance, the first volume in a trilogy. It was released simultaneously as an e-book and a print-on-demand paperback in June 2011 by The Writers' Coffee Shop, a virtual publisher based in Australia. The second volume, Fifty Shades Darker, was released in September 2011, and the third, Fifty Shades Freed, followed in January 2012.\nSet largely in Seattle, the trilogy traces the deepening relationship between college graduate Ana Steele and a young business magnate, Christian Grey. It is notable for its explicitly erotic scenes featuring elements of BDSM.\nThe author originally wrote &quot;Master of the Universe&quot;, using the penname &quot;Snowqueens Icedragon&quot;, as a Twilight fan fiction featuring Edward and Bella. Later James released it as an e-book under the new name and with renamed main characters.\nThe Writers' Coffee Shop had a restricted marketing budget and relied largely on book blogs for early publicity. However sales were boosted by fans of the original fiction published episodically on EL James's own website, and in the USA word-of-mouth recommendation by readers - notably married women over thirty - led to an exponential increase in sales. In January 2012 Fifty Shades of Grey became a bestseller on Amazon.com with no conventional marketing or publicity, despite the high cover price and frequent shortages of the print-on-demand paperback edition. The book's erotic nature and the perceived demographic of its fanbase led to it being dubbed &quot;Mommy Porn&quot; by some news agencies.[1]","torrent":{"xt":"urn:btih:d5364bff03b4c4157b5099ba55e9c338022d4147","amp;dn":"Fifty+Shades+Trilogy+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5364bff03b4c4157b5099ba55e9c338022d4147","infoHashBuffer":{"type":"Buffer","data":[213,54,75,255,3,180,196,21,123,80,153,186,85,233,195,56,2,45,65,71]},"announce":[],"urlList":[]}}