{"title":"BINARY STAR MASTERS OF THE UNIVERSE","uid":4279473,"size":174878957,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d55cfe314c35d80a7579942d1ad8f3c7c70a32a2&amp;dn=BINARY+STAR+MASTERS+OF+THE+UNIVERSE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":0,"uploader":"nigeldpablo","files":-1,"time":1215305765,"description":"One.Be.Lo was imprisoned in 1994, shortly after his 18th birthday, on a drug charge. While in prison, he met Senim Silla, and the two formed Binary Star during their time in Hiawatha Correctional Facility.[1] One.Be.Lo took the time to gather extensive amounts of knowledge pertaining to the music industry, such as copyrights, publishing, and how to successfully start a record company. In his own words, he &quot;learned how to hustle legally&quot;.[1]\n\nTheir debut effort, Waterworld was produced on a $500 budget[2] and released in 1999, under the label Terrorist Records. An extensive tour of Michigan followed, as both members of the duo were on parole and were not permitted to leave the state. Binary Star then switched to Subterraneous Records and released Masters of the Universe, named for a track on the album. This album was essentially just a remixed version of Waterworld,[3] but garnered far more attention, as the album sold 20,000 copies.[4] However, the pair were not getting along particularly well,[1] and, citing creative differences,[5] Binary Star was discontinued. They reunited briefly in 2002, doing a concert together at Middlebury College in Middlebury, Vermont,[6] but they did not record any new material. Although there has inevitably been speculation about a reformation of Binary Star, One.Be.Lo has stated that this is unlikely. &quot;I seriously doubt it&quot;, he said, proceeding to claim, &quot;Artists are real, real picky and real, real closed minded. They can be real, real strongly opinionated. If there ain?t no real chemistry, it ain?t going to work.&quot;[5]\n\nBinary Star's legacy, while minor, is still apparent, as Masters of the Universe and its earlier counterpart Waterworld are still highly regarded by many fans of underground hip hop","torrent":{"xt":"urn:btih:d55cfe314c35d80a7579942d1ad8f3c7c70a32a2","amp;dn":"BINARY+STAR+MASTERS+OF+THE+UNIVERSE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d55cfe314c35d80a7579942d1ad8f3c7c70a32a2","infoHashBuffer":{"type":"Buffer","data":[213,92,254,49,76,53,216,10,117,121,148,45,26,216,243,199,199,10,50,162]},"announce":[],"urlList":[]}}