{"title":"Financial Vipers of Venice: Alchemical Money, Magical Physics ..","uid":15861661,"size":2267655,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5bba61eedd0f994b1e54e6e138e1aeafbc50ff4&amp;dn=Financial+Vipers+of+Venice%3A+Alchemical+Money%2C+Magical+Physics+..&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"marty14","files":1,"time":1474306252,"description":"Financial Vipers of Venice: Alchemical Money, Magical Physics, and Banking in the Middle Ages and Renaissance - Joseph P. Farrell [epub]\r\n\r\nIn this sequel to Joseph P. Farrell's Babylon's Banksters, the banksters have moved from Mesopotamia via Rome to Venice. There, they have manipulated popes and bullion prices, clipped coins, sacked Constantinople, destroyed rival Florence, waged war, burned &quot;heretics,&quot; and suppressed hidden secrets threatening their financial supremacy ... until Giordano Bruno and Christopher Columbus broke the banking cartel's control of information and bullion.\r\n\r\nWe might wonder—with some justification—how an excursion into such magical mediaeval matters could possibly shed light on the contemporary debate on finance, commerce, credit, and debt taking place around the world.\r\n\r\nAs will be seen in these pages, the modern global economy, with its bonds, annuities, bills of exchange, alchemical paper &quot;fiat money,&quot; bullion, wage-slavery, national debts, private central banking, stock brokerages, and commodities exchanges, in a sense began in the Middle Ages, for all these institutions began for quite perceptible and specific reasons during that time.\r\n\r\nThe centerpiece in this debate is of course money: what, and who, does it really represent? And how did it manage to begin as a purely metaphysical phenomenon, with deep ties to a cosmological and indeed topological and alchemical metaphor of the physical medium, thence to transmute itself into the conception that money is bullion, and thence once again to transmute itself back into a purely metaphysical construct of credit and debt denominated on tokens of paper?","torrent":{"xt":"urn:btih:d5bba61eedd0f994b1e54e6e138e1aeafbc50ff4","amp;dn":"Financial+Vipers+of+Venice%3A+Alchemical+Money%2C+Magical+Physics+..","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5bba61eedd0f994b1e54e6e138e1aeafbc50ff4","infoHashBuffer":{"type":"Buffer","data":[213,187,166,30,237,208,249,148,177,229,78,110,19,142,26,234,251,197,15,244]},"announce":[],"urlList":[]}}