{"title":"Cosmos - A Space Time Odyssey COMPLETE Season by TommyJay","uid":10320266,"size":15205559862,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:d5c96011397d510912937af5eaf8496a4024e74b&amp;dn=Cosmos+-+A+Space+Time+Odyssey+COMPLETE+Season+by+TommyJay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":3,"uploader":"therealtommyjay","files":-1,"time":1402299697,"description":"Cosmos: A Spacetime Odyssey is a 2014 American science documentary television series. The show is a follow-up to the 1980 television series Cosmos: A Personal Voyage, which was presented by Carl Sagan on the Public Broadcasting Service and is considered a milestone for scientific documentaries. This series was developed to bring back the foundation of science to network television at the height of other scientific-based television series and films. The show is presented by astrophysicist Neil deGrasse Tyson, who was inspired by Sagan as a young college student. Among the executive producers are Seth MacFarlane, whose clout and financial investment was instrumental in bringing the show to broadcast television, and Ann Druyan, Sagan's widow and a co-creator of the original series. The series loosely follows the same thirteen-episode format and storytelling approach that the original Cosmos used, including elements such as the &quot;Ship of the Imagination&quot;, but features information updated since the 1980 series along with extensive computer-generated graphics and animation footage augmenting the narration. The show is produced by Brannon Braga, and Alan Silvestri provides the backing score.\n\nThe series premiered on March 9, 2014, simultaneously in the US across ten 21st Century Fox networks.  The series has been rebroadcast internationally in dozens of other countries by local National Geographic and Fox stations. It contains 13 40-minute episodes which make up the whole series. Re-Packed and brought to you by Tommy Jay","torrent":{"xt":"urn:btih:d5c96011397d510912937af5eaf8496a4024e74b","amp;dn":"Cosmos+-+A+Space+Time+Odyssey+COMPLETE+Season+by+TommyJay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5c96011397d510912937af5eaf8496a4024e74b","infoHashBuffer":{"type":"Buffer","data":[213,201,96,17,57,125,81,9,18,147,122,245,234,248,73,106,64,36,231,75]},"announce":[],"urlList":[]}}