{"title":"Prince of Persia - The Two Thrones [Ntsc], Ps2","uid":5271193,"size":1455301590,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:d6b725eb0a26077b0cd1a9f505d7b1946ad700f7&amp;dn=Prince+of+Persia+-+The+Two+Thrones+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":3,"uploader":"Big_dude","files":-1,"time":1263198513,"description":"Prince of Persia - The Two Thrones for the Ps2                      Rel. 12/02/2005\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Action\nRating:        M (Mature)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nAfter many dangerous adventures, the Prince finally makes his way home to Babylon, bringing with him his new bride Kaileena, the Empress of Time. Their hopes for a peaceful and happy future together are dashed, however, when they arrive in Persia to find the land ravaged by war. Kaileena is promptly captured and murdered by the evil Vizier, and her death unleashes the Sands of Time, from which the Vizier derives terrifying new powers.\n\nOnce again the Prince of Persia must stand to fight, but this time he will be stronger than ever, thanks to his new alter ego the Dark Prince, borne of the Prince's contact with the Sands. As he fights to reclaim his kingdom from the hands of a madman, he must also battle with his own inner demons as the Dark Prince threatens to consume him entirely.\n\nThe game is very similar (in terms of fight and puzzle sequences) to the previous installments of UbiSoft's Prince of Persia trilogy: The Sands of Time and Warrior Within. There are some major innovations like the character of Dark Prince, who possess the main protagonist from time to time and offers him new combos and moves. There is also new ability, called &quot;Speed Kill&quot;, which is very effective against all opponents in the game (victims are attacked from behind and murdered in brutally fashion).\n\nIn Prince of Persia: The Two Thrones player will explore not only the streets of Babylon, but also a ruined palace of his father, temple and the famous Hanging Gardens.\n\nFeatures:\n\n* Play and master two distinct characters: Wield the powers and weapons of two \n  master warriors with different combat styles, attitudes, and histories. \n\n* Choose your way to fight: Master the expanded Free-Form Fighting system to \n  destroy enemies in your own style; strangle enemies from afar with the deadly\n  Daggertail; or surprise them with full-speed one-shot kills using a brand new \n  stealth art. The choice is yours. \n\n* Battle freely through Babylon: Dominate enemies on the perilous rooftops, dodge\n  through chaotic streets, and ambush pursuers in dark, underground passageways. \n\n* Immerse yourself in a dramatic story: Experience unparalleled depth in\n  storytelling as you fight your way through a twisting tale filled with \n  adrenaline, tension and discovery. \n\n* Manipulate time to surprise enemies: Execute powerful attacks against entire \n  armies by slowing down or rewinding time, or surprise them by using some all-\n  new Sands of Time powers. \n\n* Experience a masterful blend of gameplay: True to the Prince of Persia\n  franchise, the game provides a variety of action combat, agility and story-\n  driven puzzles - all masterfully blended together into a rich gaming experience.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:d6b725eb0a26077b0cd1a9f505d7b1946ad700f7","amp;dn":"Prince+of+Persia+-+The+Two+Thrones+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6b725eb0a26077b0cd1a9f505d7b1946ad700f7","infoHashBuffer":{"type":"Buffer","data":[214,183,37,235,10,38,7,123,12,209,169,245,5,215,177,148,106,215,0,247]},"announce":[],"urlList":[]}}