{"title":"Space_Run-FANiSO","uid":10384581,"size":722144705,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d717b590c2f7e86d5e86ae73726ae0d3dc6d9c0d&amp;dn=Space_Run-FANiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"Mr.Stifmeister","files":2,"time":1403122294,"description":"\n                            [ P R E S E N T S ]\n                   Space Run (c) Focus Home Interactive\n\n Supplied By: A Friend               Diskettes   : 1 CD\n Cracked By : A Friend               Game Type   : Strategy\n Packaged By: A Friend               Released On : June 2014\n\n\nSpace Run is a real-time spaceship construction strategy game. Space\nRun takes the well-known Tower Defense-style gameplay and twists it,\nchallenging you to manage and protect a spaceship and its cargo\nagainst the hazards of deep space!\n\nSpace can be a dangerous place. Youre one of the most daring Space\nTransporters, people who carry the dangerous task of transporting\nvaluable shipments from one place to another across hazardous space.\nThis supposedly simple task gets tricky once you add dense asteroid\nfields that regularly cross the space lanes, the armed-to-the-teeth\npirate starfighters and spaceships all too willing to shred your\nship for your cargo, as well as the other Space Transporters\nyou are competing against!\n\nTake on increasingly difficult missions as your reputation grows:\nbringing more expensive cargo to their destination will earn you\ncredits to unlock new ship modules and upgrades that will help you\nsurvive the lethal threats of space: laser turrets, missile\nlaunchers, protection shields, thrusters, power generators... you\nname it! Youll have to quickly adapt to every new situations if\nyou wish to survive, building modules on your ship as you fly\nacross space. The faster you fly and reach your destination, the\nbetter your reputation, allowing you to unlock more difficult\ndelivery missions!\nSpace Run boasts high replay value: replay earlier missions with the\nnew modules you unlocked in order to complete them faster and score\nhigher... and show your friends youre the fastest, most daring\nSpace Transporter ever!\n\n\n Features:\n ~~~~~~~~~\n\n* Accessible and extremely dynamic gameplay that puts a new twist\n  on the well-known Tower Defense genre\n* Build your spaceship on the fly to adapt to every situation,\n  protecting your valuable cargo and beating your competitor\n  in deadly delivery races\n* Earn credits to Unlock &amp; Upgrade new ship modules, allowing you\n  to better defend yourself, attack other cargo, and complete\n  your missions faster to gain higher reputation\n* High replay value: replay earlier missions with the modules you\n  unlocked to best your friends and your own scores!!\n\n\n Install\n ~~~~~~~\n 1.) Unpack\n 2.) Burn or mount\n 3.) Play the game\n\n\n                     LETZ ROCK - LETZ DOPE - LETZ KICK!\n","torrent":{"xt":"urn:btih:d717b590c2f7e86d5e86ae73726ae0d3dc6d9c0d","amp;dn":"Space_Run-FANiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d717b590c2f7e86d5e86ae73726ae0d3dc6d9c0d","infoHashBuffer":{"type":"Buffer","data":[215,23,181,144,194,247,232,109,94,134,174,115,114,106,224,211,220,109,156,13]},"announce":[],"urlList":[]}}