{"title":"GTA V Brady guide","uid":8937386,"size":117847394,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d721d17f714fa25ea9eb42949a578c710b07ba7b&amp;dn=GTA+V+Brady+guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1379602300,"description":"BradyGames has teamed up with Rockstar Games to bring you Grand Theft Auto V Signature Series Guide, a comprehensive guide to the biggest and most anticipated game of the year. Provides a step-by-step walkthrough of the entire single-player story and strategy for every action-packed mission, enabling you to get the most out of GTA and complete the game faster than your friends!\n\nGet complete coverage of all off-mission activities and sophisticated mini-games. Maps identify key objectives, specify targets, and chart the fastest path to success in this enormous world that's bigger than Red Dead Redemption, GTA IV, and GTA: San Andreas combined. Plus, get the inside story on the three playable characters and learn about their personalities, motivations, and skill-sets.\n\nSet in the sprawling, sun-soaked metropolis of Los Santos, Grand Theft Auto V centres around three very different criminals all plotting and scheming for their own chance of survival and success. Running out of options, Franklin, Michael, and Trevor risk everything in a series of daring and dangerous heists that could set them up for life or send them straight to the slammer.\n\nGTA V is available for XBox360 and PS3 and perfect for fans of this record-breaking game series. Take your game further with Grand Theft Auto Signature Series Guide and BradyGames.","torrent":{"xt":"urn:btih:d721d17f714fa25ea9eb42949a578c710b07ba7b","amp;dn":"GTA+V+Brady+guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d721d17f714fa25ea9eb42949a578c710b07ba7b","infoHashBuffer":{"type":"Buffer","data":[215,33,209,127,113,79,162,94,169,235,66,148,154,87,140,113,11,7,186,123]},"announce":[],"urlList":[]}}