{"title":"Peter Hurley - Illuminating the face","uid":10627788,"size":5604636355,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d8eba5e48868f440e1891b18752db774b5375bf4&amp;dn=Peter+Hurley+-+Illuminating+the+face&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":2,"uploader":"un4b0mb3r","files":3,"time":1406257112,"description":"An Obvious Progression From Peter Hurley's First Tutorial\nIn 2011 Fstoppers teamed up with Peter Hurley to produce the 4 hour video tutorial: The Art Behind The Headshot. Many people have claimed that The Art Behind The Headshot is the single best resource when it comes to coaching your subject and making any person in front of your camera look their best.\n\n4.5 Hours Of Technical Lighting\n3 years later Lee Morris and Patrick Hall from Fstoppers traveled back to NYC once again to create a completely unique 4.5 hour video tutorial named: Illuminating The Face. Peter's first tutorial only touched on the technical aspects of lighting but Illuminating The Face completely focuses on every detail that goes into lighting the human face.\n\nFilmed With 4 Cameras and Proportional Modeling Lights\nPeter and the Fstoppers team spent 3 days planning and testing, and 6 days filming this detailed video. By using flash heads with proportional modeling lights, Peter is able to spend the first 3 hours shooting without strobe which allows you to clearly see every subtle lighting change he makes. The Fstoppers crew recorded the entire process with 4 cameras running simultaneously so that you will be able to see the shoot from every angle, including a video camera that mimics Peter's still camera. Every time Peter moves a light or changes a power setting, you will be able to see that change on the models face.\n\nLighting Modifiers Tested On Male And Female Faces\nFlattering light differs on men and woman and so it was important to have both a male and female model. By using the same models for the entire 6 day shoot, Peter is able to compare images side by side that were taken days apart. You will be able to study these models faces and by the end of the tutorial you will have a completely new outlook on lighting cast on the human face.\n\nLearn Different Genres Of Lighting\nFor the first 3 hours Peter goes over the basics of lighting and individual lighting modifiers. You will be able to compare hard light to umbrellas to softboxes to beauty dishes to ring flashes and other light shaping modifiers. Once you have an understanding of the available tools, Peter designs 6 completely different images using all of the modifiers at his disposal. By the end of this tutorial you should have a solid understanding of classic, beauty, fashion, and edgy lighting.\n\nLearn To See Light\nThis tutorial is not a lesson in camera settings or ratios. Instead of teaching you to mimic light and camera settings, Peter teaches you to see light in a new and detailed way. After watching this tutorial you should be able to view images taken by other photographers and be able to understand exactly how that image was lit simply by looking at the shadow angle, depth, sharpness, falloff, and catch lights. Instead of teaching you to recreate Peter's shots, Peter will teach you how to sculpt the light and notice subtleties so that you can create your own unique images and personal style.","torrent":{"xt":"urn:btih:d8eba5e48868f440e1891b18752db774b5375bf4","amp;dn":"Peter+Hurley+-+Illuminating+the+face","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8eba5e48868f440e1891b18752db774b5375bf4","infoHashBuffer":{"type":"Buffer","data":[216,235,165,228,136,104,244,64,225,137,27,24,117,45,183,116,181,55,91,244]},"announce":[],"urlList":[]}}