{"title":"Best Of Audioslave (Japanese Edition) 2014 ak 6189","uid":11808196,"size":181776286,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d95aec34f616ac6a051d7878c6e3bd77521df8c6&amp;dn=Best+Of+Audioslave+%28Japanese+Edition%29+2014+ak+6189&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":36,"leechers":3,"uploader":"analogkid6103","files":17,"time":1428679762,"description":"\nAudioslave was an American rock supergroup formed in Los Angeles, California, in 2001 and disbanded in 2007. The four-piece band consisted of then-former Soundgarden lead singer/rhythm guitarist Chris Cornell, and then-former Rage Against the Machine members Tom Morello (lead guitar), Tim Commerford (bass/backing vocals), and Brad Wilk (drums). Critics first described Audioslave as an amalgamation of Soundgarden and Rage Against the Machine, but by the band's second album, Out of Exile, it was noted that they had established a separate identity.\nimage\nAudioslave's trademark sound was created by blending 1970s hard rock with 1990s alternative rock. Moreover, Morello incorporated his well-known, unconventional guitar solos into the mix. As with Rage Against the Machine, the band prided themselves on the fact that all sounds on their albums were produced using only guitar, bass, drums, and vocals.\n\nIn its six years of existence, Audioslave released three albums, received three Grammy nominations, and became the first American rock band to perform an open-air concert in Cuba. Audioslave disbanded in February 2007 when Cornell issued a statement announcing that he was permanently leaving the band &quot;due to irresolvable personality conflicts as well as musical differences.&quot; The 2007 Rage Against the Machine reunion and tour involving the rest of the band as well as solo albums released that same year by Morello and Cornell cemented the supergroup's permanent demise.\n\n\n\n\n\n2014 Best Collection (Best Of)\n\n\nTracklist:\n\n01. Set It Off\n\n02. Your Time Has Come\n\n03. Like a Stone\n\n04. The Worm\n\n05. Original Fire\n\n06. Heavens Dead\n\n07. Doesn't Remind Me\n\n08. Be Yourself\n\n09. Shape Of Things To Come\n\n10. I Am the Highway\n\n11. Show Me How to Live\n\n12. Cochise\n\n13. Revelations\n\n14. Until We Fall\n\n15. Gasoline\n\n16. Out Of Exile\n\n17. Moth\n\n\nGenre: Rock\nSubgenre: Alternative Rock\nBitrate: 320 k\nSize: 173.36 MB\nShow/Hide Files:\n17 files\n\n\nAs normal go to the shows and buy the merch,thats the best way to support the artist, all of that money goes to the band. Not to the DMCA\nAlthough it does not apply to this band only the Managers will get any money out it","torrent":{"xt":"urn:btih:d95aec34f616ac6a051d7878c6e3bd77521df8c6","amp;dn":"Best+Of+Audioslave+%28Japanese+Edition%29+2014+ak+6189","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d95aec34f616ac6a051d7878c6e3bd77521df8c6","infoHashBuffer":{"type":"Buffer","data":[217,90,236,52,246,22,172,106,5,29,120,120,198,227,189,119,82,29,248,198]},"announce":[],"urlList":[]}}