{"title":"America's Money Machine: The Story of the Federal Reserve","uid":15789306,"size":648227,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbaf5d92eb0ce31d2f5a743eeb8ae6af69e0bc48&amp;dn=America%27s+Money+Machine%3A+The+Story+of+the+Federal+Reserve&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":0,"uploader":"marty14","files":1,"time":1473370113,"description":"America's Money Machine: The Story of the Federal Reserve - Elgin Groseclose [epub]\r\n\r\nElgin Groseclose, an eminent monetary economist in the 20th century, rips the roof off the Federal Reserve in this wonderful history that takes us from the Fed's founding to the 1960s. He shows that the gap between the promise and the reality is shockingly massive, so much so that the Federal Reserve must be considered one of the greatest failures in the history of public policy. Grosecloses's treatise on the subject contains research unavailable anywhere else. He was meticulous, having spent many years culling through the archives of every institution and person involved with Fed decision making. In case after case, he chronicles the policy failure, and the relentless decline in money's quality from the Fed's inception and forward.\r\n\r\nAs just one example, the opening chapters unearth an editorial from the New York Times, which denounces the idea of the Fed as an example of the &quot;shallow sophistries of (Theodore) Roosevelt Socialism,&quot; and further said that the American people are too intelligent and have too much common sense to put up with a central bank like the Fed. So not only was there opposition to the Fed, it had a voice and its predictions of a coming calamity turned out to be right on. He shows that at no time in its history has the Fed actually achieved what it promised: low inflation, economic stability, stable growth, reliable regulation of the banking system. Groseclose goes further to show that the Fed has generated unrelenting cycles and inflation and been the major fuel for the growth of government - politicizing the whole of American economic life","torrent":{"xt":"urn:btih:dbaf5d92eb0ce31d2f5a743eeb8ae6af69e0bc48","amp;dn":"America%27s+Money+Machine%3A+The+Story+of+the+Federal+Reserve","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbaf5d92eb0ce31d2f5a743eeb8ae6af69e0bc48","infoHashBuffer":{"type":"Buffer","data":[219,175,93,146,235,12,227,29,47,90,116,62,235,138,230,175,105,224,188,72]},"announce":[],"urlList":[]}}