{"title":"Refused- The Shape of Punk to Come (1998)[320kbps]","uid":4978220,"size":147182129,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dbf90f8398b07f42655e3ec0ba92a52c1fe82e7e&amp;dn=Refused-+The+Shape+of+Punk+to+Come+%281998%29%5B320kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":2,"uploader":"KidA91827","files":12,"time":1246122196,"description":"I do not own this music, it is the property of Refused and Burning Heart Records.\n\nThere were problems with the track number tags in the torrent that I uploaded yesterday, so here is a new torrent with corrected track numbers.\n\nTracklist:\n1. Worms Of The Senses / Faculties Of The Skull\n2. Liberation Frequency\n3. The Deadly Rhythm\n4. Summerdays vs. Punkroutine\n5. Bruitist Pome #5\n6. New Noise\n7. The Refused Party Program\n8. Protest Song '68\n9. Refused Are Fuckin' Dead\n10. The Shape Of Punk To Come\n11. TannhÃƒÂ¤user / DerivÃƒÂ¨\n12. The Apollo Programme Was A Hoax\n\nReview from sputnikmusic.com:\n\n&quot;It's pretty creepy isn't it? Refused named their album this and for some strange reason, it came true. Without this album, I'd doubt there would be a lot of what has become post-hardcore. To help you with this for the general reader, post-hardcore is like a modern hardcore sound. I'm not exactly a super-nazi to the genre but I'm getting there. With this album you don't think of it as a great album, it's more a revolution. Refused probably never meant it, they probably just wanted to make a great album that showed their political stands. This album is immense as a musical experience but also as a main influence for today's post-hardcore bands. Refused is what Minor Threat did for the original hardcore. They completely made a new sound which wasn't around at that time taking some influence from their fathers. Warning right now, the album is very political so if you are offended by opinions or you think lyrics should be based on dragons and Satan then stay away right now.\n\nIt is pretty obvious that the band are pretty opinionated because as soon as you open the small booklet which came with the CD then you are suddenly showered with quotes and words that barely anyone on this site would know the meaning to. Refused don't care what other people think, they are their own minds by not getting influenced by any outside sources. They really stick to their guns here. When this type of music comes around then the gentle minds of today's youth will lap up the lyrics and their opinions which is amazing considering that a lot of music today doesn't really speak to young ones. That was how big this album is but at this point it seems I'm repeating myself and ranting off-topic'.\n\nThe band originated from Sweden and though they did create a new sound, they never really had a full life with only 2 CD's and a DVD. This one is more about post-hardcore while the one before this was a raw hardcore album. One thing you might find strange is the synths in the songs. They use it in breakdowns or anywhere they feel is necessary. I even remember a fellow Mxer calling the band industrial hardcore. I'm not making fun or anything but this could be true in some ways. The synths do play a big part which is common in industrial and there is no denying this is a hardcore album. So yeah, this could be true but they were so much more than putting them into a specific genre. Every time I listen to this, I get a weird tingly feeling. Every time I put the next track on I think, 'I love this song so much'. If you are a hardcore fan then I'm sure you're the same.\n\nWhile the band used their minds 50% of the time, the other 50% belongs to what they can do with their fingers and their voice box. Dennis is a terrific vocalist but what probably turns people off the band is the vocals. Dennis has a very strong scream, not some low growling scream but a high one. It's true to say, without Dennis, the Refused wouldn't be the same. His mastermind lyrics and his vocals to scream the word into you are a major part of what they had but it'd be pretty unfair to say Dennis was the band as I don't think they'd be the same without any band member to be honest. The guitars are pretty simple to the metal guitarist but they without a doubt work. The distortion is up full blast and it is pretty simple parts and riffs here and there, on paper it doesn't seem that exciting but oh boy, it does.\n\n&quot;Faces like angels, licking our fingertips\nWe don't have the patience to deal with it\nWith battered bodies &amp; puckered lips\nWe don't have the patience to deal with it. Yeah!&quot;\n\nSo we have the vocals and the guitars but what's next on our 'Describe The Instruments 4000'? Why none other than the drums which don't do fills but they are powerful and as the featured album blurb says, 'It's like throwing a brick out of the Empire state building'. I couldn't have said it better myself. The drums sound like they are battered the hell out them. They provide some good beats and rhythm and don't go to the point where he's showing off. The bass is chunky and clean, it is quite clear when you're listening to it and I'd recommend some intermediate or even some beginner bassists to try some of the songs out. We have the basic band set-up but Refused had to take one step more again. There is cellos, violins, tambourines, double bass and the usual synths. It is really crazy however there is always the usual band members playing them which has the theory the band are real musicians.\n\nEvery song is vital in the making of this album but I feel that some stand out more than others. From when I first heard the album, Worms of the Senses never really stood out to me and even now I don't really listen to the track but the second track Liberation Frequency grabbed me the moment it came on. It starts with a clean guitar part with Dennis not screaming for a change and then it goes into chaos until changing back to the quiet part which sounds like they recorded it in mono. That sounds bad but that improves the song loads I think. Halfway through it might seem to be repeating but I assure you it's supposed to be like that. Anyone that's heard the Refused is probably because of New Noise which takes ambient noises and heavy as hell parts and creates it into a 5 minute digestible song. It starts with some palm-muting on the G string and then it has a massive build-up only to trick the listener by playing with the synths again. Dennis then shouts, 'Can I scream?' Of course you can Dennis, do you really need to ask us that in your song? The song has various pseudo build ups and breakdowns until the almighty climax comes in. It is one of the most breath-taking experience in my life.\n\nTo be honest, I could go through every song and say how great it is but I recommend those I mentioned. I also recommend The Shape of Punk To Come, The Refused Are F***ing Dead and Protest Song '68. This is not for the mainstream listener but if you are open-minded then this could be the best decision of your life buying this. You shouldn't really need a review telling you how great this album is because it should already be in your collection and if not then shame on you. This is a modern classic so get this, I don't care how. Buy it, download it, borrow it off a friend etc. just get a hold of it some way as it could be the album you've been waiting for and indeed it is.&quot;\n &lt;a href=&quot;\nhttp://www.sputnikmusic.com/album.php?reviewid=6526&amp;genreid=3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sputnikmusic.com/album.php?reviewid=6526&amp;genreid=3&lt;/a&gt;\n\n\nYou guys better seed this, so the rest of us can hear this legendary album.\n\n\nFor more great music, check out my blog:","torrent":{"xt":"urn:btih:dbf90f8398b07f42655e3ec0ba92a52c1fe82e7e","amp;dn":"Refused-+The+Shape+of+Punk+to+Come+%281998%29%5B320kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbf90f8398b07f42655e3ec0ba92a52c1fe82e7e","infoHashBuffer":{"type":"Buffer","data":[219,249,15,131,152,176,127,66,101,94,62,192,186,146,165,44,31,232,46,126]},"announce":[],"urlList":[]}}