{"title":"ProShow Styles Complete Pack","uid":8858691,"size":1809237857,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:dc0881029d6e892a67bb6bc57e26038d14aadfe1&amp;dn=ProShow+Styles+Complete+Pack+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":2,"uploader":"xenneox","files":-1,"time":1377722754,"description":"ProShow Styles Complete Pack - this set of styles and transitions to create beautiful presentations with your photos and video. Include: ProShow StylePack Volume 1-4, ProShow Transition Pack, ProShow Styles Escapes, ProShow Styles Grunge, ProShow Styles Vintage, ProShow StylePack Weddings.\n\nProShow StylePack Volume 1 - ProShow StylePack 1 provides you with dozens of high-quality Slide Styles.\nProShow StylePack Volume 2 - add a sophisticated and contemporary twist to your shows with ProShow StylePack 2. Created for ProShow Producer and ProShow Web users, this volume features a diverse collection of 25 high-impact, pre-designed Styles. \nProShow StylePack Volume 3 - without skipping a beat, ProShow StylePack Volume 3 picks up right where Volume 2 left off, featuring 25 all-new and amazing Slide Styles for ProShow Producer and ProShow Web, each one guaranteed to impress.\nProShow Styles Volume 4 - 25 styles will add glitter and glamor of the images, while maintaining attention to the pictures.\nProShow Transition Pack Volume 1 - go beyond the simple crossfade with the 25 new transitions available in Transition Pack 1. Explore new and exciting effects like Clouds, Smoke and Paper Tear. Add an artistic flair to your shows with Ink Splatter, Brushstrokes and Color Wheel. \nProShow Styles Escapes - 25 styles will help you process photos taken on trips and on vacation.\nProShow Styles Grunge - 25 sheets give effect to your photos, accented on the look on his face.\nProShow StylePack Weddings - capture the emotion of love, romance and wedding photography with 25 sets of layouts and effects. Weddings is perfect for wedding videos, anniversaries, romantic holidays, or any show about love and romance.\n","torrent":{"xt":"urn:btih:dc0881029d6e892a67bb6bc57e26038d14aadfe1","amp;dn":"ProShow+Styles+Complete+Pack+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc0881029d6e892a67bb6bc57e26038d14aadfe1","infoHashBuffer":{"type":"Buffer","data":[220,8,129,2,157,110,137,42,103,187,107,197,126,38,3,141,20,170,223,225]},"announce":[],"urlList":[]}}