{"title":"My Dinner with Andre","uid":5415359,"size":850091319,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dc891503ef4968ddfc7dcaac2c1355f04e47fb69&amp;dn=My+Dinner+with+Andre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":4,"uploader":"scottielass","files":4,"time":1267898295,"description":"My Dinner with Andre\n1981\nVideo Capture from DVR recording\n110 min\nVideo: Xvid 866 kbs 720x480\nAudio: 44.1kHz 128 kbps CBR\n\nIMDB  &lt;a href=&quot;\nhttp://imdb.com/title/tt0082783&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0082783&lt;/a&gt;\nWallace Shawn and Andre Gregory, apparently playing themselves, share their lives over the course of an evening meal at a restaurant. Gregory, a theater director from New York, is the more talkative of the pair. He relates to Shawn his tales of dropping out, traveling around the world, and experiencing the variety of ways people live, such as a monk who could balance his entire weight on his fingertips. Shawn listens avidly, but questions the value of Gregory's seeming abandonment of the pragmatic aspects of life. Written by Rick Gregory \n\nRoger Ebert &lt;a href=&quot;\nhttp://rogerebert.suntimes.com/apps/pbcs.dll/article?AID=/19990613/REVIEWS08/906130301/1023&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://rogerebert.suntimes.com/apps/pbcs.dll/article?AID=/19990613/REVIEWS08/906130301/1023&lt;/a&gt;\nSomeone asked me the other day if I could name a movie that was entirely devoid of cliches. I thought for a moment, and then answered, &quot;My Dinner With Andre.&quot; Now I have seen the movie again; a restored print is going into release around the country, and I am impressed once more by how wonderfully odd this movie is, how there is nothing else like it. It should be unwatchable, and yet those who love it return time and again, enchanted.\n\n\nAmazon.com\nThe sheer audacity of My Dinner with Andre drew throngs of curious filmgoers who made the film the most talked-about art-house hit of 1981. After all, who'd ever heard of a movie consisting of nearly two hours of nonstop dinner conversation? Ah... but this isn't just any conversation--it's the kind of mesmerizing, soul-searching, life-affirming exploration that we feel privileged to listen to, and with unobtrusive style, director Louis Malle invites us to eavesdrop to our hearts' and minds' content. The film was written by two New Yorkers at the dinner table, noted playwright-actor Wallace Shawn and well-known stage director Andre Gregory, who essentially play themselves. They taped their conversations for several weeks and Shawn gradually shaped them into a scripted conversation, but you'd never know it from watching the movie. The talk flows and flows until you're captivated by Gregory's stories of world travel and spiritual quests in Poland, India, Tibet, the Sahara desert... the tales of a soul-searcher who'd dropped out of the theater world to rediscover his zest for living. Shawn plays the skeptic, the voice of reason, his feet on the ground but his own mind willing to soar. The cumulative effect of this conversation is almost hypnotic, and certainly plays into our eternal appetite for storytelling. Both primal and sophisticated, witty and profound, My Dinner with Andre is a film that can be savored over time, offering new revelations with each viewing as the listener-viewer develops his or her own appreciation of life's great mysteries. --Jeff Shannon ","torrent":{"xt":"urn:btih:dc891503ef4968ddfc7dcaac2c1355f04e47fb69","amp;dn":"My+Dinner+with+Andre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc891503ef4968ddfc7dcaac2c1355f04e47fb69","infoHashBuffer":{"type":"Buffer","data":[220,137,21,3,239,73,104,221,252,125,202,172,44,19,85,240,78,71,251,105]},"announce":[],"urlList":[]}}