{"title":"A Tribe Called Quest - Discography 1990-2008 [FLAC]","uid":10590172,"size":4476851769,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dcd8d6f5cf65aa88b87ba85d07dad7ca9a0f931e&amp;dn=A+Tribe+Called+Quest+-+Discography+1990-2008+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":14,"uploader":"rudown78","files":338,"time":1405789064,"description":"A Tribe Called Quest - Discography 1990-2008 [FLAC]\n\n\nWithout question the most intelligent, artistic rap group during the 1990s, A Tribe Called Quest jump-started and perfected the hip-hop alternative to hardcore and gangsta rap. In essence, they abandoned the macho posturing rap music had been constructed upon, and focused instead on abstract philosophy and message tracks. The &quot;sucka MC&quot; theme had never been completely ignored in hip-hop, but Tribe confronted numerous black issues -- date rape, use of the word nigger, the trials and tribulations of the rap industry -- all of which overpowered the occasional game of the dozens. Just as powerful musically, Quest built upon De La Soul's jazz-rap revolution, basing tracks around laid-back samples instead of the played-out James Brown-fests which many rappers had made a cottage industry by the late '80s. Comprised of Q-Tip, Ali Shaheed Muhammad, and Phife, A Tribe Called Quest debuted in 1989 and released their debut album one year later. Second album The Low End Theory was, quite simply, the most consistent and flowing hip-hop album ever recorded, though the trio moved closer to their harder contemporaries on 1993's Midnight Marauders. A spot on the 1994 Lollapalooza Tour showed their influence with the alternative crowd -- always a bedrock of A Tribe Called Quest's support -- but the group kept it real on 1996's Beats, Rhymes and Life, a dedication to the streets and the hip-hop underground.\n\nA Tribe Called Quest was formed in 1988, though both Q-Tip (b. Jonathan Davis) and Phife (b. Malik Taylor) had grown up together in Queens. Q-Tip met DJ Ali Shaheed Muhammad while at high school and, after being named by the Jungle Brothers (who attended the same school), the trio began performing. A Tribe Called Quest's recording debut came in August 1989, when their single, &quot;Description of a Fool,&quot; appeared on a tiny area label (though Q-Tip had previously guested on several tracks from De La Soul's 3 Feet High and Rising and later appeared on Deee-Lite's &quot;Groove Is in the Heart&quot;).\n\nSigned to Jive Records by 1989, A Tribe Called Quest released their first album, People's Instinctive Travels and the Paths of Rhythm, one year later. Much like De La Soul, Tribe looked more to jazz as well as '70s rock for their sample base -- &quot;Can I Kick It?&quot; plundered Lou Reed's classic &quot;Walk on the Wild Side&quot; and made it viable in a hip-hop context. No matter how solid their debut was, second album The Low End Theory outdid all expectations and has held up as perhaps the best hip-hop LP of all time.\n\nThe Low End Theory had included several tracks with props to hip-hop friends, and A Tribe Called Quest cemented their support of the rap community with 1993's Midnight Marauders. The album cover and booklet insert included the faces of more than 50 rappers -- including obvious choices such as De La Soul and the Jungle Brothers -- as well as mild surprises like the Beastie Boys, Ice-T, and Heavy D. Though impossible to trump Low End's brilliance, the LP offered several classics (including Tribe's most infectious single to date, &quot;Award Tour&quot;) and a harder sound than the first two albums. During the summer of 1994, A Tribe Called Quest toured as the obligatory rap act on the Lollapalooza Festival lineup, and spent a quiet 1995, marked only by several production jobs for Q-Tip. Returning in 1996 with their fourth LP, Beats, Rhymes and Life, Tribe showed signs of wear; it was a good album, but proved less striking than The Low End Theory or Midnight Marauders. While touring in support of 1998's The Love Movement, the group announced their impending breakup.\n\n\n1990 - People's Instinctive Travels and the Paths of Rhythm\n1990 - Can I Kick It? [CD-Single]\n1991 - The Low End Theory\n1992 - Revised Quest for the Seasoned Traveller\n1993 - Midnight Marauders\n1994 - Oh My God [Maxi-Single]\n1996 - 1nce Again [Maxi-Single]\n1996 - Beats, Rhymes and Life\n1996 - Stressed Out [Maxi-Single]\n1998 - The Love Movement [2-CD Limited Edition]\n1999 - The Anthology [with Bonus Disc]\n2003 - Hits, Rarities &amp; Remixes\n2008 - The Best of A Tribe Called Quest\n\n\nAlbum artwork, rip logs and cue sheets are included. Enjoy!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:dcd8d6f5cf65aa88b87ba85d07dad7ca9a0f931e","amp;dn":"A+Tribe+Called+Quest+-+Discography+1990-2008+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcd8d6f5cf65aa88b87ba85d07dad7ca9a0f931e","infoHashBuffer":{"type":"Buffer","data":[220,216,214,245,207,101,170,136,184,123,168,93,7,218,215,202,154,15,147,30]},"announce":[],"urlList":[]}}