{"title":"China's Cosmological Prehistory: Science Encoded in Symbols","uid":15891759,"size":2013086,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd5dc3b0add458d123f7270b0c184cd0a7b308cd&amp;dn=China%27s+Cosmological+Prehistory%3A+Science+Encoded+in+Symbols&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":1,"uploader":"marty14","files":1,"time":1474761197,"description":"China's Cosmological Prehistory: The Sophisticated Science Encoded in Civilization's Earliest Symbols - Laird Scranton [epub]\r\n\r\nBuilding on his extensive research into the sacred symbols and creation myths of the Dogon of Africa and those of ancient Egypt, India, and Tibet, Laird Scranton investigates the myths, symbols, and traditions of prehistoric China, providing further evidence that the cosmology of all ancient cultures arose from a single now-lost source. \r\n\r\nScranton explores the fundamental similarities between the language that defined ancient Chinese cosmology and that of other creation traditions, revealing the connections between the phonetic structure of the words, their glyphs, and their use. He demonstrates striking parallels between the earliest systems of writing in China and the hieroglyphs of ancient Egypt. He examines the 8 levels of creation in Taoism and the cosmological origins of Chinese ancestor worship, mythical emperors, the zodiac, the mandala, and the I Ching. He details the fundamental principles of land-use in ancient China in relation to the symbolism of a Buddhist stupa and the Dogon granary, ritual shrines that are also the central symbol of other creation traditions. Understanding the true meanings of these symbol complexes also reveals the sophisticated scientific understanding of these ancient cultures, for these creation symbols directly correlate with our modern understanding of atoms and the energetic makeup of matter. \r\n\r\nIn exploring Chinese cosmological traditions, Scranton sheds new light on the contention that the sacred knowledge of the ancients is the legacy of an earlier culture who gave primitive humanity the tools they needed to birth the first known civilizations","torrent":{"xt":"urn:btih:dd5dc3b0add458d123f7270b0c184cd0a7b308cd","amp;dn":"China%27s+Cosmological+Prehistory%3A+Science+Encoded+in+Symbols","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd5dc3b0add458d123f7270b0c184cd0a7b308cd","infoHashBuffer":{"type":"Buffer","data":[221,93,195,176,173,212,88,209,35,247,39,11,12,24,76,208,167,179,8,205]},"announce":[],"urlList":[]}}