{"title":"HuniePop 64bit Windows PC","uid":11673532,"size":315502773,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dd8f6d19dc4be134b804e118d201ceeb6f3f261a&amp;dn=HuniePop+64bit+Windows+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":2,"uploader":"jibbajabbax","files":1,"time":1422747579,"description":"HuniePop is a unique sim experience for PC, Mac and Linux. It's a gameplay first approach that's part dating sim, part puzzle game, with light RPG elements, a visual novel style of presentation, an abrasive western writing style and plenty of &quot;plot&quot;. \n\nAfter a pathetic attempt to try and pick up Kyu, a magic love fairy in disguise, she decides to take you under her wing and help you out with your crippling inability to meet new women. After a few dating lessons and some sound advice, Kyu sends you out into the world ready to take on the dating world and a wide cast of beautiful babes. \n\n* 8 gorgeous girls each with their own personalities, preferences and style. (Rumor has it there are several secret characters to unlock as well!) \n\n* More than 20 in-game locations each with beautiful hand painted environment art and many with full day/night cycles. \n\n* Over 250 unique items (food, drinks, gifts, accessories) that you can purchase, unlock, collect and give as gifts. \n\n* A beautifully composed soundtrack containing over 20 tracks of original music inspired by eastern pop, jazz and bossa nova melodies. \n\n* Thousands of lines of dialog, fully and professionally voice acted, complete with a unique character lip-syncing system. \n\n* Customize girls' appearances with unlockable outfits and hairstyles! The girls will also dress up for dates! (Or dress down afterwards...) \n\n* Collect nearly 50 stunning CG photos depicting the girls in various scenarios, including steamy bedroom scenes. \n\n* An addicting match-3 style puzzle dating system with it's own unique twists including upgradeable traits/stats, the ability to move any number of positions and special date gifts that have a variety of interesting effects on the puzzle.\n\n------------------------------------------------------------------------------\n\nSomeone already sent this here, but I dunno about his copy, or what the deal is with the 'texture pack' and 'other resources'.  I bought this game on Steam and this RAR file contains every single thing I got w/ my Steam game, with two differences.  First off, the EXE file is modified (cracked).  So you simply unrar and play.\n\nMalware Bytes dtects nothing and Virus Total comes up with 0/57.\n &lt;a href=&quot;\nhttps://www.virustotal.com/en/file/9aaa5cccc67cdc803ecb485a74a21e842cd4704d4d5f547b711576496ff965cc/analysis/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.virustotal.com/en/file/9aaa5cccc67cdc803ecb485a74a21e842cd4704d4d5f547b711576496ff965cc/analysis/&lt;/a&gt;\n\nThe other difference is that the huniepop_uncensored_patch.game file is included in the root HuniePop directory.  This is a 0 byte file that makes the game 'uncensored'.  You can read about it here: \n\n\nIf you don't want it uncensored, simply remove that file.\n\nI bought this game on Steam because I knew it'd be profitable with the steam trading cards + gems, but I was surprised ... that it's actually a fun(ny) game.  Esp. if you're drunk or high.\n\nMy personal screenshots:\n &lt;a href=&quot;\nhttp://cloud-4.steamusercontent.com/ugc/548645741806951297/76683A078640EE9A9E43047A36EB3FD692085697/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cloud-4.steamusercontent.com/ugc/548645741806951297/76683A078640EE9A9E43047A36EB3FD692085697/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://cloud-4.steamusercontent.com/ugc/548645741806946667/8E70CC62D3F7E0113E0D89B1F6582D1119308A60/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cloud-4.steamusercontent.com/ugc/548645741806946667/8E70CC62D3F7E0113E0D89B1F6582D1119308A60/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://cloud-4.steamusercontent.com/ugc/548645741809745175/C163905C808E4DBD7BA63CA97C0D613AB14DFD1C/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cloud-4.steamusercontent.com/ugc/548645741809745175/C163905C808E4DBD7BA63CA97C0D613AB14DFD1C/&lt;/a&gt;\n\nThe game aspect of it is very similar to bejeweled.  It also gets really, really hard later on in the game.  Either that, or I had had too much to drink, I dunno.  I haven't had a chance to get back to it yet.\n\nI RAR'ed it up myself with some super old version of RAR, so don't need RAR v5+ to unrar.  Archive size is a little bigger but w/e.\n\nI don't consider this a 'porn game' even w/ the uncensored version, so just including it under PC Games.  Again, if you're that concerned about it, just delete that 0 byte file","torrent":{"xt":"urn:btih:dd8f6d19dc4be134b804e118d201ceeb6f3f261a","amp;dn":"HuniePop+64bit+Windows+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd8f6d19dc4be134b804e118d201ceeb6f3f261a","infoHashBuffer":{"type":"Buffer","data":[221,143,109,25,220,75,225,52,184,4,225,24,210,1,206,235,111,63,38,26]},"announce":[],"urlList":[]}}