{"title":"Dark History of the Popes","uid":15802136,"size":18380991,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de24e5196f06b4841ae18511f5ab15d33b357068&amp;dn=Dark+History+of+the+Popes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":0,"uploader":"marty14","files":1,"time":1473519221,"description":"Dark History of the Popes: Vice, Murder and Corruption in the Vatican - Brenda Ralph Lewis [epub]\r\n\r\nIn the 10th century, being head of the Catholic Church didn’t stop Pope John XII from allegedly committing incest with his sisters, calling on pagan gods and goddesses, being an alcoholic and putting his mistress in charge of his brothel. Of course, being pope didn’t make popes popular either: in 896AD, Pope Formosus died, but that was no obstacle to Lambert of Spoleto, who bore something of a grudge, in exhuming the pontiff and putting him on trial. Formosus was found guilty of being unworthy of his papal office, had all his acts annulled and his body was thrown in the Tiber.\r\n\r\nFrom corruption to nepotism, from crusade to witch-burning to Inquisition, from popes sanctioning murder to popes being murdered, Dark History of The Popes explores more than 1000 years of sinister deeds surrounding the papacy. Ranging from the 9th century AD to Pope Pius XII’s position during World War II, the book examines political, religious and social history through the skulduggery of popes and courtiers, the role the Borgias family played in the papacy, the persecution of Jews and the religious controversy over Galileo Galilei’s heretical views, among other topics. Using diaries, letters, reports from foreign ambassadors to the Vatican and official registers of the ecclesiastical courts, a picture of both sinning and sinned against popes is revealed. Packed with more than 200 colour and black-&amp;-white photographs, paintings and artworks, Dark History of The Popes is an eye-opening account of the history of the papacy that pontiffs would rather not mention","torrent":{"xt":"urn:btih:de24e5196f06b4841ae18511f5ab15d33b357068","amp;dn":"Dark+History+of+the+Popes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de24e5196f06b4841ae18511f5ab15d33b357068","infoHashBuffer":{"type":"Buffer","data":[222,36,229,25,111,6,180,132,26,225,133,17,245,171,21,211,59,53,112,104]},"announce":[],"urlList":[]}}