{"title":"Beginning JavaScript [5th Edition] - Jeremy McPeak","uid":11914963,"size":14825425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de6418660a533b55b20984d8a580d933b06ab5eb&amp;dn=Beginning+JavaScript+%5B5th+Edition%5D+-+Jeremy+McPeak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1431478308,"description":"Beginning JavaScript 5th Edition shows you how to work effectively with JavaScript frameworks, functions, and modern browsers, and teaches more effective coding practices using HTML5. This new edition has been extensively updated to reflect the way JavaScript is most commonly used today, introducing you to the latest tools and techniques available to JavaScript developers. Coverage includes modern coding practices using HTML5 markup, the JSON data format, DOM APIs, the jQuery framework, and more. Exercises with solutions provide plenty of opportunity to practice, and the companion website offers downloadable code for all examples given in the book.\n\nLearn JavaScript using the most up to date coding style\nUnderstand JSON, functions, events, and feature detection\nUtilize the new HTML5 elements and the related API\nExplore new features including geolocation, local storage, and more\nJavaScript has shaped the Web from a passive medium into one that is rich, dynamic, and interactive. No matter the technology on the server side, it's JavaScript that makes it come alive in the browser. To learn JavaScript the way it's used today, Beginning JavaScript, 5th Edition is your concise guide","torrent":{"xt":"urn:btih:de6418660a533b55b20984d8a580d933b06ab5eb","amp;dn":"Beginning+JavaScript+%5B5th+Edition%5D+-+Jeremy+McPeak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de6418660a533b55b20984d8a580d933b06ab5eb","infoHashBuffer":{"type":"Buffer","data":[222,100,24,102,10,83,59,85,178,9,132,216,165,128,217,51,176,106,181,235]},"announce":[],"urlList":[]}}