{"title":"Alien Skin Bokeh 2.0.1.493  (32 - 64 bit) [ChingLiu]","uid":9044378,"size":58968090,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:de827c87ad0342bf81f07ef521eb1dab13c539bc&amp;dn=Alien+Skin+Bokeh+2.0.1.493++%2832+-+64+bit%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":0,"uploader":"Ching_Liu","files":-1,"time":1381710326,"description":"Bokeh 2 provides a wide range of creative focus effects and accurate lens simulation in a simple interface. Photographers use Bokeh to draw attention to their subject by manipulating focus, vignette, and depth of field. \n\nBokeh gives you the visual language of specialized lenses without the expense or hassle. Just drop a focus region over your subject and choose a preset or easily craft your own look.\n\nBokeh 2 is dramatically faster, has multiple focus regions, motion blur, and a more flexible vignette.\n\nFeatures\n\nSpeed! - Bokeh sports a super-fast user interface that gives you real-time feedback as you change any control. Bokeh takes advantage of multiple processors and multiple cores in order to run fast on modern computers. \n\nPhotoshop CC 64-bit Support - Bokeh 2 works great with the 64-bit version of Photoshop CS5 on both Macintosh and Windows. This gives Bokeh access to more memory and a speed boost.\n\nLightroom Support - Bokeh 2 now works in Adobe Lightroom 2 or newer. Our method of tight Lightroom integration provides batch processing and does not require Photoshop to be installed\n\nCreative Lens Optics - Bokeh 2 provides many more lens simulation capabilities, including the simulation of motion-like optics found in specialized tilt-shift lenses. Bokeh 2 also simulates traditional fast lenses and also allows you to easily create artistic aperture shapes. \n\nRealistic Depth-Of-Field Simulation - Bokeh allows you to turn an f/22 shot into an f/1 by applying that smooth creamy blur only found in high-end fast lenses. \n\nAperture Creative Aperture - Create realistic or fanciful shapes in the highlights of your photographs.\n\nMultiple Regions - Bokeh allows you combine multiple radial and planar shapes for more control over your focus region. \n\nGrain Matching - When Bokeh is applied to a grainy photo, the blurring process will remove the existing grain structure of the image. The grain matching features allow you to replace the missing grain. \n\nVignette Enhancements - In addition to the darkening vignetting effect, Bokeh also provides a bleaching (desaturation) control to remove color in the vignette area. It also has the ability to apply the vignette to an area independent of the blur area. \n\nSettings Enhancements - Bokeh comes with a slew of new factory presets to help you get great results fast. These presets are grouped into meaningful categories and you can combine presets from different groups to create your own customized effect. \n\nNon-Destructive Editing - Bokeh supports a non-destructive workflow, making experimentation easy. Effects in Photoshop are rendered on a new layer, leaving your original image untouched. In Photoshop, Bokeh can be run as a Smart Filter for easy tweaking of the effect after it is created. \n\nSystem Requirements \n\n- Intel Pentium 4 processor (or compatible) \n- Windows XP SP3 or newer\n- 1024x768 or greater monitor resolution\n\nHost Requirements\n\nThis product requires one of the following host applications: \n- Adobe Photoshop CS3 or newer\n- Adobe Lightroom 2 or newer\n- Adobe Photoshop Elements 7 or newer\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.alienskin.com/bokeh/index.aspx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.alienskin.com/bokeh/index.aspx&lt;/a&gt;","torrent":{"xt":"urn:btih:de827c87ad0342bf81f07ef521eb1dab13c539bc","amp;dn":"Alien+Skin+Bokeh+2.0.1.493++%2832+-+64+bit%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de827c87ad0342bf81f07ef521eb1dab13c539bc","infoHashBuffer":{"type":"Buffer","data":[222,130,124,135,173,3,66,191,129,240,126,245,33,235,29,171,19,197,57,188]},"announce":[],"urlList":[]}}