{"title":"Milan Kundera - The Unbearable Lightness of Being (pdf)","uid":8544309,"size":2190822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dea1696da1b989e5d5a8d0dd673847b3a234f2df&amp;dn=Milan+Kundera+-+The+Unbearable+Lightness+of+Being+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":2,"uploader":"pharmakate","files":-1,"time":1370481811,"description":"Milan Kundera - The Unbearable Lightness of Being (Harper and Row, 1984). 314 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nI haven't been able to find a good quality version of this book, so here's a new scan.\n\n\n&quot;A meditation on life, on the erotic, on the nature of men and women and love . . . full of telling details, truths large and small.&quot; -- People\n\nReview\n\nNovel by Milan Kundera, first published in 1984 in an English translation and in a French translation as L'Insoutenable Legerete de l'etre. In 1985 the work was published in the original Czech as Nesnesitelna lehkost byti, but it was banned in Czechoslovakia until 1989. Set against the background of Czechoslovakia in the 1960s, the novel concerns a young Czech physician who substitutes a series of erotic adventures over which he thinks he can maintain control for becoming involved in his country's politics, where he feels he can have no power or freedom. Inevitably, he is drawn into Czechoslovakia's political unrest. In a parallel vein, he is forced to choose among the women with whom he is involved. -- The Merriam-Webster Encyclopedia of Literature\n","torrent":{"xt":"urn:btih:dea1696da1b989e5d5a8d0dd673847b3a234f2df","amp;dn":"Milan+Kundera+-+The+Unbearable+Lightness+of+Being+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dea1696da1b989e5d5a8d0dd673847b3a234f2df","infoHashBuffer":{"type":"Buffer","data":[222,161,105,109,161,185,137,229,213,168,208,221,103,56,71,179,162,52,242,223]},"announce":[],"urlList":[]}}