{"title":"Getting Things Done: The Art of Stress-Free Productivity-Mantesh","uid":6177279,"size":5816871,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df75261489298d6143546f87bf2615790287d5a9&amp;dn=Getting+Things+Done%3A+The+Art+of+Stress-Free+Productivity-Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":0,"uploader":"MANTESH","files":3,"time":1297813453,"description":" &lt;a href=&quot;http://img13.imageshack.us/img13/2402/0142000280.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img13.imageshack.us/img13/2402/0142000280.jpg&lt;/a&gt;\n\n\n\n\n\n\n\nGetting Things Done: The Art of Stress-Free Productivity\n\n\nPublisher: Penguin \nDavid Allen\nISBN: 0142000280\nENGLISH\n2002 \nPDF \n267 pages \n5.54 MB\n\n\n\nWith first-chapter allusions to martial arts, &quot;flow,&quot; &quot;mind like water,&quot; and other concepts borrowed from the East (and usually mangled), you'd almost think this self-helper from David Allen should have been called Zen and the Art of Schedule Maintenance.\n\nNot quite. Yes, Getting Things Done offers a complete system for downloading all those free-floating gotta-do's clogging your brain into a sophisticated framework of files and action lists--all purportedly to free your mind to focus on whatever you're working on. However, it still operates from the decidedly Western notion that if we could just get really, really organized, we could turn ourselves into 24/7 productivity machines. (To wit, Allen, whom the New Economy bible Fast Company has dubbed &quot;the personal productivity guru,&quot; suggests that instead of meditating on crouching tigers and hidden dragons while you wait for a plane, you should unsheathe that high-tech saber known as the cell phone and attack that list of calls you need to return.)\n\nAs whole-life-organizing systems go, Allen's is pretty good, even fun and therapeutic. It starts with the exhortation to take every unaccounted-for scrap of paper in your workstation that you can't junk, The next step is to write down every unaccounted-for gotta-do cramming your head onto its own scrap of paper. Finally, throw the whole stew into a giant &quot;in-basket&quot;\n\nThat's where the processing and prioritizing begin; in Allen's system, it get a little convoluted at times, rife as it is with fancy terms, subterms, and sub-subterms for even the simplest concepts. Thank goodness the spine of his system is captured on a straightforward, one-page flowchart that you can pin over your desk and repeatedly consult without having to refer back to the book. That alone is worth the purchase price. Also of value is Allen's ingenious Two-Minute Rule: if there's anything you absolutely must do that you can do right now in two minutes or less, then do it now, thus freeing up your time and mind tenfold over the long term. It's commonsense advice so obvious that most of us completely overlook it, much to our detriment; Allen excels at dispensing such wisdom in this useful, if somewhat belabored, self-improver aimed at everyone from CEOs to soccer moms (who we all know are more organized than most CEOs to start with)\n\n\n\n","torrent":{"xt":"urn:btih:df75261489298d6143546f87bf2615790287d5a9","amp;dn":"Getting+Things+Done%3A+The+Art+of+Stress-Free+Productivity-Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df75261489298d6143546f87bf2615790287d5a9","infoHashBuffer":{"type":"Buffer","data":[223,117,38,20,137,41,141,97,67,84,111,135,191,38,21,121,2,135,213,169]},"announce":[],"urlList":[]}}