{"title":"FSX Wilco A380 V2 - Retail (B-H)","uid":4250340,"size":87964597,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dfad7a9ba19817c358abf014729a86187ecb4609&amp;dn=FSX+Wilco+A380+V2+-+Retail+%28B-H%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":1,"uploader":"bone-hunter","files":1,"time":1213978231,"description":"Wilco Airbus A380 V2 for FSX\n &lt;a href=&quot;\nhttp://www.wilcopub.com/index.cfm?fuseaction=prod_380&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.wilcopub.com/index.cfm?fuseaction=prod_380&lt;/a&gt;\n\nInstaller + Serial\n\n\n\nMission description (for FSX)\n\nTOULOUSE - April 27, 2005.\n\nThe newly constructed A380 is rolled out of its hangar for its maiden test flight. \nAirport and Airbus staff have joined government officials and members of the public to see the flight off.\n\nAs Official Test Pilot, you will embark your A380 for a 60 minutes Maiden Flight.\nAfter a (hopefully) successful take-off from Toulouse Blagnac, you will be asked to execute a smooth touch-and-go in Spain, over majestic Pyrenees mountains and &amp;#039;hollywood-type&amp;#039; cinematics sequences. During the flight, ground engineers will ask you to perform in-flight tests over beautiful landscapes and the Atlantic ocean. Then, you will be directed to the factory home base so that the test sensor data can be offloaded.\n\nThis Flight Simulator X mission, supplied in different complexity levels, allow beginner and expert pilots alike to train through a step-by-step tutorial, from cold and dark cockpit to full kiss landing. The missions feature English voices and subtitles displayed in English, German or French.\n\nAircraft Features (for FSX)\n\nHighly detailed replica of the Airbus A380 \nFlight Simulator X only : Jetways connection animations. \nNEW : Three realism levels available: beginner, intermediate and expert. Beginner users won&amp;#039;t have to read tons of documentation to fly, intermediate users will have more realism while enjoying some FS &quot;shortcuts&quot;, while expert users will have to follow actual procedures. \nFlight Simulator X Viewpoints : Gear, Wing, Belly, Cabin, ... \n3DSMax exterior/interior models with high resolution reflectives textures, dynamic shine, realistic night lighting,... \nNumerous international liveries : Airbus livery - Air France - British Airways - China Southern Airlines - Emirates - Etihad Airways - Korean Air Lines - Lufthansa - Qantas Airways - Singapore Airlines - Virgin Atlantic Airways. \nOutstanding 3D Cabin : luxury First Class, economy class, sleeper cabins,... \nUltra realistic digital &amp;#039;FLY-BY-WIRE&amp;#039; technology. \nReal simulation from complete Cold &amp; Dark cockpit to full auto landing. \nReal cabin crew announcements ! \nNumerous sound effects \nFlexible wings \nNumerous animations : hydraulic suspension, flaps, slats, spoilerons, speed brakes, thrust reversers, passengers door, cargo hatches, ... \nFrame-rate friendly \nEasy-to-use Paint Kit to create your own airline and share them on the net (Photoshop required). \nMcPhat textures here \nPanel Features (for FSX)\n\nGlass cockpit with advanced digital avionics, CAT II and III landing certification. \n2D panel with multiple subpanels : overhead, pedestal,... \nInteractive 3D Virtual Cockpit - Exactly as the real aircraft ! \nTraffic and Collision Avoidance System (TCAS) \nAbility to save your flights including ALL FMC programmed parameters. \nDay and night lighting. \nAircraft flyable from the Captain or First Officer&amp;#039;s seat from the Virtual Cockpit. \nHotspots on the panel to ease access to 2D panels. \nPop up EFIS screens for multi-monitor displays, resizable and detachable for any additional monitor use. \nVector graphics displays (GDI+ technology) for nicer and smoother graphics. \nEFIS Features (for FSX) \n\nAll the Airbus EFIS are available: Primary Flight Display (PFD), Navigation Display (ND), Engine/Warning Display (E/WD), System Display (SD), with all the system pages available \nAll the EFIS screens are developed with vector graphics technology that makes them detachable and resizable without any quality loss, and their brightness is adjustable. \nMore about EFIS features \nAdvanced Configuration Module (for FSX)\n\nIntegrated module accessible through the Flight Simulator pull-down menu \nAvailable features: \nUser Experience: allows the user to select the realism level of the systems \nMore about Advanced Configuration Module features \nSystems Features (for FSX)\n\nGround Proximity Warning System (GPWS) and caution messages. \nRadio Management panel. \nRealistic auto-brake system. \nInertial Reference System (IRS) - Fully working Navigational System \nFully featured Fly-by-Wire system \nFully featured autopilot system, with ALL the Airbus specific modes \nFully featured FADEC (Full Authority Digital Engine Control) system \nAlert system \nMore about Systems features \nFMS Features (for FSX) \n\nThe flight management system is composed of : \nBasic features \nAdvanced features \nSID/STAR management \n","torrent":{"xt":"urn:btih:dfad7a9ba19817c358abf014729a86187ecb4609","amp;dn":"FSX+Wilco+A380+V2+-+Retail+%28B-H%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfad7a9ba19817c358abf014729a86187ecb4609","infoHashBuffer":{"type":"Buffer","data":[223,173,122,155,161,152,23,195,88,171,240,20,114,154,134,24,126,203,70,9]},"announce":[],"urlList":[]}}