{"title":"Stefan Bjornander - C++ Windows Programmin (pdf)","uid":15880299,"size":13132951,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0a0fe2fbfafa93bf7addc7f752288fb67755ac5&amp;dn=Stefan+Bjornander+-+C%2B%2B+Windows+Programmin+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":4,"uploader":"BanchMon2","files":1,"time":1474588642,"description":"Stefan Bjornander, &quot;C ++ Windows Programming&quot;\r\nEnglish | ISBN: 1786464225 | 2016 | PDF | 428 pages | 13 MB\r\n\r\nKey Features\r\nCreate diverse applications featuring the versatility of Small Windows C++ library\r\nLearn about object-oriented programming in Windows and how to develop a large object-oriented class library in C++\r\nUnderstand how to tackle application-specific problems along with acquiring a deep understanding of the workings of Windows architecture\r\nBook Description\r\nIt is critical that modern developers have the right tools to build practical, user-friendly, and efficient applications in order to compete in today's market. Through hands-on guidance, this book illustrates and demonstrates C++ best practices and the Small Windows object-oriented class library to ease your development of interactive Windows applications.\r\n\r\nBegin with a focus on high level application development using Small Windows. Learn how to build four real-world applications which focus on the general problems faced when developing graphical applications. Get essential troubleshooting guidance on drawing, spreadsheet, and word processing applications. Finally finish up with a deep dive into the workings of the Small Windows class library, which will give you all the insights you need to build your own object-oriented class library in C++.\r\n\r\nWhat you will learn\r\nDevelop advanced real-world applications in Windows\r\nDesign and implement a graphical object-oriented class library in C++\r\nGet to grips with the workings of the integral aspects of the Win32 API, such as mouse input, drawing, cut-and-paste, file handling, and drop files\r\nIdentify general problems when developing graphical applications as well as specific problems regarding drawing, spreadsheet, and word processing applications\r\nImplement classes, functions, and macros of the object-oriented class library developed in the book and how we implement its functionality by calling functions and macros in the Win32 API","torrent":{"xt":"urn:btih:e0a0fe2fbfafa93bf7addc7f752288fb67755ac5","amp;dn":"Stefan+Bjornander+-+C%2B%2B+Windows+Programmin+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0a0fe2fbfafa93bf7addc7f752288fb67755ac5","infoHashBuffer":{"type":"Buffer","data":[224,160,254,47,191,175,169,59,247,173,220,127,117,34,136,251,103,117,90,197]},"announce":[],"urlList":[]}}