{"title":"Yoga eBook Pack","uid":7313943,"size":789488985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0ed67e02e95445a1a3aa143bbb5f09de4611a3e&amp;dn=Yoga+eBook+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":2,"uploader":null,"files":62,"time":1338424393,"description":"These include pretty much every quality yoga book I could find (and one or two that are just ok.) , plus additional useful articles and content. Some are compiled from varies sources across the interweb (even TPB!) and some were the result of some nifty scanning work, or some crafty conversion from other formats. \n\nI've included Adobe OCRs are most material, they are the smallest files and quality should be suitable.\n\nThere are even some Chinese titles! Select Chinese titles have been OCRed with Finereader.\n\n\nBe sure to check out the recommended Yoga-related links included in the torrent as well, they really are worth while.\n\n\nIf you like these materials, support their authors and buy them.\n\nSorry, I'm not gonna post amazon links or isbns for all these. Titles should be sufficient, you'll have to copy and paste from there *gasp*! If someone else would like to do the footwork, please:)\n\n\nPS. Please seed long term. I sometimes have intermittent internet connectivity. If the seed goes out over the coming weekend, it'll be back in no time. I only have a laptop, so if I gotta go, I gotta go.\n\n\n\n\nFile List:\n\nSorry, due to upload issues, you'll have to check to torrent. (Description too long?)","torrent":{"xt":"urn:btih:e0ed67e02e95445a1a3aa143bbb5f09de4611a3e","amp;dn":"Yoga+eBook+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0ed67e02e95445a1a3aa143bbb5f09de4611a3e","infoHashBuffer":{"type":"Buffer","data":[224,237,103,224,46,149,68,90,26,58,161,67,187,181,240,157,228,97,26,62]},"announce":[],"urlList":[]}}