{"title":"IT Security Risk Control Management (2016) (Pdf) Gooner","uid":15854907,"size":17011150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0f4d44860a73c9cfda315a7328edd9bff19a6e5&amp;dn=IT+Security+Risk+Control+Management+%282016%29+%28Pdf%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":1,"uploader":"GoonerTPB","files":2,"time":1474233664,"description":"IT Security Risk Control Management - An Audit Preparation Plan (2016) (Pdf) Gooner\r\n\r\nPublisher: Apress; 1st ed. edition (29 Sept. 2016)\r\nLanguage: English\r\nISBN-10: 1484221397\r\nISBN-13: 978-1484221396\r\n\r\nThis book explains how to construct an information security program, from inception to audit, with enduring, practical, hands-on advice and actionable behavior for IT professionals.  Information security is more than configuring firewalls, removing viruses, hacking machines, or setting passwords. Creating and promoting a successful security program requires skills in organizational consulting, diplomacy, change management, risk analysis, and out-of-the-box thinking.\r\n\r\nIT Security Risk Control Management provides step-by-step guidance on how to craft a security program that will fit neatly into an organization and change dynamically to suit both the needs of the organization and survive constant changing threats.  Readers will understand the paradoxes of information security and discover handy tools that hook security controls into business processes. \r\n\r\nWith this book, you will be able to equip your security program to prepare for and pass such common audits as PCI, SSAE-16 and ISO 27001. In addition, you will learn the depth and breadth of the expertise necessary to become an adaptive and effective security professional. \r\n\r\n[u]This book:[/u]\r\n\r\n* Starts at the beginning of how to approach, scope, and customize a security program to fit an organization.\r\n\r\n* Walks you through how to implement the most challenging processes, pointing out common pitfalls and distractions.\r\n\r\n* Teaches you how to frame security and risk issues to be clear and actionable to decision makers, technical personnel, and users.\r\n\r\n[u]What you will learn:[/u]\r\n\r\n* How to organically grow a useful, functional security program appropriate to an organization's culture and requirements\r\n\r\n* How to inform, advise, and influence executives, IT staff, and users on information security\r\n\r\n* How to think like a seasoned security professional, understanding how cyber-criminals subvert systems with subtle and insidious tricks.\r\n\r\n* How to analyze, select, implement, and monitor security controls such as change control, vulnerability management, incident response, and access controls.\r\n\r\n* How to prepare an organization to pass external formal audits such as PCI, SSAE-16 or ISO 27001\r\n\r\n* How to  write clear, easy to follow, comprehensive security policies and procedures\r\n\r\n[u]Who This Book Is For:[/u]\r\n\r\nIT professionals moving into the security field; new security managers, directors, project heads, and would-be CISOs; and security specialists from other disciplines moving into information security (e.g., former military security professionals, law enforcement professionals, and physical security professionals)","torrent":{"xt":"urn:btih:e0f4d44860a73c9cfda315a7328edd9bff19a6e5","amp;dn":"IT+Security+Risk+Control+Management+%282016%29+%28Pdf%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0f4d44860a73c9cfda315a7328edd9bff19a6e5","infoHashBuffer":{"type":"Buffer","data":[224,244,212,72,96,167,60,156,253,163,21,167,50,142,221,155,255,25,166,229]},"announce":[],"urlList":[]}}