{"title":"The Art And Science Of Low Carbohydrate Living (Epub,Mobi) Goone","uid":9762046,"size":1207384,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e13e4dc899dde129d3144a641687f1febe9278db&amp;dn=The+Art+And+Science+Of+Low+Carbohydrate+Living+%28Epub%2CMobi%29+Goone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":3,"uploader":"GoonerTPB","files":3,"time":1394825656,"description":"Paperback: 316 pages\nPublisher: Beyond Obesity LLC (May 19, 2011)\nLanguage: English\nISBN-10: 0983490708\nISBN-13: 978-0983490708\n\nCarbohydrate restricted diets are commonly practiced but seldom taught. As a result, doctors, dietitians, nutritionists, and nurses may have strong opinions about low carbohydrate dieting, but in many if not most cases, these views are not grounded in science. \n\nNow, whether you are a curious healthcare professional or just a connoisseur of diet information, two New York Times best-selling authors provide you with the definitive resource for low carbohydrate living.\nDoctors Volek and Phinney share over 50 years of clinical experience using low carbohydrate diets, and together they have published more than 200 research papers and chapters on the topic. Particularly in the last decade, much has been learned about the risks associated with insulin resistance (including but not limited to metabolic syndrome, hypertension, and type-2 diabetes), and how this condition is far better controlled by carbohydrate restriction than with drugs. \nIn this book, you will learn why: \nCarbohydrate restriction is the proverbial 'silver bullet' for managing insulin resistance, metabolic syndrome and type-2 diabetes. \nRestricting carbohydrate improves blood glucose and lipids while reducing inflammation, all without drugs. \nDietary saturated fat is not a demon when you are low carb adapted.\nDietary sugars and refined starches are not needed to feed your brain or fuel exercise. \nLong-term success involves much more than simply cutting out carbs. \nElectrolyte and mineral management are key to avoiding side effects and ensuring success.\nTrading up from sugars and starches to a cornucopia of nutrient-rich, satisfying, and healthy foods is empowering. \nStudying hunter-gathers' diets provides clues to how best formulate a low carbohydrate diet. \nThis is a great book for health-minded individuals. \nIt is an excellent book for healthcare professionals. \nBest of all, it is the perfect gift for health-minded individuals to share with their doctors, dietitians, and nutritionists.\n\nAbout the Author\nJeff Volek is a dietitian-scientist who has spent 15 years studying diet and exercise effects on health and performance. He has held an academic position at Ball State University and is currently an associate professor at the University of Connecticut. Dr. Volek has contributed to 3 books, 2 patents, and over 200 papers. He received his dietetic training at Michigan State University and Penrose St Francis Hospital and his PhD in Exercise Physiology from Penn State University.\nSteve Phinney is a physician-scientist who has spent 35 years studying diet, exercise, fatty acids, and inflammation. He has held academic positions at the Universities of Vermont, Minnesota, and California at Davis, as well as leadership positions at Monsanto, Galileo Laboratories, and Efficas. Dr. Phinney has published over 70 papers and several patents. He received his MD from Stanford University, his PhD in Nutritional Biochemistry from MIT, and post-doctoral training at the University of Vermont and Harvard.","torrent":{"xt":"urn:btih:e13e4dc899dde129d3144a641687f1febe9278db","amp;dn":"The+Art+And+Science+Of+Low+Carbohydrate+Living+%28Epub%2CMobi%29+Goone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e13e4dc899dde129d3144a641687f1febe9278db","infoHashBuffer":{"type":"Buffer","data":[225,62,77,200,153,221,225,41,211,20,74,100,22,135,241,254,190,146,120,219]},"announce":[],"urlList":[]}}