{"title":"Lev Grossman - The Magician King","uid":6570121,"size":1445503,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e14114830237190528fe51476a8d7bb0df0a8ff6&amp;dn=Lev+Grossman+-+The+Magician+King&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":1,"uploader":"kash79","files":-1,"time":1311906399,"description":"The Magician King (2011)\n(The second book in the Magician series)\nA novel by Lev Grossman\n\n\nEbook formats - EPUB,MOBI,LIT\n\n\nReturn to Fillory in the riveting sequel to The New York Times bestseller and literary phenomenon of 2009--The Magicians.\n\nThe Magicians was praised as a triumph by readers and critics of both mainstream and fantasy literature. Now Grossman takes us back to Fillory, where the Brakebills graduates have fled the sorrows of the mundane world, only to face terrifying new challenges.\n\nQuentin and his friends are now the kings and queens of Fillory, but the days and nights of royal luxury are starting to pall. After a morning hunt takes a sinister turn, Quentin and his old friend Julia charter a magical sailing ship and set out on an errand to the wild outer reaches of their kingdom. Their pleasure cruise becomes an adventure when the two are unceremoniously dumped back into the last place Quentin ever wants to see: his parent's house in Chesterton, Massachusetts. And only the black, twisted magic that Julia learned on the streets can save them.\n\nThe Magician King is a grand voyage into the dark, glittering heart of magic, an epic quest for the Harry Potter generation. It also introduces a powerful new voice, that of Julia, whose angry genius is thrilling. Once again Grossman proves that he is the modern heir to C.S. Lewis, and the cutting edge of literary fantasy. ","torrent":{"xt":"urn:btih:e14114830237190528fe51476a8d7bb0df0a8ff6","amp;dn":"Lev+Grossman+-+The+Magician+King","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e14114830237190528fe51476a8d7bb0df0a8ff6","infoHashBuffer":{"type":"Buffer","data":[225,65,20,131,2,55,25,5,40,254,81,71,106,141,123,176,223,10,143,246]},"announce":[],"urlList":[]}}