{"title":"The Ultimate Yogi with Travis Eliot","uid":9433937,"size":10703036874,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e1ca7182c9cd50bfa4cde8fc41b62c933bceb2ca&amp;dn=The+Ultimate+Yogi+with+Travis+Eliot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":5,"uploader":"yousef86","files":-1,"time":1388860665,"description":"The Ultimate Yogi with Travis Eliot (2012) | Size 9.97 GB\n\nType: Health-Fitness-Sports\n\n\nThe All-In-One Yoga DVD &amp; Fitness Program\n\nThe Ultimate Yogi is the most comprehensive yoga DVD set on the market. Renowned instructor Travis Eliot will take you to your physical limits and beyond on this 108-Day Journey. Each of the 14 Thematic classes are comprised of creative sequences that will challenge the expert and encourage the beginner. The Ultimate Yogi is MORE than just a fitness program, it is a transformational experience guaranteed to improve your quality of life. ORDER NOW or learn more about the CLASSES, the MEDITATION and the DIET.\n\nThe Ultimate Yogi DVD set is not a quick-fix. It is a journey that requires commitment and dedication. The instructor is only the guide- you have to do the traveling. For 108 days you follow the calendar and take transformation into your own hands. If you want to use Yoga for weight loss, gain muscle tone, and experience true health, then this is the perfect exercise DVD set for you. Follow the common sense food program and practice the meditation to experience sensational results. If you are not satisfied, send it back and we will refund your payment.\n\nThe Ultimate Yogi DVD set is the most cinematic yoga DVD set on the market. The program has taken all the key components of all health and fitness and delivers them in a yogic way. You have Strength, Balance, and Flexibility to lengthen and tone the body. The practice include Detox, Vitality, and Yoga Cardio to balance all the energy systems. Yin and Gentle Yoga offer you the restorative aspects that you will need along the path. Pranayama will access equanimity and Meditation help you cultivate joy. Not one aspect of the eight limbs has been left out.\n\nVeteran Power Yoga Instructor Travis Elliot has created a multi-faceted Yoga DVD program that guarantees success. If you are brand new then it is recommended that you start with Yoga Foundations. If you want to try a taste of the program but are not ready to commit to the 108 Day Journey, then Yoga Cross Training is the ideal entry point. Become the Ultimate Yogi by starting your 108 day journey today. Are you ready?","torrent":{"xt":"urn:btih:e1ca7182c9cd50bfa4cde8fc41b62c933bceb2ca","amp;dn":"The+Ultimate+Yogi+with+Travis+Eliot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1ca7182c9cd50bfa4cde8fc41b62c933bceb2ca","infoHashBuffer":{"type":"Buffer","data":[225,202,113,130,201,205,80,191,164,205,232,252,65,182,44,147,59,206,178,202]},"announce":[],"urlList":[]}}