{"title":"Did Moses Exist?: The Myth of the Israelite Lawgiver","uid":15861579,"size":8884393,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2dded41eadddc621712a5c24b34a5fded2c9569&amp;dn=Did+Moses+Exist%3F%3A+The+Myth+of+the+Israelite+Lawgiver&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"marty14","files":1,"time":1474304303,"description":"Did Moses Exist?: The Myth of the Israelite Lawgiver - D.M. Murdock [epub]\r\n\r\nThe biblical figure of Moses has been the center of fascination for over 2,000 years, but what do we actually know about him? Was he a real person? Did the Exodus truly happen? Or is the story in the Pentateuch a mythical account written centuries after the alleged events?\r\n\r\nWhy does Moses's story resemble that of other, older lawgivers and legendary predecessors? Why are there so many elements of sun and wine god myths in the tale of Moses? What does the focus on the serpent in his story signify? Who were Yahweh and the Elohim?\r\n\r\nDid Moses Exist? provides a massive amount of information from antiquity about the world's religious traditions and mythology, including how solar myths, wine cultivation and fertility cults have shaped the Bible and Judaism. This book may be the most comprehensive study to date, using the best scholarship and state-of-the-art research methods.\r\n\r\nIn the citations and bibliography appear numerous ancient sources such as the Bible, Anacreon, Apollodorus, Aristides, Aristophanes, Arrian, Cicero, Clement of Alexandria, Diodorus, Euripides, Eusebius, Herodotus, Hesiod, Homer, Josephus, Justin Martyr, Megasthenes, Origen, Ovid, Pausanias, Pindar, Plato, Plutarch, Porphyry, Seneca, Strabo, Varro, Virgil and others, often in the original languages, mostly Greek, Hebrew and Latin.\r\n\r\nAlso discussed are texts and words in Akkadian, Arabic, Assyrian, Babylonian, Canaanite, Phoenician, Ugaritic and other Semitic languages, along with Egyptian, Sumerian, Vedic and Sanskrit","torrent":{"xt":"urn:btih:e2dded41eadddc621712a5c24b34a5fded2c9569","amp;dn":"Did+Moses+Exist%3F%3A+The+Myth+of+the+Israelite+Lawgiver","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2dded41eadddc621712a5c24b34a5fded2c9569","infoHashBuffer":{"type":"Buffer","data":[226,221,237,65,234,221,220,98,23,18,165,194,75,52,165,253,237,44,149,105]},"announce":[],"urlList":[]}}