{"title":"John Grisham - Rogue Lawyer","uid":12620435,"size":169214608,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e36b16d0e74c9b0699133117c55326d65c684567&amp;dn=John+Grisham+-+Rogue+Lawyer&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":0,"uploader":"Cybotage","files":1,"time":1445592033,"description":"\n\r\n\r\nOn the right side of the law. Sort of.\r\n\r\nSebastian Rudd is not your typical street lawyer. He works out of a customized bulletproof van, complete with Wi-Fi, a bar, a small fridge, fine leather chairs, a hidden gun compartment, and a heavily armed driver. He has no firm, no partners, no associates, and only one employee: his driver, who's also his bodyguard, law clerk, confidant, and golf caddy. He lives alone in a small but extremely safe penthouse apartment, and his primary piece of furniture is a vintage pool table. He drinks small-batch bourbon and carries a gun.\r\n\r\nSebastian defends people other lawyers won't go near: a drug-addled, tattooed kid rumored to be in a satanic cult, who is accused of molesting and murdering two little girls; a vicious crime lord on death row; a homeowner arrested for shooting at a SWAT team that mistakenly invaded his house. Why these clients? Because he believes everyone is entitled to a fair trial, even if he, Sebastian, has to cheat to secure one. He hates injustice and doesn't like insurance companies, banks, or big corporations; he distrusts all levels of government and laughs at the justice system's notions of ethical behavior.\r\n\r\nSebastian Rudd is one of John Grisham's most colorful, outrageous, and vividly drawn characters yet. Gritty, witty, and impossible to put down, Rogue Lawyer showcases the master of the legal thriller at his very best.\r\n\r\n\r\n\r\nRead by Mark Deakins\r\nFormat: M4B\r\nBitrate: 32 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:e36b16d0e74c9b0699133117c55326d65c684567","amp;dn":"John+Grisham+-+Rogue+Lawyer","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e36b16d0e74c9b0699133117c55326d65c684567","infoHashBuffer":{"type":"Buffer","data":[227,107,22,208,231,76,155,6,153,19,49,23,197,83,38,214,92,104,69,103]},"announce":[],"urlList":[]}}