{"title":"Autodesk AutoCAD P &amp; ID 2015 SP1 x86-x64 RUS-ENG (AIO) by m0","uid":11216409,"size":6044276325,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e47615a57536bce8c5f8f4771ebea1196d60a05a&amp;dn=Autodesk+AutoCAD+P+%26amp%3B+ID+2015+SP1+x86-x64+RUS-ENG+%28AIO%29+by+m0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":25,"leechers":1,"uploader":"OnlyByTheRain","files":7,"time":1413330435,"description":"[b]Autodesk AutoCAD P &amp; ID 2015 SP1 x86-x64 RUS-ENG (AIO) [/b]\n\nName of Program: Autodesk AutoCAD P &amp; ID 2015 SP1 x86-x64 RUS-ENG (AIO)\nProgram Version: 2015 Build J.104.0.0\nOfficial site: http://www.autodesk.ru\nBy assembling : m0nkrus\nLanguage: English / Russian \nTreatment: complete\nType of medicine: patch crack System requirements:\n\nFor 32-bit version of AutoCAD P &amp; ID 2015\n- Microsoft Windows 8 / 8.1 Enterprise, Professional or Core, Windows 7 Enterprise, Ultimate, Professional or Home Premium\n- Dual-Core Intel Pentium 4 or AMD Athlon processor with a frequency of at least 3.0 GHz, with support for SSE2 technology\n- 2 GB of RAM (8 GB recommended)\n- 7 GB for installation\n- 1024 x 768 (recommended resolution of 1600 x 1050 or higher) with a regime of full-color palette (True Color)\n- Microsoft Internet Explorer 9.0 or later\n- To install: connect to the Internet or DVD-ROM drive \n\n\nFor 64-bit version of AutoCAD P &amp; ID 2015\n- Microsoft Windows 8 / 8.1 Enterprise, Professional or Core, Windows 7 Enterprise, Ultimate, Professional or Home Premium\n- AMD Athlon 64, AMD Opteron, Intel Xeon with support for Intel EM64T, Intel Pentium 4 with Intel EM64T support and SSE2 technology\n- 2 GB of RAM (8 GB recommended)\n- 7 GB for installation\n- 1024 x 768 (recommended resolution of 1600 x 1050 or higher) with a regime of full-color palette (True Color)\n- Microsoft Internet Explorer 9.0 or later\n- To install: connect to the Internet or DVD-ROM drive Description:\n\nAutoCAD P &amp; ID - this is the app for quick and easy creation schemes piping and instrumentation, as well as for editing and management. \nBuilt on the latest version of AutoCAD software AutoCAD P &amp; ID - it's easy to use CAD with the familiar interface designers and engineers. \nIn order to get started with almost no training required. AutoCAD P &amp; ID optimizes and automates routine operations planning. Easy to use features reporting, \nediting, monitoring, and data transfer - a sound basis for the implementation of the projects pipeline systems on time and at a lower cost.\n\nFunctionality\n\nData Manager\nBuilt possible changes, viewing and editing are essential to ensure the quality of the documentation. Dynamic linear objects and components\n\nRoutine operations simplified. Create lines and elements can be moved and tied to the objects using control &quot;knobs&quot;. Libraries notation\n\nIn the drawings can be placed on the industry standard notation (PIP, ISA, JIS and ISO / DIN), as well as company standards. markers and explanations\n\nThere are opportunities for the creation, adaptation and editing marks and explanations. Properties are assigned automatically. The necessary information can be dragged from the Data Manager window. Communicating and reporting\n\nThe data is imported into a table format and exported to various formats. Control\n\nTo check for errors and rapid identification of problems. Communicating\n\nSupport for open standards-based data exchange procedures such as ISO 15926.\n\n\nCusp\n\nMerged the four original R1-distributions in one English x64, x86 English, Russian x64, x86 Russian.\nIn the installer adds the ability to establish a local reference for the English version of the program.\nIn the installer adds the ability to install the module support VBA-macros.\nIn the installer adds the ability to install the module SPDS Extension 4.0 allows to execute drawings in accordance with the requirements of GOST 21.1101-2009 (see. screenshots 4 and 6).\nIn the installation package AutoCAD P &amp; ID 2015 will integrate Service Pack 1 .\nThis software, Autodesk ReCap 2015 updated from version 1.3.1.39 to version 1.4.0.132.\nUtility Autodesk Application Manager updated to version 1.0.59.0 to version 3.0.159.0.\nUtility Autodesk BIM 360 Glue updated from version 3.32.3004 to version 4.34.2701.\nDistributions used in the original package .NET Framework 4.5 is replaced by a revised version of the draft [Slim] .NET Framework 4.5.3 Full x86 / x64 , with integrated updates on 26 June 2014.\nDistributions used in the original package Microsoft Visual C ++ Redistributable Package replaced by a revised version of a single project [addon] Microsoft Visual C Redistributable Package ++ 2005-2008-2010-2012-2013 Hybrid .\nYou can also install AutoCAD P &amp; ID 2015 software on any supported language, and not only those that are sewn into the installer. Just download ofsayta language pack and the path to it during the installation (see. Screenshot 2).\nSince AutoCAD P &amp; ID 2015 to default out so-called &quot;classic interface&quot;, I thought it possible to restore it to the afflicted (see. Screenshot 5).\nAssembly is relieved of some of the problems arising when connecting the image via a virtual drive, the installer will sometimes require a different drive.\nEverything you need for treatment, including detailed instructions, is located within the image in the folder Crack.\n\n\nThe procedure for treatment\nStart the installation of AutoCAD P &amp; ID 2015 using 111-11111111 , 222-22222222 or 333-33333333 as the serial number, and 448G1 as the product code.\nCopy your desired crack (32-bit or 64-bit) from Crack folder to your hard drive. Otherwise, it can not work.\nStart AutoCAD P &amp; ID 2015 and agree to our privacy statement. In the licensing click on &quot;Activate&quot; (Activation), then in the window where you will be notified that &quot;You need to connect to the Internet&quot; (Internet Connection Required), click on &quot;Close&quot; (Close) and confirm the cancellation of the operation. Re-open window licensing, where once again you will need to click the &quot;Activate&quot; (Activation). In the next window, select &quot;I have an activation code Autodesk&quot; (I have an activation code from Autodesk).\nAs administrator, run the crack (right-click on the file and choose from the drop down menu &quot;Run as administrator&quot;) and click in the window keygens button Patch. You should see a window with the message &quot;Successfully patched&quot;.\nIn the Request keygen copy the request code (Request Code) window Licensing Autodesk. Then click the Generate button and the result of the field Activation keygens transfer in the field Activation Code (Activation Code) window Licensing Autodesk. Click &quot;Next&quot; (Next). A message about the successful activation of the product.\nNOTE: The generated code activation is slightly longer than the space allocated for a field in the keygen. Try not to lose some characters when copying. But also, I want to note that this code is shorter than the allotted space for it in the Licensing Autodesk. Sixteenth field is left blank, and the fifteenth contains only one character - the letter Z . Activation is not impeded.\nEnjoy the registered version of the product!\n\nImage size and CRC\n\nImage Size: 5.62 GB (6,044,180,480 bytes)\nMD5-sum image: 58c938b962bfdea7aeff37901ebcd4b6\nSHA1-sum image: 77dfa05504b82e8aaba33b2779c8387ae411f271","torrent":{"xt":"urn:btih:e47615a57536bce8c5f8f4771ebea1196d60a05a","amp;dn":"Autodesk+AutoCAD+P+%26amp%3B+ID+2015+SP1+x86-x64+RUS-ENG+%28AIO%29+by+m0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e47615a57536bce8c5f8f4771ebea1196d60a05a","infoHashBuffer":{"type":"Buffer","data":[228,118,21,165,117,54,188,232,197,248,244,119,30,190,161,25,109,96,160,90]},"announce":[],"urlList":[]}}