{"title":"Albert Camus - Nobel Prize in Literature, 1957 (19 books)","uid":11705741,"size":94370204,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e48559544a5be5f2ab2be5782a8dfd8606340d70&amp;dn=Albert+Camus+-+Nobel+Prize+in+Literature%2C+1957+%2819+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":2,"uploader":"workerbee","files":52,"time":1424114133,"description":"\nALBERT CAMUS (1913-1960) was a French author, journalist, and philosopher.  He was awarded the 1957 Nobel Prize for Literature &quot;for his important literary production, which with clear-sighted earnestness illuminates the problems of the human conscience in our times.&quot;\n\nHis origin in Algeria and his experiences there in the thirties were dominating influences in his thought and work.  Of semi-proletarian parents, early attached to intellectual circles of strongly revolutionary tendencies, with a deep interest in philosophy (only chance prevented him from pursuing a university career in that field), he came to France at the age of twenty-five.  The man and the times met: Camus joined the resistance movement during the occupation and after the liberation was a columnist for the newspaper Combat.  But his journalistic activities had been chiefly a response to the demands of the time; in 1947 Camus retired from political journalism and, besides writing his fiction and essays, was very active in the theatre as producer and playwright.\n\nThe essay THE MYTH OF SISYPHUS (1942) expounds Camus's notion of the absurd and of its acceptance with &quot;the total absence of hope, which has nothing to do with despair, a continual refusal, which must not be confused with renouncement -- and a conscious dissatisfaction.&quot;  Meursault, central character of THE STRANGER (1942), illustrates much of this essay: man as the nauseated victim of the absurd orthodoxy of habit, later -- when the young killer faces execution -- tempted by despair, hope, and salvation.  Dr. Rieux of THE PLAGUE (1947), who tirelessly attends the plague-stricken citizens of Oran, enacts the revolt against a world of the absurd and of injustice, and confirms Camus's words: &quot;We refuse to despair of mankind. Without having the unreasonable ambition to save men, we still want to serve them.&quot;\n\nOther well-known works of Camus are THE FALL (1956) and EXILE AND THE KINGDOM (1957).  His austere search for moral order found its aesthetic correlative in the classicism of his art.  He was a stylist of great purity and intense concentration and rationality.\n\n\nThis collection includes novels, short stories, plays, essays and non-fiction.  All the books are in PDF and/or ePUB format as indicated below:\n\n* ALGERIAN CHRONICLES (Harvard UP, 2013).  Translated by Arthur Goldhammer with an Introduction by Alice Kaplan. -- PDF\n\n* AMERICAN JOURNALS (Abacus, 1990).  Translated by Hugh Levick. -- PDF\n\n* CALIGULA &amp; THREE OTHER PLAYS (Vintage, 1962).  Translated by Stuart Gilbert. -- PDF + ePUB\n\n* CHRISTIAN METAPHYSICS AND NEOPLATONISM (University of Missouri, 2007).  Translated by Ronald D. Srigley. -- PDF\n\n* EXILE AND THE KINGDOM (Vintage, 1958).  Translated by Justin O'Brien. -- PDF + ePUB\n\n* EXILE AND THE KINGDOM (Vintage, 2007).  Translated by Carol Cosman. -- PDF\n\n* THE FALL (Penguin, 1963 / Vintage, 1984).  Translated by Justin O'Brien.  Scanned by and reproduced with the kind permission of @pharmakate. -- PDF + ePUB\n\n* THE FALL / THE OUTSIDER (Lythway, 1977).  Translated by Stuart Gilbert. -- PDF\n\n* THE FIRST MAN (Knopf, 1995).  Translated by David Hapgood. -- PDF + ePUB\n\n* A HAPPY DEATH (Vintage, 1973).  Translated by Richard Howard, with an Afterword and Notes by Jean Sarocchi. -- PDF + ePUB\n\n* LYRICAL AND CRITICAL ESSAYS (Vintage, 1970).  Translated by Ellen Conroy Kennedy and edited by Philip Thody. -- PDF + ePUB\n\n* THE MYTH OF SISYPHUS &amp; OTHER ESSAYS (Vintage, 1991).  Translated by Justin O'Brien. -- PDF + ePUB\n\n* THE PLAGUE (Modern Library, 1948 / Vintage, 1991).  Scanned by and reproduced with the kind permission of @pharmakate. Translated by Stuart Gilbert. -- PDF + ePUB\n\n* THE POSSESSED: A Play in Three Parts (Vintage, 1964).    Translated by Justin O'Brien. -- PDF\n\n* THE REBEL: An Essay on Man in Revolt (Vintage, 1956).  Translated by Anthony Bower.  Scanned by and reproduced with the kind permission of @pharmakate. -- PDF + ePUB\n\n* RESISTANCE, REBELLION, AND DEATH (Knopf, 1961).  Translated by Justin O'Brien. -- PDF + ePUB\n\n* THE STRANGER (Vintage, 1958).  Translated by Stuart Gilbert. -- PDF + ePUB\n\n* THE STRANGER (Vintage, 1989).  Translated by Matthew Ward.  Scanned by and reproduced with the kind permission of @pharmakate. -- PDF + ePUB\n\n* YOUTHFUL WRITINGS (Vintage, 1977).  Translated by Ellen Conroy Kennedy with an Introductory Essay by Paul Viallaneix. -- PDF\n\n________________________________________________________________________\n\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:e48559544a5be5f2ab2be5782a8dfd8606340d70","amp;dn":"Albert+Camus+-+Nobel+Prize+in+Literature%2C+1957+%2819+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e48559544a5be5f2ab2be5782a8dfd8606340d70","infoHashBuffer":{"type":"Buffer","data":[228,133,89,84,74,91,229,242,171,43,229,120,42,141,253,134,6,52,13,112]},"announce":[],"urlList":[]}}