{"title":"Malwarebytes Anti-Malware Premium 2.0.1.1004 + Keys-P2P","uid":9895537,"size":17308720,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e4c834f8a738d860aa38867a0d37a3a8b287702a&amp;dn=Malwarebytes+Anti-Malware+Premium+2.0.1.1004+%2B+Keys-P2P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":1,"uploader":"AtomTPB","files":6,"time":1396704633,"description":"Description:\nMalwarebytes Anti-Malware is an anti-malware application that can thoroughly remove even the most advanced malware. Malwarebytes products have a proven record of protecting computers by completely removing all forms of malware, including viruses, Trojans, spyware, adware and rootkits. When it comes to the safety of your computer, Malwarebytes provides the ultimate in protection from the cutting edge of technology! Malwarebytes technology takes the next step in the fight against malware. Malwarebytes Anti-Malware PRO detects and removes malware where even the best known anti-virus and anti-malware applications fail. Malwarebytes Anti-Malware PRO monitors every process and stops malicious processes before they even start.\n\nThe Proactive Protection Module of Malwarebytes Anti-Malware Pro keeps your system safe and secure with advanced heuristic scanning technology.\n\nMalwarebytes Anti-Malware Premium includes three proprietary technologies (signature, heuristics, and behavorial) that automatically protect you and your online experience from malware that antivirus products don't detect.\n\nIt employs malware removal techniques so innovative that computer technicians often recommend Malwarebytes when an antivirus can't finish the job.\n\nProprietary Malwarebytes Chameleon technology protects Malwarebytes Anti-Malware Premium against malware's attempts to disable it, so you're always protected.\n\n\nFeatures:\n*Detects and protects against malware in real-time\n*Blocks hacking and phishing attempts\n*Schedules automatic scanning\n*Offers three flexible scanning modes\n*Anti-Malware/Anti-Spyware\n*Malicious website blocking\n*Real-time protection\n*Heuristic detection\n*Integrated Malwarebytes Anti-Rootkit\n*Hyper Scan mode\n*Scan/Database update scheduler\n*Integrated Malwarebytes Chameleon\n*Advanced malware removal\n*Antivirus compatibility\n\n\nWhat's New in Version 2.0.1.1004:\nImprovements:\n*Database is now updated automatically after installation\n*Notifications are no longer displayed if the Dashboard is in focus to reduce *redundant information\n*Significantly reduced the size of all tray notifications\n*Reduced the intensity of the colors used for tray notifications and status *banners in the Dashboard\n*Database out of date and scan has never been run notifications now reduced *in severity to orange instead of red\n\nIssues Fixed:\n*All scheduled scans should now run without popping up the main UI so that users are not interrupted\n\n\nRequirements:\n*OS: Windows 8.1Â®, Windows 8Â®, Windows 7Â®, Windows VistaÂ®, Windows XPÂ® (32-bit, 64-bit)\n*256MB of RAM (512MB or more recommended)\n*800MHz CPU or faster\n*20MB of free hard disk space\n*800x600 or greater screen resolution\n*Active internet connection for database and product updates\n*Internet Explorer 6 or newer","torrent":{"xt":"urn:btih:e4c834f8a738d860aa38867a0d37a3a8b287702a","amp;dn":"Malwarebytes+Anti-Malware+Premium+2.0.1.1004+%2B+Keys-P2P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4c834f8a738d860aa38867a0d37a3a8b287702a","infoHashBuffer":{"type":"Buffer","data":[228,200,52,248,167,56,216,96,170,56,134,122,13,55,163,168,178,135,112,42]},"announce":[],"urlList":[]}}