{"title":"Pokemon Go v0.39.1 (Mods) APK [SadeemPC]","uid":15896808,"size":405361543,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:e77767cd07626af089d4e0c1c38b21af63a32391&amp;dn=Pokemon+Go+v0.39.1+%28Mods%29+APK+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":9,"uploader":"SadeemPC","files":7,"time":1474817383,"description":"Pokemon GO v0.39.1 APK [Mods + No Root]\r\n\r\nVenusaur, Charizard, Blastoise, Pikachu, and many other Pokémon have been discovered on planet Earth! Nowâ™s your chance to discover and capture the Pokemon all around you—so get your shoes on, step outside, and explore the world. Youâ™ll join one of three teams and battle for the prestige and ownership of Gyms with your Pokémon at your side.\r\n\r\nNotes:\r\nThis app is free-to-play and offers in-game purchases. It is optimized for smartphones, not tablets.\r\nCompatible with Android devices that have 2GB RAM or more and have Android Version 4.4 – 6.0 installed.\r\nCompatibility is not guaranteed for devices without GPS capabilities or devices that are connected only to Wi-Fi networks\r\nCompatibility with tablet devices is not guaranteed.\r\nApplication may not run on certain devices even if they have compatible OS versions installed.\r\nIt is recommended to play while connected to a network in order to obtain accurate location information.\r\nCompatibility information may be changed at any time.\r\nPlease visit http://www.PokemonGO.com for additional compatibility information.\r\nInformation current as of July 5, 2016\r\n\r\nANTI-BAN Tips !\r\nDo not go faster than 20 Kmph\r\nDo not change your location more than 10 KM away or you'll get soft banned\r\n\r\nWhatâ™s New:\r\n- Capture location: The location where a Pokémon was caught will now be displayed on their information screen.\r\n- Pokémon GO Plus and Incense: Trainers can attempt to capture Pokémon they encounter from using Incense with the Pokémon GO Plus accessory.\r\n- Fixed a bug that caused some users to get stuck on the loading screen, even after restarting the app.\r\n- Fixed a bug where the camera sometimes moved at slow speeds during battle.\r\n- Minor bug fixes\r\n\r\nHack Instructions:\r\nDownload and install the latest Pokemon GO version\r\nDownload and install Hide Mock Location (link below)\r\nDownload and install Xposed Ins6taller (Update framework inside the app if needed)\r\nOpen the Hide Mock Location App and select Pokemon Go\r\nActivate Hide Mock Location Module using Xposed Installer\r\nReboot your device\r\nDownload and Install Xposed Pokemon app (link below)\r\nActivate Xposed Pokemon Module using Xposed Installer\r\nReboot your device\r\nOpen up Xposed Pokemon app and select a location (Use &quot;search&quot; to look for a specific location)\r\nPress &quot;Start&quot;\r\nOpen Pokemon GO and Move using on-screen joystick\r\nYou can also enable &quot;Walk&quot; Feature and Use joystick to specify direction, Player will keep moving in that direction :)\r\nSet Speed to minimum (Or else you'll not get any pokemon)\r\n\r\nRequires Android 4.0/4.4 and up","torrent":{"xt":"urn:btih:e77767cd07626af089d4e0c1c38b21af63a32391","amp;dn":"Pokemon+Go+v0.39.1+%28Mods%29+APK+%5BSadeemPC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e77767cd07626af089d4e0c1c38b21af63a32391","infoHashBuffer":{"type":"Buffer","data":[231,119,103,205,7,98,106,240,137,212,224,193,195,139,33,175,99,163,35,145]},"announce":[],"urlList":[]}}