{"title":"Ghost Boy - Martin Pistorius","uid":10556158,"size":3127811,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7d31779cc191d2ffd2343e5abf77a3b55ee1548&amp;dn=Ghost+Boy+-+Martin+Pistorius&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":3,"uploader":"Mohammad_AT","files":3,"time":1405393744,"description":"In January 1988, aged twelve, Martin Pistorius fell inexplicably sick. First he lost his voice and stopped eating; then he slept constantly and shunned human contact. Doctors were mystified. Within eighteen months he was mute and wheelchair-bound. Martin's parents were told that an unknown degenerative disease had left him with the mind of a baby and he probably had less than two years to live. Martin went on to be cared for at centres for severely disabled children, a shell of the bright, vivacious boy he had once been. What no-one knew is that while Martin's body remained unresponsive his mind slowly woke up, yet he could tell no-one; he was a prisoner inside a broken body. Then, in 1998, when Martin was twenty-three years old, an aromatherapy masseuse began treating him and sensed some part of him was alert. Experts were dismissive, but his parents persevered and soon realised their son was as intelligent as he'd always been. With no memory of the time before his illness, Martin was a man-child reborn in a world he didn't know. He was still in a wheelchair and unable to speak, but he was brilliantly adept at computer technology. Since then, and against all odds, he has fallen in love, married and set up a design business which he runs from his home in Essex. Ghost Boy is an incredible, deeply moving story of recovery and the power of love. Through Martin's story we can know what it is like to be here and yet not here - unable to communicate yet feeling and understanding everything. Martin's emergence from his darkness enables us to celebrate the human spirit and is a wake-up call to cherish our own lives.\n\n**\n\nReview\n\n'It is a deeply affecting and at times shocking book... The Diving-Bell and the butterfly but with a happy ending' Sunday Times 17/7 'Deeply moving' Mail on Sunday ']Pistorius] is almost fealess in the way he confronts emotional reality' Catherine Deveney, Scotland on Sunday","torrent":{"xt":"urn:btih:e7d31779cc191d2ffd2343e5abf77a3b55ee1548","amp;dn":"Ghost+Boy+-+Martin+Pistorius","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7d31779cc191d2ffd2343e5abf77a3b55ee1548","infoHashBuffer":{"type":"Buffer","data":[231,211,23,121,204,25,29,47,253,35,67,229,171,247,122,59,85,238,21,72]},"announce":[],"urlList":[]}}