{"title":"Audio Hijack 3.0.1 [Mac Os X] [coque599]","uid":11679348,"size":16442150,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e8c5edd937f8b83c22a7f0c4216793922c06812b&amp;dn=Audio+Hijack+3.0.1+%5BMac+Os+X%5D+%5Bcoque599%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"coque599","files":1,"time":1423010311,"description":"Description\n\nRecord any audio, with Audio Hijack! Save audio from applications like iTunes, Skype or Safari, or from hardware devices like microphones and mixers.\n\nRecord Any App\nJust select an application and hit Record. Now you're saving its audio!\n\nRecord From Devices\nRecord from microphones, mixers, or other audio input devices.\n\nRecord System Audio\nThe System Audio source helps you record all the audio heard on your Mac.\n\nRecord Web Streams\nThere's oodles of streaming audio on the web. Use Audio Hijack to save it.\n\nIncrease the Volume\nStuck with small laptop speakers? Use Volume Overdrive to crank things past 100%.\n\nVoIP Recording\nEasily save conversations from Skype, FaceTime, Google Talk, and more.\n\nImport Analog Content\nIf you still have music on tapes or vinyl, Audio Hijack can help you digitize it.\n\nPodcast Recording\nCustomizable source and recording options give podcasters full control.\n\nPull From DVDs\nImport audio from concert DVDs, movies, and more, for listening in iTunes and beyond.\n\nEasy Recording Defaults\nIf you don't know much about audio formats, Audio Hijack is here to help.\n\nBulletproof Recording\nBulletproof recording means that even if your computer crashes, you'll never lose a recording.\n\nPopular Formats\nRecord to the world's most popular audio formats, including MP3 and AAC.\n\nRecording Presets\nTweak your recording settings to perfect, then save a preset for future use with just one click.\n\nLossless Formats Too\nYou can also save perfect-fidelity audio in AIFF, WAV, Apple Lossless, or FLAC.\n\nSmart Controls\nAutomatically split files based on size or time. Neat!\n\nSession Templates\nUse the Template Chooser to get a pre-configured Session. Tweak as needed!\n\nPreview Recordings\nCheck your recordings by playing them back with a single click.\n\nTime Shift\nThe new Time Shift effect lets you pause, delay, and rewind live audio!\n\nRe-usable Sessions\nOnce you've configured a Session to your liking, you can re-use it over and over.\n\nGorgeous Audio Effects\nThe included audio effects are easy to use and easy on the eyes.\n\nTimed Recordings\nUse the Schedule tab to set up timed recordings, for when you're not around.\n\nEasy Organization\nFind all of your recordings, sorted by Session, in the Recordings tab.\n\nDucking Effect\nDJs and Podcasters will love the auto-ducking now possible.\n\nWake Up!\nThe Scheduling feature can also turn any app on your Mac into an alarm clock.\n\nSeed And Enjoy\nIf you like my work vote it good","torrent":{"xt":"urn:btih:e8c5edd937f8b83c22a7f0c4216793922c06812b","amp;dn":"Audio+Hijack+3.0.1+%5BMac+Os+X%5D+%5Bcoque599%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8c5edd937f8b83c22a7f0c4216793922c06812b","infoHashBuffer":{"type":"Buffer","data":[232,197,237,217,55,248,184,60,34,167,240,196,33,103,147,146,44,6,129,43]},"announce":[],"urlList":[]}}