{"title":"WhatsApp Messenger v2.10.222 apk Android - iamponu","uid":8582983,"size":10233021,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:e8d3d5324af9a547c69dd158618d29e2065fd678&amp;dn=WhatsApp+Messenger+v2.10.222+apk+Android+-+iamponu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":0,"uploader":"pirate983","files":-1,"time":1371459698,"description":"Description :\nWhatsApp Messenger is a smartphone messenger available\nfor Android and other smartphones. WhatsApp uses your 3G\nor WiFi (when available) to message with friends and family.\nSwitch from SMS to WhatsApp to send and receive\nmessages, pictures, audio notes, and video messages. First\nyear FREE! ($0.99 USD/year after)\n\nWHY USE WHATSAPP:\n*NO HIDDEN COST: Once you and your friends download\nthe application, you can use it to chat as much as you want.\nSend a million messages a day to your friends for free!\nWhatsApp uses your Internet connection: 3G/EDGE or Wi-Fi\nwhen available.\n\n*MULTIMEDIA: Send Video, Images, and Voice notes to\nyour friends and contacts.\n\n*GROUP CHAT: Enjoy group conversations with your\ncontacts.\n*NO INTERNATIONAL CHARGES: Just like there is no\nadded cost to send an international email, there is no cost to\nsend WhatsApp messages internationally. Chat with your\nfriends all over the world as long as they have WhatsApp\nMessenger installed and avoid those pesky international SMS\ncosts.\n\n*SAY NO TO PINS AND USERNAMES: Why even bother\nhaving to remember yet another PIN or username? WhatsApp\nworks with your phone number, just like SMS would, and\nintegrates flawlessly with your existing phone address book.\n\n*NO NEED TO LOG IN/OUT: No more confusion about\ngetting logged off from another computer or device. With\npush notifications WhatsApp is ALWAYS ON and ALWAYS\nCONNECTED.\n\n*NO NEED TO ADD BUDDIES: Your Address Book is used\nto automatically connect you with your contacts. Your\ncontacts who already have WhatsApp Messenger will be\nautomatically displayed.\n\n*OFFLINE MESSAGES: Even if you miss your push\nnotifications or turn off your phone, WhatsApp will save your\nmessages offline until you retrieve them during the next\napplication use.\n\n*AND MUCH MORE: Share location, Exchange contacts,\nCustom wallpaper, Custom notification sounds, Landscape\nmode, Precise message time stamps, Email chat history,\nBroadcast messages and MMS.\n\nSimply install the apk file in your android device.","torrent":{"xt":"urn:btih:e8d3d5324af9a547c69dd158618d29e2065fd678","amp;dn":"WhatsApp+Messenger+v2.10.222+apk+Android+-+iamponu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8d3d5324af9a547c69dd158618d29e2065fd678","infoHashBuffer":{"type":"Buffer","data":[232,211,213,50,74,249,165,71,198,157,209,88,97,141,41,226,6,95,214,120]},"announce":[],"urlList":[]}}