{"title":"Mount Your Friends v1.Hun-K","uid":10686467,"size":209543783,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e96a96629a9e49e53fc8bd7a62692080bd739e39&amp;dn=Mount+Your+Friends+v1.Hun-K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"dRumMzZ","files":-1,"time":1407083649,"description":"I am not the original poster, I found this version on a russian forum (http://small-games.info/?go=game&amp;c=5&amp;i=16496) and since the DL links are kind of slow I decided to post it here.  \n\nIf there's any problem I can take it down or give proper credit.\n\n--- \n  \nExperience the extreme simulated sporting sensation that's sweeping our digital nation! Mount Your Friends is a fiercely competitive sporting event for you to play with your friends in the contextual security of your own home, assuming that your home is not composed of sexual innuendo. If it is, we may suggest buying a new home or at least getting the current one cleaned professionally. \n\nMount Your Friends is a physics based competitive climbing game where what you climb is each other. Players take turns climbing to the top of a tower of previous climbers (and a goat) working to become the new highest point before time runs out. If you run out of time before reaching the top, you're eliminated. It's simple to get into, but difficulty to master. Adept competitors can create massive towers by flinging themselves faster than simple climbing methods can attain. Of course, you may also end up just falling all the way down a tower if you miss!\n\n\nMinimum: \nOS: Windows XP or Later \nProcessor: 2.4 GHz or better \nMemory: 2 GB RAM \nGraphics: Graphics card capable of Pixel and Vertex Shader 3.0 (game uses XNA 4.0 in Hi-Def mode) \nDirectX: Version 10 \nHard Drive: 200 MB available space \nAdditional Notes: Currently requires Windows Media Player to be installed on your system. Game supports Microsoft XBox 360 Controllers or Keyboard/Mouse control  \n  \n","torrent":{"xt":"urn:btih:e96a96629a9e49e53fc8bd7a62692080bd739e39","amp;dn":"Mount+Your+Friends+v1.Hun-K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e96a96629a9e49e53fc8bd7a62692080bd739e39","infoHashBuffer":{"type":"Buffer","data":[233,106,150,98,154,158,73,229,63,200,189,122,98,105,32,128,189,115,158,57]},"announce":[],"urlList":[]}}