{"title":"The Great Wall of China (Art Ebook).pdf","uid":15939795,"size":35817885,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea31cf401666eda58341d4f607686ad42b233de4&amp;dn=The+Great+Wall+of+China+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":2,"uploader":"STBGD","files":1,"time":1475442433,"description":"The Great Wall of China - With 159 Duotone Photographs and 10 Maps\r\nThames and Hudson | 1990 | 0500541566 | English | 232 pages | PDF | 34 MB\r\n\r\nOver many years and many journeys, Daniel Schwartz has patiently and meticulously photographed one of mankind's supreme monuments - the Great Wall of China. Schwartz was the first foreigner ever to be allowed such privileged access to the Wall. From the Yellow River westward he travelled through mountains and deserts and frozen grasslands to the borders of Central Asia. China's new policy of openness encouraged him recently to revisit the Wall and to photograph areas that had been closed to him on previous journeys. To place the photographs in context, the Chinese historian Luo Zhewen, who had dedicated his life to the study of the great wall, has written an essential brief history. Also included in Jorge Luis Borges's meditation 'The Wall and the Books' and an extract from Franz Kafka's short story 'The Great Wall of China'. This extraordinary project is at once a beautiful photographic essay, an intriguing conceptual art project, and a personal odyssey. Daniel Schwartz, with his prfound and haunting vision of the Great Wall, has made not only a unique document but a book that is a work of art in itself","torrent":{"xt":"urn:btih:ea31cf401666eda58341d4f607686ad42b233de4","amp;dn":"The+Great+Wall+of+China+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea31cf401666eda58341d4f607686ad42b233de4","infoHashBuffer":{"type":"Buffer","data":[234,49,207,64,22,102,237,165,131,65,212,246,7,104,106,212,43,35,61,228]},"announce":[],"urlList":[]}}