{"title":"Dungeon of Cum - DoCR - Jul 25, 2016 - Jezebelle Bond","uid":16000543,"size":1104085437,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ea6c2b0d8031291fbd0fe08586a7d3185c58cec0&amp;dn=Dungeon+of+Cum+-+DoCR+-+Jul+25%2C+2016+-+Jezebelle+Bond&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":40,"uploader":"merzedes","files":443,"time":1476120848,"description":"&quot;The SexSlave Named Bond&quot; \r\nDungeon of Cum : Redux\r\n Jezebelle Bond\r\n\r\nMp4 + Pics. \r\n\r\nMolten hot Jezebelle Bond is back for another round in The Dungeon. Jezebelle oozes sexuality, has a killer body and loves bondage, and loves to fuck. T.J. Cummings is the lucky customer this week, as he finds Ms. Bond waiting for him in a gravity suspension. After he peruses our offering, it's time to sample the goods as he breaks out his flogger. The cold leather of the flogger is quickly warmed up as Mr. Cummings' works Jezebelle's vulnerable body over from head to toe. With juices pumping, T.J. strategicaly removes Ms. Bond's panties to get his fingers in Jezebelle's pussy and fuck her eager mouth. Switching gears, Jezebelle is then tied by her hands and feet. Legs wide. Pussy exposed. Seeing Jezebelle in such a submissive position, Mr. Cummings can barely contain himself. After a furious ass spanking session, he mounts Jezebelle hard and deep. The harder she gasps and moans, the harder he nails her cunt, pausing only to briefly dick slap her face with his cock before entering her again. Next, we find beautiful Jezebelle gagged and tied naked, to a wooden box spreadeagle. T.J. gets it going again by sliding his cock into her sopping pussy. Then to reward Jezebelle for being such an obefient girl, he breaks out a massive vibrator and smashes it up against her pussy. Jezebelle's screams grow louder and louder as T.J. slides his cock back into her while he works her clit with the vibrator until she explodes in orgasm. With his slave satisfied, it's time for The Master to deliver the payload. And the payload is delivered... in Ms. Bond's open and inviting mouth\r\n\r\nScreens \r\n     \nhttp://www.dungeoncorp.com/updates16/DRE/JEZ_092107/index.php\r\n\r\nUploaded by Merzedes and Shallow2 \r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect. \r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:) \r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!! \r\n\r\nAny Questions ?? Read our FAQ!! \r\n     \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg \r\n     \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg \r\n\r\nCheers :-) \r\n\r\nKAT RIP","torrent":{"xt":"urn:btih:ea6c2b0d8031291fbd0fe08586a7d3185c58cec0","amp;dn":"Dungeon+of+Cum+-+DoCR+-+Jul+25%2C+2016+-+Jezebelle+Bond","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea6c2b0d8031291fbd0fe08586a7d3185c58cec0","infoHashBuffer":{"type":"Buffer","data":[234,108,43,13,128,49,41,31,189,15,224,133,134,167,211,24,92,88,206,192]},"announce":[],"urlList":[]}}