{"title":"Avengers Disassembled Complete (- Nem -)","uid":9467884,"size":439897489,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:eada90dd230ce3e3603417aa68f3612134f470c2&amp;dn=Avengers+Disassembled+Complete+%28-+Nem+-%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":24,"leechers":1,"uploader":"nemesis43","files":36,"time":1389492377,"description":"Plot Summary\n\nWhen Wasp began a romantic relationship with Hawkeye, she would constantly talk to Scarlet Witch about it. While lounging around the swimming pool, a drunk Wasp accidentally slips and reveals to Wanda that she once had children and that this fact was hidden from her by her teacher, Agatha Harkness. After confirming the truth of the story, that her children were not real and were actually willed into being, Wanda becomes enraged. Her initial acts are subtle at first, but become terrifying and result in the destruction of the Avengers team as a whole. An attack by the recently deceased Jack Of Hearts - who walks into the Avengers Mansion gates and explodes, killing Scott Lang - is followed by Iron Man giving an embarrassing, drunken, enraged speech to the UN in which he shouts and rants to the Latverian delegate about how he should just kill him. The Vision then slams a Quinjet into the already battered Avengers mansion before dropping several large, silver orbs from his mouth which proceed to form into copies of the Avengers long-time enemy Ultron, which attack the team. Unprovoked, She-Hulk now becomes more and more enraged and grabs the Vision and rips him in half, and proceeds to attack her startled friends. The culmination of events is the sudden, inexplicable arrival of a fleet of Kree warships who attack the assembled heroes. Hawkeye dies when he sacrifices himself to save his friends and gets sucked into a warship's air intake, causing it to explode. The remaining Kree troops around the ground dematerialize as quickly as they had at first come, and the smaller attack ships flee the scene. Doctor Strange finally appears on the scene to ask which powerful being could possibly be causing these horrific things. The group and Strange deduce that the Scarlet Witch is behind the events due to the loss of her children, and fly to apprehend her. When Strange confronts and uses the All-Seeing Eye of Agamotto to show her the truth of what she has unwittingly caused, Wanda falls to the ground and her creations fade away. Magneto, Professor X and the mutants that made up Excalibur are in Genosha, trying to rebuild after the most recent destruction of the small nation, hear about the destruction caused by Magneto's daughter. Magneto travels to the Avengers and takes his daughter away back to Genosha. He seals her in his home in hopes of protecting her from the outside world, repairing her shattered mind and nursing her back to health. The tragic events shock the Avengers so much that they decide to disperse and the team is effectively ended.\n\nThis story arc is one of the most controversial of any Avengers storyline, leading to the deaths of three major characters: Hawkeye, Vision and Scott Lang and the temporary end of the Avengers, who would reform in the title New Avengers (actually only a month later in real comics terms). Under the creative direction of Brian Bendis, among others, Disassembled was used to shift the tone and reset the Avengers franchise for years to come.\n\nAccompanying stories were written in other major Marvel titles at the time which also concluded their runs. In the pages of Thor, Thor battles to stop the cycle of death and rebirth called Ragnarok, set off this time by Loki. The conclusion sees Thor enter a period of hibernation. Thor ceased to feature with the main Avengers team until his return to the group in 2010 with the relaunch of Avengers. In Iron Man, Tony Stark encounters a terrorist weapons developer who steals a suit of Iron Man armor. In Captain America, Steve Rogers discovers that his wartime partner Bucky Barnes was not in fact dead, but is still alive as the Russian agent: Winter Soldier.","torrent":{"xt":"urn:btih:eada90dd230ce3e3603417aa68f3612134f470c2","amp;dn":"Avengers+Disassembled+Complete+%28-+Nem+-%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eada90dd230ce3e3603417aa68f3612134f470c2","infoHashBuffer":{"type":"Buffer","data":[234,218,144,221,35,12,227,227,96,52,23,170,104,243,97,33,52,244,112,194]},"announce":[],"urlList":[]}}