{"title":"Fable.The.Lost.Chapters.PC","uid":3765139,"size":2318467072,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:eb5349af39771c25535041fd98729be1e78bb4fc&amp;dn=Fable.The.Lost.Chapters.PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":2,"uploader":"Whistler2k4","files":4,"time":1186454952,"description":"Fable : The Lost Chapters\n\nFeatures\n\n    *\n\n      Experience expanded content. Explore the original worlds and core missions of &quot;Fable&quot; that thrilled Xbox gamers and discover additional regions, storylines and side quests, as well as optional missions unique to Windows gamers with &quot;Fable: The Lost Chapters&quot;. In addition, &quot;Fable: The Lost Chapters&quot; offers the ability to fight new monsters, practice an expanded group of spells, don new armor, wield additional weapons and interact with new expressions.\n    *\n\n      Witness stunning graphics. &quot;Fable: The Lost Chapters&quot; is fully optimized for the Windows platform, bringing with it breath-taking graphics that allow you to view the world of Albion at its best.\n    *\n\n      Forge a hero based on actions. Heroes age and evolve through the actions players choose and the paths they follow - be it for good, evil or in between. Those who ply the way of the sword will see their muscles bulge. Those who weave the dark arts will witness power crackle at their fingertips. And those who rely on speed and stealth will develop lightning-like reflexes and eagle-eyed accuracy.\n    *\n\n      Engage in intense real-time combat. Players collect battle scars as they duel with cunning foes and deadly creatures. They can master an array of deadly weapons as they hone the art of blade-craft, hunt their quarry using subterfuge and stealth, or weave death from the elements as they harness the dark arts of the arcane.\n    *\n\n      Build a living legend. Through deeds and actions, &quot;Fable: The Lost Chapters&quot; players build a name for their character across the land. They can recruit allies and followers, gain glory or notoriety, make friends and enemies, the whole time interacting with a living world of people, places and events all reactive to them.\n    *\n\n      Shape and exploring a living, evolving world. Players champion or manipulate an ever-changing land with competitive and cooperative heroes, dynamic weather systems, and environments teeming with cultures, creatures, citizens and cities.\n    *\n\n      Hone scores of unique skills and extras. Players master new abilities and add possessions as their character develops. They can master the art of thievery, acquire a family, real estate, clothing or tattoos, and more. &quot;Fable: The Lost Chapters&quot; expands these offerings, providing the player with even more customization choices.\n    *\n\n      Never play the same game twice. Once an adventure has been completed, players can forge a new tale full of unexpected twists and turns, with new skills, powers, influences, allies and enemies.\n\n___________________________________________________________________________________\n\n Based on the best-selling award-winning Xbox title Fable, Fable: The Lost Chapters is now fully optimized for the Windows platform complete with expanded content, greater customization, new quests and enhanced graphics.\n\nIn this groundbreaking role-playing adventure game from Lionhead Studios, your every action determines your character&amp;#039;s skills, appearance and morality. Your character&amp;#039;s life story is created from childhood through to adulthood and on to old age. Grow from an inexperienced child into the most powerful being in the world, spoken of by all and immortalized in legend.\n\nAs additional story and side quests await, choose the path of righteousness, or dedicate your life to evil, and see yourself transform into a reflection of your actions and decisions. Age leaves you wizened and battle leaves you scarred as you explore the world of Albion and the plethora of expanded and enhanced content.\n\nWith experience comes advancement and physical change, whether it be expanding muscles, a keen eye and nimble form, or the buzz of magical energies around your finger tips. As you develop your alter ego, the world reacts to you and your actions. People comment on your successes and failures, your appearance, and your behavior.\n\nFable: The Lost Chapters offers Windows gamers even more character customization choices that will impact your appearance. The denizens of Albion&amp;#039;s many opinions are expressed through applause, mockery, trepidation, panic, and even flirtation if they feel so inclined.\n\nEach person you aid, each flower you crush, each creature you slay, will change this world forever. In Fable: The Lost Chapters , gamers decide: &quot;Who will I be?&quot; ","torrent":{"xt":"urn:btih:eb5349af39771c25535041fd98729be1e78bb4fc","amp;dn":"Fable.The.Lost.Chapters.PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb5349af39771c25535041fd98729be1e78bb4fc","infoHashBuffer":{"type":"Buffer","data":[235,83,73,175,57,119,28,37,83,80,65,253,152,114,155,225,231,139,180,252]},"announce":[],"urlList":[]}}