{"title":"[Pulitzer] Guns, Germs, and Steel, The Fates of Human Societies","uid":7972831,"size":934430,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebb8432225bef1f9a06bb9bc3b24123fa8a25ef6&amp;dn=%5BPulitzer%5D+Guns%2C+Germs%2C+and+Steel%2C+The+Fates+of+Human+Societies+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":1,"uploader":"KatQwerty","files":3,"time":1356903560,"description":"[b][size=&quot;150&quot;]This book Won the 1998 Pulitzer prize in non fiction category[/size][/b]\n\n[b]Publication Date: July 11, 2005 | EPUB [/b]\n \n \n \nWith a new chapter. The phenomenal bestseller; over 1.5 million copies sold; is now a major PBS special.\n\nWinner of the Pulitzer Prize, Guns, Germs, and Steel is a brilliant work answering the question of why the peoples of certain continents succeeded in invading other continents and conquering or displacing their peoples. This edition includes a new chapter on Japan and all-new illustrations drawn from the television series. \n \n \nUntil around 11,000 BC, all peoples were still Stone Age hunter/gatherers. At that point, a great divide occurred in the rates that human societies evolved. In Eurasia, parts of the Americas, and Africa, farming became the prevailing mode of existence when indigenous wild plants and animals were domesticated by prehistoric planters and herders.\n \n \n \n \n As Jared Diamond vividly reveals, the very people who gained a head start in producing food would collide with preliterate cultures, shaping the modern world through conquest, displacement, and genocide.The paths that lead from scattered centers of food to broad bands of settlement had a great deal to do with climate and geography.\n \n \n \n But how did differences in societies arise? Why weren't native Australians, Americans, or Africans the ones to colonize Europe? Diamond dismantles pernicious racial theories tracing societal differences to biological differences. He assembles convincing evidence linking germs to domestication of animals, germs that Eurasians then spread in epidemic proportions in their voyages of discovery. In its sweep, Guns, Germs and Steel encompasses the rise of agriculture, technology, writing, government, and religion, providing a unifying theory of human history as intriguing as the histories of dinosaurs and glaciers. 32 illustrations\n\n\n\n \n \n ","torrent":{"xt":"urn:btih:ebb8432225bef1f9a06bb9bc3b24123fa8a25ef6","amp;dn":"%5BPulitzer%5D+Guns%2C+Germs%2C+and+Steel%2C+The+Fates+of+Human+Societies+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebb8432225bef1f9a06bb9bc3b24123fa8a25ef6","infoHashBuffer":{"type":"Buffer","data":[235,184,67,34,37,190,241,249,160,107,185,188,59,36,18,63,168,162,94,246]},"announce":[],"urlList":[]}}