{"title":"Sub Focus - Sub Focus [2009-MP3-320-M3U-Cov][Bubanee]","uid":5112604,"size":134229869,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ebcce50d606783c500faa19ad1b8a923126e4842&amp;dn=Sub+Focus+-+Sub+Focus+%5B2009-MP3-320-M3U-Cov%5D%5BBubanee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"bubanee","files":15,"time":1254881928,"description":"Please SEED for others to Enjoy!\nCheers, Bubanee\n\nTracklisting:\n\n01 Let The Story Begin (4:53)\n02 World Of Hurt (4:25)\n03 Follow The Light (5:34)\n04 Last Jungle (3:39)\n05 Deep Space (4:37)\n06 Rock It (4:35)\n07 Move Higher (4:12)\n08 Vapourise (4:05)\n09 Splash (3:58)\n10 Could This Be Real (3:36)\n11 Triple X (4:02\n12 Timewarp (4:37)\n13 Coming Closer (3:35)\n\nJust skip past the first minute if you dare. It`s the best thing John Carpenter hasn`t recorded in several years. Sub Focus` eagerly awaited debut album has come as a very welcome and unexpected surprise. I was expecting the bangers we already know and love such as recent funky ass, Pendulum-baiting &quot;Rock It&quot; (surely the bastard drum &amp; bass cousin of Daft Punk`s &quot;Robot Rock&quot; ?) and the massive wonky time clown step anthem &quot;Timewarp&quot; complete with the massive hoovers that don`t know if they are ascending or descending.\n\nI could even expect tracks like the later Photek / later Rufugie Kru stylings of &quot;World Of Hurt&quot; - the basslines and distorted synths although at complete odds with the clear vocals are perfectly counterbalanced, rescuing what could have been a little of a disaster in unsure hands. Other drum &amp; bass tracks such as &quot;Follow The Light&quot; move towards the typical Hospital sound without managing to sound quite as Jazz-Wanky as occassionally the Hospital sound can drift towards thanks to a subtle trance influence, similar to the sound of late 90`s Blue Amazon with the then unaffected influence of what was to happen to trance, if in spirit if not in tempo.\n\nIt`s really great to hear some fantasticly memorable songs in here also - &quot;Splash&quot; has Euro-riff all over it, as does &quot;Triple X&quot;. There`s a definite and refreshing intent to make a good album rather than just a collection of good tracks. And that`s the jump off point for what makes this album. Look away now if you`re a Sub Focus fanatic and don`t want to have the album ruined ...\n\nThis is an album that just happens to have some Drum &amp; Bass tracks on it. It also has some bloody great old school breakbeat. And House. And Dubstep. And Fidget-House. This makes it a great album for anyone remotely interested in Dance Music, and contender for the Dance Music album of the year.\n\nYes, it took me three listens to suddenly realise it, but &quot;Last Jungle&quot; is The Future Sound Of London`s &quot;Papua New Guinea&quot;. Or just a few samples away from being it anyway. The fact that it took me three listens is testament to how well it`s constructed however. It bears repeated listening, and it`s respectful enough to get away with it, and has just enough tipping of the hat to early Omni Trio to get away with it. We`re still in breakbeat territory however at this point.\n\nBut when you get to &quot;Move Higher&quot; you`ve moved to a completely different part of the club. Calvin Harris would be proud of the huge riff here. A contender for another single surely as some remixes will take this in directions other than the house / fidget dancefloor it sits in for some parts of the track. Stick a complete vocal on it and there will be a top 40 hit in this. Then there`s the Italio-Piano house of &quot;This Could Be Real&quot;, and the dubstep of album closer &quot;Coming Closer&quot;. Despite not being in the genre we know Sub Focus for, never at any point does any of it sound anything less than credible.","torrent":{"xt":"urn:btih:ebcce50d606783c500faa19ad1b8a923126e4842","amp;dn":"Sub+Focus+-+Sub+Focus+%5B2009-MP3-320-M3U-Cov%5D%5BBubanee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebcce50d606783c500faa19ad1b8a923126e4842","infoHashBuffer":{"type":"Buffer","data":[235,204,229,13,96,103,131,197,0,250,161,154,209,184,169,35,18,110,72,66]},"announce":[],"urlList":[]}}