{"title":"The Harvard Medical School Guide to Tai Chi [Epub &amp; Mobi] [S","uid":10097715,"size":2348883,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebdc40aad0a17e1fa8918e0a25b3a13ea0a87a45&amp;dn=The+Harvard+Medical+School+Guide+to+Tai+Chi+%5BEpub+%26amp%3B+Mobi%5D+%5BS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":1,"uploader":"krystine","files":-1,"time":1399331921,"description":"The Harvard Medical School Guide to Tai Chi: 12 Weeks to a Healthy Body, Strong Heart, and Sharp Mind\nAuthor: Peter M. Wayne &amp; Mark L. Fuerst\nPublished: 2013\nPublisher: Shambhala Publications\nISBN: 9781590309421\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\n\nConventional medical science on the Chinese art of Tai Chi now shows what Tai Chi masters have known for centuries: regular practice leads to more vigor and flexibility, better balance and mobility, and a sense of well-being. Cutting-edge research from Harvard Medical School also supports the long-standing claims that Tai Chi also has a beneficial impact on the health of the heart, bones, nerves and muscles, immune system, and the mind. This research provides fascinating insight into the underlying physiological mechanisms that explain how Tai Chi actually works.\n\n\nDr. Peter M. Wayne, a longtime Tai Chi teacher and a researcher at Harvard Medical School, developed and tested protocols similar to the simplified program he includes in this book, which is suited to people of all ages, and can be done in just a few minutes a day. This book includes:\n\nThe basic program, illustrated by more than 50 photographs\n\nPractical tips for integrating Tai Chi into everyday activities\n\nAn introduction to the traditional principles of Tai Chi\n\nUp-to-date summaries of the research literature on the health benefits of Tai Chi\n\nHow Tai Chi can enhance work productivity, creativity, and sports performance\n\nAnd much more.\n\n","torrent":{"xt":"urn:btih:ebdc40aad0a17e1fa8918e0a25b3a13ea0a87a45","amp;dn":"The+Harvard+Medical+School+Guide+to+Tai+Chi+%5BEpub+%26amp%3B+Mobi%5D+%5BS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebdc40aad0a17e1fa8918e0a25b3a13ea0a87a45","infoHashBuffer":{"type":"Buffer","data":[235,220,64,170,208,161,126,31,168,145,142,10,37,179,161,62,160,168,122,69]},"announce":[],"urlList":[]}}