{"title":"Soldier Spy (2016) (Epub) Gooner","uid":15993918,"size":468775,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ec02952451ca51a56f6d5a0fa99c12f0e31c3525&amp;dn=Soldier+Spy+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":2,"uploader":"GoonerTPB","files":2,"time":1476053000,"description":"Soldier Spy - The True Story of an MI5 Officer Risking his Life to Save Yours (2016) (Epub) Gooner\r\n\r\nPublisher: Michael Joseph (6 Oct. 2016)\r\nLanguage: English\r\nISBN-10: 071818484X\r\nISBN-13: 978-0718184841\r\n\r\nIn the boot were six homemade pipe bombs, all linked to detonate at the same time from a single call on a brand-new pay-as-you-go phone found on the target.\r\n\r\nSpecial Branch also found Chinese Type 56 assault rifles with eight full magazines full of ammunition.\r\n\r\nHis target was a local school. He planned to attack two coaches of teenagers returning home after a school trip to France. Approximately sixty children, their accompanying teachers and their waiting parents.\r\n\r\nHe was going to kill them all.\r\n\r\n'My world was dark, no colour, no right or wrong and no back-up. People like me exist to fight those no one else dares face. I wasn't the last resort; I was the only option'\r\n\r\nTom Marcus was recruited by MI5 in the wake of the 7/7 attacks on London. After five years spent undercover as part of a covert British Army special operations unit he offered the Security Service the edge they so desperately needed.\r\n\r\nFollowing months of intensive training, Marcus was thrown into a world of relentless, unimaginable pressure; a never-ending struggle to prevent terrorist atrocities on our city streets, foil devastating strikes against the nation's infrastructure, and keep our country's secrets safe from foreign spies. Split second decisions carried life or death consequences. And not all his colleagues would survive the fight.\r\n\r\nIn this explosive first-hand account, Soldier Spy lifts the lid on the war being waged by MI5 to keep us safe in our towns and cities for the first time; a blistering, visceral insight into life on the front line against terror, revealed in never-before-seen detail.\r\n\r\nIt was a job which would inevitably exact a heavy price. But when it came down to it, Marcus knew he didn't have a choice.\r\n\r\n'Some people join the service out of a sense of duty, some out of wanting to do some good by removing the evil. I did it because it's all I knew. I'm a hunter of people and I'm damn good at it.'","torrent":{"xt":"urn:btih:ec02952451ca51a56f6d5a0fa99c12f0e31c3525","amp;dn":"Soldier+Spy+%282016%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec02952451ca51a56f6d5a0fa99c12f0e31c3525","infoHashBuffer":{"type":"Buffer","data":[236,2,149,36,81,202,81,165,111,109,90,15,169,156,18,240,227,28,53,37]},"announce":[],"urlList":[]}}