{"title":"TreeSize Professional 6.3.3.1183 (x86x64) Incl Keygen [SadeemPC]","uid":15499946,"size":84652641,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ec968c714ec5659de897385c9c7a1aa6ae8c9bc6&amp;dn=TreeSize+Professional+6.3.3.1183+%28x86x64%29+Incl+Keygen+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":0,"uploader":"SadeemPC","files":6,"time":1470485372,"description":"TreeSize Professional is a powerful and flexible hard disk space manager for Windows 2003/2008/XP/Vista/7/8. Find out which folders are the largest on your drives and recover megabytes on your disks. TreeSize Professional shows you the size, allocated and wasted space, the number of files, 3D charts, the last access date, the file owner and permissions, the NTFS compression rate and much more information for several folders or drives you choose. It also lets you search drives, entire servers or the entire network for old, big, temporary and duplicate files. The search results can be moved, deleted or exported. The application has an intuitive Explorer-like user interface, it is fast and multi-threaded and supports Unicode and scheduled scans. You can print detailed reports or export the collected data to Excel and to an HTML, XML or text file. TreeSize Professional can be started from the context menu of every folder or drive. \r\n\r\nWhy TreeSize Professional:\r\n- Manage and clean up disk space efficiently\r\n- Visualize disk usage\r\n- Detailed analysis, right down to the lowest directory levels\r\n- Find and remove redundant files\r\n- Numerous export and reporting options\r\n- The versatile duplicate file search\r\n\r\nEfficient Disk Space Management from all perspectives\r\n- See the size of all folders including their subfolders and break it down to the file level.\r\n- Visualize disk usage in the pie or bar chart.\r\n- Tree maps visualize hierarchies and sizes of subfolders in the selected directory.\r\n- Detailed view with single files and additional information (e.g. date of last access).\r\n- Statistics about file types and file owners for every branch.\r\n- Filter the file system tree on the left by a certain user or file type.\r\n- See a list of the 100 largest files.\r\n- Distribution of occupied disk space by file age.\r\n- Scan FTP, WebDAV, and SharePoint servers.\r\n- Disk Space Management on smartphones and mobile devices.\r\n\r\nFull NTFS Support\r\n- Unicode file and folder names are supported.\r\n- File based NTFS compression.\r\n- Hardlinks and Alternate Data Streams (ADS).\r\n- File paths longer than 255 characters will be found and processed correctly.\r\n- Analyse NTFS permissions.\r\n\r\nPerfect Integration with the Windows Explorer\r\n- Explorer context menu supported inside the TreeSize window.\r\n- TreeSize Professional can be started from within the Windows Explorer.\r\n- Drag and Drop is enabled.\r\n- On a Windows Core Server TreeSize can serve as a graphical user interface.\r\n\r\nFull Network Support\r\n- TreeSize Professional offers full support for network drives and scans UNC paths like Servershare.\r\n\r\nWhats New \nhttp://www.jam-software.com/treesize/changes.shtml","torrent":{"xt":"urn:btih:ec968c714ec5659de897385c9c7a1aa6ae8c9bc6","amp;dn":"TreeSize+Professional+6.3.3.1183+%28x86x64%29+Incl+Keygen+%5BSadeemPC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec968c714ec5659de897385c9c7a1aa6ae8c9bc6","infoHashBuffer":{"type":"Buffer","data":[236,150,140,113,78,197,101,157,232,151,56,92,156,122,26,166,174,140,155,198]},"announce":[],"urlList":[]}}