{"title":"The Sims 4  update ver 1.5.139.1020 + Get to Work DLC Mr DJ","uid":11795027,"size":3045099259,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:eceb8bfcee298eebeb8f418b63614e3a683a0feb&amp;dn=The+Sims+4++update+ver+1.5.139.1020+%2B+Get+to+Work+DLC+Mr+DJ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":5,"uploader":"rock840","files":4,"time":1428105265,"description":"The Sims 4 RELOADED update version 1.5.139.1020 + ALL DLC's [ Including Get To Work Addon ] .....\n\nThis is meant for those who have my &quot;The Sims 4 repack Mr DJ&quot; : &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/11022192/The_Sims_4_glitch_free_dlc_s_unlocked[Origin]_Multi17_repack_Mr_&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/11022192/The_Sims_4_glitch_free_dlc_s_unlocked[Origin]_Multi17_repack_Mr_&lt;/a&gt;\n OR\nIf u have The Sims 4-RELOADED\n OR\nIf u have any other release apart from RELOADED (3DM), just make sure it's working for you ......\n\nALL PREVIOUS UPDATES AND DLCs INCLUDING GHOSTS, POOLS, HOLIDAY CELEBRATION, GENEALOGY , OUTDOOR RETREAT PACK AND BASEMENTS ARE INCLUDED .....\n\nFeatures:\n\n * Become A Doctor: You rule the Hospital! Live the thrilling life of an\n emergency room Doctor and spend your days saving lives. Just make sure to\n stay focused as you're treating patients, delivering babies, and performing\n emergency surgery\n * Become A Detective: You rule the Police Station! Grab your badge and start\n solving elaborate mysteries as a Detective. See what secrets you uncover as\n you investigate crime scenes, interrogate Sims, arrest criminals, and work\n your way from Cadet to the Chief of Police\n * Become A Scientist: You rule the Science Lab! Use your analytical\n mastermind to create crazy inventions as a Scientist. Collect unique\n specimens to craft diabolical creations like the Sim Ray and decide whether\n you'll use your inventions for good or to torment your fellow Sims\n * Create Unique Retail Businesses: You rule your business! Create any type\n of retail business you desire including bakeries, clothing boutiques, art\n galleries, bookstores, and many more. Customize every facet of your\n business with Build Mode and watch the simoleons roll in! Select what items\n to sell, manage your employees as you see fit, and schmooze your customers\n to close the sale\n * New Career Venues: Spend your days saving lives at the Hospital, booking\n criminals at the Police Station, searching for alien life at the Science\n Lab, or chatting up customers at one of the many retail businesses you've\n created!\n * Learn New Skills: Learn new skills to help your Sims create even more\n unique objects to enjoy in The Sims 4. Capture the picture-perfect photo or\n bake and decorate a delicious treat with the new Photography and Baking\n skills. Display your creations at home or sell them to earn some extra\n simoleons\n * Discover Aliens: Aliens have landed! Uncover which Sims are truly out of\n this world and discover the mysterious Alien dimension!\n\nINSTALL INSTRUCTIONS:\n\n1. DISABLE YOUR ANTIVIRUS BEFORE RUNNING 'Setup' ....\n2. INSTALL IT TO THE SAME LOCATION WHERE YOU HAVE INSTALLED THE SIMS 4 (REMOVE THE DEFAULT DIRECTORY THAT IS SPECIFIED IN THE INSTALLER , CLICK ON CONFIGURE, THEN CLICK ON BROWSE AND SPECIFY THE DIRECTORY WHERE U HAVE INSTALLED YOUR SIMS 4) ...\n3. ADD THE SIMS 4 GAME FOLDER TO THE EXCLUSION/EXCEPTION LIST OF YOUR ANTIVIRUS OTHERWISE YOUR ANTIVIRUS WILL CHANGE THE 'TS4.exe' FILE INTO A TEMPORARY FILE OR JUST DELETE IT WHICH WON'T LET THE GAME TO RUN, AFTER THIS STEP, U CAN ENABLE YOUR ANTIVIRUS....\n\nIF U HAVE ALREADY CREATED AN EXCEPTION FOR IT THEN IGNORE STEP 3...\n\nTIPS: \n\n -IF AFTER UPDATE , U DON'T FIND 'TS4.exe' , THEN IT MEANS YOUR ANTIVIRUS HAS BLOCKED IT, RESTORE IT FROM ANTIVIRUS QUARANTINE ZONE OR REINSTALL UPDATE WITH ANTIVIRUS DISABLED. (WINDOWS DEFENDER IS THE DEFAULT ANTIVIRUS)....\n\n -MAKE SURE BOTH VISUAL C++ ARE INSTALLED TO AVOID ANY MVS.dll ERROR OR rld.dll ERROR....\n\n -IF U GET AN ERROR MESSAGE STATING THAT THE GAME DATA IS MISSING, THEN IT MEANS U HAVE INSTALLED THE UPDATE IN THE WRONG LOCATION ...\n\n -IF U GET AN INITIALISATION FAILED ERROR, THEN IT MEANS U R MISSING NECESSARY PREVIOUS UPDATE AS ALREADY STATED , ATLEAST OR ABOVE UPDATE VERSION 1.0.732.20 MAY BE REQUIRED.....\n\n -IF SOME DLC'S ARE MISSING , COMPLETELY EXIT ORIGIN AND THEN PLAY THE GAME ....\n\nJUST DO EVERYTHING LIKE U DID FOR THE PREVIOUS UPDATE :) , OPEN THE GAME FROM 'TS4.exe' FROM GAME DIRECTORY OR THE DESKTOP SHORTCUT ...\n\nALWAYS OPEN THE GAME USING 'Run as administrator' TO AVOID ANY CRASH....\n\nIF U R STILL UNABLE TO GET IT WORKING, INBOX ME AT KICKASS OR ON MY FACEBOOK PAGE ....\n\nCheck out my Official facebook page for any help &quot;Mr DJ repacks&quot; \nLike it guys to support and get updates on upcoming repacks, gaming tips and requests","torrent":{"xt":"urn:btih:eceb8bfcee298eebeb8f418b63614e3a683a0feb","amp;dn":"The+Sims+4++update+ver+1.5.139.1020+%2B+Get+to+Work+DLC+Mr+DJ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eceb8bfcee298eebeb8f418b63614e3a683a0feb","infoHashBuffer":{"type":"Buffer","data":[236,235,139,252,238,41,142,235,235,143,65,139,99,97,78,58,104,58,15,235]},"announce":[],"urlList":[]}}