{"title":"GTA III - Repack","uid":10593387,"size":579987213,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ed015eaf192e1341cd6d5594a7dc9de90d560a5c&amp;dn=GTA+III+-+Repack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":0,"uploader":"Ytklyx15","files":-1,"time":1405827852,"description":"Grand Theft Auto III takes place in Liberty City, a city on the East Coast of America, which is loosely based on New York City. Altogether, the city and surrounding areas take up about three square miles. The version of Liberty City featured in Grand Theft Auto was also later used for Liberty City Stories, Advance and for one mission in San Andreas, and is one of three renditions of Liberty City featured throughout the series. A previous rendition of the city was featured in the original Grand Theft Auto game, and a different rendition was later used Grand Theft Auto IV (2008), its episodes The Lost and Damned and The Ballad of Gay Tony (both 2009), and in a top-down perspective in the handheld game Chinatown Wars (2009). Grand Theft Auto III is set around the autumn of 2001, when the game was first released; this was indicated by the Liberty Tree website, which included plot points that connect to events in the beginning of the game in its last existing monthly entry, dated 18 October 2001. The player progresses from the east (Portland) to the west (Shoreside Vale) during the game.\n\nSystem Requirements:\nAthlon 1,5 G, 3D Card 128 Mo, 512 Mo Ram\n\nInstructions:\nOpen setup and install the game. Then just play.\nEnjoy.","torrent":{"xt":"urn:btih:ed015eaf192e1341cd6d5594a7dc9de90d560a5c","amp;dn":"GTA+III+-+Repack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed015eaf192e1341cd6d5594a7dc9de90d560a5c","infoHashBuffer":{"type":"Buffer","data":[237,1,94,175,25,46,19,65,205,109,85,148,167,220,157,233,13,86,10,92]},"announce":[],"urlList":[]}}