{"title":"The Tetris Effect: The Game That Hypnotized The World","uid":15876173,"size":709489,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed087452557304d6bd24375d0e7f583ba4b4d761&amp;dn=The+Tetris+Effect%3A+The+Game+That+Hypnotized+The+World&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":1,"uploader":"Orangie2Dope","files":1,"time":1474513360,"description":"English | EPUB | 535 Pages | .7 MB\r\n\r\n\r\n\r\n\r\nTetris is perhaps the most instantly recognizable, popular video game ever made. But the fascinating story of its origins is lesser known. How did an obscure Soviet programmer, working on frail, antiquated computers, create a product that has earned nearly $1 billion in sales? How did an inspired, makeshift game turn into a worldwide sensation, which has been displayed at the Museum of Modern Art, inspired a Hollywood movie, and been played in outer space?\r\n\r\nIn this surprising, trivia-filled book, tech reporter Dan Ackerman describes how, as a teenager behind the Iron Curtain, Alexey Pajitnov was struck with inspiration, then meticulously worked for years to bring the game he had envisioned to life. Ackerman shows how Tetris worked its way first through Pajitnov’s office and then out into the world, entrancing player after player with its hypnotic shapes. Then, tracing the stories of the British, American, and Japanese moguls who raced each other for the rights, Ackerman recounts the game’s complex and improbable path to global success. The Tetris Effect is an homage to both creator and creation, and a perfect gift for anyone who's ever played the game—which is to say everyone","torrent":{"xt":"urn:btih:ed087452557304d6bd24375d0e7f583ba4b4d761","amp;dn":"The+Tetris+Effect%3A+The+Game+That+Hypnotized+The+World","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed087452557304d6bd24375d0e7f583ba4b4d761","infoHashBuffer":{"type":"Buffer","data":[237,8,116,82,85,115,4,214,189,36,55,93,14,127,88,59,164,180,215,97]},"announce":[],"urlList":[]}}