{"title":"Matters of Size - Penis Enlargement Exercise Program","uid":6593343,"size":4680755200,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ed106ad0b92430b1ae716ca31e429bb5fcaf147b&amp;dn=Matters+of+Size+-+Penis+Enlargement+Exercise+Program&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":9,"uploader":"CoreOfLore","files":241,"time":1312919314,"description":"Front Cover : http://leetleech.org/images/55719682033269678183.jpg\n\nImagine being exceptional, popular, known for something other men only wish they had. A big penis will give you all these things and more. If you have always wished you could have a long, thick, powerful penis like a porn star, then this may be the most important film you ll ever purchase. Read mode on next page.\n\nWith Matters of Size, you will learn all the classified secrets that most porn stars have protected for years, the same secrets the adult industry does not want you to know. You will add up to five inches to your length and girth with the same highly effective, doctor approved, natural penis enlargement exercises that most well endowed porn stars use in only minutes a day.\n\nMatters of Size has been the secret behind many well known porn stars and thousands of regular men just like you in achieving the huge penis size they have always dreamed of. Matters of Size has discovered exactly what works and what doesn t when it comes to penis enlargement. Our phenomenal, five phase, natural penis enlargement exercise system has changed thousands of lives. It works wonders regardless of age, race, or current penis size.\n\nMatters of Size created one of the most effective penis enlargement systems on the market by combining proven powerful exercises with size producing routines. Matters of Size is one of the most trusted names in natural penis enlargement and continues to help thousands of men everyday realize their penis size dreams. If you follow this program you will gain penis size guaranteed. Matters of Size is a name you can trust with a 100% success rate.\n\nNot only will this film give you a longer, thicker, more powerful looking penis, but you will enjoy other extraordinary rewards as well. With Matters of Size, you will also gain greater sensitivity, more powerful orgasms, the ability to last as long as you like in bed, the mastery to remain erect after orgasm, increased ejaculation volume, correction of a curved penis, among many other countless benefits. The new, virile you will be praised in every sexual encounter.\n\n","torrent":{"xt":"urn:btih:ed106ad0b92430b1ae716ca31e429bb5fcaf147b","amp;dn":"Matters+of+Size+-+Penis+Enlargement+Exercise+Program","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed106ad0b92430b1ae716ca31e429bb5fcaf147b","infoHashBuffer":{"type":"Buffer","data":[237,16,106,208,185,36,48,177,174,113,108,163,30,66,155,181,252,175,20,123]},"announce":[],"urlList":[]}}