{"title":"Primal's Taboo Sex - Brooklyn Chase - Mom Wants her Needs Satisf","uid":15689045,"size":939078098,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ed5e661d6bd4e45d0fb3bab9ea9db0d7488070a4&amp;dn=Primal%27s+Taboo+Sex+-+Brooklyn+Chase+-+Mom+Wants+her+Needs+Satisf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":28,"leechers":2,"uploader":"distinc","files":1,"time":1472378961,"description":"Primal's Taboo Sex - Brooklyn Chase - Mom Wants her Needs Satisfied - 720P\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=1121536503\r\n \nhttp://imagedisco.net/?g=8773693433\r\n\r\nPlot:\r\n\r\nBrooklyn walks into the living room where her son is watching TV. He can just tell something is off by the way she is dressed, the way she leans in too close, then when she puts her head on his lap, and...despite his struggle his dick starts getting hard. Brooklyn smiles knowingly. She lets her hands tease, almost like an accident. Little by little she gets her son harder and harder until his cock is pushing out the top of his shorts. Brooklynn knew his cock was so much bigger than his dad's. She married young, and now her older husband doesn't have the stamina to give her what she needs, and She has her needs, and she makes her son satisfy them completely\r\n\r\nBrooklynn's son has been trying to avoid her, He is obviously full of guilt about what he wants to do, but she sees his pants swell every time he looks at her. She decides to have a work-out in the garage, and gets her son to start teaching her some of the self defense stuff he knows. Brooklyn takes advantage of having him close. She is amused that her son thinks he can resist her. Brooklyn doesn't care what is right or wrong, she just needs her pussy licked and then fucked hard by a huge cock, and her son can give her exactly what she needs.\r\n\r\nGenre:Blowjobs, Pussy Eating, Tit play, Cowgirl, Doggy style, Facial","torrent":{"xt":"urn:btih:ed5e661d6bd4e45d0fb3bab9ea9db0d7488070a4","amp;dn":"Primal%27s+Taboo+Sex+-+Brooklyn+Chase+-+Mom+Wants+her+Needs+Satisf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed5e661d6bd4e45d0fb3bab9ea9db0d7488070a4","infoHashBuffer":{"type":"Buffer","data":[237,94,102,29,107,212,228,93,15,179,186,185,234,157,176,215,72,128,112,164]},"announce":[],"urlList":[]}}