{"title":"Three Stories - J. D. Salinger (unnpublished)","uid":9259575,"size":88597249,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed8f9de4b9151b3b0e5b998caf7a124e9e7b0e17&amp;dn=Three+Stories+-+J.+D.+Salinger+%28unnpublished%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":0,"uploader":"SmashAndGrab","files":-1,"time":1385607565,"description":"The short stories included in this book are the following:\n\n* The Ocean Full of Bowling Balls\n* Birthday Boy\n* Paula (also known as Mrs. Hincher)\n\nAdditionally, there is a letter from J. D. Salinger himself to a John Woodman.\n\n\nThe Ocean Full of Bowling Balls\n\n&quot;The Ocean Full of Bowling Balls&quot; is an unpublished work by J. D. Salinger. It is about the death of Kenneth Caulfield, who later became the character Allie in The Catcher in the Rye.\n\nThe story was initially going to appear in Harper's Bazaar, but Salinger withdrew the story before publication. This story is available only in the Princeton library. Those who wish to read it must check in with two forms of identification with the librarian, and are then supervised while they read the story behind the closed doors of a special reading room. As per the terms of Salinger's donation of the manuscript to Princeton University, it cannot be published until 50 years after his death; thus, the earliest it can be published is January 27, 2060. (Princeton Library guide pg. 2 line 5).\n\nAccording to Jack Sublette in his 1984 annotated bibliography of J.D. Salinger, Collier's fiction editor Knox Burger stated in 1948 that &quot;Ocean Full of Bowling Balls&quot; &quot;contains the greatest letter home from camp ever composed by man or boy.&quot; The letter referred to is sent from Holden Caulfield (later the protagonist of the The Catcher in the Rye) to his younger brother in this story, Kenneth.\n\n\nBirthday Boy\n\nThe story details a hospital visit by a woman to her husband. He is being treated for an alcohol-induced illness, and when she enters he pleads for a drink. When she denies his request he becomes enraged and gropes her.\n\nSalinger references this story as late as 1951 in letters, but its date of completion was actually 1946. According to notes available on the manuscript found in the Harry Ransom Center, as well as the correspondence to his literary agent at the time, Dorothy Olding, he intended to sell the story to one of the &quot;slicks&quot; to acquire some financial security after he returned from his military service.\n\n\nPaula (also known as Mrs. Hincher)\n\nThe story centers on a married couple, Frank and Paula Hincher, who are struggling to have a child. Mrs. Hincher convinces herself she is pregnant, and claims she needs bedrest. While her doctors tell her otherwise, she determines she will have a child, and sets up a nursery. Her husband finds her staying in bed and soon locking herself in the room. Weeks go by until a young girl is allowed in and reports there is a little baby in there but it won't talk. Overcome with frustration, Mr. Hincher breaks in the bedroom to find Mrs. Hincher curled in the fetal position in a crib. They decide to go on a vacation to Florida, where Mr Hincher subsequently has a mental breakdown in the lobby of the hotel and is sent to an asylum.\n\nSalinger completed the story in late 1941 and sold this story under the name &quot;Paula&quot; to Stag (magazine) in 1942 but the magazine decided not to publish the dark tale, referenced by himself as his only documented attempt at the horror genre. Salinger's agency was contacted by editors requesting he write a novel at the time, but his time in the military did not allow for this. In one letter he refers to this story as his only &quot;horror&quot; story. The story is essentially a set of fragments, and is available, as are letters referencing the piece, for a fee and required registration at the Harry Ransom Center at the University of Texas, as well as archives accessible only by his literary agency.","torrent":{"xt":"urn:btih:ed8f9de4b9151b3b0e5b998caf7a124e9e7b0e17","amp;dn":"Three+Stories+-+J.+D.+Salinger+%28unnpublished%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed8f9de4b9151b3b0e5b998caf7a124e9e7b0e17","infoHashBuffer":{"type":"Buffer","data":[237,143,157,228,185,21,27,59,14,91,153,140,175,122,18,78,158,123,14,23]},"announce":[],"urlList":[]}}