{"title":"Discoteca Anni 90 [Lossy Mp3 VBR] Hits of the 90s - Dance, Dream","uid":6568175,"size":1793433261,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ee754a7066ec3602eddc1e0eff25977ea13e2045&amp;dn=Discoteca+Anni+90+%5BLossy+Mp3+VBR%5D+Hits+of+the+90s+-+Dance%2C+Dream&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":2,"uploader":"proximun","files":227,"time":1311767139,"description":"DETAILS\n\nDate: 1990-1999\nGenre: Dance, Dream, Progressive, Techno, Trance.\nBit rate: Various (128-320 Kbps VBR)\nFormat: MP3\nSize: 1,66 GB\nTagged: Title; Artist; Year; Genre.\n\n\nDESCRIPTION\n\n\n\nSEASON\n\nIn the history of dance music, 90 years have been those in which the music industry has invested heavily in the production of disco music. Unlike the eighties, where the general character of the music market was the pop, the 90 are characterized by the presence of massive productions, musical artists and groups devoted explicitly to disco music. During this time you are increasing the record labels that produce only dance music. Just as happened in the 70's with disco music, it comes back to attend a new period of glory of disco music and, due to the predominant feature in this decade, there has been contamination suffered by many artists not normally devoted to this type of music.\nFollowing the success of such primordial house (1986-1989) and its derivatives, the 90 start to operate in the field of dance and fertile ground already explored for new proposals. The first years of the decade 1990 are characterized by increasingly sharp separation of dance genres and, consequently, we are seeing for the first time a differentiation of the clubs based on the type of music they play. In a decisive manner, assume its own identity and character is the kind that the Techno House, which will be gradually to stand at the antipodes. The first is the kind that in the early Nineties will be distinguished by the large number of experiments and resampling of songs of the past, and the type of catchy melodies, but sought not to be confused however with the eurodance music only from that predominate Since 1993, the dance in all its genres is the genre most music played in clubs. Techno music is the protagonist instead of phenomena such as rave parties and clubs of enormous size, which is to dominate the electronic sounds and &quot;aggressive&quot;, that is characterized by more distinct bass and a number of beats per minute (BPM) more high in comparison to house music. Transversely, as already introduced above, since 1993 there has been a great success and catchy dance like that in Italy will be called simply dance, eurodance in the rest of Europe (particularly in reference to the German and Belgian productions) and the U.S. House very general. Eurodance music is the dominant genre of the 90's and is still appreciated.\n\n\nMY SELECTION\n\nWhat you will find is my personal best-of those years, for most songs will be dance / eurodance, or commonly called &quot;commercial&quot;, but there will also be a separate folder where you will find other songs (Dream-Progressive Techno-Trance). Purists in the latter category may turn up their noses, patience ... I tried to do what is just a collection of songs that I have heard and danced at the time, regardless of gender.\nNeedless to say it was a wonderful time, that those who lived it most likely will regret it ... listening again to some old song and maybe he will get goose bumps thinking about the times we had (at least that's what happens to me).\nI wish to all a good listen and a good journey through the memories to someone.\n\n\n\n\n----------------------------------------------------------------------\n\nITA\n\n\nPERIODO\n\nNella storia della musica dance, gli anni 90 sono stati quelli in cui l'industria discografica ha investito maggiormente nelle produzioni di musica da discoteca. A differenza degli anni ottanta, dove il genere protagonista del mercato discografico era il pop, gli anni 90 sono caratterizzati da un'imponente presenza di produzioni, artisti e gruppi musicali dediti esplicitamente alla musica da discoteca. In questo periodo si vanno moltiplicando le etichette discografiche che producono solo musica dance. Proprio come accadde negli anni 70 con la disco-music, si torna ad assistere ad un nuovo periodo di gloria della musica da discoteca e, caratteristica riconducibile in modo predominante a questo decennio, si registra la contaminazione subita da molti artisti normalmente non dediti a questo tipo di musica.\nA seguito del successo del primordiale genere house (1986-1989) e delle sue derivazioni, gli anni 90 iniziano ad operare nel settore dance su un terreno giÃƒÂ  sondato e fertile per nuove proposte. I primi anni del decennio 1990 si caratterizzano per una separazione sempre piÃƒÂ¹ netta dei generi ballabili e, di conseguenza, si assiste per la prima volta ad una differenziazione delle discoteche in base al tipo di musica che suonano. In maniera decisa, assumono una propria identitÃƒÂ  e carattere sia il genere House che il Techno, che via via andranno a porsi agli antipodi. Il primo ÃƒÂ¨ il genere che nei primi anni del decennio novanta si distinguerÃƒÂ  per il grande numero di sperimentazioni e ricampionature di brani del passato, e per il tipo di melodie ricercate ma orecchiabili, da non confondere tuttavia con la musica eurodance che predominerÃƒÂ  solo a partire dal 1993; La dance in tutti i suoi generi sarÃƒÂ  il genere piÃƒÂ¹ suonato nei music club. La musica Techno sarÃƒÂ  invece protagonista di fenomeni come i rave party e delle discoteche di enormi dimensioni, dove a dominare sono le sonoritÃƒÂ  elettroniche ed &quot;aggressive&quot;, caratterizzate cioÃƒÂ¨ da dei bassi piÃƒÂ¹ distinti e da un numero di battute per minuto (BPM) piÃƒÂ¹ elevato rispetto alla musica house. Trasversalmente, come giÃƒÂ  introdotto in precedenza, a partire dal 1993 si assiste ad un grande successo del genere ballabile ed orecchiabile che in Italia verrÃƒÂ  chiamato semplicemente dance, nel resto d'Europa eurodance (soprattutto in riferimento alle produzioni tedesche e belghe) e negli USA molto genericamente House. La musica eurodance sarÃƒÂ  il genere dominante degli anni 90 e risulta apprezzato ancora oggi.\n\nLA MIA SELEZIONE\n\nQuello che troverete ÃƒÂ¨ il mio personale best-of di quegl'anni, per la maggior parte saranno brani dance/eurodance o volgarmente detta &quot;Commerciale&quot;, perÃƒÂ² ci sarÃƒÂ  anche una cartella distinta dove troverete i brani di altro genere (Dream-Progressive-Techno-Trance). I puristi di quest'ultima categoria potranno storcere il naso, pazienza... quello che ho cercato di fare ÃƒÂ¨ proprio una raccolta dei brani che ho piÃƒÂ¹ ascoltato e ballato in quel periodo, a prescindere dal genere.\nInutile dire che ÃƒÂ¨ stato un periodo fantastico, che chi lo ha vissuto molto probabilmente lo rimpiangerÃƒÂ ... e forse riascoltando qualche vecchio brano gli verrÃƒÂ  la pelle d'oca a pensare ai momenti passati (almeno ÃƒÂ¨ quello che succede a me).\nAuguro un buon ascolto a tutti e un buon viaggio tra i ricordi a qualcuno.\n\n\nEnjoy all :))","torrent":{"xt":"urn:btih:ee754a7066ec3602eddc1e0eff25977ea13e2045","amp;dn":"Discoteca+Anni+90+%5BLossy+Mp3+VBR%5D+Hits+of+the+90s+-+Dance%2C+Dream","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee754a7066ec3602eddc1e0eff25977ea13e2045","infoHashBuffer":{"type":"Buffer","data":[238,117,74,112,102,236,54,2,237,220,30,14,255,37,151,126,161,62,32,69]},"announce":[],"urlList":[]}}