{"title":"Limited Edition-Prototypes, One-Offs and Design Art Furniture","uid":15879536,"size":37822133,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee7ebd5a28a2045575e70568e58e7bf88eef5903&amp;dn=Limited+Edition-Prototypes%2C+One-Offs+and+Design+Art+Furniture&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":6,"uploader":"STBGD","files":1,"time":1474577567,"description":"Limited Edition: Prototypes, One-Offs and Design Art Furniture\r\n2009 | 3764388943 | 255 pages | PDF | 36 MB\r\n\r\nLimited Edition is the new buzzword in furniture design. The demand for unique pieces is steadily increasing. With prototypes, one-offs and limited product lines, designers are celebrating a cult of individuality for all price classes. Furniture prototypes have always been an element of the industrial design process, but now they are being brought from the workshops and presented to the public as embodiments of one of the most exciting creative fields of our age. In the global village with its standardized commodities, exclusive one-offs with an artisanal flavor are turning into coveted objects. Limited furniture series satisfy the collectors thirst for objects that dissolve the boundary between art and design.Limited Edition pursues this new phenomenon and uncovers its background in meticulous investigative essays based on the authors ongoing interchange with key designers, gallery owners, auctioneers and manufacturers. With a rich selection of magnificent images and an attractive layout, it presents the best and most breathtaking pieces by the leading designers","torrent":{"xt":"urn:btih:ee7ebd5a28a2045575e70568e58e7bf88eef5903","amp;dn":"Limited+Edition-Prototypes%2C+One-Offs+and+Design+Art+Furniture","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee7ebd5a28a2045575e70568e58e7bf88eef5903","infoHashBuffer":{"type":"Buffer","data":[238,126,189,90,40,162,4,85,117,231,5,104,229,142,123,248,142,239,89,3]},"announce":[],"urlList":[]}}