{"title":"Encyclopedia of Norse and Germanic Folklore, Mythology and Magic","uid":16044679,"size":7461541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eed24096b06ca26cf5d6528462c825d307dead71&amp;dn=Encyclopedia+of+Norse+and+Germanic+Folklore%2C+Mythology+and+Magic&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":6,"uploader":"marty14","files":1,"time":1476551070,"description":"Encyclopedia of Norse and Germanic Folklore, Mythology and Magic - Claude Lecouteux [epub]\r\n\r\nThe legends of the Norse and Germanic regions of Europe--spanning from Germany and Austria across Scandinavia to Iceland and England--include a broad range of mythical characters and places, from Odin and Thor, to berserkers and Valhalla, to the Valkyries and Krampus. In this encyclopedia, Claude Lecouteux explores the origins, connections, and tales behind many gods, goddesses, magical beings, rituals, folk customs, and mythical places of Norse and Germanic tradition. \r\n\r\nMore than a reference to the Aesir and the Vanir pantheons, this encyclopedia draws upon a wealth of well-known and rare sources, such as the Poetic Edda, the Saga of Ynglingar by Snorri Sturluson, and The Deeds of the Danes by Saxo Grammaticus. Beyond the famous and infamous Norse gods and goddesses, Lecouteux also provides information on lesser-known figures from ancient Germanic pagan tradition such as the Elf King, the Lorelei, the Perchten, land spirits, fairies, dwarves, trolls, goblins, bogeymen, giants, and many other beings who roam the wild, as well as lengthy articles on well-known figures and events such as Siegfried (Sigurd in Norse) and Ragnarök. The author describes the worship of the elements and trees, details many magical rituals, and shares wild folktales from ancient Europe, such as the strange adventure of Peter Schlemihl and the tale of the Cursed Huntsman. He also dispels the false beliefs that have arisen from the Nazi hijacking of Germanic mythology and from its longtime suppression by Christianity. \r\n\r\nComplete with rare illustrations and information from obscure sources appearing for the first time in English, this detailed reference work represents an excellent resource for scholars and those seeking to reconnect to their pagan pasts and restore the old religion","torrent":{"xt":"urn:btih:eed24096b06ca26cf5d6528462c825d307dead71","amp;dn":"Encyclopedia+of+Norse+and+Germanic+Folklore%2C+Mythology+and+Magic","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eed24096b06ca26cf5d6528462c825d307dead71","infoHashBuffer":{"type":"Buffer","data":[238,210,64,150,176,108,162,108,245,214,82,132,98,200,37,211,7,222,173,113]},"announce":[],"urlList":[]}}