{"title":"Lonely Planet Italy 9th Edition","uid":6831275,"size":33754252,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f10c956473fc8e6b947e3c0633584349d1ff96ba&amp;dn=Lonely+Planet+Italy+9th+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":1,"uploader":"TheBookie","files":-1,"time":1321882362,"description":"Lonely Planet Italy 9th Edition 2010\n\n\nFrom Antarctica to Zimbabwe, if youre going there, chances are Lonely Planet has been there first. With a pithy and matter-of-fact writing style, these guides are guaranteed to calm the nerves of first-time world travelers, while still listing off-the-beaten-path finds sure to thrill even the most jaded globetrotters. Lonely Planet has been perfecting its guidebooks for nearly 30 years and as a result, has the experience and know-how similar to an older siblings been there advice. The original backpacker's bible, the LP series has recently widened its reach. While still giving insights for the low-budget traveler, the books now list a wide range of accommodations and itineraries for those with less time than money.\nExplore the riches of Italy with Lonely Planets essential guide. Featuring a special color feature on Italian art and architecture, this book also contains insiders advice on the best pasta and gelati; skiing and trekking information, notes on history, culture and current politics; as well as practical food and accommodation suggestions for every budget. Delightful sidebars add insight into the culture, with details on everything from gladiators to mushroom picking.\n\n\n","torrent":{"xt":"urn:btih:f10c956473fc8e6b947e3c0633584349d1ff96ba","amp;dn":"Lonely+Planet+Italy+9th+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f10c956473fc8e6b947e3c0633584349d1ff96ba","infoHashBuffer":{"type":"Buffer","data":[241,12,149,100,115,252,142,107,148,126,60,6,51,88,67,73,209,255,150,186]},"announce":[],"urlList":[]}}