{"title":"Warren Buffet: The Snowball - Unabridged Audiobook","uid":4630858,"size":1165399018,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f2dbb64f54b50670af3596967c21ecedc571df7f&amp;dn=Warren+Buffet%3A+The+Snowball+-+Unabridged+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"flash_os","files":-1,"time":1231383555,"description":"Warren Buffet: The Snowball - Unabridged | 1.2 GB\n\nHere is Warren Buffet: The Snowball Unabridged recounting the life and times of one of the most respected men in the world, Warren Buffett. The legendary Omaha investor has never written a memoir, but now he has allowed one writer, Alice Schroeder, unprecedented access to explore directly with him and with those closest to him his work, opinions, struggles, triumphs, follies, and wisdom. The result is the personally revealing and complete biography of the man known everywhere as &quot;The Oracle of Omaha.&quot;\n\nAlthough the media track him constantly, Buffett himself has never told his full life story. His reality is private, especially by celebrity standards. Indeed, while the homespun persona that the public sees is true as far as it goes, it goes only so far. Warren Buffett is an array of paradoxes. He set out to prove that nice guys can finish first. Over the years he treated his investors as partners, acted as their steward, and championed honesty as an investor, CEO, board member, essayist, and speaker. At the same time he became the world's richest man, all from the modest Omaha headquarters of his company Berkshire Hathaway. None of this fits the term &quot;simple&quot;.","torrent":{"xt":"urn:btih:f2dbb64f54b50670af3596967c21ecedc571df7f","amp;dn":"Warren+Buffet%3A+The+Snowball+-+Unabridged+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2dbb64f54b50670af3596967c21ecedc571df7f","infoHashBuffer":{"type":"Buffer","data":[242,219,182,79,84,181,6,112,175,53,150,150,124,33,236,237,197,113,223,127]},"announce":[],"urlList":[]}}