{"title":"Dag Öhrlund - Där inga ögon ser - Svensk","uid":15239747,"size":276927070,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f3f948b30241278673eb7a934355dd876176cfbb&amp;dn=Dag+%26Ouml%3Bhrlund+-+D%26auml%3Br+inga+%26ouml%3Bgon+ser+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"totomas1","files":122,"time":1467928166,"description":"Dag Öhrlund - Där inga ögon ser\r\n\r\nEn våldtagen och mördad pojke. En förtvivlad pappa som aldrig blev rentvådd. En stad där alla tycks veta men alla ljuger.\r\n\r\nNär den buttre och fördomsfulle kommissarien Ewert Truut får komma tillbaka till Stockholm efter några års kommendering till en liten skånsk ort, är det på ett villkor – att han tar sig an cold cases och löser dem.\r\nTill sin förfäran upptäcker Truut att han inte får arbeta ensam. Hans nya medarbetare, den snygga Carolina Herrera och datageniet Måns Schmidt, får båda jobba hårt för att övertyga Truut om att han behöver dem.\r\n\r\nUppdraget börjar i Mariefred och Truut märker snart att trion inte är välkommen. Vem eller vilka känner till sanningen om Mattias död för tio år sedan – pojkens mamma, gymnastikläraren, den före detta polischefen eller gangstern som blivit advokat? Truut måste återupprätta sin heder genom att lösa fallet.\r\nSamtidigt kämpar han mot inre demoner och konfronteras gång på gång med sina fördomar, vilket leder till mer än en överraskning.\r\n\r\nDag Öhrlund, tidigare mest känd för succéböckerna om psykopaten Christopher Silfverbielke, har innan han blev författare arbetat som journalist och fotograf. Han har rest och arbetat i 30 länder och hans reportage har publicerats över hela världen.\r\nUnder sitt äventyrliga liv har Dag Öhrlund överlevt en terrorbomb, blivit beskjuten, blivit förlamad och hamnat i rullstol samt varit nära döden flera gånger – händelser som präglat hans sätt att se på livet.\r\nMed Där inga ögon ser inleder han en ny serie, om kommissarie Ewert Oswald Truut och hans medarbetare.\r\n\r\n\r\nAntal CD: 8 CD\r\nUppläsare: Stefan Sauk\r\nSpeltid: 9 timmar, 37 minuter","torrent":{"xt":"urn:btih:f3f948b30241278673eb7a934355dd876176cfbb","amp;dn":"Dag+%26Ouml%3Bhrlund+-+D%26auml%3Br+inga+%26ouml%3Bgon+ser+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3f948b30241278673eb7a934355dd876176cfbb","infoHashBuffer":{"type":"Buffer","data":[243,249,72,179,2,65,39,134,115,235,122,147,67,85,221,135,97,118,207,187]},"announce":[],"urlList":[]}}