{"title":"Seconds 1966 BrRip Avi Lee1001","uid":9826379,"size":1323586438,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f4a8878986ba913218d01c6d711de384bcb0da02&amp;dn=Seconds+1966+BrRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":3,"uploader":"xultfoad","files":2,"time":1395786081,"description":"Seconds 1966 BrRip Avi Lee1001\n[img]http://www.freeimage.us/image-35C8_5313F84C.jpg[/img]\n[url]http://www.imdb.com/title/tt0060955/[/url]\n[url]https://en.wikipedia.org/wiki/Seconds_(film)[/url]\nThis memorably odd piece of sci-fi-influenced psychodrama has been criminally overlooked in the years since its release, partly through unavailability, but possibly because of its sombre tone and bleak conclusion.\n[img]http://www.freeimage.us/image-3444_53143B41.jpg[/img]\nArthur Hamilton (John Randolph) is a fifty-something banker deeply disappointed by life. Summoned to 'The Corporation' he meets Old Man (Will Geer) and brokers a Faustian deal. For a fee they'll fake his death and set him up with a new face, body and life. Shortly thereafter he's reincarnated as Tony Wilson (Rock Hudson) and joins a community of similarly reinvigorated folks living it up on Malibu beach. He paints, he parties, he's admired and desired but still he's gnawed at by a dreadful sense of emptiness.\n[img]http://www.freeimage.us/image-95B6_53143B41.jpg[/img]\nSeconds' strength lies in the seriousness with which Frankenheimer approaches the subject matter. Hudson displays more range and depth than almot any of his other performances, and Oscar-nominated cinematographer Howe captures the community's orgiastic excess in a series of freaky sequences, among them a memorably bizarre and strangely kinky-looking grape-crushing party.\n[img]http://www.freeimage.us/image-369C_53143B41.jpg[/img]\nLike The Swimmer, this is a film very much at odds with the pleasure-seeking decade in which it was made, but anyone who likes their cautionary tales dark will relish its underlying message: there's no such thing as a free lunch. \n\nA lost gem. This cerebral psychodrama raises a whole load of interesting questions about identity, value and society and, in its own bleak way, answers\n\nThis would have to be one of the most horrifying films ever made. Not in a conventional horror-film type of way, but in a horror that we can all recognise inside ourselves. Often regarded as Rock Hudson's greatest performance, Seconds will stay with you, whether you love or hate it by film's end. Initially booed at the Cannes Film Festival years ago, director John Frankenheimer's paranoid gem has gone on to take it's rightful place as a classic piece of cinema from any genre. Seconds also has one of the most gruelling endings to be found in any film, let alone one from 1966.\n\nVIDEO\nSize.... 1.23gb\nDuration.... 01:47:20\nCodec.... divx\nFrame Width..... 720\nFrame Height.... 416\nData Rate.... 1516kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 128kbps.... MP3\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample\n","torrent":{"xt":"urn:btih:f4a8878986ba913218d01c6d711de384bcb0da02","amp;dn":"Seconds+1966+BrRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4a8878986ba913218d01c6d711de384bcb0da02","infoHashBuffer":{"type":"Buffer","data":[244,168,135,137,134,186,145,50,24,208,28,109,113,29,227,132,188,176,218,2]},"announce":[],"urlList":[]}}