{"title":"Surviving the Death Railway: A POW's Memoir","uid":15932438,"size":40347529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f4b49391142246525fa33545633f0a483f0c4cd2&amp;dn=Surviving+the+Death+Railway%3A+A+POW%27s+Memoir&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":1,"uploader":"marty14","files":1,"time":1475368633,"description":"Surviving the Death Railway: A POW's Memoir and Letters from Home - Hilary Custance Green (ed.) [epub]\r\n\r\nThe ordeals of the POWs put to slave labour by their Japanese masters on the 'Burma Railway' have been well documented yet never cease to shock. It is impossible not to be horrified and moved by their stoic courage in the face of inhuman brutality, appalling hardship and ever-present death. While Barry Custance Baker was enduring his 1000 days of captivity, his young wife Phyllis was attempting to correspond with him and the families of Barry's unit. Fortunately these moving letters have been preserved and appear, edited by their daughter Hilary, in this book along with Barry's graphic memoir written after the War.\r\n\r\nSurviving the Death Railway's combination of first-hand account, correspondence and comment provide a unique insight into the long nightmare experienced by those in the Far East and at home. The result is a powerful and inspiring account of one of the most shameful chapters in the history of mankind which makes for compelling reading","torrent":{"xt":"urn:btih:f4b49391142246525fa33545633f0a483f0c4cd2","amp;dn":"Surviving+the+Death+Railway%3A+A+POW%27s+Memoir","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4b49391142246525fa33545633f0a483f0c4cd2","infoHashBuffer":{"type":"Buffer","data":[244,180,147,145,20,34,70,82,95,163,53,69,99,63,10,72,63,12,76,210]},"announce":[],"urlList":[]}}