{"title":"The 15 Invaluable Laws of Growth - John C. Maxwell.epub","uid":9482536,"size":424314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5043e2b77f42cba17dea5c3ac27e0a7fdec0e26&amp;dn=The+15+Invaluable+Laws+of+Growth+-+John+C.+Maxwell.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":23,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1389824364,"description":"Are there tried and true principles that are always certain to help a person grow? John Maxwell says the answer is yes. He has been passionate about personal development for over fifty years, and for the first time, he teaches everything he has gleaned about what it takes to reach our potential. In the way that only he can communicate, John teaches . . .\n\nThe Law of the Mirror: You Must See Value in Yourself to Add Value to Yourself\nThe Law of Awareness: You Must Know Yourself to Grow Yourself\nThe Law of Modeling: It's Hard to Improve When You Have No One But Yourself to Follow\nThe Law of the Rubber Band: Growth Stops When You Lose the Tension Between Where You are and Where You Could Be\nThe Law of Contribution: Developing Yourself Enables You to Develop Others\n\n\nThis third book in John Maxwell's Laws series (following the 2-million seller The 21 Irrefutable Laws of Leadership and The 17 Indisputable Laws of Teamwork) will help you become a lifelong learner whose potential keeps increasing and never gets &quot;used up.&quot;","torrent":{"xt":"urn:btih:f5043e2b77f42cba17dea5c3ac27e0a7fdec0e26","amp;dn":"The+15+Invaluable+Laws+of+Growth+-+John+C.+Maxwell.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5043e2b77f42cba17dea5c3ac27e0a7fdec0e26","infoHashBuffer":{"type":"Buffer","data":[245,4,62,43,119,244,44,186,23,222,165,195,172,39,224,167,253,236,14,38]},"announce":[],"urlList":[]}}