{"title":"FEZ v1.10 - PC Game","uid":9096795,"size":380749072,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f5229b1c3d7a0899c229cfc844f7f92cf3c0a703&amp;dn=FEZ+v1.10+-+PC+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":2,"uploader":"dupetank","files":1,"time":1382660229,"description":"Fez is a puzzle/platform game developed by independent software developers Polytron Corporation.\n\nThe plot of Fez revolves around Gomez, a two-dimensional creature who lives in a flat, 2D world. One day, Gomez encounters a strange and mysterious artifact called the Hexahedron, which gives him a magical fez hat that allows him to perceive a third dimension. Just as Gomez begins to explore his new ability, the Hexahedron suddenly fractures and explodes, causing the world around him to glitch up and freeze.\n\nThe game &quot;reboots&quot; and Gomez wakes up to find that he can now explore his world in three dimensions. A floating hypercube explains that he must collect the fragments of the Hexahedron, which have been scattered across the world, before the world is torn apart.\n\nThe goal of Fez is to collect 32 cubes,[8] which have been scattered around the world, to rebuild the Hexahedron and restore Gomez's world before it is torn apart. Cubes and cube fragments are visible and can be collected by simply touching them. Players can also collect 32 &quot;anti-cubes&quot;[8] by solving various puzzles, many of which require some form of cryptanalysis. As the player collects cubes and anti-cubes, doors become unlocked and allow the player to access new areas.\n\nFez is presented as a 2D platform game in which Gomez can walk, jump, climb and manipulate objects. However, the player can shift perspectives at any time, rotating the world 90 degrees relative to the screen. This reveals doors and passageways and causes platforms to realign on the screen. Since depth is not a factor in the 2D gameplay, the player can (and must) take advantage of this mechanic to perform actions that would normally be impossible in a true 3D world. (For example, while standing on a floating platform, shifting the perspective 90 degrees allows Gomez to jump to another platform that had previously been on the opposite side of the screen. Rotating back to the original perspective after the jump reveals that Gomez has moved a great distance.\n\n-----------------------------------------------------------------------------------\n\nInstructions:\n\n-Install\n-Play\n\nEasiest Instructions in the world.\n\nNo crack or serial needed. This is the DRM-free version from the Humble Bundle.","torrent":{"xt":"urn:btih:f5229b1c3d7a0899c229cfc844f7f92cf3c0a703","amp;dn":"FEZ+v1.10+-+PC+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5229b1c3d7a0899c229cfc844f7f92cf3c0a703","infoHashBuffer":{"type":"Buffer","data":[245,34,155,28,61,122,8,153,194,41,207,200,68,247,249,44,243,192,167,3]},"announce":[],"urlList":[]}}