{"title":"Stoner - John Williams.epub","uid":9146218,"size":240716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f53f0e4ae2df230db5579f434579ffcb5935122c&amp;dn=Stoner+-+John+Williams.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":0,"uploader":"420weedman","files":1,"time":1383601170,"description":"Colum McCann once called Stoner one of the great forgotten novels of the past century, but it seems it is forgotten no longer - in 2013 translations of Stoner began appearing on bestseller lists across Europe. Forty-eight years after its first, quiet publication in the US, Stoner is finally finding the wide and devoted readership it deserves. Have you read it yet?\n\nWilliam Stoner enters the University of Missouri at nineteen to study agriculture. A seminar on English literature changes his life, and he never returns to work on his father's farm. Stoner becomes a teacher. He marries the wrong woman. His life is quiet, and after his death his colleagues remember him rarely.\n\nYet with truthfulness, compassion and intense power, this novel uncovers a story of universal value. Stoner tells of the conflicts, defeats and victories of the human race that pass unrecorded by history, and reclaims the significance of an individual life. A reading experience like no other, itself a paean to the power of literature, it is a novel to be savoured.\n\n&quot;A beautiful, sad, utterly convincing account of an entire life. I'm amazed a novel this good escaped general attention for so long&quot; (Ian McEwan)\n\n&quot;A terrific novel of echoing sadness&quot; (Julian Barnes)\n\n&quot;Stoner is a brilliant, beautiful, inexorably sad, wise, and elegant novel&quot; (Nick Hornby The Believer)\n\n&quot;I have read few novels as deep and as clear as John Williams' Stoner. It deserves to be called a quiet classic of American literature&quot; (Chad Harbach)\n\n&quot;One of the great forgotten novels of the past century. I have bought at least 50 copies of it in the past few years, using it as a gift for friends. It is universally adored by writers and readers alike. The book is so beautifully paced and cadenced that it deserves the status of classic&quot; (Colum McCann Guardian)\n\n&quot;A beautiful and moving novel, as sweeping, intimate and mysterious as life itself&quot; (Geoff Dyer)\n\n&quot;One of the great unheralded 20th century American novels...Almost perfect&quot; (Bret Easton Ellis)\n\n&quot;It's simply a novel about a guy who goes to college and becomes a teacher. But its one of the most fascinating things that you've ever come across&quot; (Tom Hanks Time magazine)\n\n&quot;There are a handful of books that have made me want to be a better writer, that in their quiet way have shown me the potential of fiction. Stoner is one of those. It does not rely on flash or suspense or tricks -- it is simply a stunning novel that through the power of character and language becomes more timeless, more important, more real, than most novels can ever hope to be. Stoner is something rare and precious that should never be forgotten&quot; (Eowyn Ivey, author of the international bestseller 'The Snow Child')\n\n&quot;John Williams's Stoner is something rarer than a great novel -- it is a perfect novel, so well told and beautifully written, so deeply moving, that it takes your breath away...few stories this sad could be so secretly triumphant, or so exhilarating. Williams brings to Stoner's fate a quality of attention, a rare empathy, that shows us why this unassuming life was worth living.&quot; (New York Times)\n\n&quot;Rarely has the intimate detail of a life been drawn with such emotional clarity&quot; (Simon Hammond Observer New Review)\n\n&quot;I've always said that my favourite novel is The Good Soldier but I'm not sure that hasn't been displaced by John Williams' Stoner...It's a wonderful book...simple, straightforward and yet full of displaced, sad things&quot; (Ruth Rendell Guardian)\n\n&quot;The novel is filled with life's most profound moments and passions&quot; (Independent)\n\n&quot;The most extraordinary work of fiction I've read in a long time... If you're looking for a book that's simple and subtle, warmly human and at the same time utterly pitiless in his rendition of the vicissitudes of an ordinary existence, here's one you will read again and again&quot; (John Gray New Statesman)\n\n&quot;Serious, beautiful and affecting, what makes Stoner so impressive is the contained intensity the author and character share&quot; (The New Republic)\n\n&quot;A masterly portrait of a truly virtuous and dedicated man&quot; (New Yorker)\n\n&quot;An exquisite study, bleak as a Hopper&quot; (Los Angeles Times)\n\nJohn Williams was born on August 29, 1922 in Clarksville, Texas. He served in the United States Army Air Force from 1942 to 1945 in China, Burma and India. The Swallow Press published his first novel, Nothing But the Night, in 1948, as well as his first book of poems, The Broken Landscape, in 1949. Macmillan published Williams' second novel, Butcher's Crossing, in 1960. \n\nAfter recieving his B.A. and M.A. from the University of Denver, and his Ph.D from the University of Missouri, Williams returned in 1954 to the University of Denver where he taught literature and the craft of writing for thirty years. In 1963 Williams received a fellowship to study at Oxford University where where he received a Rockefeller grant enabling him to travel and research in Italy for his last novel, Augustus, published in 1972. John Williams died in Arkansas on March 4, 1994.\n","torrent":{"xt":"urn:btih:f53f0e4ae2df230db5579f434579ffcb5935122c","amp;dn":"Stoner+-+John+Williams.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f53f0e4ae2df230db5579f434579ffcb5935122c","infoHashBuffer":{"type":"Buffer","data":[245,63,14,74,226,223,35,13,181,87,159,67,69,121,255,203,89,53,18,44]},"announce":[],"urlList":[]}}