{"title":"Nightwish - Elan (Single) (2015)ak","uid":11698268,"size":43613696,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f56e3431482c3a701c40c6ad623a37d48f04eefa&amp;dn=Nightwish+-+Elan+%28Single%29+%282015%29ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":2,"uploader":"analogkid6103","files":4,"time":1423815391,"description":"image\nEqual parts epic metal and gothic symphony, Nightwish stand alone. They blend soaring keyboards and operatic vocals with shredding guitars and jagged rhythms for a style of cinematic, orchestral heavy music all their own. The Finnish quintet has remained a force in the European scene for the last decade, but with their second Roadrunner Records release Dark Passion Play, they are destined to captivate metal fans across the entire globe. Filling vocalist Tarja Turunen's vacant spot with newcomer Anette Olzon, the band is now stronger than ever. They have also crafted a record that's heavy, hypnotic and downright powerful.\n\nNightwish's style has established them as one of the premier female-fronted metal bands. With overpowering keyboard tones reminiscent of classic film scores, the band separates itself. Their combination of seductive, emotional vocals and gallant guitar melodies brings to mind both Evanescence and Iced Earth. Yet, Nightwish have crafted a distinct sound. Their 1997 debut Angels Fall Fast introduced the world to this sound, propelled by the strength of the single &quot;The Carpenter.&quot; The follow-up Oceanborn would secure a spot in the Finnish Top Five and spawn three chart-topping singles. In 2000, Wishmaster cemented the band's rabid fan following and led to their first U.S. distribution. However, a hard-hitting fourth offering Century Child added bassist and backing vocalist Marco Hietela to the fold, and it yielded some of the band's heaviest and darkest tracks up to that point. Nightwish embraced their metallic and classical influences to the fullest and completely established themselves.\n\nIn 2004, the band's first Roadrunner Records release and fifth studio effort Once would gain them a foothold in the U.S. They launched a hotly-anticipated tour in The States, packing sold-out theaters across the country. Over the course of the year, Once surpassed sales of one million units worldwide. The album featured the single &quot;Nemo,&quot; with an entrancing video courtesy of director Antti Jokinen (Eminem). Once eventually garnered the band five awards at the Finnish Grammy Awards including both &quot;Band of the Year&quot; and &quot;The Best Selling Album of the Year.&quot; These accolades would solidify Nightwish as an international force.\n\nAfter a highly successful world tour in 2005, the band underwent a drastic lineup change. They severed ties with Tarja via an open letter. Fans and the media clamored for a replacement, and questions ran rampant. Though most artists might not be able to recover from a split like this, Nightwish aren't most artists. The band would check out over 2,000 applications from singers worldwide until they found Anette Olzon. Upon her first visit to Finland, Anette met the band and immediately clicked with them. They announced her addition shortly after. Swedish singer elevates Nightwish to the next level with a dynamic voice that breathes charisma and life into the new songs.\n\nEven with the absence of Tarja, Nightwish has crafted an epic, infectious and potent sixth release in the form of Dark Passion Play. Tuomas Holopainen's keys create huge melodies that are deep, gothic and sensual, while Emppu Vuorinen's guitars hit with an urgent crunch. The record represents the culmination of the band's evolution and success. It's a dark, yet infectious journey, featuring all of the elements that fans love about Nightwish-from the symphonic keyboards to the divine melodies. At the forefront of the new music is Anette. Her voice hypnotizes with a diverse range, complementing both the metallic guitars and orchestral keys perfectly. The new songs are some of Nightwish's most adventurous and powerful. Leadoff single &quot;Bye Bye Beautiful&quot; starts with a precise, calculated riff locked in with warm electronic keys. Then the song launches into vibrant vocal interplay between Anette and Marco with an incendiary and catchy chorus. &quot;7 Days to the Wolves&quot; features galloping guitars with swirling orchestrations and visual lyrics that captivate. On &quot;Master Passion Greed,&quot; epic riffs and keyboards create an inviting, yet intense embrace. Heavy guitars crescendo into an incredible vocal explosion. Meanwhile, &quot;Amaranth&quot; has a power metal rhythm that builds with a serious urgency.\n\nHowever, Nightwish have further experimented, embracing their new singer's immense talent and venturing beyond the norm. &quot;Eva&quot; highlights Anette's versatility, allowing her voice to take center stage and simply soar. The ballad showcases ethereal keyboards and a hauntingly gorgeous chorus.\n\nUltimately, Nightwish have made a career out of breaking the rules. Their sound could never simply be categorized, and they have managed to continually evolve with each album. With their first U.S. tour with Anette this fall and Dark Passion Play out October 2nd, Nightwish are bound to secure their spot at the top.\n\n\nNightwish Official Site\n\n\n\n\n\n2015 Ã‰lan (Single)\n\n\nTracklist:\n\n\nTracklist:\n\n01. Ã‰lan (Album Version)\n02. Sagan\n03. Ã‰lan (Alternate Version)\n04. Ã‰lan (Radio Edit)\n\nLabel: Nuclear Blast\n\n\nGenre: Power\nSubgenre: Symphonic Power Metal\nBitrate: 320 k\nSize: 41.59 MB\nShow/Hide Files:\n4 files","torrent":{"xt":"urn:btih:f56e3431482c3a701c40c6ad623a37d48f04eefa","amp;dn":"Nightwish+-+Elan+%28Single%29+%282015%29ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f56e3431482c3a701c40c6ad623a37d48f04eefa","infoHashBuffer":{"type":"Buffer","data":[245,110,52,49,72,44,58,112,28,64,198,173,98,58,55,212,143,4,238,250]},"announce":[],"urlList":[]}}