{"title":"Disaster Recovery using VMware vSphere Replication and vCenter S","uid":10591255,"size":4221336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6efa2442b54b4cbcb2710c6b45329e358dfb122&amp;dn=Disaster+Recovery+using+VMware+vSphere+Replication+and+vCenter+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"freeshare4all","files":1,"time":1405799988,"description":"Learn to deploy and use vSphere Replication 5.5 as a standalone disaster recovery solution and to orchestrate disaster recovery using vCenter Site Recovery Manager 5.5.\n\nOverview\n\nLearn how to deploy and use vSphere Replication as a standalone disaster recovery solution.\nConfigure SRM to leverage array-based or vSphere replication engine.\nUse SRM to orchestrate the execution of recovery plans.\nIn Detail\n\nVMware vCenter Site Recovery Manager automates disaster recovery in a manner that no other solution does. It is programmed to leverage array-based replication and VMware's proprietary vSphere Replication engine.\n\nThis book will familiarize you with the concepts of disaster recovery using vCenter Site Recovery Manager and vSphere Replication.\n\nYou will learn how to deploy and confi gure vSphere Replication in the standalone mode to replicate virtual machines. You will also learn how to use vCenter Site Recovery Manager to leverage array-based replication or vSphere Replication, form Recovery Plans and orchestrate them to perform a test, Planned Migration, Failover, or Failback.\n\nWhat you will learn from this book\n\nFamiliarize yourself with disaster recovery concepts\nDeploy vCenter Site Recovery Manager\nConfigure vCenter Site Recovery Manager to leverage array-based replication and vSphere Replication\nEnable the protection of virtual machines by creating Protection Groups\nCreate and test Recovery Plans\nMigrate virtual machine workload to another site using Recovery Plans\nPerform a Failover in the event of a disaster\nFailback the virtual machines to the Protected Site\nUse vSphere Replication as a standalone disaster recovery solution\nApproach\n\nThis is a step-by-step guide that will help you understand disaster recovery using VMware vSphere Replication 5.5 and VMware vCenter Site Recovery Manager (SRM) 5.5. The topics and configuration procedures are accompanied with relevant screenshots, flow-charts, and logical diagrams that makes grasping the concepts easier.","torrent":{"xt":"urn:btih:f6efa2442b54b4cbcb2710c6b45329e358dfb122","amp;dn":"Disaster+Recovery+using+VMware+vSphere+Replication+and+vCenter+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6efa2442b54b4cbcb2710c6b45329e358dfb122","infoHashBuffer":{"type":"Buffer","data":[246,239,162,68,43,84,180,203,203,39,16,198,180,83,41,227,88,223,177,34]},"announce":[],"urlList":[]}}