{"title":"Spacebase DF9 v1.06 &lt;Viruz&gt;","uid":11583166,"size":178918070,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f7c675e41e619ff516c46a4208dea4cbc5c1da6f&amp;dn=Spacebase+DF9+v1.06+%26lt%3BViruz%26gt%3B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":0,"uploader":"Ghostman_375","files":1,"time":1417146104,"description":"Here it is! Spacebase DF-9 for windows! Tested &amp; Working! PLEASE SEED)! If you like the game buy it and support the developer.\n\nThank you for downloading the Spacebase DF-9 - Version v1.06 (Windows) You can find a trailer for Spacebase DF-9 here.\n\nThis may show a warning of being a virus, do not worry... its false - positive. Reason being is because the torrent contains a crack.\n\n====================================================================================================\nInstallation:\n- Disable antivirus and add folder location to exceptions, worried about my torrent then check it yourself with Virustotal.\n- Unzip the .ZIP file to your desired location and play.\n\nProblems with errors or getting your game started? then check out this.\n\n====================================================================================================\nDescription:\nIn Spacebase DF-9, you'll build a home among the stars for a motley population of humans and aliens as they go about their daily lives. Mine asteroids, discover derelicts, and deal with the tribulations of galactic resettlement in Earth's distant future. Meteor impacts! Explosive decompression! Unbearable loneliness!\n\n====================================================================================================\n\nFull change list:\n\n- Mods can now be loaded via ZIP files from the Mods subdirectory of the game's install directory. Each ZIP is loaded as a simple virtual file system which can contain directories that mirror the main game scripts and override their behavior. A file called &quot;init.lua&quot; in the top level of each ZIP's directory structure will run when the mod is loaded, allowing you to perform any needed initialization. See the MyDemoObject.zip there for a simple example mod, which adds a new buildable object with its own artwork.\n- Arrow keys now pan view same as WASD keys.\n- &quot;show_hints&quot; flag added to bootconfig.cfg, set it false to disable the Hint system entirely.\n- Fixed: Unsuited citizens in a vacuum don't enter &quot;sucked into space&quot; immediately.\n- Fixed: Turrets don't spawn in derelicts and docking ships as intended.\n- Fixed: Various UI issues when resizing game window.\n- Fixed: Held weapons don't appear correctly on spacesuited characters.\n- Fixed: Research datacubes don't display properly.\n- Fixed: Ships dock onto pending construction.\n- Fixed: Base Seed Pod can start encased in an asteroid.\n- Fixed: Turrets don't display properly when scanning for threats.\n- Fixed: Raiders kill people imprisoned in brigs.\n- Fixed: Ship engines don't sort correctly with nearby walls","torrent":{"xt":"urn:btih:f7c675e41e619ff516c46a4208dea4cbc5c1da6f","amp;dn":"Spacebase+DF9+v1.06+%26lt%3BViruz%26gt%3B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7c675e41e619ff516c46a4208dea4cbc5c1da6f","infoHashBuffer":{"type":"Buffer","data":[247,198,117,228,30,97,159,245,22,196,106,66,8,222,164,203,197,193,218,111]},"announce":[],"urlList":[]}}