{"title":"The Battle of Leyte Gulf: 23-26 October 1944","uid":15891847,"size":3461716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7d8f552e4707f78ff5ba3297be862c7acb80ecd&amp;dn=The+Battle+of+Leyte+Gulf%3A+23-26+October+1944&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":35,"leechers":2,"uploader":"marty14","files":1,"time":1474762635,"description":"The Battle of Leyte Gulf: 23-26 October 1944 - Thomas J. Cutler [epub]\r\n\r\nThe last great naval battle of World War II, Leyte Gulf also is remembered as the biggest naval battle ever fought anywhere, and this book has been called the best account of it ever written. First published in hardcover on the battle's fiftieth anniversary in 1994 and drawing on materials not previously available, it blends history with human drama to give a real sense of what happened--despite the mammoth scope of the battle. Every facet of naval warfare was involved in the struggle that engaged some two hundred thousand men and 282 American, Japanese, and Australian ships over more than a hundred thousand square miles of sea. That Tom Cutler succeeded at such a difficult task is no surprise. The award-winning author saw combat service aboard many types of ships during his naval career, and as a historian and professor of strategy and policy at the Naval War College, he has studied the battle for many years.\r\n \r\nCutler captures the milieu, analyzes the strategy and tactics employed, and re-creates the experiences of the participants--from seaman to admiral, both Japanese and American. It is a story replete with awe-inspiring heroism, failed intelligence, flawed strategy, brilliant deception, great controversies, and a cast of characters with names like Halsey, Nimitz, Ozawa, and MacArthur. Such an exciting and revealing account of the battle is unlikely to be equaled by future writers","torrent":{"xt":"urn:btih:f7d8f552e4707f78ff5ba3297be862c7acb80ecd","amp;dn":"The+Battle+of+Leyte+Gulf%3A+23-26+October+1944","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7d8f552e4707f78ff5ba3297be862c7acb80ecd","infoHashBuffer":{"type":"Buffer","data":[247,216,245,82,228,112,127,120,255,91,163,41,123,232,98,199,172,184,14,205]},"announce":[],"urlList":[]}}