{"title":"Star Wars - Edge of the Empire RPG","uid":7826755,"size":1139801444,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8342b8ff3681acd489db368cde7f009491a63fa&amp;dn=Star+Wars+-+Edge+of+the+Empire+RPG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":21,"leechers":0,"uploader":"Desiderat","files":2,"time":1352946372,"description":" &lt;a href=&quot;http://i.imgur.com/YVYbW.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i.imgur.com/YVYbW.png&lt;/a&gt;\n\nStar Wars: Edge of the Empire is Fantasy Flight Game's first book in their new Star Wars RPG line-up. This version seems to attempt to try to fit in more with the movie's style of storytelling and action, namely by removing almost all instances of number bloat and focusing on action, options, and more intuitive play. Also unlike the previous versions, this RPG will actually focus more on a single setting of the game: the Rebellion Era. Whereas previous editions have left it open, much of the content in this one will be tailored to the setting shown in episodes 4, 5, and 6.\n\nThey're attempting to go with the feel of the movies by releasing multiple books. You could just think of them in 4e terms as PHBs 1 through 3. The first, Edge of the Empire, focuses on fringe exploration and more 'at-home' characters like explorers and more scum characters like smugglers. It should feel right for almost any Star Wars fan really.\n\nThe second book, Age of the Rebellion, will focus more on the war and conflict, and will involve more career soldier characters such as soldiers (duh), pilots, and spies. The characters will deal more with the Empire than criminals and bounty hunters like they would in Edge of the Empire.\n\nThe third and final book is Force and Destiny. As the name implies, characters in this will be dealing more with their own morality and surviving while being hunted by the Empire. More importantly, it will have Jedi characters and force adepts in it. The first two books of course have force powers and the ability to give your character force sensitivity, but no Jedi.\n\nFFG's Star Wars RPGs main feature is its dice.\n &lt;a href=&quot;\nhttp://i.imgur.com/rYKfx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/rYKfx.jpg&lt;/a&gt;\n\nOther than the symbols, the game is fairly easy to understand. You have a dice pool, you try to roll more successes than failures to get something done. The phrase &quot;dice pool&quot; might make you worry, but don't be alarmed: dice pools of one type never go above 6, barring extra effects. In fact, the average skill dice pool will be 3-5 dice. Difficulty pools range from 1-5, and to save rolling a ton of dice by one person, the GM can simply roll the difficulty dice himself.\n\nDifficulty is determined by GM, with &quot;Average&quot; difficulty being 2 difficulty dice. A quick look at the image of the dice above and you'll see that there is 1 more success on the Ability die than there are failures on the Difficulty die. Meaning a person with 2 in an ability (thus giving him 2 ability dice) doing an average task will more often than not succeed (ties result in failure though). However, there are more Threats on the difficulty die than Advantages on the Ability dice.\n\nHow the RPG prevents dice pools from getting out of control is their concept of &quot;upgrading&quot;. Rather than taking your skill and characteristic and adding them together, they instead make common points &quot;upgrade&quot; dice. In other words, if you possess points in a skill AND its key characteristic, you get better dice, not more dice. For example, say you want to find out your dice pool for hitting somebody with a sword. Your melee is 2, and your Brawn is 3. You first take the higher number, 3, and you add put number of ability dice to your attack pool. You then take the lower number, 2, and upgrade that many ability dice. So your pool would be 2 Proficiency, 1 Ability.\n\nOne of the advantages of the dice system is also that in combat, your actions will rarely be wasted, even if you fail to hit somebody. For example, if you manage to get a good amount of Advantages on your dice, but completely fail to hit your opponent, you can spend your Advantages to give somebody else a Boost die on their next attack, or to disarm the enemy.\n\nThe game isn't quite out yet, but the beta is available to buy for $30. The beta book supposedly is the complete game, bar a few errata likely, but does not include the extras such as fluff, some pictures, flavor, etc. Though I wouldn't blame you if you didn't buy it, I'm waiting for the complete game. However, it is a chance to actually influence the game; FFG actually listens to their fans, if their Only War beta is any indication, and they have an open forum until December for discussing the beta.\n\nI didn't see a torrent of this great game anywhere on the internet, and I said to myself &quot;THIS WILL NOT DO.&quot; So I spent 3 hours scanning the whole book into a PDF file.\n\nThe only thing I excluded was the sample adventure on pages 207-219 (Because who uses those anyways).\n\nXOXOX,\nDesideratus~ ","torrent":{"xt":"urn:btih:f8342b8ff3681acd489db368cde7f009491a63fa","amp;dn":"Star+Wars+-+Edge+of+the+Empire+RPG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8342b8ff3681acd489db368cde7f009491a63fa","infoHashBuffer":{"type":"Buffer","data":[248,52,43,143,243,104,26,205,72,157,179,104,205,231,240,9,73,26,99,250]},"announce":[],"urlList":[]}}