{"title":"AOMEI Backupper 1.6 [Windows 8/7/Vista/XP and Server 2003/2008/2","uid":9117424,"size":63043273,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f9151a524ca68f9798fa8a366217f5d56e35ffd0&amp;dn=AOMEI+Backupper+1.6+%5BWindows+8%2F7%2FVista%2FXP+and+Server+2003%2F2008%2F2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":0,"uploader":null,"files":3,"time":1383054145,"description":"AOMEI Backupper 1.6 Protect System &amp; Data in Windows PC and Server with\nFREE Backup Software\n One-click backup your system drive to ensure system security\n Backup disk &amp; partition, create disk images and clone hard drive\n Support Windows 8/7/Vista/XP and Server 2003/2008/2012 (32/64-bit)\n \n[b][color=red]Main Features:[/color][/b]\nTo prevent system failure or data loss, backup is important and necessary. AOMEI free backup software provides basic and advanced features to ensure the safety of your system and data.\nSystem Backup:\nOne-click back up all data of system drive, including system files and installed applications, without interrupting work.\nDisk Backup:\nBackup your hard disk drives, including MBR disk, GPT disk, external hard drive, USB disk and other storage devices that can be recognized by Windows.\nPartition Backup:\nIf you just want to backup a partition or dynamic volume, not the entire disk, the feature will be your best choice. With it, you can backup one or multiple partitions/dynamic volumes (including dynamic system volume New!) to an image file.\nSchedule Backup:\nSet up a schedule to automatically backup your system and data, especially for users who want to create backups at a lesser frequency or have multiple backup schedules (e.g. daily, weekly, monthly).\n[b][color=red]Other Features:[/color][/b]\nBuilt-in Utilities:\nImage File Checker and Explorer:\nCheck data integrity of image file to ensure the backups can be restored successfully. Mount image files to a virtual partition so that you can browse the contents of the backups in Windows Explorer.\nCreate Bootable Rescue Media:\nCreate a bootable media (e.g. CD or USB media) to restore system drive on the condition that Windows cannot boot, create bootable image and burn it to USB Flash Drive or USB removable disk, backup to share folder and restore from share network under bootable media environment, and manually add additional drivers when create Windows PE Bootable Media.\nBackup Settings:\nIncremental &amp; Differential Backups:\nBased on a full backup, the software supports to create incremental or differential backup to taking less time and save storage space. Besides, it allows you to add comments for incremental and differential backups.\nEncryption and Compression:\nYou can set a password for each backups to prevent unauthorized access. When the backup process, specify an industry leading compression algorithm to compress image file in order to take up less disk space.\nComment Backups and Splitting Backups:\nAdd comments to backups so that the backups can be further identified and clarified. Let you know what a backup is for or what it contains. Splitting Backups can split backup an image file into proper sizes to fit storage media.\nUseful Features:\nNAS Supported:\nSet Network-Attached Storage (NAS) as the destination path to easily backup to NAS or restore from NAS. Also, it's able to config IP, subnet, gateway, DNS for accessing your NAS.\nGPT &amp; UEFI Boot Supported :\nCompletely support GPT disk and smoothly work with UEFI boot\nDynamic Volumes Supported:\nDynamic Volumes Supported: Fully support to backup and restore system and/or data volumes (partitions) on a dynamic disk, including simple, spanned, striped, mirrored and RAID 5 volumes.\n[color=red][b]Work Environment:[/b][/color]\nPC Operating System:\nWindows 7 (all editions, including SP1)\nWindows 8\nWindows Vista (all editions)\nWindows XP (all editions)\nServer Operating System:\nWindows Server 2012\nWindows Server 2003 and 2003 R2 (all editions)l\nWindows Server 2008 and 2008 R2 SP1 (all editions)\nWindows Small Business Server 2003, 2008, 2011\nWindows Home Server 2011\nStorage Devices:\nSupports all storage devices recognized by Windows, e.g.:\nIDE, SATA, SCSI, SSD, USB external disk\nUSB flash drive, memory card, memory stick\nHardware RAID, RAID 0, RAID 1, RAID 5, RAID 10, etc.\nNetwork-Attached Storage (NAS)\nHyper-V, Virtual box, VMware virtual disk\nDisk Properties and File System:\nMBR disk\nGPT disk and UEFI boot\nDynamic volume\nFile system including NTFS, FAT32\nFAT, EXT2, EXT3, etc.\nSupport up to 256 disks within one system\n\nScreenshots:\n[img]http://imageshack.us/a/img189/8347/mxx9.jpg[/img]\n[img]http://imageshack.us/a/img811/5280/6nw7.jpg[/img]\n\n[i][b]Please Seed After Download[/b][/i]","torrent":{"xt":"urn:btih:f9151a524ca68f9798fa8a366217f5d56e35ffd0","amp;dn":"AOMEI+Backupper+1.6+%5BWindows+8%2F7%2FVista%2FXP+and+Server+2003%2F2008%2F2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9151a524ca68f9798fa8a366217f5d56e35ffd0","infoHashBuffer":{"type":"Buffer","data":[249,21,26,82,76,166,143,151,152,250,138,54,98,23,245,213,110,53,255,208]},"announce":[],"urlList":[]}}