{"title":"The CRC Handbook of Mechanical Engineering 2nd ed","uid":15641385,"size":79814424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f91eddac148db99e99868835a49911efcd782eff&amp;dn=The+CRC+Handbook+of+Mechanical+Engineering+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":0,"uploader":"clouderone","files":1,"time":1472016515,"description":"The CRC Handbook of Mechanical Engineering 2nd ed - Frank Kreith, D. Yogi Goswami (CRC, 2005).pdf\r\n\r\nSince the first edition of this comprehensive handbook was published ten years ago, many changes have taken place in engineering and related technologies. Now, this best-selling reference has been updated for the 21st century, providing complete coverage of classic engineering issues as well as groundbreaking new subject areas. \r\n\r\nThe second edition of The CRC Handbook of Mechanical Engineering covers every important aspect of the subject in a single volume. It continues the mission of the first edition in providing the practicing engineer in industry, government, and academia with relevant background and up-to-date information on the most important topics of modern mechanical engineering. \r\n\r\nCoverage of traditional topics has been updated, including sections on thermodynamics, solid and fluid mechanics, heat and mass transfer, materials, controls, energy conversion, manufacturing and design, robotics, environmental engineering, economics and project management, patent law, and transportation. Updates to these sections include new references and information on computer technology related to the topics. This edition also includes coverage of new topics such as nanotechnology, MEMS, electronic packaging, global climate change, electric and hybrid vehicles, and bioengineering","torrent":{"xt":"urn:btih:f91eddac148db99e99868835a49911efcd782eff","amp;dn":"The+CRC+Handbook+of+Mechanical+Engineering+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f91eddac148db99e99868835a49911efcd782eff","infoHashBuffer":{"type":"Buffer","data":[249,30,221,172,20,141,185,158,153,134,136,53,164,153,17,239,205,120,46,255]},"announce":[],"urlList":[]}}