{"title":"InfiniteSkills Advanced Microsoft Excel 2013","uid":8777612,"size":1740624577,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fa2cfec56c5de21d85baeed53d18002c44088357&amp;dn=InfiniteSkills+Advanced+Microsoft+Excel+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":34,"leechers":5,"uploader":"EliteBeast","files":-1,"time":1375597166,"description":"Duration 10 hours\n\nIn this advanced training course for Microsoft Excel 2013, expert author Guy Vaccaro takes you beyond the basics of Excel, and teaches you how to use the advanced features and functions in this spreadsheet program from Microsoft.\n\nYou will start with basic operations such as SUM, MIN, and MAX, as well as conditional mathematical functions. Guy proceeds to instruct you on using IF statements to control conditions. You will learn how to perform data lookups using VLOOKUP and HLOOKUP, and how to create Sparklines. Other features that are covered in this advanced Excel tutorial are; working with time, outlining, custom views, text manipulation, error checking, pivot tables and pivot charts. Guy also covers some basic Macro operations within Excel for optimizing your workflow.\n\nBy the completion of this computer based training video for Microsoft Excel 2013, you will be comfortable with many of the advanced features and functions that this powerful spreadsheet software from Microsoft has to offer. Working files are included, allowing you to follow along with the author throughout the lessons.","torrent":{"xt":"urn:btih:fa2cfec56c5de21d85baeed53d18002c44088357","amp;dn":"InfiniteSkills+Advanced+Microsoft+Excel+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa2cfec56c5de21d85baeed53d18002c44088357","infoHashBuffer":{"type":"Buffer","data":[250,44,254,197,108,93,226,29,133,186,238,213,61,24,0,44,68,8,131,87]},"announce":[],"urlList":[]}}