{"title":"Learn to Earn by Peter Lynch, John Rothchild.epub","uid":9157052,"size":2577469,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa49e7965f1ea1b0e684b776823bf51f094b1d2c&amp;dn=Learn+to+Earn+by+Peter+Lynch%2C+John+Rothchild.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":27,"leechers":0,"uploader":"420weedman","files":1,"time":1383795119,"description":" Mutual-fund superstar Peter Lynch and author John Rothchild explain the basic principles of investing and business in a primer that will enlighten and entertain anyone who is high-school age or older.\nMany investors, including some with substantial portfolios, have only the sketchiest idea of how the stock market works. The reason, say Lynch and Rothchild, is that the basics of investing -- the fundamentals of our economic system and what they have to do with the stock market -- aren't taught in school. At a time when individuals have to make important decisions about saving for college and 401(k) retirement funds, this failure to provide a basic education in investing can have tragic consequences.\nFor those who know what to look for, investment opportunities are everywhere. The average high-school student is familiar with Nike, Reebok, McDonald's, the Gap, and the Body Shop. Nearly every teenager in America drinks Coke or Pepsi, but only a very few own shares in either company or even understand how to buy them. Every student studies American history, but few realize that our country was settled by European colonists financed by public companies in England and Holland -- and the basic principles behind public companies haven't changed in more than 300 years.\nIn Learn to Earn, Lynch and Rothchild explain in a style accessible to anyone who is high-school age or older how to read a stock table in the daily newspaper, how to understand a company annual report, and why everyone should pay attention to the stock market. They explain not only how to invest, but also how to think like an investor.\nGenre: Non Fiction , Educational","torrent":{"xt":"urn:btih:fa49e7965f1ea1b0e684b776823bf51f094b1d2c","amp;dn":"Learn+to+Earn+by+Peter+Lynch%2C+John+Rothchild.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa49e7965f1ea1b0e684b776823bf51f094b1d2c","infoHashBuffer":{"type":"Buffer","data":[250,73,231,150,95,30,161,176,230,132,183,118,130,59,245,31,9,75,29,44]},"announce":[],"urlList":[]}}