{"title":"Nuclear Throne Update 64","uid":11733718,"size":133994523,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fac03f05af3e581bb7c98e107dfc1ade0688f93f&amp;dn=Nuclear+Throne+Update+64&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":1,"uploader":"dauphong","files":48,"time":1425482929,"description":"    Features\n    Reworked the way Shell weapons work! They now get a significant damage boost when hitting things super close to the player, which is reactivated for two frames after bouncing with Shotgun Shoulders as well.\n    Burst weapons got a bit of a fix, now allowing Long Arms, Eagle Eyes, and Steroids lack of accuracy to work with them!\n    The very first, early test for upgraded loop bosses has been implemented. Good luck fighting Big Bandits.\n    We added an overpowered new Bolt Weapon.\n\n    Balancing\n    The Proto Statue now has more health, will no longer get destroyed by big melee enemies, gets more HP on loops, and will be easier to break after activating.\n    Cluster Launcher spawns slightly later.\n    Horror's A Ultra spawns even less projectiles.\n    Horror's Throne Butt has been improved, now charging your beam up twice as fast.\n    Super Flak Cannon now deals more damage.\n    Hostile Horror will wait a bit longer after spawn before attacking.\n    Sharp Teeth no longer works on props.\n\n    Fixes\n    Weapons should now properly come with you through portals!\n    Fixed the health of Allies with Rebel's A Ultra.\n    Plant can no longer one-shot things with a ton of health with the saplings.\n    Big Dog now always wakes up!\n    Steroids no longer gets &quot;MAX MELEE AMMO&quot; popups with Throne Butt.\n    Horror's beam should no longer push enemies through walls.\n    Allies should no longer get damage from most Impact Wrist corpses.\n    Broken Walls now show up on B Floors as well.\n    There will no longer be walls spawned on top of the Proto Statue.\n    Big Rads are no longer attracted to unactivated Proto Statues.\n    IDPD grenades can now be hit away with a melee weapon.\n\n    Misc\n    Sharp Teeth now deals damage after a short, staggered delay, on the right frame of its animation.\n    The popup for &quot;LEVEL 10!&quot; now says &quot;LEVEL ULTRA!&quot;.\n    Big Dog now shakes the screen when walking.\n    Trigger Fingers now shows a shine on your gun when triggered.\n    Improved and added some tips.\n    Fish now angles in his movement direction when using Throne Butt. This'll eventually get a custom animation!\n    The game Freezes slightly shorter when killing smaller enemies now.\n    Bullets now spawn their hit effects when hitting walls as well","torrent":{"xt":"urn:btih:fac03f05af3e581bb7c98e107dfc1ade0688f93f","amp;dn":"Nuclear+Throne+Update+64","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fac03f05af3e581bb7c98e107dfc1ade0688f93f","infoHashBuffer":{"type":"Buffer","data":[250,192,63,5,175,62,88,27,183,201,142,16,125,252,26,222,6,136,249,63]},"announce":[],"urlList":[]}}