{"title":"The Infinity Gauntlet 01-06 (1991|Digital|TheHand-Empire)","uid":9867577,"size":147972256,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:faeb376eaccaaef8a9a6dac5016c6c7c66ccb86a&amp;dn=The+Infinity+Gauntlet+01-06+%281991%7CDigital%7CTheHand-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":32,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1396371915,"description":"For more information about this crossover event and its tie-ins and sequels, please check out the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Infinity_Gauntlet&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Infinity_Gauntlet&lt;/a&gt;\n\nHaving created Thanos in 1973, Marvel's resident Cosmic specialist, Jim Starlin, had been working towards this story for years in all of his various runs - especially in tales involving the powerful Adam Warlock. Together with Ron Lim and artist George Perez, Starlin crafted a sprawling, epic tale of battle with Thanos on one side and nearly the entire Marvel Universe on the other. The Infinity Gauntlet launched ever more miniseries and wars and crossovers but none had the raw power and tight writing (along with gorgeous art) of the original. After finally seizing the Infinity gems (in &quot;Thanos Quest&quot;) and assembling the titular Gauntlet, Thanos is eager to prove his love to the bemused, bored, and possibly even scared Lady Death. With Mephisto as the literal devil on his shoulder, Thanos the Mad Titan quickly and without hesitation kills half the universe's population - and thus begins the desperate attempts to bring him down before the entire cosmos is shattered! Nearly every major hero or team - Spider-Man, The Avengers, the X-Men and others - join the fray, as well as even Galactus and those &quot;gods&quot; who normally stay out of such affairs. Some of the battle scenes are too epic for words, and the way it all plays out and ends is truly awesome. This is one of the best limited series that Marvel's ever done, and if you haven't read it then you should do so as soon as possible.\n\nThis torrent contains all six issues of the core event; the various tie-ins and so on have not been included because A) they are mostly superfluous, B) they are not yet released in digital versions and C) they are still easy to find to supplement your reading if you wish. For that reason, I have opted to have the individual issue scans instead of the collected editions. These nice digital versions are thanks to TheHand-Empire, and really show off Perez's extraordinary artwork. Thanks to that group for their efforts - please seed, and enjoy! :-)\n\n","torrent":{"xt":"urn:btih:faeb376eaccaaef8a9a6dac5016c6c7c66ccb86a","amp;dn":"The+Infinity+Gauntlet+01-06+%281991%7CDigital%7CTheHand-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faeb376eaccaaef8a9a6dac5016c6c7c66ccb86a","infoHashBuffer":{"type":"Buffer","data":[250,235,55,110,172,202,174,248,169,166,218,197,1,108,108,124,102,204,184,106]},"announce":[],"urlList":[]}}