{"title":"The Iran Wars: Spy Games, Bank Battles and Secret Deals","uid":15932614,"size":1059468,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb42d3b3f0d033eb5a4335f6dfa17d1246614a46&amp;dn=The+Iran+Wars%3A+Spy+Games%2C+Bank+Battles+and+Secret+Deals&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":20,"leechers":1,"uploader":"marty14","files":1,"time":1475369187,"description":"The Iran Wars: Spy Games, Bank Battles and the Secret Deals That Reshaped the Middle East - Jay Solomon [epub]\r\n\r\nFor more than a decade, the United States has been engaged in a war with Iran as momentous as any other in the Middle East—a war all the more significant as it has largely been hidden from public view. Through a combination of economic sanctions, global diplomacy, and intelligence work, successive U.S. administrations have struggled to contain Iran’s aspirations to become a nuclear power and dominate the region—what many view as the most serious threat to peace in the Middle East. Meanwhile, Iran has used regional instability to its advantage to undermine America’s interests. The Iran Wars is an absorbing account of a battle waged on many levels—military, financial, and covert.\r\n\r\nJay Solomon’s book is the product of extensive in-depth reporting and interviews with all the key players in the conflict—from high-ranking Iranian officials to Secretary of State John Kerry and his negotiating team. With a reporter’s masterly investigative eye and the narrative dexterity of a great historian, Solomon shows how Iran’s nuclear development went unnoticed for years by the international community only to become its top security concern. He catalogs the blunders of both the Bush and Obama administrations as they grappled with how to engage Iran, producing a series of both carrots and sticks. And he takes us inside the hotel suites where the 2015 nuclear agreement was negotiated, offering a frank assessment of the uncertain future of the U.S.-Iran relationship.\r\n\r\nThis is a book rife with revelations, from the secret communications between the Obama administration and the Iranian government to dispatches from the front lines of the new field of financial warfare. For readers of Steve Coll’s Ghost Wars and Lawrence Wright’s The Looming Tower, The Iran Wars exposes the hidden history of a conflict most Americans don’t even realize is being fought, but whose outcome could have far-reaching geopolitical implications","torrent":{"xt":"urn:btih:fb42d3b3f0d033eb5a4335f6dfa17d1246614a46","amp;dn":"The+Iran+Wars%3A+Spy+Games%2C+Bank+Battles+and+Secret+Deals","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb42d3b3f0d033eb5a4335f6dfa17d1246614a46","infoHashBuffer":{"type":"Buffer","data":[251,66,211,179,240,208,51,235,90,67,53,246,223,161,125,18,70,97,74,70]},"announce":[],"urlList":[]}}