{"title":"[FSX] - [P3D] - Blackbox, Airbus A330 Xtreme Prologue v0.66 [RI","uid":8951605,"size":341602932,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fb8bc3c33b12fec317c89cc952b0a7bb33ea8f14&amp;dn=+%5BFSX%5D+-+%5BP3D%5D+-+Blackbox%2C+Airbus+A330+Xtreme+Prologue+v0.66+%5BRI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":0,"uploader":"fady_k2000","files":-1,"time":1379899046,"description":" BlackBox - A330 X'treme &quot;Prologue&quot;\nA fully flyable set of Aircraft with the &quot;BBS promise&quot; of amazing things to come. \n\nThe Airbus A330 Family are a fly-by-wire marvels that are rightfully acknowledged as one of the most successful Long Haul aircraft in civil aviation. With a flight deck unlike that of any other airliner (Apart from Another Airbus!) reproducing this aircraft accurately presents a unique challenge to any add on developer.   \n\nBlackBox however, have risen to that challenge and have combined development of the very highly appraised A320 Prologue with the new A330 Prologue to give you the best in short and long haul BlackBox Airbus flying! And as we have done with the A320 our new A330 will only get better with the release of :-\n\nAIRBUS A330 X'TREME!  \n\nWe can now offer you the Prologue version 0.60 so you can see and feel what to expect from the Full AIRBUS X'TREME V1.00 release.\n\nBlackBox Quality and attention to detail will be second to none, with every system modelled to the fullest possible levels. The smallest of items will be given our full attention and you wont find a switch, knob or button that doesn't do something. \n\nIn the Prologue Package you will still have a very useable Airbus simulation with Highly detailled MFD Screens and ECAMS. These are all switchable and have independant dimmer controls! Some systems and functionality may be limited initially but The MCDU Will allow you to program a FlightPlan from start to finish, including climbs, Sids, Stars, Speed and Altitude Constraints as well as holding patterns Airways and Alternate Airports. You'll see your performance figures with Vspeeds and Fuel predictions.  \n\nWith our regular service updates The ECAM Screens will eventually show all your system status including Fuel, Electrical, Hydraulic, Pressure systems, Doors and Landing Gear as well as many warnings to help you get things in order.  The Fuel system is also highly automated with transfers from wings to trim tanks, centre to wings etc... All happening behind the scenes\n\nThe external model features The A330-200, A330-300 A330-200F (Cargo version) As well as the all new A330-MRTT ( Multi Role Tanker Transport) from Airbus Military division.\nAll Variants have the correct Engine types from the GE CF6, to the Rolls Royse Trent 700 and the Pratt and Whitney 4168. They have been faithfully recreated using advanced 3dsMax techniques and each model contains in excess of 150 thousand Polygons, Hi Definition 4096x4096 Textures and bump Mapping and a whole host of custom animations that include new Fanblade animation for smooth running and slow startup,  New &quot;no flicker&quot; Wheel animations that rotate smoothly and behave correctly when you stand on the brakes. \nAll control surfaces are seperately driven by the correct Hydraulic system with the surfaces drooping with pressure drop when the systems are powered down.  A Full electrical system is modelled with Ground power, AC/DC buses APU and 3 Batteries \n\nThere is also a niceley detalled cockpit and a cabin visible through the reflective 3D modelled Windows. open the doors and you have more detal in the cargobays and galley areas, all illuminated at night.\n\nThe Virtual Cockpit is another 160K Polygons and almost every switch, knob, lever and dial is accurateley modelled and animated. Each panel has its own seperate integral lighting and both front and rear overheads are accurateley reproduced. There are dimmer controls for each MFD and you can swap them around via the correct pedestal switching. The Thrust levers have &quot;built in&quot; Detents operated by either Joystick, Numpad, F1-F4 Keys or Pageup/Dn you will easily find the one intuitive to you. Custom animations include the fold out tables, Arm rests and sunscreens on top of all the expected switches etc. The Side sticks operate correctly and lock properly when using the autopilot. And you have switchable Nosewheel steering &quot;tiller control&quot; for accurate Taxi and Parking\n\nAll the MCDU and FCU Programming can be done from either the 2D Panels or in the VC  either directly or via the many Popup screens a click away.\n\nThe Airbus A330 Flight model has been reproduced and tested by independant Current Airbus Pilots and includes our Custom Fly By Wire system and Envelope protection Laws. \n\nExperience for yourself the unique Airbus fly-by-wire concept and see whats in store later this year when we release AIRBUS X'TREME!\n\n&quot; These aircraft think one step ahead of the pilot - it's a flying experience like no other!&quot; ","torrent":{"xt":"urn:btih:fb8bc3c33b12fec317c89cc952b0a7bb33ea8f14","amp;dn":"+%5BFSX%5D+-+%5BP3D%5D+-+Blackbox%2C+Airbus+A330+Xtreme+Prologue+v0.66+%5BRI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb8bc3c33b12fec317c89cc952b0a7bb33ea8f14","infoHashBuffer":{"type":"Buffer","data":[251,139,195,195,59,18,254,195,23,200,156,201,82,176,167,187,51,234,143,20]},"announce":[],"urlList":[]}}