{"title":"Mike Cernovich - Gorilla Mindset (Unabridged)","uid":13132674,"size":57492029,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fbde08bdbba3259bb926be4c65d455ccd738b1d5&amp;dn=Mike+Cernovich+-+Gorilla+Mindset+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":1,"uploader":null,"files":1,"time":1451859246,"description":"Lossless DRM-free removal.\r\n\r\n--------\r\n\r\nGorilla Mindset is an entire system that, when coupled with specific mindset shifts and habits, will change the way you think, feel and live your life.\r\n\r\nApplying Gorilla Mindset to your life (make no mistake, this is an audiobook you must apply) will improve your health and fitness, lead to more money and career advancement, and help you have deeper, more meaningful relationships (or more casual ones; it's your choice).\r\n\r\nYour thinking will become clear. You will have more focus. You will know exactly what steps to take to change your life.\r\n\r\nMore importantly, you will be able to troubleshoot your own life - what psychologists call auto-regulate - when something goes wrong.\r\n\r\nFor the first time ever, there is a complete system for you to live by, and more importantly, to improve and adapt to your needs. Some chapters will revolutionize how you live your life where as others might not apply to you at all.\r\n\r\nGorilla Mindset is not an audiobook of theory. These are all practical steps - mindset shifts you take or habits you form.\r\n\r\nThere are chapters on routine, self-talk, frame, focus, state/mood, mindfulness, and body language. Each chapter contains techniques, mindset shifts, and habits that can be applied to your life.\r\n\r\nYet each chapter forms part of an entire system to apply to your life. The chapters all feed off of and add to one another.\r\n\r\nFor example, improving your self-talk will improve your state or mood. How you frame challenges in your life is also a matter of the language - or self-talk - you use.\r\n\r\nGetting in the moment improves your self-talk just as your self-talk helps you get into the moment.\r\n\r\nAt the end of Gorilla Mindset you'll tie every concept together to live the life others don't even dare dream of","torrent":{"xt":"urn:btih:fbde08bdbba3259bb926be4c65d455ccd738b1d5","amp;dn":"Mike+Cernovich+-+Gorilla+Mindset+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbde08bdbba3259bb926be4c65d455ccd738b1d5","infoHashBuffer":{"type":"Buffer","data":[251,222,8,189,187,163,37,155,185,38,190,76,101,212,85,204,215,56,177,213]},"announce":[],"urlList":[]}}