{"title":"Fahrenheit 9/11(2004)DVDRip.AC3(ENG)-DROCK","uid":6290263,"size":733277330,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fcb5824206b8cfed10d2803005cc9d2f13b5a70a&amp;dn=Fahrenheit+9%2F11%282004%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":22,"leechers":2,"uploader":"drock232","files":-1,"time":1301777698,"description":"Directed by Michael Moore, whose aura of controversy only grew after his Oscar acceptance speech at the 2003 Academy Awards, Fahrenheit 9/11, like Moore's Bowling For Columbine and Roger &amp; Me, promises to expose the corporate wrongdoings and big-money scandals perpetrated by America's financial elite. This movie, however, looks beyond the inner echelons of General Motors and Lockheed Martin in hopes of outing the evildoers in the White House, particularly in regards to the 43rd President of the United States, George W. Bush. In addition to criticizing the administration's handling of the September 11, 2001, terrorist attacks on the Pentagon and World Trade Center, Moore digs deep into the surprising relationship with the Bin Laden family held by both Bush administrations, and questions whether or not potential Saudi involvement with the attacks has been ignored. As Fahrenheit 9/11's Cannes Film Festival debut approached, marking only the second time in 48 years that a documentary has been included among the festival's main competition, Miramax's parent company Disney announced it would not be distributing the film due to its partisan nature, and, according to Moore, out of trepidation that the Florida-based Goliath's multi-million-dollar tax breaks might be negatively affected by Florida Governor Jeb Bush, whose review within Fahrenheit 9/11 is less than favorable. \n\nRipped with Handbrake.\n\nLength: 2 Hours 2 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:fcb5824206b8cfed10d2803005cc9d2f13b5a70a","amp;dn":"Fahrenheit+9%2F11%282004%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcb5824206b8cfed10d2803005cc9d2f13b5a70a","infoHashBuffer":{"type":"Buffer","data":[252,181,130,66,6,184,207,237,16,210,128,48,5,204,157,47,19,181,167,10]},"announce":[],"urlList":[]}}