{"title":"George Bernard Shaw - Nobel Prize in Literature, 1925 (23 books)","uid":15802303,"size":97069454,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fcbe1256ddc336545a7c61cf37c48589d4605c4b&amp;dn=George+Bernard+Shaw+-+Nobel+Prize+in+Literature%2C+1925+%2823+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":29,"leechers":2,"uploader":"workerbee","files":45,"time":1473521558,"description":"GEORGE BERNARD SHAW (1856-1950), known at his insistence simply as Bernard Shaw, was an Irish playwright, critic and polemicist.  He was awarded the 1925 Nobel Prize in Literature &quot;for his work which is marked by both idealism and humanity, its stimulating satire often being infused with a singular poetic beauty.&quot;\n\nWith a range incorporating both contemporary satire and historical allegory, Shaw became the leading dramatist of his generation, and his influence on Western theatre, culture and politics extended from the 1880s to his death and beyond. He wrote more than sixty plays, including major works such as ARMS AND THE MAN (1894), MAN AND SUPERMAN (1902), PYGMALION (1912) and SAINT JOAN (1923).\n\nFollowing a political awakening, Shaw became the most prominent pamphleteer of the gradualist Fabian Society. Influenced by Ibsen, he sought to introduce a new realism into English-language drama, using his plays as vehicles to disseminate his political, social and religious ideas. Shaw's expressed views were often contentious; he promoted eugenics and alphabet reform, and opposed vaccination and organised religion. He courted unpopularity by denouncing both sides in the First World War as equally culpable, and although not a republican, castigated British policy on Ireland in the postwar period. By the late 1920s he had largely renounced Fabian gradualism and often wrote and spoke favourably of dictatorships of the right and left, expressing admiration for both Mussolini and Stalin.\n\nSince Shaw's death scholarly and critical opinion has varied about his works, but he has regularly been rated as second only to Shakespeare among English-language dramatists, and critics recognize his extensive influence on generations of playwrights.\n\n\nThe following books are in PDF or ePUB format as indicated:\n\n\n                                   == PLAYS ==                                      \n\n* Heartbreak House: A Fantasia in the Russian Manner on English Themes (Penguin Classics, 2000). Definitive text under the editorial supervision of Dan H. Laurence, with an Introduction by David Hare. -- ePUB\n\n* Man and Superman (Start, 2012). -- ePUB\n\n* Man and Superman &amp; Three Other Plays (Barnes and Noble, 2004). Introduction and Notes by John A. Bertolini. -- ePUB\n\n* Plays (Mrs Warren's Profession; Arms and the Man; Candida; Man and Superman) (Signet, 2004). Introduction by Eric Bentley. -- ePUB\n\n* Plays Extravagant (Too True to Be Good; The Simpleton of the Unexpected Isles; The Millionairess) (Penguin Classics, 2010). Definitive text under the editorial supervision of Dan H. Laurence. -- ePUB\n\n* Plays Pleasant (Arms and the Man; Candida, The Man of Destiny; You Never Can Tell) (Penguin Classics, 2003). Definitive text under the editorial supervision of Dan H. Laurence, with an Introduction by W. J. McCormack. -- ePUB\n\n* Plays Political (The Apple Cart; On the Rocks; Geneva) (Penguin Classics, 2010). Definitive text under the editorial supervision of Dan H. Laurence. -- ePUB\n\n* Plays Unpleasant (Widowers' Houses; The Philanderer; Mrs Warren's Profession) (Penguin Classics, 2000). Definitive text under the editorial supervision of Dan H. Laurence, with an Introduction by David Edgar. -- ePUB\n\n* Pygmalion &amp; Three Other Plays (Barnes and Noble, 2004). Introduction and Notes by John A. Bertolini. -- ePUB\n\n* Works of George Bernard Shaw (Delphi Classics, 2014). -- ePUB\n\n\n                                   == PROSE ==\n\n* Bernard Shaw and Alfred Douglas: A Correspondence (Ticknor &amp; Fields, 1982). Edited by Mary Hyde. -- PDF\n\n* Black Girl in Search of God &amp; Some Lesser Tales, The (Constable, 1954) -- PDF\n\n* Everybody's Political What's What? (Dodd Mead, 1945) -- PDF\n\n* Great Composers, The: Reviews and Bombardments (University of California, 1978). Edited by Louis Crompton. -- PDF\n\n* Intelligent Woman's Guide to Socialism and Capitalism (Brentano's, 1928). -- PDF\n\n* Perfect Wagnerite, The: A Commentary on the Niblung's Ring (Dover, 1967). -- PDF\n\n* Prose Anthology, A (Fawcett Premier, 1965). Edited by H. M. Burton. -- PDF\n\n* Shaw: An Autobiography, 1856-1898 (Weybright and Talley, 1969). Selected from His Writings by Stanley Weintraub. -- PDF\n\n* Shaw on Dickens (Ungar, 1984). Edited by Dan H. Laurence and Martin Quinn. -- PDF\n\n* Shaw on Religion (Dodd Mead, 1967). Edited by Warren Sylvester Smith. -- PDF\n\n* Shaw on Theatre (Hill &amp; Wang, 1958). Edited by E. J. West. -- PDF\n\n* Shaw's Dramatic Criticism (1895-98) (Hill &amp; Wang, 1959). Edited by John F. Matthews. -- PDF\n\n* Socialism of Shaw, The (Vanguard, 1926). Edited by James Fuchs. -- PDF\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account): \nhttps://pirates-forum.org/User-workerbee\n\nPLEASE HELP TO SEED! If you like these books and want others to have access to them, please help to seed for as long as you can. The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content. Thank you!","torrent":{"xt":"urn:btih:fcbe1256ddc336545a7c61cf37c48589d4605c4b","amp;dn":"George+Bernard+Shaw+-+Nobel+Prize+in+Literature%2C+1925+%2823+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcbe1256ddc336545a7c61cf37c48589d4605c4b","infoHashBuffer":{"type":"Buffer","data":[252,190,18,86,221,195,54,84,90,124,97,207,55,196,133,137,212,96,92,75]},"announce":[],"urlList":[]}}