{"title":"Call.of.Duty.Black.Ops-SKIDROW","uid":5944970,"size":7826148568,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fd1166d0130eb46ecd953116ccef9b532d95ca29&amp;dn=Call.of.Duty.Black.Ops-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":31,"leechers":10,"uploader":"Darthmufin","files":81,"time":1289329031,"description":"\t\t\t\t  Eboy\n\n\t\t\t\t  S   K   i   D   R   O   W\n\n\t\t\t  -   T H E   L E A D i N G   F O R C E    -\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t  proudly presents\n\t\t\t\t\t\t\t\t\t\tCall of Duty: Black Ops / Activision\n\nRELEASE DATE : 09-11-2010              PROTECTION : Steam + CEG\nGAME TYPE    : Shooter                 DISKS      : 1 DVD\n\n  Release Notes:\n\n\t\tThe Skid Rowdies are looking new blood to fill up the ranks.\n  We're a professional team of dedicated sceners with big mark\n  under sceners. We believe on the ground idealism of the root\n  of the real old school scene. We do all this for fun and\n  nothing else. We don't earn anything on our hobby, as we do\n  this for the competition and the heart of what got the scene\n  started in the mid eighties.\n\n  If you think you got something to offer, then don't hold back\n  on contacting us as soon as possible.\n\n\t  twice the fun    / double the trouble\n\n  On with the game release information:\n\n  The biggest first-person action series of all time and the\n  follow-up to last year's blockbuster Call of Duty: Modern\n  Warfare 2 returns with Call of Duty: Black Ops.\n\n  Call of Duty: Black Ops will take you behind enemy lines as a\n  member of an elite special forces unit engaging in covert\n  warfare, classified operations, and explosive conflicts across\n  the globe. With access to exclusive weaponry and equipment,\n  your actions will tip the balance during the most dangerous\n  time period mankind has ever known.\n\n  Cinematic Single Player Campaign: An epic campaign and story\n  that takes you to a variety of locations and conflicts all\n  over the world where you will play as an elite Black Ops\n  soldier in deniable operations where if you are caught,\n  captured or killed, your country will disavow all knowledge of\n  your existence.\n\n  Signature Multiplayer: Call of Duty's signature multiplayer\n  gameplay returns with new perks and killstreaks, deeper levels\n  of character and weapon customization, and all new modes\n  including:\n\n  Wager Matches: One in the Chamber, Gun Game, Sticks and\n  Stones, Sharpshooter\n\n  Theater Mode: View, record, and edit your favorite moments\n  from multiplayer, and share with your friends\n\n  Combat Training: Test your skill solo or Co-Op with friends\n  against AI enemy players\n\n  Zombies!: Fan favorite Zombie mode is back providing endless\n  hours of Zombie-slaying entertainment, solo or Co-Op\n\n  Install Notes:\n\n\t\t1. Unpack release\n  2. Mount image or burn it\n  3. Install\n  4. Copy the cracked content from the SKIDROW folder on the DVD\n\t to the main installation folder and overwrite\n  5. Play the game\n\n  Support the companies, which software you actually enjoy!\n\n  Greetings:\n\n\t\tSalutes to our old Amiga friends from:\n\n  FAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\n  DCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\n  THE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\n  Salutes to our new friends in:\n\n  UNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\n  FAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\n\t\t\t\t\t\tLogo and layout by: Eboy/SAE\n\t\t\t\t\t\t\t\tLast updated 21/07/2007 by [XXX]\n\n\n","torrent":{"xt":"urn:btih:fd1166d0130eb46ecd953116ccef9b532d95ca29","amp;dn":"Call.of.Duty.Black.Ops-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd1166d0130eb46ecd953116ccef9b532d95ca29","infoHashBuffer":{"type":"Buffer","data":[253,17,102,208,19,14,180,110,205,149,49,22,204,239,155,83,45,149,202,41]},"announce":[],"urlList":[]}}