{"title":"[Sega Dreamcast] US Shenmue","uid":7431694,"size":1321619289,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:fded7eba0dec0528b3b2dc8ceed0af8e109af24d&amp;dn=%5BSega+Dreamcast%5D+US+Shenmue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":3,"uploader":"VasiliyRS","files":-1,"time":1341963422,"description":"_   _____/__  _______    ____    ____   ____ |  | |__| ____   ____\n |    __)_  / /__    /      / ____/ __ |  | |  |/  _  /    \n |        \\   /  / __ |   |  / /_/  &gt;  ___/|  |_|  (   )   |  \n/_______  / _/  (____  /___|  /___  / ___  &gt;____/__|____/|___|  /\n        /            /     //_____/      /                    / -dReMCaSt-\n\n\npresents :\n\nUS Shenmue Jap/Us - 23/02/2007\n\nCD 1 : 31x15 mb\nCD 2 : 27x15 mb\nCD 3 : 32x15 mb\n\n\nRelease Notes :\n===============\n\nThis release was made for the Shenmue's fan, this specific version was never\nget ripped before. It includes Jap and English subtitles, you can swap between them\nusing the START BUTTON.\n\nThe game are NOT 60 hz patched for PAL Dreamcast, but you can do it easly with\nMegalex's PAL Patcher 2.0.\n\nNothing is ripped, all audio tracks are here, during the motorcycle scene\non the third CD, you will hear some nice music. (Not like the Kalisto or Alpax release).\n\nEnjoy it.\n\n\n\nDescription :\n=============\n\nThe story of Shenmue, which begins in 1986, centers on a young man named\nRyo Hazuki. Ryo returns home one day just in time to witness his father's\nkilling at the hands of a man named Lan Di. Both Lan Di and Ryo's father,\nIwao Hazuki, are martial arts experts, but Iwao is no match for Lan Di's\nabilities. Lan Di enigmatically asks for &quot;the mirror,&quot; and Iwao, unable to\nfeign ignorance, reveals that it is buried underneath his sakura tree. Land\nDi finds the mirror and examines the decoration of a dragon, after killing\nIwao. Ryo feels the need to avenge his father's death, even though he has no\nidea who Lan Di is or why his father was killed.\n\nRyo's first clue is a car that some of his neighbors saw on the day of the murder.\n Though his leads are few and far between, Ryo slowly makes progress in his investigation\nby interviewing people all over Yokosuka. Just as he is about to run out of leads, a letter\nfrom a man named Yuanda Zhu suggests that he seek the aid of a certain Master Chen, who works\nat the harbor. Through Chen and his son Guizhang, Ryo learns that a local wharf gang known as\nthe Mad Angels is connected to Lan Di's crime organization, the Chiyoumen. Ryo also learns that\n&quot;the mirror&quot; stolen by Lan Di is part of a set of two mirrors. After much investigation, he\nlocates the second mirror underneath his father's dojo. This mirror is decorated with a phoenix.\n\nRyo takes a job on the waterfront in order to learn more about the Mad Angels gang, and eventually\nhe causes them enough trouble that the gang kidnaps his friend (and principle love interest) Nozomi\nHarasaki. To rescue Nozomi, Ryo must first fight Guizhang, then team up with Guizhang to defeat all\nseventy members of the Mad Angels gang. Upon defeat, the gang's leader reveals to Ryo that Lan Di has\nleft Japan for Hong Kong. With the aid of the Chen family as well as his family and friends, Ryo boards\na boat to Hong Kong. Before the close of the first chapter (and subsequent end of the game itself), he\nis instructed by Master Chen to seek out the help of a master of the Chinese martial arts located in Wan\nChai named Lishao Tao. Concluding the first chapter of Shenmue, Ryo boards a boat and travels to Hong Kong\nin pursuit of Lan Di.\n\n\nWeblinks :\n==========\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Shenmue&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Shenmue&lt;/a&gt; &lt;a href=&quot;\nhttp://www.shenmue.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shenmue.com/&lt;/a&gt;\n\nGreetings fly to : Darkfalz (for his tools), SeGa PaLaCe, Dolmexica (thanks for the fast release\nof Trigger Heart Exelica), Nu-NRG, sveny and many others.\n","torrent":{"xt":"urn:btih:fded7eba0dec0528b3b2dc8ceed0af8e109af24d","amp;dn":"%5BSega+Dreamcast%5D+US+Shenmue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fded7eba0dec0528b3b2dc8ceed0af8e109af24d","infoHashBuffer":{"type":"Buffer","data":[253,237,126,186,13,236,5,40,179,178,220,140,238,208,175,142,16,154,242,77]},"announce":[],"urlList":[]}}