{"title":"The Chronicles of Riddick 1, 2, 3, 4 - Vin Diesel Action Eng [H2","uid":9466595,"size":3105948599,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ff70dfa0e70eb8374fde410f154ed3403ab703f4&amp;dn=The+Chronicles+of+Riddick+1%2C+2%2C+3%2C+4+-+Vin+Diesel+Action+Eng+%5BH2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":26,"leechers":10,"uploader":"Zack2014","files":13,"time":1389466751,"description":"\nimdb Pitch Black\nimdb The Chronicles of Riddick\nimdb Dark Fury (Animation)\nimdb Riddick\n\nPitch Black.\nSet in the distant future, a spaceship carrying some 40 people, mostly ones wanting\nto settle on other planets from their own, hits a meteor shower and crash lands on\na distant planet killing all but twelve of them. The survivors, led by the second\nin command Carolyn Fry ('Rahda Mitchell' ), find themselves on a hot and arid\nlandscape with constant sunlight from three orbiting suns. Fry not only must help\nthe survivors find food and water, but contend with a deadly criminal, named Riddick\n(Vin Diesel), who was being transported to a prison cell on their destination. But\nevery 22 years, the planet's three suns go into a total eclipse for a month where\ndarkness brings out the planet's real inhabitants; large, reptilian, vampire-like\ncreatures that come out and dominate the surface in total darkness, killing and\neating all life. The Fry and her people then must cooperate with Riddick, who has\nsurgically enhanced eyes to see in darkness, to lead them to safety and off the\nplanet before they all become dinner for the creatures.\n\nStars.\n=&gt;-Vin Diesel.\n=&gt;-Radha Mitchell.\n\nDirector.\n=&gt;-David Twohy.\n\nThe Chronicles of Riddick.\nFive years ago... Escaped convict Richard B. Riddick escaped from a desert planet\nwith his two companions, religious man Imam and runaway teenage girl Jack. After\nfive years wandering across the outskirts of the galaxy and being hunted by bounty\nhunters calming the bounty on his head, Riddick arrives on the colonized planet\nNew Mecca, he learns Imam placed the bounty on his head and Jack has been imprisoned\non the prison planet &quot;Crematoria&quot; for murder. Riddick learns from Aereon, ambassador\nof the Elemental race is seeking out Furians, a race of warriors in a bid to balance\nthe universe, as a warrior army known as The Necromongers led by the evil undead\nLord Marshal are invading every planet in the galaxy and cleansing all of humanity\nin their goal for universal conquest. Beliving Riddick is a Furian warrior, Aereon\ndecides to hire Riddick believing he is the one man who can stop The Lord Marshal\nand the Necromongers. When the Necromongers attacks New Mecca, Riddick is captured\nby cocky bounty hunter Toombs and his crew and he is transported to Crematoria,\nwhere he reunites with Jack now named 'Kyra', where Riddick and Kyra escapes to the\nplanet's sun ravaged surface, where Riddick helped by Necromonger warrior Vakko and\nhis sexy wife Dame Vakko, sets out to defeat the Lord Marshal and save the universe\nfrom the Lord Marshal's rule and save the rest of humanity from being converted into\nNercomonger warriors.\n\nStars.\n=&gt;-Vin Diesel.\n=&gt;-Judi Dench.\n\nDirector.\n=&gt;-David Twohy.\n\nDark Fury (Animation).\nAfter escaping from a desert planet, Escaped convict Richard B. Riddick and his two\ncompanions, Jack and Imam are captured by a crew of bounty hunters of the vessel\n&quot;Kublah-Khan&quot; commanded by a imperial woman named Antonia Chillingsworth and her\nchief henchman Junner. Riddick discovers Chillingsworth has her own museum on-board\nand she collects the galaxy's most-wanted criminals and instead of delivering them\nto penal colonies and claiming the bounty, Chillingsworth turns them into living\nstatues and Riddick has become the latest addition to her collection.\n\nStars.\n=&gt;-Vin Diesel.\n=&gt;-Rhiana Griffith.\n\nDirector.\n=&gt;-Peter Chung.\n\nRiddick.\nThe infamous Riddick has been left for dead on a sun-scorched planet that appears to\nbe lifeless. Soon, however, he finds himself fighting for survival against alien\npredators more lethal than any human he's encountered. The only way off is for Riddick\nto activate an emergency beacon and alert mercenaries who rapidly descend to the\nplanet in search of their bounty. The first ship to arrive carries a new breed of\nmerc, more lethal and violent, while the second is captained by a man whose pursuit\nof Riddick is more personal. With time running out and a storm on the horizon that\nno one could survive, his hunters won't leave the planet without Riddick's head as\ntheir trophy.\n\nStars.\n=&gt;-Vin Diesel.\n=&gt;-Karl Urban.\n\nDirector.\n=&gt;-David Twohy.\n\nInfo\n=&gt;-Genre.....................: Action : Sci-Fi : Thriller.\n=&gt;-Release Date..............: 2000 : 2004 : 2004 : 2013.\n=&gt;-Language..................: English.\n=&gt;-File Size.................: 811 MiB : 980 MiB : 252 MiB : 918 MiB.\n=&gt;-Overall bit rate..........: 1 014 Kbps : 1 022 Kbps : 1 011 Kbps : 1 013 Kbps.\n=&gt;-Movie Runtime.............: 1h 51mn : 2h 14mn : 34mn 50s : 2h 06mn.\n\nVideo\n=&gt;-Codec.....................: H.264/MPEG-4 AVC.\n=&gt;-Aspect Ratio..............: 2.40.1 : 2.000.\n=&gt;-Resolution................: 720 x 300 : 720 x 360.\n=&gt;-Bit rate..................: 860 Kbps.\n\nAudio\n=&gt;-Codec.....................: mp4a: MPEG-4 AAC LC.\n=&gt;-Channels..................: 2 channel Stereo.\n=&gt;-Bit Rate..................: 152 Kbps.\n=&gt;-Maximum bit rate..........: 192 Kbps.","torrent":{"xt":"urn:btih:ff70dfa0e70eb8374fde410f154ed3403ab703f4","amp;dn":"The+Chronicles+of+Riddick+1%2C+2%2C+3%2C+4+-+Vin+Diesel+Action+Eng+%5BH2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff70dfa0e70eb8374fde410f154ed3403ab703f4","infoHashBuffer":{"type":"Buffer","data":[255,112,223,160,231,14,184,55,79,222,65,15,21,78,211,64,58,183,3,244]},"announce":[],"urlList":[]}}