{"title":"Call of Duty 1 and Call of Duty United Offensive","uid":11896159,"size":2283198974,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ffcf7d4fb16936e41f11c6c9698f20c830a941d4&amp;dn=Call+of+Duty+1+and+Call+of+Duty+United+Offensive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":30,"leechers":10,"uploader":null,"files":81,"time":1431157485,"description":"About the game:\nCall of Duty is a 2003 first-person shooter video game developed by Infinity Ward and published by Activision. It is the first major installment in the Call of Duty video game series. The game simulates the infantry and combined arms warfare of World War II. The game is based on the Quake III: Team Arena engine. It was accompanied in September 2004 by an expansion pack, Call of Duty: United Offensive, which was produced by Activision, and developed by Gray Matter Interactive, with contributions from Pi Studios. Call of Duty is similar in theme and gameplay to Medal of Honor, as it is made out of single-player campaigns and missions. However, unlike Medal of Honor, the war is seen not just from the viewpoint of an American soldier but also from the viewpoint of British, Canadian, and Soviet soldiers.\n\nThe game was somewhat unusual at the time in that throughout the single-player mode the player is joined by computer-controlled allies who range in quantity from two infantrymen (in some of the British missions) to an entire regiment of tanks (in the Soviet missions). The computer-controlled allies will support the actual player during the missions. They also further the game's goal of providing an immersive and realistic experience; that is, soldiers in World War II were usually part of a larger group, as opposed to the &quot;lone wolf&quot; seen in video games such as Medal of Honor. However, there are some missions where the player is alone.\n\nUploader's note:\nJust click &quot;codsp.exe&quot; or &quot;CoDUOSP.exe&quot; to instantly play the game. \nNo installation needed. To play multiplayer you'll need a CD key though.\n\nThanks for downloading and don't forget to seed!","torrent":{"xt":"urn:btih:ffcf7d4fb16936e41f11c6c9698f20c830a941d4","amp;dn":"Call+of+Duty+1+and+Call+of+Duty+United+Offensive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffcf7d4fb16936e41f11c6c9698f20c830a941d4","infoHashBuffer":{"type":"Buffer","data":[255,207,125,79,177,105,54,228,31,17,198,201,105,143,32,200,48,169,65,212]},"announce":[],"urlList":[]}}